{
  "chapterSummary": {
    "General": "Genesis 10, the Table of Nations, lists the descendants of Noah's sons: Japheth, Ham, and Shem. It outlines the origins of various peoples, clans, languages, territories, and nations known to the ancient Israelites. Japheth's line populates the coastlands and northern regions. Ham's line spreads south and includes notable figures like Nimrod (founder of Babel and Nineveh) and the Canaanites. Shem's line, listed last, includes the ancestors of the Israelites (through Arphaxad and Eber) and other Semitic peoples. The chapter notes the division of the earth during the time of Peleg.",
    "Non-Denominational": "Focuses on the fulfillment of the mandate to fill the earth post-Flood. It maps the origins of nations from Noah's sons, establishing ethnic and geographical relationships relevant to later biblical history. Highlights Nimrod's rebellion/kingdom building (Babel) and the lineage of Shem leading towards Abraham. The mention of division in Peleg's time connects to the scattering after Babel.",
    "Baptist": "Views the Table of Nations as an accurate historical record of humanity's dispersion. Emphasizes God's sovereignty in ordering the nations. Notes Nimrod as a powerful, possibly rebellious figure. Highlights the lineage of Shem as the line through which God's redemptive promises would flow (leading to Abraham and Christ). Links Peleg's time to the Babel dispersion.",
    "Catholic": "Sees the Table of Nations as depicting the providential spread of humanity across the earth after the Flood, fulfilling God's command. Recognizes the listing of peoples and their relationships, including those significant later (Egypt, Canaan, Assyria, Babylon via Nimrod). Notes the Shemite lineage as central to salvation history. Interprets the division in Peleg's time as likely referring to the Babel event.",
    "Methodist": "Understands this chapter as outlining the diversification and spread of humanity according to God's plan. Notes the geographical and ethnic origins described. Highlights key figures like Nimrod and the importance of Shem's line for future redemption. Connects the division in Peleg's time with the scattering described in Chapter 11.",
    "Lutheran": "Views this as a record of how God ordered the world post-Flood, showing the origins of nations. Notes Nimrod's earthly kingdom. Emphasizes the lineage of Shem, the line of promise leading to Christ. Sees the division in Peleg's time as linked to God's judgment at Babel.",
    "Presbyterian": "Sees the Table of Nations as demonstrating God's sovereignty over history and the ordering of nations after the Flood. Notes Nimrod's kingdom as an example of human ambition. Highlights the importance of Shem's line in God's redemptive plan (covenant lineage). Connects Peleg and the division of the earth to the Babel judgment and scattering.",
    "Pentecostal": "Views this as an inspired account of humanity's post-Flood dispersion. Highlights God's hand in establishing nations. Notes Nimrod's might and kingdom building. Emphasizes the chosen line of Shem. Sees the division in Peleg's time as referencing the linguistic division and scattering at Babel.",
    "Anglican": "Interprets the Table of Nations as describing the ordered dispersion of peoples after the Flood. Notes the foundation of various significant ancient cultures and kingdoms (Nimrod, Canaanites, Egyptians). Underlines the importance of Shem's lineage for salvation history. Connects the division of the earth in Peleg's time with the subsequent Babel narrative.",
    "Orthodox": "Understands this as outlining the origins and dispersion of nations according to God's providence. Recognizes the listing of ancestors for various peoples. Notes Nimrod's worldly power. Highlights the lineage of Shem as significant for the coming of Christ. Sees the division in Peleg's time as linked to the confusion of tongues at Babel."
  },
  "1": {
    "General": "This verse introduces the account of the descendants of Noah's sons: Shem, Ham, and Japheth, noting that sons were born to them after the flood.",
    "Non-Denominational": "Introduces the genealogy, establishing the foundation for the repopulation of the earth through Noah's sons after the Flood.",
    "Baptist": "Introduction to the post-Flood genealogy of Noah's sons.",
    "Catholic": "Introduces the genealogy ('toledot') of Noah's sons, the progenitors of post-Flood humanity.",
    "Methodist": "Sets the stage for the listing of descendants born after the Flood.",
    "Lutheran": "Introduction to the account of Noah's descendants after the Flood.",
    "Presbyterian": "Introduces the historical account of Noah's sons and their descendants.",
    "Pentecostal": "Begins the record of Noah's sons' families after the Flood.",
    "Anglican": "Introduces the genealogy of Noah's sons, Shem, Ham, and Japheth, after the Flood.",
    "Orthodox": "Introduces the generations ('toledot') of Noah's sons born after the Flood."
  },
  "2": {
    "General": "Lists the sons of Japheth: Gomer, Magog, Madai, Javan, Tubal, Meshech, and Tiras.",
    "Non-Denominational": "Begins the listing of Japheth's line, generally associated with peoples inhabiting regions north and west of Israel (Anatolia, Aegean, Caucasus).",
    "Baptist": "Lists the immediate sons of Japheth.",
    "Catholic": "Names the sons of Japheth, ancestors of various Indo-European peoples.",
    "Methodist": "Identifies the sons of Japheth.",
    "Lutheran": "Lists Japheth's sons.",
    "Presbyterian": "Records the sons of Japheth.",
    "Pentecostal": "Names Japheth's sons.",
    "Anglican": "Lists the sons of Japheth, progenitors of various northern and western peoples.",
    "Orthodox": "Names the sons of Japheth."
  },
  "3": {
    "General": "Lists the sons of Gomer (Japheth's son): Ashkenaz, Riphath, and Togarmah.",
    "Non-Denominational": "Details the descendants of Gomer, often linked to peoples in Anatolia or further north (Scythians, Armenians).",
    "Baptist": "Lists Gomer's descendants.",
    "Catholic": "Names the sons of Gomer, further detailing Japheth's lineage.",
    "Methodist": "Identifies Gomer's sons.",
    "Lutheran": "Lists Gomer's sons.",
    "Presbyterian": "Records the sons of Gomer.",
    "Pentecostal": "Names Gomer's sons.",
    "Anglican": "Lists the sons of Gomer.",
    "Orthodox": "Names the sons of Gomer."
  },
  "4": {
    "General": "Lists the sons of Javan (Japheth's son): Elishah, Tarshish, Kittim, and Dodanim.",
    "Non-Denominational": "Details descendants of Javan, generally associated with Greek peoples and Mediterranean coastlands (Cyprus, Rhodes, possibly Spain/Tartessus).",
    "Baptist": "Lists Javan's descendants, linked to Mediterranean peoples.",
    "Catholic": "Names the sons of Javan, ancestors of peoples in the Mediterranean region (Greeks, Cypriots, etc.).",
    "Methodist": "Identifies Javan's sons, associated with Mediterranean areas.",
    "Lutheran": "Lists Javan's sons.",
    "Presbyterian": "Records the sons of Javan.",
    "Pentecostal": "Names Javan's sons.",
    "Anglican": "Lists the sons of Javan, associated with Greece and Mediterranean islands/coastlands.",
    "Orthodox": "Names the sons of Javan, linked to Mediterranean peoples."
  },
  "5": {
    "General": "States that the maritime peoples spread out into their territories by their clans within their nations, each with its own language, originating from Japheth's line.",
    "Non-Denominational": "Summarizes the dispersion of Japheth's descendants, particularly associated with coastlands ('maritime peoples'), highlighting their organization by clan, nation, and language.",
    "Baptist": "Describes the settlement patterns of Japhethites, especially maritime peoples, by clan, language, and nation.",
    "Catholic": "Summarizes the spread of Japheth's descendants, particularly maritime nations, organized by clan, language, and territory.",
    "Methodist": "Describes the settlement of Japheth's line into distinct territories, languages, and nations.",
    "Lutheran": "The descendants of Japheth spread into the coastal regions, forming nations with distinct languages.",
    "Presbyterian": "Summarizes the dispersion of Japhethites into distinct nations, lands, and language groups.",
    "Pentecostal": "Describes the spread of Japheth's descendants into their lands, each with their own language and family groups.",
    "Anglican": "Summarizes the dispersion of the Japhethites, particularly the 'maritime peoples,' into distinct territories, languages, clans, and nations.",
    "Orthodox": "Describes the spread of Japheth's descendants to the coastlands, forming nations based on clan, language, and territory."
  },
  "6": {
    "General": "Lists the sons of Ham: Cush, Mizraim, Put, and Canaan.",
    "Non-Denominational": "Begins the listing of Ham's line, generally associated with peoples south of Israel (Africa, Arabia, Canaan). Mizraim is Egypt, Cush is often Ethiopia/Nubia, Put possibly Libya.",
    "Baptist": "Lists the immediate sons of Ham.",
    "Catholic": "Names the sons of Ham, ancestors of peoples primarily in Africa and the southern Levant (Egypt, Ethiopia, Libya, Canaan).",
    "Methodist": "Identifies the sons of Ham.",
    "Lutheran": "Lists Ham's sons.",
    "Presbyterian": "Records the sons of Ham.",
    "Pentecostal": "Names Ham's sons.",
    "Anglican": "Lists the sons of Ham, progenitors of southern peoples including Egyptians and Canaanites.",
    "Orthodox": "Names the sons of Ham, ancestors of African peoples and Canaanites."
  },
  "7": {
    "General": "Lists the sons of Cush (Ham's son): Seba, Havilah, Sabtah, Raamah, and Sabteca. Also lists the sons of Raamah: Sheba and Dedan.",
    "Non-Denominational": "Details descendants of Cush, largely associated with peoples in Arabia and Northeast Africa.",
    "Baptist": "Lists Cush's descendants, associated with Arabia/Africa.",
    "Catholic": "Names the sons of Cush and Raamah, associated with peoples in Arabia and Africa.",
    "Methodist": "Identifies Cush's sons and grandsons.",
    "Lutheran": "Lists Cush's sons and grandsons.",
    "Presbyterian": "Records the descendants of Cush.",
    "Pentecostal": "Names Cush's sons and grandsons.",
    "Anglican": "Lists the sons of Cush and the sons of Raamah, primarily associated with Arabian and African peoples.",
    "Orthodox": "Names the sons of Cush and Raamah, linked to Arabian/African tribes."
  },
  "8": {
    "General": "States that Cush was the father of Nimrod, who became a mighty warrior on the earth.",
    "Non-Denominational": "Introduces Nimrod, a significant figure known for his power and establishment of kingdoms, diverging from the simple listing format.",
    "Baptist": "Introduces Nimrod, a descendant of Cush, known for his might.",
    "Catholic": "Highlights Nimrod, Cush's descendant, renowned for his power and prowess.",
    "Methodist": "Introduces the notable figure Nimrod, famed for his strength.",
    "Lutheran": "Introduces Nimrod, a mighty one on the earth.",
    "Presbyterian": "Highlights Nimrod, descendant of Cush, who gained great power.",
    "Pentecostal": "Introduces Nimrod as a powerful figure.",
    "Anglican": "Introduces Nimrod, son of Cush, who grew to be a mighty warrior.",
    "Orthodox": "Introduces Nimrod, descendant of Cush, who became powerful on earth."
  },
  "9": {
    "General": "Describes Nimrod as a mighty hunter before the Lord, leading to the saying, 'Like Nimrod, a mighty hunter before the Lord.'",
    "Non-Denominational": "Emphasizes Nimrod's status as a renowned hunter, potentially implying prowess, rebellion, or prominence in God's sight (interpretations vary on 'before the Lord').",
    "Baptist": "Describes Nimrod's fame as a hunter, possibly indicating his power or defiance.",
    "Catholic": "Notes Nimrod's reputation as a 'mighty hunter before the Lord,' a phrase suggesting great renown, though its moral connotation is debated.",
    "Methodist": "Highlights Nimrod's fame as a hunter, becoming proverbial.",
    "Lutheran": "Nimrod was famous as a mighty hunter before the Lord.",
    "Presbyterian": "Describes Nimrod's reputation as a hunter 'before the Lord' (implying either prominence or defiance).",
    "Pentecostal": "Emphasizes Nimrod's legendary status as a hunter.",
    "Anglican": "Describes Nimrod as a 'mighty hunter before the Lord,' noting the proverb that arose from his fame.",
    "Orthodox": "Notes Nimrod's fame as a great hunter 'before the Lord' (enantion Kyriou - could mean in God's sight or in defiance)."
  },
  "10": {
    "General": "Lists the first centers of Nimrod's kingdom: Babel, Erech, Akkad, and Calneh in the land of Shinar (Babylonia).",
    "Non-Denominational": "Identifies Nimrod as a kingdom-builder, founding major cities in Mesopotamia, including Babel, the future site of the tower.",
    "Baptist": "Attributes the founding of early Babylonian cities, including Babel, to Nimrod.",
    "Catholic": "Lists the foundational cities of Nimrod's kingdom in Shinar (Babylonia), including Babel.",
    "Methodist": "Identifies the core cities of Nimrod's kingdom in Babylonia.",
    "Lutheran": "Nimrod founded kingdoms in Shinar, including Babel.",
    "Presbyterian": "Records the cities founded by Nimrod in Shinar, establishing his kingdom.",
    "Pentecostal": "Names the beginning cities of Nimrod's kingdom in Babylonia.",
    "Anglican": "Lists the principal cities of Nimrod's early kingdom in Shinar (Babylonia), including Babel.",
    "Orthodox": "Names the chief cities of Nimrod's kingdom in Shinar, including Babel."
  },
  "11": {
    "General": "States that from that land (Shinar), Nimrod went to Assyria and built Nineveh, Rehoboth Ir, Calah,",
    "Non-Denominational": "Describes Nimrod's expansion northward into Assyria, founding major Assyrian cities like Nineveh.",
    "Baptist": "Records Nimrod's expansion and founding of Assyrian cities.",
    "Catholic": "Narrates Nimrod's expansion into Assyria, where he founded significant cities including Nineveh.",
    "Methodist": "Details Nimrod's further kingdom expansion into Assyria.",
    "Lutheran": "Nimrod expanded his territory into Assyria, building cities there.",
    "Presbyterian": "Describes Nimrod's expansion into Assyria and the cities he built.",
    "Pentecostal": "Details Nimrod's move into Assyria and city building.",
    "Anglican": "Describes Nimrod's move from Babylonia into Assyria, where he built Nineveh and other cities.",
    "Orthodox": "Relates Nimrod's expansion into Assyria and his founding of cities there."
  },
  "12": {
    "General": "...and Resen, located between Nineveh and Calah, described as the great city.",
    "Non-Denominational": "Continues listing Nimrod's building projects in Assyria, highlighting the significance of the region ('the great city' - likely referring collectively or to Nineveh).",
    "Baptist": "Completes the list of cities founded by Nimrod in Assyria.",
    "Catholic": "Concludes the list of cities built by Nimrod in Assyria.",
    "Methodist": "Completes the list of Assyrian cities founded by Nimrod.",
    "Lutheran": "Lists Resen as another city built by Nimrod.",
    "Presbyterian": "Completes the list of cities Nimrod built in Assyria.",
    "Pentecostal": "Finishes listing the cities Nimrod built in Assyria.",
    "Anglican": "Adds Resen to the list of cities built by Nimrod in Assyria.",
    "Orthodox": "Names Resen as another city founded by Nimrod in Assyria."
  },
  "13": {
    "General": "Lists the descendants of Mizraim (Egypt): the Ludites, Anamites, Lehabites, Naphtuhites,",
    "Non-Denominational": "Begins listing the peoples descended from Mizraim, associated with Egypt and surrounding areas, likely Libyan or related groups.",
    "Baptist": "Lists peoples descended from Mizraim (Egypt).",
    "Catholic": "Names various peoples descended from Mizraim (Egypt), likely tribes within or near Egypt.",
    "Methodist": "Identifies descendants of Mizraim (Egypt).",
    "Lutheran": "Lists descendants of Mizraim (Egypt).",
    "Presbyterian": "Records descendants of Mizraim.",
    "Pentecostal": "Names groups descended from Mizraim.",
    "Anglican": "Lists various peoples descended from Mizraim (Egypt).",
    "Orthodox": "Names peoples descending from Mizraim (Egypt)."
  },
  "14": {
    "General": "...Pathrusites, Casluhites (from whom the Philistines came), and Caphtorites.",
    "Non-Denominational": "Continues listing Mizraim's descendants, notably identifying the origin of the Philistines (from the Casluhites, associated with Caphtor/Crete).",
    "Baptist": "Continues the list, noting the origin of the Philistines.",
    "Catholic": "Continues naming Egyptian-related peoples, crucially noting the Philistines' origin from the Casluhites (related to Caphtor/Crete).",
    "Methodist": "Completes the list, mentioning the Philistines' origin.",
    "Lutheran": "Continues list, notes Philistine origin.",
    "Presbyterian": "Completes the list of Mizraim's descendants, including the origin of the Philistines.",
    "Pentecostal": "Finishes the list, identifying the Philistines' ancestors.",
    "Anglican": "Continues the list of Mizraim's descendants, importantly noting the Philistines originated from the Casluhites/Caphtorites.",
    "Orthodox": "Continues the list, noting the origin of the Philistines from the Casluhites/Caphtorites (Crete)."
  },
  "15": {
    "General": "Lists Canaan's firstborn son as Sidon, and also mentions Heth.",
    "Non-Denominational": "Begins listing the descendants of Canaan (Ham's son), the inhabitants of the land later promised to Israel. Sidon (major Phoenician city) and Heth (Hittites) are named first.",
    "Baptist": "Begins listing Canaan's descendants, including Sidon and Heth (Hittites).",
    "Catholic": "Names Canaan's firstborn, Sidon (eponymous ancestor of the Sidonians/Phoenicians), and Heth (ancestor of the Hittites).",
    "Methodist": "Identifies Canaan's first sons, Sidon and Heth.",
    "Lutheran": "Lists Canaan's firstborn Sidon, and Heth.",
    "Presbyterian": "Records Canaan's first descendants, Sidon and Heth.",
    "Pentecostal": "Names Sidon and Heth as Canaan's offspring.",
    "Anglican": "Begins the list of Canaan's descendants, naming Sidon (founder of the Phoenician city) and Heth (ancestor of the Hittites).",
    "Orthodox": "Names Canaan's firstborn Sidon, and Heth (Hittites)."
  },
  "16": {
    "General": "Lists more descendants of Canaan: the Jebusites, Amorites, and Girgashites.",
    "Non-Denominational": "Continues listing Canaanite groups who inhabited the land of Canaan before the Israelite conquest (Jebusites in Jerusalem, Amorites widespread, Girgashites).",
    "Baptist": "Lists prominent Canaanite tribes.",
    "Catholic": "Names more Canaanite peoples inhabiting the Promised Land before Israel: Jebusites (Jerusalem), Amorites (widespread), Girgashites.",
    "Methodist": "Identifies more Canaanite peoples.",
    "Lutheran": "Lists Jebusites, Amorites, Girgashites.",
    "Presbyterian": "Records more Canaanite peoples.",
    "Pentecostal": "Names more Canaanite groups.",
    "Anglican": "Lists further Canaanite peoples: Jebusites, Amorites, and Girgashites.",
    "Orthodox": "Names more Canaanite peoples: Jebusites, Amorites, Girgashites."
  },
  "17": {
    "General": "Lists more descendants of Canaan: the Hivites, Arkites, and Sinites.",
    "Non-Denominational": "Continues listing Canaanite groups, some inhabiting specific areas (Hivites near Shechem/Gibeon), others less clearly located (Arkites, Sinites).",
    "Baptist": "Lists more Canaanite groups.",
    "Catholic": "Names more Canaanite peoples: Hivites, Arkites, Sinites.",
    "Methodist": "Identifies more Canaanite peoples.",
    "Lutheran": "Lists Hivites, Arkites, Sinites.",
    "Presbyterian": "Records more Canaanite peoples.",
    "Pentecostal": "Names more Canaanite groups.",
    "Anglican": "Lists further Canaanite peoples: Hivites, Arkites, and Sinites.",
    "Orthodox": "Names more Canaanite peoples: Hivites, Arkites, Sinites."
  },
  "18": {
    "General": "Lists more descendants of Canaan: the Arvadites, Zemarites, and Hamathites. Notes that later the Canaanite clans scattered.",
    "Non-Denominational": "Completes the list of specific Canaanite groups (Arvadites, Zemarites, Hamathites - coastal/northern cities) and notes their subsequent dispersion.",
    "Baptist": "Completes the list of Canaanite groups, noting their later scattering.",
    "Catholic": "Names final Canaanite peoples listed (Arvadites, Zemarites, Hamathites - northern coastal cities) and mentions their eventual dispersal.",
    "Methodist": "Completes the list of Canaanite groups and mentions their dispersion.",
    "Lutheran": "Lists Arvadites, Zemarites, Hamathites, notes scattering.",
    "Presbyterian": "Completes the list, notes Canaanite clans scattered later.",
    "Pentecostal": "Finishes naming Canaanite groups, notes their scattering.",
    "Anglican": "Lists the final Canaanite groups mentioned (Arvadites, Zemarites, Hamathites) and notes the clans later scattered.",
    "Orthodox": "Names final Canaanite groups listed and notes their later scattering."
  },
  "19": {
    "General": "Defines the borders of Canaanite territory, extending from Sidon south towards Gerar near Gaza, and east towards Sodom, Gomorrah, Admah, and Zeboyim near Lasha.",
    "Non-Denominational": "Outlines the geographical extent of Canaanite settlement, encompassing Phoenicia, the coastal plain, the Jordan Valley (including the cities of the plain), defining the region Israel would later contest.",
    "Baptist": "Describes the geographical boundaries of the Canaanite territory.",
    "Catholic": "Defines the borders of the land inhabited by the Canaanites, the land later promised to Abraham's descendants.",
    "Methodist": "Specifies the geographical area inhabited by the Canaanites.",
    "Lutheran": "Describes the borders of the Canaanite land.",
    "Presbyterian": "Outlines the territory occupied by the Canaanite peoples.",
    "Pentecostal": "Defines the borders of the Canaanite land.",
    "Anglican": "Defines the traditional borders of the Canaanite territory.",
    "Orthodox": "Describes the borders of the territory settled by the Canaanites."
  },
  "20": {
    "General": "Summarizes the account of Ham's descendants, noting they are listed by their clans, languages, territories, and nations.",
    "Non-Denominational": "Concluding summary for Ham's line, reiterating the organizing principles of the genealogy (clan, language, territory, nation).",
    "Baptist": "Summarizes the listing of Ham's descendants by clan, language, territory, nation.",
    "Catholic": "Summarizes the Hamite section, noting the classification by clan, language, territory, and nation.",
    "Methodist": "Concluding summary for Ham's line based on clan, language, territory, nation.",
    "Lutheran": "Summary statement for Ham's descendants.",
    "Presbyterian": "Summarizes the account of Ham's descendants.",
    "Pentecostal": "Summarizes the Hamite section by clan, language, land, nation.",
    "Anglican": "Summarizes the Hamite list according to clans, languages, territories, and nations.",
    "Orthodox": "Summarizes the Hamite genealogy by clan, language, territory, and nation."
  },
  "21": {
    "General": "Introduces the descendants of Shem, identified as the older brother of Japheth and the ancestor of all the sons of Eber.",
    "Non-Denominational": "Begins the crucial line of Shem, highlighting his relationship to Japheth and, significantly, his role as ancestor of Eber's sons (foreshadowing the Hebrews).",
    "Baptist": "Introduces Shem's line, noting his relationship to Japheth and his status as ancestor of Eber.",
    "Catholic": "Introduces the genealogy of Shem, noting he is Japheth's older brother and, importantly, the ancestor of the Eberites (Hebrews).",
    "Methodist": "Introduces Shem's line, identifying him relative to Japheth and as Eber's ancestor.",
    "Lutheran": "Introduces Shem's line, ancestor of Eber.",
    "Presbyterian": "Introduces the line of Shem, ancestor of Eber (and thus the Hebrews).",
    "Pentecostal": "Begins Shem's genealogy, identifying him as Eber's ancestor.",
    "Anglican": "Introduces the line of Shem, identified as Japheth's older brother and the ancestor of the Eberites.",
    "Orthodox": "Introduces the generations of Shem, ancestor of the sons of Eber."
  },
  "22": {
    "General": "Lists the sons of Shem: Elam, Asshur, Arphaxad, Lud, and Aram.",
    "Non-Denominational": "Lists Shem's immediate sons, ancestors of peoples largely in Mesopotamia and surrounding areas (Elamites, Assyrians, Chaldeans via Arphaxad, Lydians?, Arameans).",
    "Baptist": "Lists the immediate sons of Shem.",
    "Catholic": "Names the sons of Shem, ancestors of various Semitic peoples (Elamites, Assyrians, Arameans, etc.).",
    "Methodist": "Identifies the sons of Shem.",
    "Lutheran": "Lists Shem's sons.",
    "Presbyterian": "Records the sons of Shem.",
    "Pentecostal": "Names Shem's sons.",
    "Anglican": "Lists the sons of Shem, progenitors of various Semitic peoples.",
    "Orthodox": "Names the sons of Shem."
  },
  "23": {
    "General": "Lists the sons of Aram (Shem's son): Uz, Hul, Gether, and Meshek.",
    "Non-Denominational": "Details descendants of Aram, associated with Aramean peoples in Syria and Upper Mesopotamia.",
    "Baptist": "Lists Aram's descendants.",
    "Catholic": "Names the sons of Aram, representing Aramean tribes.",
    "Methodist": "Identifies Aram's sons.",
    "Lutheran": "Lists Aram's sons.",
    "Presbyterian": "Records the sons of Aram.",
    "Pentecostal": "Names Aram's sons.",
    "Anglican": "Lists the sons of Aram.",
    "Orthodox": "Names the sons of Aram."
  },
  "24": {
    "General": "States that Arphaxad was the father of Shelah, and Shelah the father of Eber.",
    "Non-Denominational": "Traces the specific line from Arphaxad to Eber, highlighting the lineage leading towards the Hebrews.",
    "Baptist": "Traces the key lineage from Arphaxad to Eber.",
    "Catholic": "Details the lineage from Arphaxad to Eber, the eponymous ancestor of the Hebrews.",
    "Methodist": "Identifies the direct line from Arphaxad to Eber.",
    "Lutheran": "Traces the line Arphaxad-Shelah-Eber.",
    "Presbyterian": "Records the lineage from Arphaxad to Eber.",
    "Pentecostal": "Shows the line from Arphaxad to Eber.",
    "Anglican": "Traces the specific lineage from Arphaxad to Shelah to Eber.",
    "Orthodox": "Specifies the lineage: Arphaxad begat Shelah, Shelah begat Eber."
  },
  "25": {
    "General": "States that two sons were born to Eber: Peleg (meaning division, because in his time the earth was divided) and Joktan.",
    "Non-Denominational": "Introduces Eber's sons, Peleg and Joktan. Significantly notes Peleg's name relates to the division/scattering of the earth, likely referencing the Tower of Babel incident.",
    "Baptist": "Names Eber's sons, Peleg and Joktan, noting the significance of Peleg's name related to the earth's division (Babel).",
    "Catholic": "Names Eber's sons, Peleg and Joktan. Explains Peleg's name ('Division') by referencing the division of the earth in his time (likely the Babel event).",
    "Methodist": "Identifies Eber's sons, explaining Peleg's name refers to the earth's division (Babel).",
    "Lutheran": "Eber's sons were Peleg (named for the division of the earth, i.e., Babel) and Joktan.",
    "Presbyterian": "Records Eber's sons, Peleg and Joktan, linking Peleg's name to the division of the earth (Babel).",
    "Pentecostal": "Names Eber's sons, highlights Peleg's name meaning division, connecting it to the earth being divided (Babel).",
    "Anglican": "Names Eber's two sons, Peleg and Joktan, explaining Peleg's name relates to the division of the earth in his time (Babel).",
    "Orthodox": "Names Eber's sons, Peleg and Joktan, noting Peleg's name relates to the division of the earth (Babel dispersion)."
  },
  "26": {
    "General": "Lists the sons of Joktan (Eber's son): Almodad, Sheleph, Hazarmaveth, Jerah,",
    "Non-Denominational": "Begins listing the descendants of Joktan, generally associated with tribes in Southern Arabia.",
    "Baptist": "Begins listing Joktan's sons, linked to Arabian peoples.",
    "Catholic": "Names the first sons of Joktan, ancestors of various South Arabian tribes.",
    "Methodist": "Identifies the first group of Joktan's sons.",
    "Lutheran": "Lists Joktan's sons.",
    "Presbyterian": "Records the sons of Joktan.",
    "Pentecostal": "Starts naming Joktan's sons.",
    "Anglican": "Begins the list of Joktan's sons, associated with South Arabian peoples.",
    "Orthodox": "Names the first sons of Joktan, linked to Arabian tribes."
  },
  "27": {
    "General": "Hadoram, Uzal, Diklah,",
    "Non-Denominational": "Continues listing Joktan's descendants (South Arabian tribes).",
    "Baptist": "Continues listing Joktan's sons.",
    "Catholic": "Continues naming Joktan's sons (South Arabian tribes).",
    "Methodist": "Identifies more sons of Joktan.",
    "Lutheran": "Lists more sons of Joktan.",
    "Presbyterian": "Records more sons of Joktan.",
    "Pentecostal": "Continues naming Joktan's sons.",
    "Anglican": "Lists further sons of Joktan.",
    "Orthodox": "Names more sons of Joktan."
  },
  "28": {
    "General": "Obal, Abimael, Sheba,",
    "Non-Denominational": "Continues listing Joktan's descendants (South Arabian tribes). Sheba here is distinct from the Cushite Sheba.",
    "Baptist": "Continues listing Joktan's sons, including Sheba.",
    "Catholic": "Continues naming Joktan's sons, including Sheba (distinct from the Cushite Sheba).",
    "Methodist": "Identifies more sons of Joktan.",
    "Lutheran": "Lists more sons of Joktan.",
    "Presbyterian": "Records more sons of Joktan.",
    "Pentecostal": "Continues naming Joktan's sons.",
    "Anglican": "Lists further sons of Joktan, including Sheba.",
    "Orthodox": "Names more sons of Joktan, including Sheba."
  },
  "29": {
    "General": "Ophir, Havilah, and Jobab. All these were sons of Joktan.",
    "Non-Denominational": "Completes the list of Joktan's sons, associated with Arabian regions known for resources like gold (Ophir, Havilah).",
    "Baptist": "Completes the list of Joktan's sons.",
    "Catholic": "Concludes the list of Joktan's sons, associated with resource-rich areas of Arabia.",
    "Methodist": "Completes the list of Joktan's sons.",
    "Lutheran": "Completes the list of Joktan's sons.",
    "Presbyterian": "Completes the list of Joktan's sons.",
    "Pentecostal": "Finishes naming Joktan's sons.",
    "Anglican": "Lists the final sons of Joktan mentioned, including Ophir and Havilah.",
    "Orthodox": "Names the final sons of Joktan listed."
  },
  "30": {
    "General": "Describes the region settled by Joktan's descendants, extending from Mesha toward Sephar in the eastern hill country.",
    "Non-Denominational": "Defines the geographical area inhabited by the Joktanites, located in Southern Arabia.",
    "Baptist": "Describes the territory settled by Joktan's descendants (Arabia).",
    "Catholic": "Specifies the region inhabited by Joktan's descendants, located in Southern Arabia.",
    "Methodist": "Identifies the geographical region settled by Joktan's line.",
    "Lutheran": "Describes the territory of Joktan's descendants.",
    "Presbyterian": "Outlines the region settled by Joktan's descendants.",
    "Pentecostal": "Defines the area where Joktan's descendants lived.",
    "Anglican": "Describes the territory settled by Joktan's descendants in southern Arabia.",
    "Orthodox": "Describes the territory settled by Joktan's descendants in Arabia."
  },
  "31": {
    "General": "Summarizes the account of Shem's descendants, noting they are listed by their clans, languages, territories, and nations.",
    "Non-Denominational": "Concluding summary for Shem's line, using the same formula as for Japheth and Ham, emphasizing the ordered dispersion.",
    "Baptist": "Summarizes the listing of Shem's descendants by clan, language, territory, nation.",
    "Catholic": "Summarizes the Shemite section, noting the classification by clan, language, territory, and nation.",
    "Methodist": "Concluding summary for Shem's line based on clan, language, territory, nation.",
    "Lutheran": "Summary statement for Shem's descendants.",
    "Presbyterian": "Summarizes the account of Shem's descendants.",
    "Pentecostal": "Summarizes the Shemite section by clan, language, land, nation.",
    "Anglican": "Summarizes the Shemite list according to clans, languages, territories, and nations.",
    "Orthodox": "Summarizes the Shemite genealogy by clan, language, territory, and nation."
  },
  "32": {
    "General": "Concludes the chapter, stating these are the clans of Noah's sons, according to their lines of descent, within their nations. From these, the nations spread out over the earth after the flood.",
    "Non-Denominational": "Overall conclusion to the Table of Nations, reaffirming that all post-Flood nations originated from Noah's sons and dispersed across the earth according to this divine ordering.",
    "Baptist": "Final summary: all nations descended from Noah's sons and spread across the earth after the Flood.",
    "Catholic": "Concluding statement summarizing the chapter: all nations originated from these clans of Noah's sons and dispersed across the earth post-Flood.",
    "Methodist": "Final summary statement emphasizing the origin of all nations from Noah's sons after the Flood.",
    "Lutheran": "Concluding summary: all nations came from Noah's sons after the Flood.",
    "Presbyterian": "Conclusion reaffirming that all nations descended from Noah's sons and scattered across the earth.",
    "Pentecostal": "Final summary statement confirming the origin of all nations from Noah's sons after the Flood.",
    "Anglican": "Concluding summary for the entire chapter, affirming these clans as the source from which the nations spread across the earth after the Flood.",
    "Orthodox": "Conclusion stating these clans of Noah's sons are the origin of the nations that spread throughout the earth after the Flood."
  }
} 