{
  "chapterSummary": {
    "General": "Genesis 11 first recounts the story of the Tower of Babel. Humanity, united by one language, migrates to Shinar and attempts to build a city and tower to reach the heavens, make a name for themselves, and avoid scattering. God intervenes by confusing their language, halting the project and forcing their dispersal across the earth. The place is named Babel. The second part provides the genealogy from Shem down to Terah, Abram's father. It details the lineage, including decreasing lifespans, and notes key family details like Sarai's barrenness and the family's migration from Ur to Haran, where Terah died.",
    "Non-Denominational": "Focuses on human unity misused for prideful ambition (Tower of Babel) aimed at self-glorification and resisting God's command to fill the earth. Highlights God's sovereign intervention (confusing language, scattering) to judge hubris and enforce His will. Transitions to the specific lineage of promise (Shem to Abram), showing God narrowing the focus towards His redemptive plan. Notes Sarai's barrenness and the move to Haran as context for Abram's later call.",
    "Baptist": "Views Babel as an act of human rebellion, pride, and idolatry, seeking unity apart from God. God's judgment (language confusion, scattering) demonstrates His sovereignty and wrath against sin. Emphasizes the genealogy as historically accurate, tracing the godly line of Shem towards Abram, the father of faith. Notes Sarai's barrenness to highlight God's power in fulfilling His promise later.",
    "Catholic": "Interprets the Tower of Babel as a symbol of human pride and the sin of seeking self-sufficiency and fame apart from God. God's intervention disrupts this false unity and leads to the diversity of languages and peoples. The genealogy traces the line of Shem, preparing for the call of Abram, a key moment in salvation history. Sarai's barrenness underscores the miraculous nature of God's later promise.",
    "Methodist": "Sees Babel as illustrating humanity's tendency towards pride and rebellion, seeking security and fame through human effort. God's confusion of languages and scattering is viewed as a corrective judgment but also facilitates the filling of the earth. The genealogy highlights the lineage leading to Abram, setting the stage for God's covenant initiative. Notes the family's journey and Sarai's barrenness as important background.",
    "Lutheran": "Interprets Babel as humanity united in sinful pride against God, seeking self-deification. God's judgment justly confuses their language and scatters them. The genealogy traces the line of promise from Shem to Abram, showing God preserving His chosen lineage amidst general decline (decreasing lifespans). Sarai's barrenness emphasizes reliance on God's promise.",
    "Presbyterian": "Views Babel as a manifestation of human depravity, pride, and organized rebellion against God's mandate. God's sovereign judgment confuses language and scatters humanity according to His plan. The genealogy meticulously traces the covenant line from Shem to Abram, demonstrating God's faithfulness in preserving His elect. Sarai's barrenness highlights the need for divine intervention for the covenant promise.",
    "Pentecostal": "Sees Babel as human pride seeking to usurp God's authority. God's supernatural intervention confuses languages and scatters people, judging sin. Emphasizes the genealogy as tracing the spiritual lineage chosen by God, leading to Abram. Views the confusion of tongues as the opposite of the unity given by the Spirit at Pentecost (Acts 2). Sarai's barrenness sets up a future miracle.",
    "Anglican": "Interprets the Babel story as a parable of human pride and the dangers of unchecked ambition. God's action results in the diversity of language and culture. The genealogy provides the historical lineage from Shem to Abram, marking the transition to the patriarchal narratives. Notes the move from Ur to Haran and Sarai's barrenness as key context for Abram's call.",
    "Orthodox": "Views Babel as humanity's arrogant attempt to create a false unity and reach God through their own efforts, reversing God's blessing of diversity. God's intervention leads to the division of languages and scattering. The genealogy traces the chosen line leading to Abram, the father of faith. Sarai's barrenness highlights the theme of God bringing life from barrenness."
  },
  "1": {
    "General": "States that at one time, the whole world had one common language and speech.",
    "Non-Denominational": "Establishes the initial post-Flood condition: linguistic unity among all humanity.",
    "Baptist": "Describes the original unity of language after the Flood.",
    "Catholic": "Notes the initial state of linguistic unity for all humanity.",
    "Methodist": "Highlights the initial common language shared by all people.",
    "Lutheran": "The world originally had one language.",
    "Presbyterian": "Records the initial linguistic unity of post-Flood humanity.",
    "Pentecostal": "States the fact of original language unity.",
    "Anglican": "States that initially the whole world shared one language and vocabulary.",
    "Orthodox": "Describes the primordial state of linguistic unity."
  },
  "2": {
    "General": "As people migrated eastward, they found a plain in Shinar (Babylonia) and settled there.",
    "Non-Denominational": "Describes the migration pattern leading to settlement in Mesopotamia, a fertile plain suitable for building civilization.",
    "Baptist": "Records the migration and settlement in Shinar.",
    "Catholic": "Narrates the migration eastward and settlement in the plain of Shinar.",
    "Methodist": "Details the migration and finding a place to settle in Shinar.",
    "Lutheran": "People migrated east and settled in Shinar.",
    "Presbyterian": "Records the eastward migration and settlement in Shinar.",
    "Pentecostal": "Describes the journey eastward and settling in Shinar.",
    "Anglican": "Describes the eastward migration and settlement on the plain of Shinar.",
    "Orthodox": "Relates the eastward journey and settlement in Shinar."
  },
  "3": {
    "General": "They decided to use bricks baked thoroughly instead of stone, and tar for mortar, indicating technological advancement.",
    "Non-Denominational": "Highlights human ingenuity and technology (brick-making) enabling large-scale construction in a region lacking natural stone.",
    "Baptist": "Notes their technological development in using bricks and tar.",
    "Catholic": "Describes their building technology (baked bricks, bitumen mortar), suited to the Mesopotamian environment.",
    "Methodist": "Details their building materials, showing human innovation.",
    "Lutheran": "They developed brick-making technology for building.",
    "Presbyterian": "Records their technological innovation in building materials.",
    "Pentecostal": "Highlights their decision to use advanced materials (bricks, tar).",
    "Anglican": "Describes their plan to use manufactured bricks and bitumen for mortar.",
    "Orthodox": "Notes their use of brick and bitumen, indicating building technology."
  },
  "4": {
    "General": "They proposed building a city with a tower reaching to the heavens, aiming to make a name for themselves and prevent being scattered.",
    "Non-Denominational": "Reveals their motivation: pride (make a name), desire for centralized power/security, and direct defiance of God's command to fill the earth (prevent scattering).",
    "Baptist": "States their goal: build a city and tower for fame and to prevent dispersion, an act of rebellion against God.",
    "Catholic": "Describes their ambitious plan driven by pride: build a city and tower reaching the heavens to achieve fame and avoid scattering.",
    "Methodist": "Details their ambition: build a monumental city and tower for reputation and unity, resisting God's plan.",
    "Lutheran": "Their plan, born of pride, was to build a city and tower to gain fame and avoid being scattered.",
    "Presbyterian": "Records their prideful plan to build a city and tower for self-glorification and to resist God's mandate.",
    "Pentecostal": "Highlights their motivation: making a name for themselves and avoiding God's command to scatter.",
    "Anglican": "Describes their ambitious plan to build a city and a tower reaching the heavens, driven by desire for fame and fear of scattering.",
    "Orthodox": "Relates their plan to build a city and tower for renown and to prevent scattering, an act of pride."
  },
  "5": {
    "General": "The Lord came down to see the city and the tower the people were building.",
    "Non-Denominational": "Anthropomorphic language describing God's awareness and assessment of humanity's rebellious project.",
    "Baptist": "God observes humanity's rebellious construction.",
    "Catholic": "God 'comes down' (anthropomorphism) to observe the city and tower built by humans in their pride.",
    "Methodist": "Describes God taking notice of the human endeavor (anthropomorphism).",
    "Lutheran": "God observes the city and tower being built.",
    "Presbyterian": "Records God's observation of humanity's prideful project.",
    "Pentecostal": "God comes down to inspect their work.",
    "Anglican": "Anthropomorphic description of the Lord observing the city and tower.",
    "Orthodox": "Describes God's attention to the human project (using anthropomorphism)."
  },
  "6": {
    "General": "The Lord noted their unity (one people, one language) and recognized this ambitious project as just the beginning, fearing nothing they planned would be impossible for them.",
    "Non-Denominational": "God assesses the situation: their unity enables this hubris, and if unchecked, their potential for rebellious achievement would be limitless.",
    "Baptist": "God recognizes their unity enables this rebellion and could lead to further unchecked sin.",
    "Catholic": "God observes their unity (one people, one language) fueling their ambition, recognizing that unchecked, nothing would restrain their prideful plans.",
    "Methodist": "God notes their unity and language enable this project, foreseeing unrestrained human ambition if not checked.",
    "Lutheran": "God sees their unity and recognizes that their sinful potential is boundless if unchecked.",
    "Presbyterian": "God observes their unity enabling this project and recognizes their potential for further rebellion if not stopped.",
    "Pentecostal": "God notes their unity and language as the source of their power, foreseeing limitless ambition.",
    "Anglican": "The Lord observes their unity and language, concluding that this project is only the start and nothing they propose will be beyond them.",
    "Orthodox": "God observes their unity enabling their plan, recognizing their potential for unrestrained hubris."
  },
  "7": {
    "General": "God decided to go down and confuse their language so they would not understand each other.",
    "Non-Denominational": "God's resolution: intervene directly by confusing their language, breaking their unity and thwarting their prideful project.",
    "Baptist": "God determines to judge their rebellion by confusing their language.",
    "Catholic": "God resolves to intervene by confusing their language, thus disrupting their sinful unity and plans.",
    "Methodist": "God decides to confuse their language to halt their rebellious project.",
    "Lutheran": "God decides to confuse their language as judgment.",
    "Presbyterian": "God determines to intervene by confusing their language.",
    "Pentecostal": "God's decision: confuse their language to stop them.",
    "Anglican": "God resolves to confuse their language to prevent mutual understanding.",
    "Orthodox": "God decides to confuse their language to break their unified rebellion."
  },
  "8": {
    "General": "So the Lord scattered them from there over the face of the whole earth, and they stopped building the city.",
    "Non-Denominational": "The consequence of God's intervention: the project halts, and humanity is scattered, fulfilling God's original intent for them to spread out.",
    "Baptist": "God enforces His will, scattering them and halting the rebellious project.",
    "Catholic": "God scatters them across the earth, forcing them to cease building the city, thus enforcing His plan.",
    "Methodist": "God's action results in the scattering of people and the cessation of the building project.",
    "Lutheran": "God scatters them across the earth, and they stop building.",
    "Presbyterian": "God executes His judgment, scattering them and stopping the building.",
    "Pentecostal": "God scatters them supernaturally, and the city construction ends.",
    "Anglican": "The Lord scatters them across the earth, and the building of the city ceases.",
    "Orthodox": "God scatters them over the earth, and they cease building the city."
  },
  "9": {
    "General": "The place was called Babel because there the Lord confused the language of the whole world and scattered them over the earth.",
    "Non-Denominational": "Explains the name Babel (related to Hebrew 'balal', to confuse) as commemorating God's act of confusing language and scattering humanity.",
    "Baptist": "Explains the name Babel, linking it to God's judgment of language confusion and scattering.",
    "Catholic": "Gives the etymology of Babel (linking it to 'confusion'), named because God confused languages and scattered people there.",
    "Methodist": "Explains the origin of the name Babel, relating it to the confusion of languages.",
    "Lutheran": "The place was named Babel (confusion) because God confused their language there.",
    "Presbyterian": "Explains the name Babel commemorates God's judgment of confusing language and scattering.",
    "Pentecostal": "Explains Babel means confusion, named for God confusing the language.",
    "Anglican": "Explains the name Babel derives from the Lord confusing (balal) the world's language and scattering people from there.",
    "Orthodox": "Names the place Babel, connecting it to the confusion (synchysis) of languages and the scattering."
  },
  "10": {
    "General": "Introduces the genealogy of Shem: Shem was 100 years old when he fathered Arphaxad, two years after the flood.",
    "Non-Denominational": "Begins the specific genealogy tracing the line of promise from Shem, providing ages and timing relative to the Flood.",
    "Baptist": "Begins Shem's genealogy, noting Arphaxad's birth timing.",
    "Catholic": "Starts the genealogy ('toledot') of Shem, crucial for tracing the line to Abraham.",
    "Methodist": "Introduces Shem's lineage, giving Arphaxad's birth details.",
    "Lutheran": "Starts Shem's genealogy: he fathered Arphaxad after the Flood.",
    "Presbyterian": "Begins the record of Shem's lineage.",
    "Pentecostal": "Starts Shem's family line account.",
    "Anglican": "Begins the formal genealogy ('toledoth') of Shem.",
    "Orthodox": "Introduces the generations ('toledot') of Shem."
  },
  "11": {
    "General": "Shem lived 500 years after fathering Arphaxad and had other sons and daughters.",
    "Non-Denominational": "Provides Shem's remaining lifespan and notes other children, following the genealogical pattern.",
    "Baptist": "Records Shem's remaining lifespan and other children.",
    "Catholic": "Gives Shem's lifespan after Arphaxad's birth and mentions other offspring.",
    "Methodist": "Notes Shem's further lifespan and other children.",
    "Lutheran": "Records Shem's lifespan and other children.",
    "Presbyterian": "Records Shem's lifespan and other offspring.",
    "Pentecostal": "States Shem's remaining years and other children.",
    "Anglican": "Records Shem's lifespan after fathering Arphaxad and notes other children.",
    "Orthodox": "Gives Shem's remaining lifespan and notes other children."
  },
  "12": {
    "General": "Arphaxad lived 35 years and fathered Shelah.",
    "Non-Denominational": "Continues the lineage: Arphaxad to Shelah.",
    "Baptist": "Continues the line: Arphaxad fathers Shelah.",
    "Catholic": "Continues the line: Arphaxad to Shelah.",
    "Methodist": "Traces the line to Shelah.",
    "Lutheran": "Arphaxad fathered Shelah.",
    "Presbyterian": "Continues the lineage: Arphaxad to Shelah.",
    "Pentecostal": "Line continues: Arphaxad fathers Shelah.",
    "Anglican": "Continues the genealogy: Arphaxad fathers Shelah.",
    "Orthodox": "Continues the line: Arphaxad begat Shelah."
  },
  "13": {
    "General": "Arphaxad lived 403 years after fathering Shelah and had other sons and daughters.",
    "Non-Denominational": "Provides Arphaxad's remaining lifespan and notes other children.",
    "Baptist": "Records Arphaxad's lifespan details.",
    "Catholic": "Gives Arphaxad's lifespan after Shelah's birth and mentions other offspring.",
    "Methodist": "Notes Arphaxad's further lifespan and children.",
    "Lutheran": "Records Arphaxad's lifespan and other children.",
    "Presbyterian": "Records Arphaxad's lifespan and other offspring.",
    "Pentecostal": "States Arphaxad's remaining years and other children.",
    "Anglican": "Records Arphaxad's lifespan after fathering Shelah and notes other children.",
    "Orthodox": "Gives Arphaxad's remaining lifespan and notes other children."
  },
  "14": {
    "General": "Shelah lived 30 years and fathered Eber.",
    "Non-Denominational": "Continues the lineage: Shelah to Eber, the eponym of the Hebrews.",
    "Baptist": "Continues the line: Shelah fathers Eber.",
    "Catholic": "Continues the line: Shelah to Eber (eponymous ancestor).",
    "Methodist": "Traces the line to Eber.",
    "Lutheran": "Shelah fathered Eber.",
    "Presbyterian": "Continues the lineage: Shelah to Eber.",
    "Pentecostal": "Line continues: Shelah fathers Eber.",
    "Anglican": "Continues the genealogy: Shelah fathers Eber.",
    "Orthodox": "Continues the line: Shelah begat Eber."
  },
  "15": {
    "General": "Shelah lived 403 years after fathering Eber and had other sons and daughters.",
    "Non-Denominational": "Provides Shelah's remaining lifespan and notes other children.",
    "Baptist": "Records Shelah's lifespan details.",
    "Catholic": "Gives Shelah's lifespan after Eber's birth and mentions other offspring.",
    "Methodist": "Notes Shelah's further lifespan and children.",
    "Lutheran": "Records Shelah's lifespan and other children.",
    "Presbyterian": "Records Shelah's lifespan and other offspring.",
    "Pentecostal": "States Shelah's remaining years and other children.",
    "Anglican": "Records Shelah's lifespan after fathering Eber and notes other children.",
    "Orthodox": "Gives Shelah's remaining lifespan and notes other children."
  },
  "16": {
    "General": "Eber lived 34 years and fathered Peleg.",
    "Non-Denominational": "Continues the lineage: Eber to Peleg, whose name signifies division.",
    "Baptist": "Continues the line: Eber fathers Peleg.",
    "Catholic": "Continues the line: Eber to Peleg.",
    "Methodist": "Traces the line to Peleg.",
    "Lutheran": "Eber fathered Peleg.",
    "Presbyterian": "Continues the lineage: Eber to Peleg.",
    "Pentecostal": "Line continues: Eber fathers Peleg.",
    "Anglican": "Continues the genealogy: Eber fathers Peleg.",
    "Orthodox": "Continues the line: Eber begat Peleg."
  },
  "17": {
    "General": "Eber lived 430 years after fathering Peleg and had other sons and daughters.",
    "Non-Denominational": "Provides Eber's remaining lifespan and notes other children.",
    "Baptist": "Records Eber's lifespan details.",
    "Catholic": "Gives Eber's lifespan after Peleg's birth and mentions other offspring.",
    "Methodist": "Notes Eber's further lifespan and children.",
    "Lutheran": "Records Eber's lifespan and other children.",
    "Presbyterian": "Records Eber's lifespan and other offspring.",
    "Pentecostal": "States Eber's remaining years and other children.",
    "Anglican": "Records Eber's lifespan after fathering Peleg and notes other children.",
    "Orthodox": "Gives Eber's remaining lifespan and notes other children."
  },
  "18": {
    "General": "Peleg lived 30 years and fathered Reu.",
    "Non-Denominational": "Continues the lineage: Peleg to Reu. Note the decreasing lifespans.",
    "Baptist": "Continues the line: Peleg fathers Reu.",
    "Catholic": "Continues the line: Peleg to Reu.",
    "Methodist": "Traces the line to Reu.",
    "Lutheran": "Peleg fathered Reu.",
    "Presbyterian": "Continues the lineage: Peleg to Reu.",
    "Pentecostal": "Line continues: Peleg fathers Reu.",
    "Anglican": "Continues the genealogy: Peleg fathers Reu.",
    "Orthodox": "Continues the line: Peleg begat Reu."
  },
  "19": {
    "General": "Peleg lived 209 years after fathering Reu and had other sons and daughters.",
    "Non-Denominational": "Provides Peleg's remaining lifespan (significantly shorter) and notes other children.",
    "Baptist": "Records Peleg's lifespan details, showing decrease.",
    "Catholic": "Gives Peleg's lifespan after Reu's birth and mentions other offspring; lifespans noticeably shorter.",
    "Methodist": "Notes Peleg's further lifespan and children.",
    "Lutheran": "Records Peleg's lifespan (shorter) and other children.",
    "Presbyterian": "Records Peleg's lifespan and other offspring.",
    "Pentecostal": "States Peleg's remaining years (shorter) and other children.",
    "Anglican": "Records Peleg's lifespan after fathering Reu and notes other children.",
    "Orthodox": "Gives Peleg's remaining lifespan and notes other children."
  },
  "20": {
    "General": "Reu lived 32 years and fathered Serug.",
    "Non-Denominational": "Continues the lineage: Reu to Serug.",
    "Baptist": "Continues the line: Reu fathers Serug.",
    "Catholic": "Continues the line: Reu to Serug.",
    "Methodist": "Traces the line to Serug.",
    "Lutheran": "Reu fathered Serug.",
    "Presbyterian": "Continues the lineage: Reu to Serug.",
    "Pentecostal": "Line continues: Reu fathers Serug.",
    "Anglican": "Continues the genealogy: Reu fathers Serug.",
    "Orthodox": "Continues the line: Reu begat Serug."
  },
  "21": {
    "General": "Reu lived 207 years after fathering Serug and had other sons and daughters.",
    "Non-Denominational": "Provides Reu's remaining lifespan and notes other children.",
    "Baptist": "Records Reu's lifespan details.",
    "Catholic": "Gives Reu's lifespan after Serug's birth and mentions other offspring.",
    "Methodist": "Notes Reu's further lifespan and children.",
    "Lutheran": "Records Reu's lifespan and other children.",
    "Presbyterian": "Records Reu's lifespan and other offspring.",
    "Pentecostal": "States Reu's remaining years and other children.",
    "Anglican": "Records Reu's lifespan after fathering Serug and notes other children.",
    "Orthodox": "Gives Reu's remaining lifespan and notes other children."
  },
  "22": {
    "General": "Serug lived 30 years and fathered Nahor.",
    "Non-Denominational": "Continues the lineage: Serug to Nahor (Abram's grandfather).",
    "Baptist": "Continues the line: Serug fathers Nahor.",
    "Catholic": "Continues the line: Serug to Nahor.",
    "Methodist": "Traces the line to Nahor.",
    "Lutheran": "Serug fathered Nahor.",
    "Presbyterian": "Continues the lineage: Serug to Nahor.",
    "Pentecostal": "Line continues: Serug fathers Nahor.",
    "Anglican": "Continues the genealogy: Serug fathers Nahor.",
    "Orthodox": "Continues the line: Serug begat Nahor."
  },
  "23": {
    "General": "Serug lived 200 years after fathering Nahor and had other sons and daughters.",
    "Non-Denominational": "Provides Serug's remaining lifespan and notes other children.",
    "Baptist": "Records Serug's lifespan details.",
    "Catholic": "Gives Serug's lifespan after Nahor's birth and mentions other offspring.",
    "Methodist": "Notes Serug's further lifespan and children.",
    "Lutheran": "Records Serug's lifespan and other children.",
    "Presbyterian": "Records Serug's lifespan and other offspring.",
    "Pentecostal": "States Serug's remaining years and other children.",
    "Anglican": "Records Serug's lifespan after fathering Nahor and notes other children.",
    "Orthodox": "Gives Serug's remaining lifespan and notes other children."
  },
  "24": {
    "General": "Nahor lived 29 years and fathered Terah.",
    "Non-Denominational": "Continues the lineage: Nahor to Terah (Abram's father).",
    "Baptist": "Continues the line: Nahor fathers Terah.",
    "Catholic": "Continues the line: Nahor to Terah.",
    "Methodist": "Traces the line to Terah.",
    "Lutheran": "Nahor fathered Terah.",
    "Presbyterian": "Continues the lineage: Nahor to Terah.",
    "Pentecostal": "Line continues: Nahor fathers Terah.",
    "Anglican": "Continues the genealogy: Nahor fathers Terah.",
    "Orthodox": "Continues the line: Nahor begat Terah."
  },
  "25": {
    "General": "Nahor lived 119 years after fathering Terah and had other sons and daughters.",
    "Non-Denominational": "Provides Nahor's remaining lifespan (very short compared to earlier generations) and notes other children.",
    "Baptist": "Records Nahor's lifespan details (markedly shorter).",
    "Catholic": "Gives Nahor's lifespan after Terah's birth and mentions other offspring; lifespans continue to shorten.",
    "Methodist": "Notes Nahor's further lifespan and children.",
    "Lutheran": "Records Nahor's lifespan (shorter) and other children.",
    "Presbyterian": "Records Nahor's lifespan and other offspring.",
    "Pentecostal": "States Nahor's remaining years (much shorter) and other children.",
    "Anglican": "Records Nahor's lifespan after fathering Terah and notes other children.",
    "Orthodox": "Gives Nahor's remaining lifespan and notes other children."
  },
  "26": {
    "General": "After Nahor lived 70 years, he became the father of Abram, Nahor (a different Nahor, Abram's brother), and Haran.",
    "Non-Denominational": "Introduces Terah's sons: Abram (the focus), Nahor, and Haran, marking the transition to the patriarchal narrative.",
    "Baptist": "Introduces Terah's sons: Abram, Nahor, and Haran.",
    "Catholic": "States Terah fathered Abram, Nahor, and Haran after reaching age 70.",
    "Methodist": "Identifies Terah's sons, including Abram.",
    "Lutheran": "Terah fathered Abram, Nahor, and Haran.",
    "Presbyterian": "Records Terah's sons: Abram, Nahor, and Haran.",
    "Pentecostal": "Names Terah's sons: Abram, Nahor, and Haran.",
    "Anglican": "States that Terah fathered Abram, Nahor, and Haran after age 70.",
    "Orthodox": "States that Terah fathered Abram, Nahor, and Haran."
  },
  "27": {
    "General": "Introduces Terah's family line: Terah fathered Abram, Nahor, and Haran. Haran fathered Lot.",
    "Non-Denominational": "Focuses the genealogy on Terah's immediate family, establishing Abram's relationship to his brothers and nephew Lot.",
    "Baptist": "Introduces Terah's family, including Abram's nephew Lot.",
    "Catholic": "Begins the specific account ('toledot') of Terah, naming his sons and grandson Lot.",
    "Methodist": "Focuses on Terah's family, introducing Lot.",
    "Lutheran": "Introduces Terah's family, including Lot.",
    "Presbyterian": "Begins the account of Terah's family line.",
    "Pentecostal": "Focuses on Terah's immediate family, including Lot.",
    "Anglican": "Begins the account ('toledoth') of Terah's family, naming sons and grandson Lot.",
    "Orthodox": "Introduces the generations ('toledot') of Terah, naming his sons and grandson Lot."
  },
  "28": {
    "General": "Haran died before his father Terah in their native land, Ur of the Chaldeans.",
    "Non-Denominational": "Notes Haran's premature death in Ur, explaining Lot's connection to Abram and the family's origin in Ur.",
    "Baptist": "Records Haran's death in Ur.",
    "Catholic": "Mentions Haran predeceasing his father Terah in Ur of the Chaldeans.",
    "Methodist": "Notes Haran's death before his father in Ur.",
    "Lutheran": "Haran died in Ur before his father.",
    "Presbyterian": "Records Haran's death in Ur.",
    "Pentecostal": "States Haran died young in Ur.",
    "Anglican": "Records Haran's death during his father Terah's lifetime in Ur.",
    "Orthodox": "Notes Haran's death in Ur before his father."
  },
  "29": {
    "General": "Abram and Nahor both married. Abram's wife was Sarai, and Nahor's wife was Milkah (Haran's daughter).",
    "Non-Denominational": "Provides marital details: Abram married Sarai, and Nahor married their niece Milkah (Haran's daughter).",
    "Baptist": "Records the marriages of Abram (to Sarai) and Nahor (to Milcah).",
    "Catholic": "Names the wives of Abram (Sarai) and Nahor (Milcah, Haran's daughter).",
    "Methodist": "Identifies the wives of Abram and Nahor.",
    "Lutheran": "Abram married Sarai; Nahor married Milcah.",
    "Presbyterian": "Records the wives of Abram and Nahor.",
    "Pentecostal": "Names Abram's wife Sarai and Nahor's wife Milcah.",
    "Anglican": "Names Abram's wife (Sarai) and Nahor's wife (Milcah, daughter of Haran).",
    "Orthodox": "Identifies the wives of Abram (Sarai) and Nahor (Milcah)."
  },
  "30": {
    "General": "States that Sarai was barren; she had no children.",
    "Non-Denominational": "Highlights a key challenge and theme: Sarai's barrenness, setting the stage for God's promise and miraculous intervention later.",
    "Baptist": "Notes Sarai's barrenness, emphasizing the obstacle to God's future promise.",
    "Catholic": "Emphasizes Sarai's barrenness, a significant detail highlighting the human impossibility of the promised offspring.",
    "Methodist": "Points out Sarai's barrenness, a crucial factor in the upcoming narrative.",
    "Lutheran": "Notes Sarai was barren, highlighting the need for God's intervention.",
    "Presbyterian": "Records Sarai's barrenness, emphasizing the obstacle to the covenant promise.",
    "Pentecostal": "Highlights Sarai's barrenness, setting up a miracle.",
    "Anglican": "States the significant fact that Sarai was barren.",
    "Orthodox": "Notes Sarai's barrenness, setting the stage for God's miraculous intervention."
  },
  "31": {
    "General": "Terah took his son Abram, his grandson Lot, and his daughter-in-law Sarai, and they set out together from Ur of the Chaldeans to go to Canaan, but they stopped and settled in Haran.",
    "Non-Denominational": "Describes the family's migration from Ur towards Canaan (the promised land), but their journey halts prematurely in Haran.",
    "Baptist": "Records the family's migration from Ur, intending for Canaan but stopping in Haran.",
    "Catholic": "Narrates Terah's migration with Abram, Lot, and Sarai from Ur towards Canaan, but settling incomplete in Haran.",
    "Methodist": "Details the family's departure from Ur towards Canaan, but their settlement in Haran instead.",
    "Lutheran": "Terah started towards Canaan with Abram, Lot, and Sarai, but settled in Haran.",
    "Presbyterian": "Records Terah's migration from Ur towards Canaan, which stalled in Haran.",
    "Pentecostal": "Describes the family leaving Ur for Canaan but stopping in Haran.",
    "Anglican": "Describes Terah taking Abram, Lot, and Sarai from Ur towards Canaan, but settling in Haran.",
    "Orthodox": "Relates Terah's journey with family from Ur, aiming for Canaan but settling in Haran."
  },
  "32": {
    "General": "Terah lived 205 years, and he died in Haran.",
    "Non-Denominational": "Records Terah's lifespan and death in Haran, setting the stage for Abram's independent call from God.",
    "Baptist": "Records Terah's age and death in Haran.",
    "Catholic": "States Terah's total lifespan and his death in Haran, before Abram continued the journey.",
    "Methodist": "Notes Terah's age and death in Haran.",
    "Lutheran": "Terah died in Haran at age 205.",
    "Presbyterian": "Records Terah's lifespan and death in Haran.",
    "Pentecostal": "States Terah's age and place of death (Haran).",
    "Anglican": "Records Terah's lifespan (205 years) and his death in Haran.",
    "Orthodox": "States Terah's lifespan and death in Haran."
  }
} 