{
  "chapterSummary": {
    "General": "Abram returns from Egypt to Canaan, very wealthy. He goes back to the altar between Bethel and Ai and worships. Lot, also wealthy, travels with him. Strife arises between their herders because the land cannot support both large households, especially with Canaanites and Perizzites present. Abram generously proposes separation, offering Lot first choice. Lot chooses the well-watered Jordan plain near the wicked city of Sodom and moves east. After Lot leaves, God reaffirms His promise to Abram, granting him and his innumerable offspring the entire land he can see, forever. God instructs Abram to survey the land. Abram moves to Hebron by the trees of Mamre and builds another altar.",
    "Non-Denominational": "Focuses on Abram's return to the place of worship, indicating restored fellowship after Egypt. Highlights the practical problem of wealth leading to conflict. Contrasts Abram's generosity and peacemaking with Lot's choice based on worldly appearance (fertile plain near sinful Sodom). Emphasizes God's timing in reaffirming and expanding the covenant promises (land, innumerable offspring) to Abram *after* the separation, rewarding Abram's faith and generosity. Notes Abram's continued worship and settling in Hebron.",
    "Baptist": "Shows Abram returning to worship, signifying repentance/restoration. Conflict arises from material blessings. Abram acts graciously in offering Lot the choice. Lot's choice reflects worldly values, leading him near Sodom's wickedness. God reaffirms and expands His covenant promises (land, seed) to Abram alone after Lot's departure, emphasizing His faithfulness despite Abram's earlier lapse and Lot's choice. Abram continues in worship.",
    "Catholic": "Abram returns to Canaan and worships at his previous altar, indicating renewed faithfulness. The conflict highlights the potential dangers of wealth. Abram's generosity in separating from Lot is praised. Lot's choice of the fertile Jordan plain, despite proximity to Sodom, reflects a worldly perspective. God's reaffirmation of the covenant with Abram after Lot leaves confirms Abram as the sole bearer of the primary promise. Abram establishes a new center of worship at Hebron.",
    "Methodist": "Highlights Abram's return to worship. Notes the conflict arising from prosperity. Praises Abram's peacemaking initiative and generosity. Contrasts Lot's choice, driven by apparent advantage near a sinful area, with Abram's reliance on God. God's renewed and expanded promises to Abram after the separation underscore His faithfulness. Abram responds with continued worship.",
    "Lutheran": "Shows Abram returning to worship. Wealth causes conflict. Abram acts generously. Lot chooses based on sight, settling near wicked Sodom. God reaffirms His promises (land, countless descendants) to Abram by grace after Lot leaves. Abram continues to worship, building an altar.",
    "Presbyterian": "Abram returns to the place of worship. Conflict arises from blessings. Abram demonstrates grace and wisdom in separation. Lot makes a worldly choice. God sovereignly reaffirms and enlarges the covenant promises to Abram (the chosen line) after Lot separates himself. Abram continues his pattern of covenant worship (altar).",
    "Pentecostal": "Highlights Abram returning to the altar and calling on God. Conflict necessitates separation. Abram shows generosity. Lot chooses based on natural sight, ending near Sodom. God appears to Abram again, powerfully reaffirming and expanding the land and seed promises after Lot's departure. Abram establishes worship in Hebron.",
    "Anglican": "Describes Abram's return to Canaan and his worship. Notes the strife caused by prosperity and Abram's generous resolution. Contrasts Lot's choice of the plain near Sodom with Abram remaining in Canaan. God reaffirms the covenant promises of land and descendants to Abram after Lot's departure. Abram settles and worships at Hebron.",
    "Orthodox": "Shows Abram returning to the place of worship. Conflict arises from abundance. Abram shows generosity and seeks peace. Lot chooses the fertile plain near Sodom based on worldly appearance. After Lot's departure, God reaffirms His promises of land and innumerable descendants to Abram. Abram moves to Mamre/Hebron and builds an altar."
  },
  "1": {
    "General": "Abram, his wife Sarai, his nephew Lot, and all his possessions went up from Egypt to the Negev.",
    "Non-Denominational": "Describes Abram's departure from Egypt and return towards Canaan, specifically the southern region (Negev), with his entire household.",
    "Baptist": "Abram leaves Egypt, returning towards Canaan with his household.",
    "Catholic": "Abram journeys out of Egypt back towards Canaan (Negev region) with his family and possessions.",
    "Methodist": "Details Abram's departure from Egypt towards the Negev.",
    "Lutheran": "Abram returns from Egypt to the Negev with his family.",
    "Presbyterian": "Records Abram's return journey from Egypt to the Negev.",
    "Pentecostal": "Describes Abram leaving Egypt and heading towards the Negev.",
    "Anglican": "Abram, Sarai, Lot, and their possessions leave Egypt and travel to the Negev.",
    "Orthodox": "Abram ascends from Egypt to the Negev with his household."
  },
  "2": {
    "General": "Abram had become very wealthy in livestock, silver, and gold.",
    "Non-Denominational": "Highlights Abram's considerable material wealth acquired, partly through the problematic encounter in Egypt.",
    "Baptist": "Notes Abram's great wealth accumulated.",
    "Catholic": "States Abram's great wealth in livestock and precious metals.",
    "Methodist": "Emphasizes Abram's significant material prosperity.",
    "Lutheran": "Abram had become very wealthy.",
    "Presbyterian": "Records Abram's considerable wealth.",
    "Pentecostal": "Highlights Abram's great wealth.",
    "Anglican": "States that Abram had become very wealthy in livestock, silver, and gold.",
    "Orthodox": "Notes Abram's great material wealth."
  },
  "3": {
    "General": "From the Negev, he continued traveling by stages until he reached the place between Bethel and Ai where his tent had formerly been.",
    "Non-Denominational": "Abram retraces his steps northward, returning to a previously established location associated with worship.",
    "Baptist": "Abram journeys back to the location of his previous encampment near Bethel.",
    "Catholic": "Abram travels northward by stages, returning to the site between Bethel and Ai.",
    "Methodist": "Abram journeys back to the familiar site between Bethel and Ai.",
    "Lutheran": "Abram returns to the place between Bethel and Ai.",
    "Presbyterian": "Records Abram's return journey to the location between Bethel and Ai.",
    "Pentecostal": "Describes Abram traveling back to his previous location near Bethel.",
    "Anglican": "Abram travels by stages from the Negev back to the place between Bethel and Ai.",
    "Orthodox": "Abram journeys by stages back to the site between Bethel and Ai."
  },
  "4": {
    "General": "This was the place where he had first built an altar, and there Abram called on the name of the Lord.",
    "Non-Denominational": "Abram returns specifically to the place of previous worship, reaffirming his relationship with God through prayer/proclamation after the detour to Egypt.",
    "Baptist": "Abram returns to the altar he built earlier and worships God again.",
    "Catholic": "Abram returns to the altar he had previously built and invokes God's name, signifying renewed worship and faithfulness.",
    "Methodist": "Abram resumes worship at the altar he first built, calling on God's name.",
    "Lutheran": "Abram returns to his altar and calls on God's name, resuming worship.",
    "Presbyterian": "Abram returns to his previous place of worship and calls on the name of the Lord.",
    "Pentecostal": "Abram goes back to the altar and calls on God's name, signifying restored communion.",
    "Anglican": "Abram returns to the site of his first altar and calls on the Lord's name again.",
    "Orthodox": "Abram returns to his previous altar and calls upon the name of the Lord."
  },
  "5": {
    "General": "Lot, who was traveling with Abram, also had flocks, herds, and tents.",
    "Non-Denominational": "Highlights Lot's own significant wealth and household, setting the stage for the conflict over resources.",
    "Baptist": "Notes Lot's considerable wealth as well.",
    "Catholic": "States that Lot also possessed significant wealth in livestock and tents.",
    "Methodist": "Mentions Lot's substantial possessions alongside Abram's.",
    "Lutheran": "Lot, traveling with Abram, was also wealthy.",
    "Presbyterian": "Records Lot's independent wealth.",
    "Pentecostal": "Highlights Lot's own prosperity.",
    "Anglican": "Notes that Lot also possessed substantial flocks, herds, and tents.",
    "Orthodox": "States that Lot, accompanying Abram, also had great wealth."
  },
  "6": {
    "General": "The land could not support both Abram and Lot living together, because their possessions were too great.",
    "Non-Denominational": "The practical consequence of their combined wealth: insufficient land resources to sustain both large households simultaneously.",
    "Baptist": "The land's resources were insufficient for their combined wealth.",
    "Catholic": "Their combined wealth was too great for the land to sustain them together.",
    "Methodist": "Explains the conflict's root cause: insufficient resources for their large households.",
    "Lutheran": "The land could not support both households due to their great possessions.",
    "Presbyterian": "States the practical reason for conflict: insufficient land for their wealth.",
    "Pentecostal": "Their great wealth created a logistical problem: not enough land.",
    "Anglican": "Explains that the land could not support both households because their possessions were so extensive.",
    "Orthodox": "The land could not sustain both Abram and Lot together due to their vast possessions."
  },
  "7": {
    "General": "Strife arose between Abram's herders and Lot's herders. The Canaanites and Perizzites were also living in the land at that time.",
    "Non-Denominational": "Conflict breaks out between the employees over grazing rights/water. The mention of existing inhabitants (Canaanites/Perizzites) emphasizes the limited resources.",
    "Baptist": "Conflict erupts between their servants. The presence of other inhabitants exacerbates the situation.",
    "Catholic": "Quarreling arises between their respective herders. The presence of Canaanites and Perizzites further strained resources.",
    "Methodist": "Strife develops between the herders. The existing population adds context to the resource scarcity.",
    "Lutheran": "Conflict arises between their herders. Canaanites and Perizzites also occupied the land.",
    "Presbyterian": "Records the strife between herders, noting the complicating factor of existing inhabitants.",
    "Pentecostal": "Conflict breaks out between the workers. Other peoples living there made resources scarcer.",
    "Anglican": "Strife develops between Abram's and Lot's herders, exacerbated by the presence of Canaanites and Perizzites.",
    "Orthodox": "Conflict arises between their herders. The presence of Canaanites and Perizzites highlights the limited land."
  },
  "8": {
    "General": "Abram said to Lot, 'Let's not have any quarreling between us, or between our herders, since we are close relatives.'",
    "Non-Denominational": "Abram initiates peacemaking, appealing to their familial bond ('we are brothers') to resolve the conflict peacefully.",
    "Baptist": "Abram takes the initiative to propose peace, appealing to their kinship.",
    "Catholic": "Abram proposes peace to Lot, emphasizing their kinship to avoid conflict.",
    "Methodist": "Abram acts as a peacemaker, urging resolution based on family ties.",
    "Lutheran": "Abram seeks peace, appealing to their relationship as relatives.",
    "Presbyterian": "Abram initiates reconciliation, appealing to their familial relationship.",
    "Pentecostal": "Abram takes the lead in seeking peace, reminding Lot of their family connection.",
    "Anglican": "Abram proposes to Lot that they should avoid quarreling because they are relatives.",
    "Orthodox": "Abram appeals to Lot for peace, invoking their kinship."
  },
  "9": {
    "General": "Abram generously offers Lot the choice: 'Is not the whole land before you? Let's part company. If you go left, I'll go right; if you go right, I'll go left.'",
    "Non-Denominational": "Abram demonstrates remarkable generosity and faith, allowing Lot (the younger) first choice of the land, trusting God's provision for himself.",
    "Baptist": "Abram generously gives Lot the choice of land to ensure peace.",
    "Catholic": "Abram magnanimously offers Lot the first choice of territory to resolve the conflict peacefully.",
    "Methodist": "Abram graciously offers Lot the privilege of choosing where to settle.",
    "Lutheran": "Abram generously offers Lot the first choice of land.",
    "Presbyterian": "Abram graciously gives Lot the choice of land, trusting God.",
    "Pentecostal": "Abram extends generosity, letting Lot choose the land first.",
    "Anglican": "Abram generously offers Lot the choice of territory, proposing separation to keep peace.",
    "Orthodox": "Abram generously gives Lot the choice of land to ensure peace."
  },
  "10": {
    "General": "Lot looked out and saw that the whole plain of the Jordan was well watered everywhere (like the garden of the Lord, like Egypt), before the Lord destroyed Sodom and Gomorrah.",
    "Non-Denominational": "Lot makes his choice based on sight and perceived material advantage – the fertile, well-watered Jordan valley, reminiscent of Eden or fertile Egypt. The parenthesis notes its pre-destruction state.",
    "Baptist": "Lot chooses based on sight, attracted by the fertile Jordan plain, comparing it to Eden and Egypt.",
    "Catholic": "Lot chooses based on the apparent fertility and abundance of the Jordan plain, comparing it favorably to Eden and Egypt (before Sodom's destruction).",
    "Methodist": "Lot chooses based on visual appeal and apparent prosperity, selecting the well-watered Jordan plain.",
    "Lutheran": "Lot chooses based on sight, selecting the well-watered Jordan plain resembling Eden or Egypt.",
    "Presbyterian": "Lot makes his choice based on sight and worldly advantage, selecting the fertile Jordan valley.",
    "Pentecostal": "Lot chooses by sight, seeing the well-watered plain looking like Eden or Egypt.",
    "Anglican": "Lot observes the well-watered fertility of the Jordan plain (compared to Eden and Egypt) before Sodom's destruction.",
    "Orthodox": "Lot chooses based on the visible fertility of the Jordan plain, comparing it to Paradise and Egypt."
  },
  "11": {
    "General": "So Lot chose the whole plain of the Jordan for himself and set out toward the east. The two men parted company.",
    "Non-Denominational": "Lot acts on his choice, taking the entire desirable plain and moving eastward, leading to the physical separation from Abram.",
    "Baptist": "Lot chooses the entire plain and moves east, separating from Abram.",
    "Catholic": "Lot chooses the whole Jordan plain and journeys east, separating himself from Abram.",
    "Methodist": "Lot chooses the plain and moves east, resulting in their separation.",
    "Lutheran": "Lot chooses the plain and moves east, separating from Abram.",
    "Presbyterian": "Lot chooses the plain and separates from Abram, moving east.",
    "Pentecostal": "Lot takes the whole plain and travels east, separating from Abram.",
    "Anglican": "Lot chooses the Jordan plain and journeys east, resulting in their separation.",
    "Orthodox": "Lot chooses the Jordan plain and travels east, separating from Abram."
  },
  "12": {
    "General": "Abram lived in the land of Canaan, while Lot lived among the cities of the plain and pitched his tents near Sodom.",
    "Non-Denominational": "Describes their separate settlements: Abram remains in Canaan (the promised land), while Lot moves progressively closer to the sinful city of Sodom.",
    "Baptist": "Abram stays in Canaan; Lot settles near the wicked city of Sodom.",
    "Catholic": "Abram remains in Canaan, while Lot settles among the cities of the plain, dangerously close to Sodom.",
    "Methodist": "Contrasts their locations: Abram in Canaan, Lot near Sodom.",
    "Lutheran": "Abram stays in Canaan, while Lot settles near Sodom.",
    "Presbyterian": "Abram dwells in Canaan, while Lot pitches his tents near sinful Sodom.",
    "Pentecostal": "Abram stays in Canaan; Lot moves near Sodom.",
    "Anglican": "Describes their resulting locations: Abram in Canaan, Lot among the cities of the plain, near Sodom.",
    "Orthodox": "Abram dwells in Canaan, while Lot settles near Sodom."
  },
  "13": {
    "General": "The narrative explicitly states that the people of Sodom were wicked and were sinning greatly against the Lord.",
    "Non-Denominational": "Provides crucial moral context for Lot's choice: Sodom's inhabitants were exceptionally wicked, highlighting the spiritual danger Lot placed himself near.",
    "Baptist": "Emphasizes the extreme wickedness of Sodom, highlighting the danger of Lot's choice.",
    "Catholic": "Explicitly condemns the inhabitants of Sodom as exceedingly wicked sinners against God, underscoring the peril of Lot's proximity.",
    "Methodist": "Highlights the profound wickedness of Sodom's inhabitants.",
    "Lutheran": "Notes the extreme wickedness of the people of Sodom.",
    "Presbyterian": "States the notorious wickedness of Sodom, emphasizing the spiritual danger Lot courted.",
    "Pentecostal": "Clearly states the great wickedness and sinfulness of Sodom.",
    "Anglican": "Explicitly states the wickedness and sinfulness of the people of Sodom.",
    "Orthodox": "Describes the inhabitants of Sodom as exceedingly wicked and sinful before God."
  },
  "14": {
    "General": "After Lot had parted from Abram, the Lord said to Abram, 'Look around from where you are, to the north and south, east and west.'",
    "Non-Denominational": "God speaks to Abram *after* Lot's departure, initiating a reaffirmation of the promise and directing Abram's gaze across the entire land.",
    "Baptist": "God speaks to Abram after Lot leaves, reaffirming His promises.",
    "Catholic": "After Lot's departure, God speaks to Abram, inviting him to survey the vastness of the promised land.",
    "Methodist": "God addresses Abram after the separation, instructing him to survey the land.",
    "Lutheran": "God speaks to Abram after Lot separates, telling him to look over the land.",
    "Presbyterian": "After Lot's departure, God speaks to Abram, reaffirming the land promise.",
    "Pentecostal": "God speaks to Abram after Lot leaves, directing him to view the promised land.",
    "Anglican": "After Lot separates, the Lord speaks to Abram, telling him to survey the land in all directions.",
    "Orthodox": "After Lot separates, God speaks to Abram, inviting him to behold the promised land."
  },
  "15": {
    "General": "God promises, 'All the land that you see I will give to you and your offspring forever.'",
    "Non-Denominational": "God reaffirms the land promise, granting Abram and his descendants perpetual ownership of all the land Abram can see.",
    "Baptist": "God explicitly promises the surveyed land to Abram and his descendants forever.",
    "Catholic": "God confirms the gift of the entire visible land to Abram and his descendants in perpetuity.",
    "Methodist": "God promises the entirety of the visible land to Abram and his offspring permanently.",
    "Lutheran": "God promises all the land Abram sees to him and his offspring forever.",
    "Presbyterian": "God reaffirms the promise, granting the land to Abram and his offspring forever.",
    "Pentecostal": "God promises all the visible land to Abram and his descendants forever.",
    "Anglican": "God promises all the visible land to Abram and his offspring forever.",
    "Orthodox": "God promises the entire visible land to Abram and his seed forever."
  },
  "16": {
    "General": "God promises to make Abram's offspring like the dust of the earth, so numerous that they cannot be counted.",
    "Non-Denominational": "God reaffirms and expands the offspring promise, using the hyperbole of 'dust of the earth' to signify an uncountable number of descendants.",
    "Baptist": "God promises innumerable descendants, comparing them to the dust of the earth.",
    "Catholic": "God promises Abram descendants as numerous as the dust of the earth, emphasizing their vast, uncountable number.",
    "Methodist": "God promises an immense number of descendants, like the dust of the earth.",
    "Lutheran": "God promises descendants as numerous as the dust, uncountable.",
    "Presbyterian": "God promises innumerable offspring, like the dust of the earth.",
    "Pentecostal": "God promises descendants as countless as the dust.",
    "Anglican": "God promises to make Abram's offspring as numerous as the dust of the earth, uncountable.",
    "Orthodox": "God promises descendants as numerous as the dust of the earth."
  },
  "17": {
    "General": "God instructs Abram, 'Go, walk through the length and breadth of the land, for I am giving it to you.'",
    "Non-Denominational": "God commands Abram to symbolically take possession of the promised land by traversing it, reinforcing the certainty of the gift.",
    "Baptist": "God commands Abram to walk through the land as a sign of possession.",
    "Catholic": "God instructs Abram to walk through the land, symbolically taking possession of the gift.",
    "Methodist": "God directs Abram to traverse the land, confirming its bestowal upon him.",
    "Lutheran": "God tells Abram to walk through the land He is giving him.",
    "Presbyterian": "God commands Abram to walk through the land, symbolizing his claim to the promise.",
    "Pentecostal": "God instructs Abram to survey the land being given to him.",
    "Anglican": "God instructs Abram to walk through the length and breadth of the land being given to him.",
    "Orthodox": "God commands Abram to traverse the land, symbolically receiving it."
  },
  "18": {
    "General": "So Abram moved his tents and went to live near the great trees of Mamre at Hebron, where he built an altar to the Lord.",
    "Non-Denominational": "Abram obeys, moving to a new significant location (Mamre/Hebron) and establishes another place of worship, demonstrating continued faith and communion with God.",
    "Baptist": "Abram moves to Hebron and builds another altar, continuing in worship.",
    "Catholic": "Abram moves his camp to Mamre near Hebron and builds another altar, establishing a new place of worship.",
    "Methodist": "Abram relocates to Mamre/Hebron and builds another altar to worship God.",
    "Lutheran": "Abram moves to Hebron and builds an altar to the Lord.",
    "Presbyterian": "Abram moves to Mamre/Hebron and builds another altar for covenant worship.",
    "Pentecostal": "Abram relocates to Hebron and builds another altar to worship God.",
    "Anglican": "Abram moves his tents to Mamre at Hebron and builds an altar there to the Lord.",
    "Orthodox": "Abram moves to Mamre (Hebron) and builds an altar to the Lord there."
  }
} 