{
  "chapterSummary": {
    "General": "Genesis 14 describes a war where four eastern kings, led by Kedorlaomer, defeat five kings of the Jordan plain (including Sodom and Gomorrah) and plunder their cities, capturing Lot. When Abram hears of Lot's capture, he leads 318 trained men from his household, along with allies, pursues the eastern kings, defeats them in a night attack near Dan, and rescues Lot and all the captives and goods. On his return, Abram is met by Melchizedek, king of Salem and priest of God Most High, who blesses Abram and receives a tenth (tithe) of the spoils from him. The king of Sodom offers Abram the recovered goods, but Abram refuses to take anything, asserting his reliance on God Most High, allowing only his allies their share.",
    "Non-Denominational": "Focuses on the historical context of regional conflict. Highlights Abram's decisive military action motivated by loyalty to Lot, demonstrating leadership and courage. Emphasizes the significant appearance of Melchizedek (priest-king of Salem/Jerusalem worshipping 'God Most High'), his blessing of Abram, and Abram's recognition of his priesthood through tithing. Contrasts Melchizedek's blessing with the King of Sodom's offer. Stresses Abram's integrity and faith in refusing spoils from Sodom, attributing his wealth solely to God.",
    "Baptist": "Views the chapter as historical, depicting Abram's righteous intervention to rescue Lot. Highlights Melchizedek as a type of Christ (priest-king) and Abram's tithe as an act of recognizing God's sovereignty and Melchizedek's priesthood. Emphasizes Abram's separation from the wickedness of Sodom by refusing its king's offer, demonstrating faith and integrity.",
    "Catholic": "Sees the war as historical backdrop. Abram's rescue of Lot demonstrates courage and familial duty. Melchizedek's appearance is highly significant: a priest-king prefiguring Christ, offering bread and wine (foreshadowing the Eucharist), and blessing Abram. Abram's tithe acknowledges Melchizedek's legitimate priesthood. Abram's refusal of Sodom's goods shows his rejection of ill-gotten gains and reliance on God's blessing.",
    "Methodist": "Depicts Abram acting courageously to rescue his kinsman. Highlights the unique encounter with Melchizedek, a righteous priest-king outside Abram's direct lineage, who blesses Abram. Notes Abram's responsive tithe. Stresses Abram's integrity in refusing the king of Sodom's offer, demonstrating reliance on God rather than potentially compromised wealth.",
    "Lutheran": "Views the events as historical. Abram acts righteously in rescuing Lot. Melchizedek is seen as a historical figure and a type of Christ (priest-king). Abram's tithe recognizes God Most High. Abram's refusal of Sodom's goods demonstrates faith, rejecting reliance on wealth from a wicked source.",
    "Presbyterian": "Understands the chapter historically. Abram acts justly and courageously. Melchizedek is a significant type of Christ, a priest according to a different order (cf. Hebrews 7). Abram's tithe affirms God's sovereignty. Abram's refusal of Sodom's spoils demonstrates his commitment to God and rejection of entanglement with the wicked world system, upholding his integrity.",
    "Pentecostal": "Highlights Abram's faith in action, leading his household to victory against powerful kings. Emphasizes the supernatural significance of Melchizedek (priest of God Most High) blessing Abram. Views the tithe as recognizing God's provision and Melchizedek's authority. Stresses Abram's spiritual integrity in refusing wealth from the wicked king of Sodom.",
    "Anglican": "Interprets the chapter as recording historical conflict and Abram's involvement. Notes the significance of Melchizedek, King of Salem and priest of God Most High, his blessing, and Abram's tithe. Highlights Abram's refusal of the King of Sodom's offer as an act of integrity and reliance on God.",
    "Orthodox": "Views the events historically. Abram acts bravely out of love for Lot. Melchizedek is seen as a righteous figure, a priest of God Most High, foreshadowing Christ's priesthood. His offering of bread and wine is seen as a type of the Eucharist. Abram's tithe is an offering to God. Abram's refusal of Sodom's goods shows his desire to be enriched only by God."
  },
  "1": {
    "General": "Describes a time when four kings from the east (Amraphel of Shinar, Arioch of Ellasar, Kedorlaomer of Elam, and Tidal king of Goiim)",
    "Non-Denominational": "Sets the scene, introducing a coalition of four powerful eastern kings, establishing the political context of the conflict.",
    "Baptist": "Introduces the eastern kings involved in the conflict.",
    "Catholic": "Names the kings forming the eastern coalition led by Kedorlaomer.",
    "Methodist": "Identifies the four kings from the east who formed an alliance.",
    "Lutheran": "Lists the four kings from the east.",
    "Presbyterian": "Records the names and locations of the four eastern kings.",
    "Pentecostal": "Names the four kings forming the invading alliance.",
    "Anglican": "Names the four kings involved in the initial conflict.",
    "Orthodox": "Introduces the four eastern kings."
  },
  "2": {
    "General": "...waged war against five kings of the southern Jordan plain: Bera of Sodom, Birsha of Gomorrah, Shinab of Admah, Shemeber of Zeboyim, and the king of Bela (also called Zoar).",
    "Non-Denominational": "Identifies the opposing faction: five kings of the cities of the plain, setting up the battle lines.",
    "Baptist": "Introduces the five kings of the plain, including Sodom and Gomorrah.",
    "Catholic": "Names the five kings of the Pentapolis (cities of the plain) who rebelled.",
    "Methodist": "Identifies the five kings of the plain who were targeted.",
    "Lutheran": "Lists the five kings of the plain who opposed them.",
    "Presbyterian": "Records the names and cities of the five kings of the plain.",
    "Pentecostal": "Names the five kings who were attacked.",
    "Anglican": "Names the five kings of the cities of the plain who were attacked.",
    "Orthodox": "Introduces the five kings of the cities of the plain."
  },
  "3": {
    "General": "These five kings joined forces in the Valley of Siddim, which is now the Dead Sea (Salt Sea).",
    "Non-Denominational": "Specifies the location of the alliance and battle: the Valley of Siddim, identified with the Dead Sea region.",
    "Baptist": "Identifies the location where the five kings allied: the Valley of Siddim (Dead Sea).",
    "Catholic": "Locates the alliance and battle in the Valley of Siddim (the Salt Sea area).",
    "Methodist": "Specifies the meeting place of the five kings in the Valley of Siddim.",
    "Lutheran": "The five kings joined forces in the Valley of Siddim.",
    "Presbyterian": "Records the location where the five kings allied.",
    "Pentecostal": "Names the location of their alliance: Valley of Siddim.",
    "Anglican": "States that these five kings allied themselves in the Valley of Siddim (the Dead Sea).",
    "Orthodox": "Locates the gathering of the five kings in the Valley of Siddim (Salt Sea)."
  },
  "4": {
    "General": "They had been subject to Kedorlaomer for twelve years, but in the thirteenth year, they rebelled.",
    "Non-Denominational": "Explains the background of the conflict: a long period of subjugation followed by rebellion, prompting Kedorlaomer's military response.",
    "Baptist": "Provides the reason for the war: rebellion after twelve years of servitude.",
    "Catholic": "Explains the casus belli: the rebellion of the five kings after twelve years under Kedorlaomer's rule.",
    "Methodist": "Gives the historical context: rebellion after twelve years of subservience.",
    "Lutheran": "They rebelled against Kedorlaomer after twelve years of servitude.",
    "Presbyterian": "Explains the political background: rebellion against Kedorlaomer.",
    "Pentecostal": "States the reason for the war: rebellion against Kedorlaomer.",
    "Anglican": "Explains the cause of the conflict: the five kings rebelled against Kedorlaomer after twelve years.",
    "Orthodox": "Provides the context: rebellion against Kedorlaomer after twelve years of servitude."
  },
  "5": {
    "General": "In the fourteenth year, Kedorlaomer and his allies came and defeated several groups: the Rephaites, Zuzites, Emites,",
    "Non-Denominational": "Details the eastern coalition's campaign, suppressing various peoples (possibly giant clans) en route to the Valley of Siddim.",
    "Baptist": "Describes the initial victories of Kedorlaomer's coalition against various peoples.",
    "Catholic": "Narrates the campaign of Kedorlaomer and allies, defeating various peoples (Rephaites, Zuzites, Emites) on their way.",
    "Methodist": "Details the eastern kings' military campaign, defeating several groups.",
    "Lutheran": "Kedorlaomer and allies defeat several peoples.",
    "Presbyterian": "Records the initial military successes of the eastern coalition.",
    "Pentecostal": "Describes the eastern kings defeating several groups along the way.",
    "Anglican": "Describes the eastern kings' campaign, defeating the Rephaites, Zuzites, and Emites.",
    "Orthodox": "Relates the defeat of the Rephaites, Zuzites, and Emites by Kedorlaomer's forces."
  },
  "6": {
    "General": "...and the Horites in the hill country of Seir, pursuing them as far as El Paran near the desert.",
    "Non-Denominational": "Continues detailing the eastern kings' victorious campaign southward into Seir (Edom) and towards the desert border.",
    "Baptist": "Records the defeat of the Horites and the extent of the pursuit.",
    "Catholic": "Continues the narration of the campaign, including the defeat of the Horites in Seir.",
    "Methodist": "Continues the description of the campaign southwards.",
    "Lutheran": "They also defeated the Horites in Seir.",
    "Presbyterian": "Records the defeat of the Horites.",
    "Pentecostal": "Describes the defeat of the Horites.",
    "Anglican": "Continues the list of defeated peoples, including the Horites in Seir.",
    "Orthodox": "Relates the defeat of the Horites in Seir."
  },
  "7": {
    "General": "They turned back and went to En Mishpat (that is, Kadesh), and conquered the entire territory of the Amalekites, as well as the Amorites living in Hazezon Tamar.",
    "Non-Denominational": "Describes the coalition turning back north, conquering territories around Kadesh, including those of the Amalekites and Amorites.",
    "Baptist": "Records further conquests by the eastern coalition, including Amalekite and Amorite territory.",
    "Catholic": "Narrates their return journey northward, conquering the Amalekites and Amorites around Kadesh and Hazezon Tamar.",
    "Methodist": "Details their conquests as they turned back north.",
    "Lutheran": "They conquered the Amalekites and Amorites.",
    "Presbyterian": "Records the conquest of the Amalekites and Amorites.",
    "Pentecostal": "Describes defeating Amalekites and Amorites.",
    "Anglican": "Describes their return journey conquering the Amalekites and Amorites.",
    "Orthodox": "Relates the conquest of the Amalekites and Amorites."
  },
  "8": {
    "General": "Then the kings of Sodom, Gomorrah, Admah, Zeboyim, and Bela (Zoar) marched out and drew up battle lines in the Valley of Siddim.",
    "Non-Denominational": "The five kings of the plain finally confront the eastern coalition in the chosen battleground, the Valley of Siddim.",
    "Baptist": "The five kings of the plain prepare for battle against the invaders.",
    "Catholic": "The five kings of the plain march out to engage the eastern coalition in the Valley of Siddim.",
    "Methodist": "The five kings prepare for the decisive battle in the valley.",
    "Lutheran": "The five kings march out for battle in the Valley of Siddim.",
    "Presbyterian": "Records the five kings mobilizing for battle.",
    "Pentecostal": "The five kings come out to fight in the valley.",
    "Anglican": "The five kings of the plain march out to fight in the Valley of Siddim.",
    "Orthodox": "The five kings march out for battle in the Valley of Siddim."
  },
  "9": {
    "General": "They faced Kedorlaomer king of Elam, Tidal king of Goiim, Amraphel king of Shinar, and Arioch king of Ellasar—four kings against five.",
    "Non-Denominational": "Explicitly sets the opposing forces: the four eastern kings against the five kings of the plain.",
    "Baptist": "Lists the opposing forces: four kings against five.",
    "Catholic": "Lists the combatants again: the four eastern kings against the five kings of the plain.",
    "Methodist": "Restates the opposing alliances: four kings versus five.",
    "Lutheran": "Sets the battle lines: four kings against five.",
    "Presbyterian": "Specifies the opposing sides in the battle.",
    "Pentecostal": "Lists the kings on each side: four versus five.",
    "Anglican": "Lists the four eastern kings faced by the five kings of the plain.",
    "Orthodox": "Names the four eastern kings again, facing the five."
  },
  "10": {
    "General": "The Valley of Siddim was full of tar pits, and when the kings of Sodom and Gomorrah fled, some of their men fell into them, while the rest escaped to the hills.",
    "Non-Denominational": "Describes the battle's outcome: the kings of Sodom and Gomorrah are routed. The terrain (tar pits) causes casualties among the fleeing forces, while survivors escape to the mountains.",
    "Baptist": "Describes the defeat of Sodom and Gomorrah, hindered by the tar pits.",
    "Catholic": "Narrates the defeat of the kings of Sodom and Gomorrah, whose flight was hampered by the valley's tar pits.",
    "Methodist": "Details the defeat and flight of the kings of Sodom and Gomorrah, mentioning the hazardous tar pits.",
    "Lutheran": "Sodom and Gomorrah are defeated; the tar pits hinder their escape.",
    "Presbyterian": "Records the defeat of Sodom and Gomorrah, noting the tar pits.",
    "Pentecostal": "Describes the battle turning into a rout, with tar pits causing problems.",
    "Anglican": "Describes the Valley of Siddim's tar pits and the flight of the kings of Sodom and Gomorrah, some falling into the pits.",
    "Orthodox": "Notes the tar pits in the valley and the flight of the kings of Sodom and Gomorrah, some falling into the pits."
  },
  "11": {
    "General": "The four victorious kings seized all the goods of Sodom and Gomorrah and all their food, and then went away.",
    "Non-Denominational": "The eastern coalition plunders Sodom and Gomorrah, taking all material wealth and supplies before departing.",
    "Baptist": "The victors plunder Sodom and Gomorrah.",
    "Catholic": "The victorious eastern kings plunder the goods and provisions of Sodom and Gomorrah.",
    "Methodist": "The eastern kings seize the spoils of war from Sodom and Gomorrah.",
    "Lutheran": "The victors seize all the goods and food from Sodom and Gomorrah.",
    "Presbyterian": "Records the plundering of Sodom and Gomorrah by the victors.",
    "Pentecostal": "The four kings take all the possessions and food from Sodom and Gomorrah.",
    "Anglican": "The four kings capture all the goods and food of Sodom and Gomorrah.",
    "Orthodox": "The four kings seize the possessions and food of Sodom and Gomorrah."
  },
  "12": {
    "General": "They also captured Abram's nephew Lot, who was living in Sodom, and his possessions.",
    "Non-Denominational": "Highlights the capture of Lot and his possessions, personally connecting Abram to the conflict and motivating his intervention.",
    "Baptist": "Lot, living in Sodom, is captured along with his possessions.",
    "Catholic": "Lot, residing in Sodom, is captured along with his goods, drawing Abram into the conflict.",
    "Methodist": "Notes the capture of Lot, Abram's nephew, living in Sodom.",
    "Lutheran": "They captured Lot, Abram's nephew, who lived in Sodom.",
    "Presbyterian": "Records the capture of Lot, Abram's nephew.",
    "Pentecostal": "Lot is captured along with his possessions because he lived in Sodom.",
    "Anglican": "Lot, Abram's nephew living in Sodom, is also captured along with his possessions.",
    "Orthodox": "Lot, Abram's nephew living in Sodom, is captured with his possessions."
  },
  "13": {
    "General": "A man who had escaped came and reported this to Abram the Hebrew, who was living near the great trees of Mamre the Amorite (brother of Eshkol and Aner, who were allied with Abram).",
    "Non-Denominational": "News of Lot's capture reaches Abram (identified as 'the Hebrew') through an escapee. Notes Abram's location and his local allies.",
    "Baptist": "Abram learns of Lot's capture from an escapee.",
    "Catholic": "An escapee informs Abram the Hebrew about Lot's capture. Notes Abram's location near Mamre and his allies.",
    "Methodist": "Abram receives news of Lot's capture while living near Mamre.",
    "Lutheran": "An escapee reports Lot's capture to Abram the Hebrew.",
    "Presbyterian": "An escapee reports Lot's capture to Abram the Hebrew.",
    "Pentecostal": "Abram hears about Lot's capture from someone who escaped.",
    "Anglican": "An escapee informs Abram the Hebrew (living near Mamre) about Lot's capture, noting Abram's allies.",
    "Orthodox": "An escapee informs Abram the Hebrew about Lot's capture; notes Abram's location and allies."
  },
  "14": {
    "General": "When Abram heard that his relative Lot had been captured, he called out his 318 trained men born in his household and went in pursuit as far as Dan.",
    "Non-Denominational": "Abram responds immediately and decisively, mustering his private force (318 trained men) and pursuing the captors north to Dan.",
    "Baptist": "Abram takes immediate action, leading his household force to rescue Lot.",
    "Catholic": "Upon hearing the news, Abram mobilizes his trained household retainers (318 men) and pursues the enemy north to Dan.",
    "Methodist": "Abram responds swiftly, gathering his household forces and pursuing the captors.",
    "Lutheran": "Abram musters his 318 trained men and pursues the enemy to Dan.",
    "Presbyterian": "Abram immediately leads out his trained men in pursuit to rescue Lot.",
    "Pentecostal": "Abram acts quickly, gathering his trained men and pursuing the enemy.",
    "Anglican": "Abram musters his 318 trained household members and pursues the captors as far as Dan.",
    "Orthodox": "Abram leads out his 318 trained household members in pursuit of Lot's captors as far as Dan."
  },
  "15": {
    "General": "During the night, Abram divided his forces to attack them, routing the enemy and pursuing them north of Damascus to Hobah.",
    "Non-Denominational": "Describes Abram's successful military strategy: a night attack with divided forces, resulting in victory and pursuit far beyond Dan.",
    "Baptist": "Abram employs sound military tactics (night attack, divided forces) to defeat the enemy.",
    "Catholic": "Abram executes a successful night attack, dividing his forces, routing the enemy, and pursuing them beyond Damascus.",
    "Methodist": "Abram uses strategic tactics (night attack, division) to defeat the eastern kings.",
    "Lutheran": "Abram defeats the enemy using a night attack and division of forces.",
    "Presbyterian": "Abram strategically attacks at night, routing the enemy coalition.",
    "Pentecostal": "Abram attacks by night, dividing his men, and defeats the enemy.",
    "Anglican": "Abram divides his forces, attacks the enemy by night, routs them, and pursues them to Hobah.",
    "Orthodox": "Abram attacks by night, divides his forces, defeats the enemy, and pursues them to Hobah."
  },
  "16": {
    "General": "Abram recovered all the goods and brought back his relative Lot, his possessions, the women, and the other people.",
    "Non-Denominational": "Details the success of Abram's rescue mission: recovery of all spoils and, most importantly, Lot and all the other captives.",
    "Baptist": "Abram successfully rescues Lot, the people, and the goods.",
    "Catholic": "Abram successfully recovers all the plundered goods, Lot, his possessions, and the other captives.",
    "Methodist": "Abram successfully recovers all the goods and captives, including Lot.",
    "Lutheran": "Abram recovers all the goods, Lot, and the other captives.",
    "Presbyterian": "Abram successfully recovers all the goods and captives, including Lot.",
    "Pentecostal": "Abram rescues Lot, the people, and brings back all the goods.",
    "Anglican": "Abram recovers all the goods and brings back Lot, his possessions, and the other captives.",
    "Orthodox": "Abram successfully recovers all the goods, Lot, his possessions, and the other captives."
  },
  "17": {
    "General": "After Abram returned from defeating Kedorlaomer and his allied kings, the king of Sodom came out to meet him in the Valley of Shaveh (that is, the King's Valley).",
    "Non-Denominational": "Sets the scene for the post-victory encounters: Abram returns, and the king of Sodom comes out to meet him in a specific location.",
    "Baptist": "The king of Sodom meets Abram upon his return from victory.",
    "Catholic": "Upon Abram's victorious return, the king of Sodom comes out to meet him in the King's Valley.",
    "Methodist": "The king of Sodom meets the returning, victorious Abram.",
    "Lutheran": "The king of Sodom meets Abram after his victory.",
    "Presbyterian": "The king of Sodom meets Abram upon his return.",
    "Pentecostal": "The king of Sodom comes to meet Abram after the battle.",
    "Anglican": "After Abram's victory, the king of Sodom meets him in the Valley of Shaveh.",
    "Orthodox": "The king of Sodom meets Abram in the King's Valley upon his return."
  },
  "18": {
    "General": "Then Melchizedek king of Salem brought out bread and wine. He was priest of God Most High (El Elyon).",
    "Non-Denominational": "Introduces the mysterious and significant figure Melchizedek: king of Salem (Jerusalem), priest of 'God Most High,' who offers Abram bread and wine (refreshment/fellowship).",
    "Baptist": "Melchizedek, king and priest of God Most High, appears, offering bread and wine.",
    "Catholic": "Introduces Melchizedek, king of Salem and priest of God Most High, who offers bread and wine (prefiguring Eucharist).",
    "Methodist": "Introduces Melchizedek, king of Salem and priest of God Most High, offering hospitality.",
    "Lutheran": "Melchizedek, king of Salem and priest of God Most High, brings bread and wine.",
    "Presbyterian": "Introduces Melchizedek, king of Salem and priest of God Most High (El Elyon).",
    "Pentecostal": "Melchizedek, king of Salem and priest of God Most High, brings bread and wine.",
    "Anglican": "Melchizedek, king of Salem and priest of God Most High, brings out bread and wine.",
    "Orthodox": "Introduces Melchizedek, king of Salem and priest of God Most High, offering bread and wine."
  },
  "19": {
    "General": "Melchizedek blessed Abram, saying, 'Blessed be Abram by God Most High, Creator of heaven and earth.'",
    "Non-Denominational": "Melchizedek pronounces a blessing on Abram in the name of God Most High, acknowledging God as the universal Creator.",
    "Baptist": "Melchizedek blesses Abram in the name of God Most High, Creator.",
    "Catholic": "Melchizedek blesses Abram, invoking God Most High, Creator of all.",
    "Methodist": "Melchizedek blesses Abram, acknowledging God as Creator.",
    "Lutheran": "Melchizedek blesses Abram by God Most High, the Creator.",
    "Presbyterian": "Melchizedek blesses Abram in the name of God Most High, Creator.",
    "Pentecostal": "Melchizedek pronounces a blessing on Abram from God Most High, Creator.",
    "Anglican": "Melchizedek blesses Abram in the name of God Most High, Creator of heaven and earth.",
    "Orthodox": "Melchizedek blesses Abram, invoking God Most High, Possessor/Creator of heaven and earth."
  },
  "20": {
    "General": "'And praise be to God Most High, who delivered your enemies into your hand.' Then Abram gave Melchizedek a tenth of everything.",
    "Non-Denominational": "Melchizedek also blesses God for granting Abram victory. Abram responds by giving Melchizedek a tithe (a tenth) of the spoils, acknowledging his priestly status and God's sovereignty.",
    "Baptist": "Melchizedek blesses God for Abram's victory. Abram responds by tithing to Melchizedek.",
    "Catholic": "Melchizedek blesses God for Abram's victory. Abram gives him a tithe of the spoils, recognizing his priesthood.",
    "Methodist": "Melchizedek praises God for the victory. Abram gives him a tenth of the spoils (tithe).",
    "Lutheran": "Melchizedek praises God for the victory. Abram gives him a tithe.",
    "Presbyterian": "Melchizedek blesses God for Abram's victory. Abram gives him a tenth, acknowledging God's ownership.",
    "Pentecostal": "Melchizedek blesses God for the victory. Abram gives him a tenth of everything.",
    "Anglican": "Melchizedek blesses God for delivering Abram's enemies. Abram gives Melchizedek a tenth of everything.",
    "Orthodox": "Melchizedek blesses God for the victory. Abram gives him a tithe of all."
  },
  "21": {
    "General": "The king of Sodom said to Abram, 'Give me the people and keep the goods for yourself.'",
    "Non-Denominational": "The king of Sodom makes a proposal focused on people vs. possessions, offering Abram the material spoils in exchange for the recovered citizens.",
    "Baptist": "The king of Sodom offers Abram the spoils of war.",
    "Catholic": "The king of Sodom proposes Abram keep the goods if he returns the people.",
    "Methodist": "The king of Sodom offers Abram the recovered goods.",
    "Lutheran": "The king of Sodom offers the goods to Abram in exchange for the people.",
    "Presbyterian": "The king of Sodom offers Abram the material spoils.",
    "Pentecostal": "The king of Sodom offers Abram the goods.",
    "Anglican": "The king of Sodom proposes that Abram keep the goods but return the people.",
    "Orthodox": "The king of Sodom offers the material goods to Abram."
  },
  "22": {
    "General": "But Abram replied to the king of Sodom, 'With raised hand I have sworn an oath to the Lord, God Most High, Creator of heaven and earth,'",
    "Non-Denominational": "Abram responds by invoking God Most High (using the same title as Melchizedek), indicating a prior commitment or resolve made to God.",
    "Baptist": "Abram refuses, invoking an oath made to God Most High.",
    "Catholic": "Abram refuses, invoking an oath sworn to the Lord, God Most High, Creator (echoing Melchizedek).",
    "Methodist": "Abram refuses the offer, citing an oath to God Most High.",
    "Lutheran": "Abram refuses, stating his oath to God Most High, Creator.",
    "Presbyterian": "Abram refuses, appealing to his oath to the Lord, God Most High.",
    "Pentecostal": "Abram refuses, declaring his oath to God Most High, Creator.",
    "Anglican": "Abram refuses, stating he has sworn an oath to the Lord, God Most High, Creator.",
    "Orthodox": "Abram refuses, citing his oath to the Lord, God Most High, Creator."
  },
  "23": {
    "General": "'...that I will accept nothing belonging to you, not even a thread or the strap of a sandal, so you will never be able to say, \'I made Abram rich.\''",
    "Non-Denominational": "Abram explicitly rejects any material gain from Sodom, ensuring his prosperity comes solely from God, preventing any claim of human contribution to his wealth.",
    "Baptist": "Abram completely refuses any spoil from Sodom to avoid any claim that Sodom enriched him.",
    "Catholic": "Abram resolutely refuses even the smallest item, so the king of Sodom cannot claim responsibility for Abram's wealth.",
    "Methodist": "Abram refuses any material gain from Sodom, asserting his reliance on God alone for prosperity.",
    "Lutheran": "Abram refuses even the smallest thing, so Sodom's king cannot claim to have made him rich.",
    "Presbyterian": "Abram utterly rejects any gain from Sodom, ensuring God alone receives credit for his prosperity.",
    "Pentecostal": "Abram refuses everything, ensuring Sodom's king can't claim credit for his wealth.",
    "Anglican": "Abram vows not to accept anything from the king of Sodom, lest the king claim to have made him rich.",
    "Orthodox": "Abram refuses even the smallest item, so the king of Sodom cannot claim to have enriched him."
  },
  "24": {
    "General": "Abram states he will accept nothing except what his men have eaten and the share belonging to his allies (Aner, Eshkol, and Mamre), who should take their share.",
    "Non-Denominational": "Abram clarifies his refusal applies to himself personally, allowing provisions for his men and acknowledging the rights of his allies to their portion of the spoils.",
    "Baptist": "Abram makes exception only for his men's provisions and his allies' rightful share.",
    "Catholic": "Abram makes exceptions only for the sustenance of his men and the due share for his allies.",
    "Methodist": "Abram allows only for his men's provisions and the share due to his allies.",
    "Lutheran": "Abram allows only provisions for his men and the share for his allies.",
    "Presbyterian": "Abram allows only provisions for his men and the just share for his allies.",
    "Pentecostal": "Abram accepts only provisions for his men and allows his allies their share.",
    "Anglican": "Abram clarifies he will accept nothing for himself, only provisions for his men and the shares due to his allies.",
    "Orthodox": "Abram makes exception only for his men's food and the share belonging to his allies."
  }
} 