{
  "chapterSummary": {
    "General": "God appears to Abram in a vision, reassuring him ('Do not be afraid... I am your shield, your very great reward'). Abram expresses concern about childlessness, suggesting Eliezer as heir. God promises Abram a biological heir and descendants as numerous as the stars. Abram believes God, and it is credited to him as righteousness. God reaffirms the land promise, and Abram asks how he can know he will possess it. God instructs Abram to prepare animals for a covenant ceremony. Abram cuts them in half. As darkness falls, God foretells the 400-year enslavement of Abram's descendants in Egypt, followed by their deliverance with great possessions, and Abram's peaceful death. A smoking firepot and blazing torch (God's presence) pass between the animal pieces, sealing the covenant. God formally grants Abram the land from the river of Egypt to the Euphrates, listing the inhabitants.",
    "Non-Denominational": "Focuses on God's direct revelation and reassurance to Abram. Highlights the core covenant promises reaffirmed and clarified: a biological heir, countless descendants (stars), and the land. Emphasizes the pivotal verse 6: Abram's belief in God's promise counted as righteousness (justification by faith). Details the solemn covenant ceremony (cutting animals, God's presence passing through) signifying God's unconditional commitment. Notes the prophecy of Egyptian bondage and deliverance, showing God's foreknowledge and sovereignty over history.",
    "Baptist": "Emphasizes God's reassurance and the specific promise of a biological heir and innumerable descendants. Stresses Genesis 15:6 as a key text for justification by faith alone – Abram believed God's promise, and this faith was credited as righteousness. Views the covenant ceremony as God unilaterally binding Himself to His promises. Notes the prophecy of Egyptian servitude and God's sovereign plan for deliverance.",
    "Catholic": "Highlights God's comforting revelation to Abram. Focuses on the promise of a son from Abram's own body and countless descendants. Views Abram's faith (15:6) as the foundation of his justification, a response to God's grace. Interprets the covenant ceremony (passing between pieces) as a solemn divine oath, guaranteeing God's fidelity. Notes the prophecy of Egypt, showing God's foreknowledge and plan unfolding in history.",
    "Methodist": "Focuses on God's personal reassurance to Abram ('shield', 'reward'). Highlights the clarified promise of a direct heir and vast posterity. Emphasizes Abram's belief (faith) being reckoned as righteousness. Views the covenant ceremony as a solemn confirmation of God's promises. Notes the prophecy of future hardship (Egypt) and ultimate deliverance as part of God's overarching plan.",
    "Lutheran": "Stresses God's Word and promise coming to Abram. Emphasizes justification by faith: Abram believed the promise (specifically, the promise pointing towards Christ, the ultimate seed), and this faith was imputed as righteousness (15:6). Views the covenant ceremony as God binding Himself to fulfill His promises through grace. The prophecy of Egypt demonstrates God's sovereign control.",
    "Presbyterian": "Highlights God's sovereign initiative in revealing Himself and His promises. Focuses on 15:6 as Abram's act of faith, which God credited as righteousness (justification through faith in the promise). Views the covenant ceremony as a solemn, self-maledictory oath by God, guaranteeing the unconditional fulfillment of His covenant promises. Notes the prophecy of Egypt as part of God's ordained plan.",
    "Pentecostal": "Emphasizes God's direct, visionary revelation to Abram. Highlights the power of God's promise regarding descendants (stars). Focuses on Abram's act of believing God leading to righteousness. Views the covenant ceremony as a powerful, supernatural confirmation of God's commitment, with the fire/torch representing God's manifest presence. Notes the prophecy of Egypt and future deliverance.",
    "Anglican": "Focuses on God's revelation and reassurance to Abram. Notes the clarification of the promise of an heir and descendants. Highlights 15:6 as a key statement on faith and righteousness. Interprets the covenant ritual as a solemn ratification of God's promises. Acknowledges the prophecy concerning Egypt within God's providence.",
    "Orthodox": "Views the vision as a divine encounter. Highlights the promise of offspring (heir, stars) and Abram's faith response (15:6) as crucial. Interprets the covenant ceremony as God condescending to human custom to confirm His oath. The smoking furnace and torch symbolize God's uncreated energies/presence. Notes the prophecy of Egypt as within God's foreknowledge and permissive will."
  },
  "1": {
    "General": "After these events, the word of the Lord came to Abram in a vision: 'Do not be afraid, Abram. I am your shield, your very great reward.'",
    "Non-Denominational": "God initiates communication through a vision, offering reassurance (countering potential fear after the battle/refusal of spoils) and identifying Himself as Abram's protection and ultimate source of blessing/reward.",
    "Baptist": "God speaks to Abram in a vision, offering comfort and assurance of His protection and provision.",
    "Catholic": "God reveals Himself to Abram in a vision, offering reassurance ('Do not fear') and promising His protection ('shield') and ultimate blessing ('reward').",
    "Methodist": "God communicates through a vision, reassuring Abram with promises of protection and reward.",
    "Lutheran": "God speaks His Word to Abram in a vision, comforting him and promising protection and reward.",
    "Presbyterian": "God sovereignly reveals Himself to Abram in a vision, offering assurance and promising protection and reward.",
    "Pentecostal": "God comes to Abram supernaturally in a vision, speaking words of comfort, protection ('shield'), and blessing ('reward').",
    "Anglican": "The Lord speaks to Abram in a vision, reassuring him after the preceding events, promising protection and reward.",
    "Orthodox": "God reveals Himself to Abram in a vision, offering comfort ('Fear not') and identifying Himself as Abram's protector ('shield') and reward."
  },
  "2": {
    "General": "Abram questions God, 'Sovereign Lord, what can you give me since I remain childless and the one who will inherit my estate is Eliezer of Damascus?'",
    "Non-Denominational": "Abram respectfully questions how God's promise of reward can be fulfilled without an heir, expressing his current reality and naming his presumed heir (Eliezer).",
    "Baptist": "Abram expresses his primary concern: childlessness, questioning the value of reward without an heir.",
    "Catholic": "Abram addresses God respectfully ('Sovereign Lord') but raises his core anxiety: his lack of an heir, suggesting Eliezer as the default.",
    "Methodist": "Abram voices his deep concern about lacking an heir, questioning the nature of the reward.",
    "Lutheran": "Abram questions God based on his childlessness, pointing to his servant Eliezer as heir.",
    "Presbyterian": "Abram raises the issue of his childlessness, questioning the fulfillment of the reward without an heir.",
    "Pentecostal": "Abram honestly questions God about the promise, given his lack of children.",
    "Anglican": "Abram questions the Lord about the promise, highlighting his childlessness and mentioning Eliezer as his likely heir.",
    "Orthodox": "Abram questions God concerning the reward, pointing out his childlessness and Eliezer's position."
  },
  "3": {
    "General": "Abram continues, 'You have given me no children; so a servant in my household will be my heir.'",
    "Non-Denominational": "Abram reiterates his lack of offspring from God and states his conclusion based on custom: a household servant will inherit.",
    "Baptist": "Abram restates his predicament: lack of children means a servant will inherit.",
    "Catholic": "Abram explicitly states his lack of children and the consequence according to custom: a servant heir.",
    "Methodist": "Abram repeats his concern: without children, a servant inherits.",
    "Lutheran": "Abram points out God hasn't given him children, so a servant will inherit.",
    "Presbyterian": "Abram states the consequence of his childlessness: inheritance by a servant.",
    "Pentecostal": "Abram emphasizes his childlessness means a servant will be his heir.",
    "Anglican": "Abram states directly that since God has given him no children, a household servant stands to be his heir.",
    "Orthodox": "Abram reiterates his lack of children implies inheritance by a servant."
  },
  "4": {
    "General": "Then the word of the Lord came to him: 'This man [Eliezer] will not be your heir, but a son who is your own flesh and blood will be your heir.'",
    "Non-Denominational": "God directly refutes Abram's assumption, explicitly promising a biological son ('your own flesh and blood') as the true heir.",
    "Baptist": "God corrects Abram, promising a biological son, not Eliezer, as the heir.",
    "Catholic": "God directly contradicts Abram's assumption, promising an heir from Abram's own body.",
    "Methodist": "God clarifies His promise: the heir will be Abram's biological son.",
    "Lutheran": "God corrects Abram: his own son, not Eliezer, will be his heir.",
    "Presbyterian": "God explicitly promises Abram a biological son as his heir, overriding custom.",
    "Pentecostal": "God speaks clearly: Eliezer is not the heir; Abram's own son will be.",
    "Anglican": "The Lord corrects Abram, promising that his heir will be his own biological son, not Eliezer.",
    "Orthodox": "God refutes Abram's conclusion, promising an heir from his own body."
  },
  "5": {
    "General": "God took Abram outside and said, 'Look up at the sky and count the stars—if indeed you can count them.' Then he said to him, 'So shall your offspring be.'",
    "Non-Denominational": "God uses the imagery of the innumerable stars to illustrate the vast number of descendants He promises Abram, emphasizing the magnitude and certainty of the promise.",
    "Baptist": "God gives a visual illustration (stars) of the promise of innumerable descendants.",
    "Catholic": "God uses the stars as a visual metaphor to promise Abram an exceedingly numerous posterity.",
    "Methodist": "God uses the countless stars to illustrate the vastness of the promised descendants.",
    "Lutheran": "God promises descendants as countless as the stars.",
    "Presbyterian": "God uses the stars to illustrate the promise of innumerable descendants.",
    "Pentecostal": "God gives a powerful visual promise: descendants as numerous as the stars.",
    "Anglican": "God uses the image of the innumerable stars to promise Abram a vast number of descendants.",
    "Orthodox": "God illustrates the promise of countless descendants using the stars."
  },
  "6": {
    "General": "Abram believed the Lord, and the Lord credited it to him as righteousness.",
    "Non-Denominational": "A pivotal theological statement: Abram's response was faith/belief in God's promise (despite circumstances), and God imputed/reckoned this faith as righteousness in His sight.",
    "Baptist": "Key verse for justification by faith: Abram believed God's promise, and God declared him righteous based on this faith.",
    "Catholic": "Crucial verse: Abram's act of faith (believing God's promise) was reckoned by God as righteousness, the foundation of his justification.",
    "Methodist": "Central statement: Abram's belief in God's promise was accepted by God as righteousness.",
    "Lutheran": "The core of justification by faith: Abram believed God (the promise pointing to Christ), and God imputed righteousness to him.",
    "Presbyterian": "Definitive statement of justification by faith: Abram believed God's promise, and God credited this faith to him for righteousness.",
    "Pentecostal": "Foundational truth: Abram's act of believing God resulted in God counting him as righteous.",
    "Anglican": "A key theological statement: Abram believed the Lord, and this faith was credited to him as righteousness.",
    "Orthodox": "Abram's faith in God's promise was accepted by God and reckoned to him as righteousness."
  },
  "7": {
    "General": "God also said to him, 'I am the Lord, who brought you out of Ur of the Chaldeans to give you this land to take possession of it.'",
    "Non-Denominational": "God identifies Himself by His past action (bringing Abram from Ur) and reaffirms the purpose: granting possession of the land.",
    "Baptist": "God reminds Abram of His past faithfulness (bringing from Ur) and reaffirms the land promise.",
    "Catholic": "God identifies Himself by His past action (leading Abram from Ur) and reiterates the promise of the land.",
    "Methodist": "God connects His identity with His past action and the future promise of the land.",
    "Lutheran": "God identifies Himself and reaffirms the land promise.",
    "Presbyterian": "God identifies Himself by His past redemptive act (bringing from Ur) and restates the land promise.",
    "Pentecostal": "God identifies Himself and reminds Abram of the purpose of bringing him out: to give him the land.",
    "Anglican": "God identifies Himself as the one who brought Abram from Ur specifically to give him the land.",
    "Orthodox": "God identifies Himself by His past deliverance from Ur and connects it to the promise of the land."
  },
  "8": {
    "General": "But Abram asked, 'Sovereign Lord, how can I know that I will gain possession of it?'",
    "Non-Denominational": "Abram, having believed the offspring promise, now asks for confirmation or assurance regarding the land promise, seeking a sign or tangible basis for certainty.",
    "Baptist": "Abram requests assurance or confirmation regarding the land promise.",
    "Catholic": "Abram asks for a sign or assurance ('How can I know?') regarding the promise of possessing the land.",
    "Methodist": "Abram seeks tangible confirmation or assurance about possessing the land.",
    "Lutheran": "Abram asks for assurance concerning the land promise.",
    "Presbyterian": "Abram seeks confirmation or a sign regarding the fulfillment of the land promise.",
    "Pentecostal": "Abram asks God for a confirmation or sign about inheriting the land.",
    "Anglican": "Abram asks for assurance or a way to know that he will indeed possess the land.",
    "Orthodox": "Abram asks for a sign or confirmation regarding the promise of inheriting the land."
  },
  "9": {
    "General": "So the Lord instructed him, 'Bring me a heifer, a goat and a ram, each three years old, along with a dove and a young pigeon.'",
    "Non-Denominational": "God responds to Abram's request by initiating a formal covenant ceremony, instructing him to prepare specific sacrificial animals.",
    "Baptist": "God instructs Abram to prepare animals for a covenant ratification ceremony.",
    "Catholic": "God answers Abram's request by commanding him to prepare animals for a solemn covenant ritual.",
    "Methodist": "God directs Abram to prepare specific animals for a covenant ceremony.",
    "Lutheran": "God instructs Abram to bring animals for a covenant ceremony.",
    "Presbyterian": "God instructs Abram to prepare animals for a formal covenant ceremony.",
    "Pentecostal": "God tells Abram to bring specific animals for a covenant ritual.",
    "Anglican": "The Lord instructs Abram to bring specific animals, initiating a covenant ritual.",
    "Orthodox": "God instructs Abram to bring specific animals to prepare for a covenant ceremony."
  },
  "10": {
    "General": "Abram brought all these, cut the larger animals in two, and arranged the halves opposite each other; the birds, however, he did not cut in half.",
    "Non-Denominational": "Abram obeys, preparing the animals according to ancient covenant-making custom, creating a path between the pieces.",
    "Baptist": "Abram prepares the animals as instructed, following ancient covenant practice.",
    "Catholic": "Abram obeys, preparing the animals according to the ancient custom for making a solemn covenant (cutting in two).",
    "Methodist": "Abram follows God's instructions, preparing the animals for the covenant ritual.",
    "Lutheran": "Abram prepares the animals as instructed for the covenant.",
    "Presbyterian": "Abram obeys, preparing the animals for the covenant ratification ceremony.",
    "Pentecostal": "Abram prepares the animals exactly as God instructed.",
    "Anglican": "Abram prepares the animals as instructed, cutting the mammals in half and arranging the pieces.",
    "Orthodox": "Abram prepares the animals as instructed, dividing the larger ones for the covenant ritual."
  },
  "11": {
    "General": "Then birds of prey came down on the carcasses, but Abram drove them away.",
    "Non-Denominational": "Symbolic interruption: forces opposing the covenant (birds of prey) attempt to interfere, but Abram diligently guards the prepared sacrifice.",
    "Baptist": "Abram protects the prepared sacrifice from interference (birds of prey).",
    "Catholic": "Abram diligently guards the sacrifices from scavenging birds, symbolizing protection of the sacred event.",
    "Methodist": "Abram guards the sacrifices from disturbance, showing diligence.",
    "Lutheran": "Abram drives away the birds of prey, protecting the sacrifices.",
    "Presbyterian": "Abram faithfully guards the elements of the covenant ceremony from defilement.",
    "Pentecostal": "Abram protects the sacrifice from interference.",
    "Anglican": "Abram drives away birds of prey attempting to descend on the carcasses.",
    "Orthodox": "Abram guards the prepared sacrifice from birds of prey."
  },
  "12": {
    "General": "As the sun was setting, Abram fell into a deep sleep, and a thick and dreadful darkness came over him.",
    "Non-Denominational": "A supernatural state falls upon Abram: deep sleep accompanied by profound, terrifying darkness, signifying the solemnity and perhaps the difficult future revealed.",
    "Baptist": "A supernatural deep sleep and dreadful darkness come upon Abram, preceding God's revelation.",
    "Catholic": "A deep, divinely induced sleep and terrifying darkness envelop Abram, setting the stage for God's solemn revelation.",
    "Methodist": "Abram falls into a supernatural sleep and darkness, indicating a solemn divine encounter.",
    "Lutheran": "God causes a deep sleep and dreadful darkness to fall on Abram before revealing the future.",
    "Presbyterian": "A deep sleep and terrifying darkness fall upon Abram, signifying the gravity of the revelation.",
    "Pentecostal": "A supernatural sleep and terrifying darkness come over Abram as God prepares to speak.",
    "Anglican": "Abram falls into a deep sleep accompanied by a thick, dreadful darkness.",
    "Orthodox": "A deep sleep and awesome darkness fall upon Abram, indicating a profound revelation."
  },
  "13": {
    "General": "Then the Lord told Abram: 'Know for certain that for four hundred years your descendants will be strangers in a country not their own and that they will be enslaved and mistreated there.'",
    "Non-Denominational": "God reveals the difficult future: Abram's descendants will endure a long period (400 years) of alienation, slavery, and mistreatment in a foreign land (Egypt).",
    "Baptist": "God prophesies the future enslavement of Abram's descendants in Egypt for 400 years.",
    "Catholic": "God reveals the future suffering of Abram's descendants: 400 years as strangers, enslaved and oppressed in a foreign land (Egypt).",
    "Methodist": "God foretells the 400-year period of slavery and mistreatment for Abram's descendants in a foreign land.",
    "Lutheran": "God reveals the prophecy of the 400-year Egyptian bondage.",
    "Presbyterian": "God reveals the future suffering and enslavement of Abram's descendants in Egypt.",
    "Pentecostal": "God gives Abram a prophecy: his descendants will be enslaved and mistreated for 400 years.",
    "Anglican": "The Lord reveals to Abram the future enslavement and mistreatment of his descendants in a foreign land for 400 years.",
    "Orthodox": "God foretells the 400-year exile and enslavement of Abram's descendants in a foreign land."
  },
  "14": {
    "General": "'But I will punish the nation they serve as slaves, and afterward they will come out with great possessions.'",
    "Non-Denominational": "God balances the prophecy of suffering with promises of judgment on the oppressing nation and the eventual liberation of His people with wealth.",
    "Baptist": "God promises judgment on the oppressing nation and deliverance for His people with wealth.",
    "Catholic": "God promises to judge the oppressing nation and that Abram's descendants will ultimately be liberated with great wealth.",
    "Methodist": "God promises judgment on the oppressor nation and the eventual exodus of His people with great possessions.",
    "Lutheran": "God promises to judge the oppressing nation and bring His people out with wealth.",
    "Presbyterian": "God promises judgment on the oppressor and the eventual deliverance of His people with great possessions.",
    "Pentecostal": "God promises to judge the nation that enslaves them and bring His people out with great wealth.",
    "Anglican": "God promises to punish the oppressing nation and that Abram's descendants will leave with great possessions.",
    "Orthodox": "God promises judgment upon the enslaving nation and the eventual liberation of Abram's descendants with great wealth."
  },
  "15": {
    "General": "'You, however, will go to your ancestors in peace and be buried at a good old age.'",
    "Non-Denominational": "God gives Abram personal reassurance: despite the future suffering of his descendants, Abram himself will die peacefully after a long life.",
    "Baptist": "God assures Abram of a peaceful death at a good old age.",
    "Catholic": "God personally assures Abram that he will die in peace at an old age, before the predicted affliction.",
    "Methodist": "God promises Abram a peaceful end after a long life.",
    "Lutheran": "God assures Abram he will die peacefully at an old age.",
    "Presbyterian": "God promises Abram a peaceful death at a ripe old age.",
    "Pentecostal": "God personally assures Abram he will die peacefully in old age.",
    "Anglican": "God assures Abram personally that he will die peacefully at a good old age.",
    "Orthodox": "God promises Abram a peaceful death in old age."
  },
  "16": {
    "General": "'In the fourth generation your descendants will come back here, for the sin of the Amorites has not yet reached its full measure.'",
    "Non-Denominational": "God gives a timeframe for return (fourth generation) and explains the delay: He is patiently waiting for the wickedness of the land's current inhabitants (Amorites) to reach its peak before enacting judgment and dispossession.",
    "Baptist": "God sets the timeframe for return (fourth generation) and explains the delay is due to the Amorites' sin not yet being complete.",
    "Catholic": "God specifies the timing of the return (fourth generation) and provides a theological reason for the delay: the sin of the Amorites has not yet warranted final judgment.",
    "Methodist": "God gives the timing for the return and links it to the measure of the Amorites' sin, showing divine patience and justice.",
    "Lutheran": "God predicts the return in the fourth generation, delaying judgment on the Amorites until their sin is full.",
    "Presbyterian": "God reveals the timing of the return is linked to His longsuffering towards the Amorites, whose sin had not yet reached its fullness requiring judgment.",
    "Pentecostal": "God reveals the timing (fourth generation) and the reason for delay: God's patience with the Amorites' sin.",
    "Anglican": "God specifies the timing of the return (fourth generation) and links it to the measure of the Amorites' sin being completed.",
    "Orthodox": "God indicates the timing of return and connects it to His longsuffering regarding the sin of the Amorites."
  },
  "17": {
    "General": "When the sun had set and darkness had fallen, a smoking firepot with a blazing torch appeared and passed between the pieces of the carcasses.",
    "Non-Denominational": "The climax of the covenant ceremony: symbols of God's glorious and consuming presence (smoking firepot, blazing torch) pass between the animal pieces, signifying God Himself taking the covenant oath and guaranteeing its fulfillment.",
    "Baptist": "God Himself, symbolized by fire and smoke, passes between the pieces, unilaterally ratifying the covenant.",
    "Catholic": "The symbols of God's presence (firepot, torch) pass between the pieces, signifying God Himself sealing the covenant with an unbreakable oath.",
    "Methodist": "God's presence, represented by fire and smoke, passes between the pieces, solemnly confirming the covenant.",
    "Lutheran": "God's presence (firepot, torch) passes between the pieces, signifying His unilateral commitment to the covenant promise.",
    "Presbyterian": "God Himself, represented by the firepot and torch, passes between the pieces, taking the covenant oath upon Himself, guaranteeing its promises unconditionally.",
    "Pentecostal": "The manifest presence of God (smoking firepot, blazing torch) passes between the pieces, supernaturally sealing the covenant.",
    "Anglican": "Symbols of the divine presence (smoking firepot, blazing torch) pass between the animal pieces, signifying God's ratification of the covenant.",
    "Orthodox": "The symbols of God's presence (firepot, torch) pass between the pieces, signifying God Himself sealing the covenant through this ancient ritual."
  },
  "18": {
    "General": "On that day the Lord made a covenant with Abram and said, 'To your descendants I give this land, from the Wadi of Egypt to the great river, the Euphrates—'",
    "Non-Denominational": "Formal declaration of the covenant ratification. God grants the land to Abram's descendants, defining its ideal vast boundaries from Egypt's border river to the Euphrates.",
    "Baptist": "God formally makes the covenant, granting the land with specified boundaries to Abram's descendants.",
    "Catholic": "The covenant is formally made, with God granting the land to Abram's descendants, defining its extensive boundaries.",
    "Methodist": "God formally establishes the covenant, granting the land with defined borders.",
    "Lutheran": "God formally makes the covenant, granting the land between Egypt's river and the Euphrates.",
    "Presbyterian": "God formally ratifies the covenant, granting the land with its specified maximal boundaries.",
    "Pentecostal": "God formally makes the covenant, giving the land between the specified rivers.",
    "Anglican": "The Lord formally makes the covenant with Abram, granting the land from the river of Egypt to the Euphrates.",
    "Orthodox": "God formally establishes the covenant, granting the land within specific boundaries."
  },
  "19": {
    "General": "'—the land of the Kenites, Kenizzites, Kadmonites,'",
    "Non-Denominational": "Begins listing the various peoples currently inhabiting the promised land, whose territory will be given to Abram's descendants.",
    "Baptist": "Lists some of the peoples inhabiting the promised land.",
    "Catholic": "Begins enumerating the peoples whose land is promised to Abram's descendants.",
    "Methodist": "Starts listing the inhabitants of the promised land.",
    "Lutheran": "Lists peoples inhabiting the land.",
    "Presbyterian": "Begins listing the peoples occupying the promised land.",
    "Pentecostal": "Starts naming the groups living in the promised land.",
    "Anglican": "Begins the list of the peoples whose land is included in the promise.",
    "Orthodox": "Begins listing the peoples inhabiting the promised land."
  },
  "20": {
    "General": "'Hittites, Perizzites, Rephaites,'",
    "Non-Denominational": "Continues listing the inhabitants of the promised land.",
    "Baptist": "Continues the list of inhabitants.",
    "Catholic": "Continues enumerating the peoples.",
    "Methodist": "Continues listing inhabitants.",
    "Lutheran": "Lists more peoples inhabiting the land.",
    "Presbyterian": "Continues listing the peoples.",
    "Pentecostal": "Continues naming the groups.",
    "Anglican": "Continues the list of inhabitants.",
    "Orthodox": "Continues listing the peoples."
  },
  "21": {
    "General": "'Amorites, Canaanites, Girgashites and Jebusites.'",
    "Non-Denominational": "Completes the list of peoples whose land is promised, emphasizing the comprehensiveness of the grant despite current occupation.",
    "Baptist": "Completes the list of inhabitants.",
    "Catholic": "Concludes the list of peoples whose land is promised.",
    "Methodist": "Completes the list of inhabitants.",
    "Lutheran": "Completes the list of peoples.",
    "Presbyterian": "Completes the list of peoples.",
    "Pentecostal": "Finishes naming the groups.",
    "Anglican": "Completes the list of inhabitants.",
    "Orthodox": "Completes listing the peoples inhabiting the promised land."
  }
} 