{
  "chapterSummary": {
    "General": "Ten years after settling in Canaan, Sarai remains barren. She suggests Abram take her Egyptian maidservant, Hagar, as a wife to bear children for them, a custom of the time. Abram agrees. When Hagar conceives, tension arises; Hagar despises Sarai, and Sarai blames Abram and mistreats Hagar. Hagar flees into the wilderness. The Angel of the Lord finds Hagar by a spring, instructs her to return and submit to Sarai, and promises her innumerable descendants through a son she is to name Ishmael ('God hears'). The Angel describes Ishmael as a 'wild donkey of a man,' often in conflict. Hagar recognizes God's presence ('God Who Sees Me') and names the well Beer Lahai Roi. Hagar returns and bears Ishmael to Abram, who is 86 years old.",
    "Non-Denominational": "Focuses on the human attempt to fulfill God's promise through cultural means (surrogacy via Hagar) due to impatience and lack of faith. Highlights the resulting conflict, jealousy, and injustice within the household. Emphasizes God's compassion and intervention for Hagar, the outcast, through the Angel of the Lord. Notes the specific prophecy about Ishmael's character and numerous descendants, distinct from the promised line through Sarai. Hagar's naming of God ('El Roi') signifies a personal encounter and God's attentiveness.",
    "Baptist": "Views this as a failure of faith by Abram and Sarai, attempting to fulfill God's promise through human effort rather than trusting God's timing. Highlights the negative consequences: family strife, jealousy, Hagar's mistreatment. Stresses God's grace and mercy shown to Hagar despite the situation. Notes the distinction between Ishmael (born of human effort) and Isaac (the promised child of faith).",
    "Catholic": "Sees Abram and Sarai's actions as understandable human impatience but ultimately lacking full trust in God's plan. Notes the moral complexities and suffering caused by deviating from God's design for marriage/family. Highlights God's mercy towards Hagar, an afflicted woman. Views the Angel of the Lord's encounter as a significant theophany. Distinguishes Ishmael's line from the line of the specific covenant promise through Isaac.",
    "Methodist": "Focuses on the human struggle with waiting on God's promises, leading to Sarai and Abram's plan. Emphasizes the resulting interpersonal conflict and suffering. Highlights God's compassion for Hagar in her distress, revealed through the Angel of the Lord. Notes the prophecy concerning Ishmael and God's care for him, while maintaining the separate promise through Sarai.",
    "Lutheran": "Views the chapter as demonstrating human weakness and impatience in trying to 'help' God fulfill His promise. Highlights the sinful consequences of this attempt (strife, mistreatment). Stresses God's grace in seeking out and promising blessing to Hagar and Ishmael, even though Ishmael is not the child of the primary promise (which points to Christ).",
    "Presbyterian": "Sees this as an example of Abram and Sarai trying to achieve God's promised ends through illegitimate, human means, lacking faith. Notes the resulting disorder and suffering. Highlights God's sovereign compassion extended to Hagar. Distinguishes God's general blessing on Ishmael from the specific covenant blessings reserved for the line of promise (Isaac).",
    "Pentecostal": "Focuses on the attempt to operate in the flesh rather than waiting for the Spirit's fulfillment of God's promise. Highlights the spiritual and relational conflict that resulted. Emphasizes the direct encounter between Hagar and the Angel of the Lord, demonstrating God's personal care for the oppressed. Notes God hears (Ishmael) and sees (El Roi).",
    "Anglican": "Interprets the events as showing human frailty and impatience in the face of God's promises. Notes the social customs of the time but also the resulting conflict. Highlights the encounter with the Angel of the Lord as a manifestation of God's care for Hagar. Distinguishes the blessing given to Ishmael from the covenant promise through Isaac.",
    "Orthodox": "Views the actions of Abram and Sarai as a lapse in faith, trying to force God's promise. Notes the resulting turmoil. Focuses on God's mercy (philanthropia) shown to Hagar through the Angel. Hagar's naming of God ('God Who Sees') is significant. Acknowledges God's blessing on Ishmael but distinguishes it from the unique covenant lineage leading to Christ."
  },
  "1": {
    "General": "Sarai, Abram's wife, had borne him no children. She had an Egyptian maidservant named Hagar.",
    "Non-Denominational": "Sets the context: Sarai's continued barrenness ten years after the promise, introducing Hagar the Egyptian maidservant.",
    "Baptist": "States the problem: Sarai's barrenness, and introduces Hagar.",
    "Catholic": "Introduces the situation: Sarai's infertility and the presence of Hagar, her Egyptian maidservant.",
    "Methodist": "Highlights Sarai's barrenness and introduces Hagar.",
    "Lutheran": "States Sarai's barrenness and introduces Hagar.",
    "Presbyterian": "Sets the scene: Sarai's barrenness and the introduction of Hagar.",
    "Pentecostal": "Identifies the core issue: Sarai has no children, and introduces Hagar.",
    "Anglican": "States that Sarai was childless and introduces her Egyptian maidservant, Hagar.",
    "Orthodox": "Introduces Sarai's barrenness and her Egyptian maidservant Hagar."
  },
  "2": {
    "General": "Sarai said to Abram, 'The Lord has kept me from having children. Go, sleep with my maidservant; perhaps I can build a family through her.' Abram agreed to what Sarai said.",
    "Non-Denominational": "Sarai initiates a plan based on cultural norms (surrogacy), attributing her barrenness to the Lord but seeking a human solution. Abram passively agrees.",
    "Baptist": "Sarai proposes a human solution to her barrenness, using Hagar. Abram consents.",
    "Catholic": "Sarai proposes using Hagar as a surrogate according to custom, acknowledging God's sovereignty over fertility but resorting to human means. Abram complies.",
    "Methodist": "Sarai proposes a plan using Hagar to have children, reflecting cultural practice. Abram agrees.",
    "Lutheran": "Sarai suggests using Hagar to obtain children, a plan born of impatience. Abram agrees.",
    "Presbyterian": "Sarai proposes a human scheme to obtain the promised offspring through Hagar. Abram consents.",
    "Pentecostal": "Sarai suggests a plan based on human reasoning, not faith. Abram goes along with it.",
    "Anglican": "Sarai proposes that Abram have a child through Hagar, following contemporary custom. Abram agrees.",
    "Orthodox": "Sarai proposes using Hagar to build a family, acknowledging God's hand in her barrenness but seeking a human remedy. Abram agrees."
  },
  "3": {
    "General": "So after Abram had been living in Canaan ten years, Sarai his wife took her Egyptian maidservant Hagar and gave her to her husband to be his wife.",
    "Non-Denominational": "Specifies the timing (ten years in Canaan) and the formal action: Sarai gives Hagar to Abram specifically as a wife for procreation.",
    "Baptist": "Details the action: Sarai gives Hagar to Abram as a wife after ten years in Canaan.",
    "Catholic": "Narrates the implementation of the plan: after ten years, Sarai formally gives Hagar to Abram as a concubine/secondary wife.",
    "Methodist": "States the time frame and Sarai's action of giving Hagar to Abram.",
    "Lutheran": "Sarai implements her plan after ten years in Canaan.",
    "Presbyterian": "Records the implementation of Sarai's plan after ten years.",
    "Pentecostal": "Details Sarai giving Hagar to Abram as a wife.",
    "Anglican": "States the time elapsed (ten years) and Sarai's formal act of giving Hagar to Abram as a wife.",
    "Orthodox": "After ten years in Canaan, Sarai gives Hagar to Abram as a wife."
  },
  "4": {
    "General": "He slept with Hagar, and she conceived. When she knew she was pregnant, she began to despise her mistress.",
    "Non-Denominational": "The plan succeeds biologically (Hagar conceives) but immediately leads to conflict: Hagar's attitude towards the barren Sarai changes to contempt.",
    "Baptist": "Hagar conceives, leading to arrogance and contempt towards Sarai.",
    "Catholic": "Hagar conceives, and her newfound status leads her to despise the childless Sarai, igniting conflict.",
    "Methodist": "Hagar conceives, resulting in her looking down on Sarai.",
    "Lutheran": "Hagar conceives and then despises Sarai.",
    "Presbyterian": "Hagar conceives, and conflict arises as she despises Sarai.",
    "Pentecostal": "Hagar conceives and begins to despise Sarai, showing immediate negative consequences.",
    "Anglican": "Abram sleeps with Hagar, who conceives and then despises Sarai.",
    "Orthodox": "Hagar conceives and, consequently, despises her mistress Sarai."
  },
  "5": {
    "General": "Then Sarai said to Abram, 'You are responsible for the wrong I am suffering! I put my servant in your arms, and now that she knows she is pregnant, she despises me. May the Lord judge between you and me.'",
    "Non-Denominational": "Sarai blames Abram for the predictable outcome of her own plan, expressing her hurt and demanding divine judgment.",
    "Baptist": "Sarai blames Abram for the consequences of her own plan and appeals to God.",
    "Catholic": "Sarai reacts bitterly, blaming Abram for the situation she initiated and invoking divine judgment.",
    "Methodist": "Sarai confronts Abram, blaming him for the conflict and calling for God's judgment.",
    "Lutheran": "Sarai blames Abram for the trouble her plan caused.",
    "Presbyterian": "Sarai blames Abram for the consequences of her scheme.",
    "Pentecostal": "Sarai blames Abram for the pain caused by her idea.",
    "Anglican": "Sarai complains to Abram, blaming him for Hagar's contempt and appealing for the Lord's judgment.",
    "Orthodox": "Sarai blames Abram for the wrong she suffers due to Hagar's contempt."
  },
  "6": {
    "General": "Abram replied, 'Your servant is in your hands. Do with her whatever you think best.' Then Sarai mistreated Hagar; so she fled from her.",
    "Non-Denominational": "Abram abdicates responsibility, giving Sarai full authority over Hagar. Sarai uses this power harshly, leading Hagar to flee.",
    "Baptist": "Abram gives Sarai control over Hagar. Sarai mistreats Hagar, causing her to flee.",
    "Catholic": "Abram delegates authority over Hagar back to Sarai, who then mistreats her severely, prompting Hagar to run away.",
    "Methodist": "Abram allows Sarai to handle Hagar. Sarai's mistreatment causes Hagar to flee.",
    "Lutheran": "Abram gives Sarai permission to deal with Hagar; Sarai mistreats her, causing her flight.",
    "Presbyterian": "Abram relinquishes Hagar to Sarai's control; Sarai's harsh treatment causes Hagar to flee.",
    "Pentecostal": "Abram hands Hagar back to Sarai. Sarai mistreats Hagar, who runs away.",
    "Anglican": "Abram gives Sarai authority over Hagar. Sarai mistreats Hagar, causing her to flee.",
    "Orthodox": "Abram gives Sarai authority over Hagar; Sarai deals harshly with her, causing Hagar to flee."
  },
  "7": {
    "General": "The angel of the Lord found Hagar near a spring in the desert; it was the spring that is beside the road to Shur.",
    "Non-Denominational": "Divine intervention: The Angel of the Lord (often seen as a theophany) seeks out the fleeing, vulnerable Hagar in a specific location in the wilderness.",
    "Baptist": "The Angel of the Lord finds Hagar in the wilderness, showing God's awareness and care.",
    "Catholic": "The Angel of the Lord (a divine messenger, possibly pre-incarnate Christ) finds the fugitive Hagar by a spring in the desert.",
    "Methodist": "God intervenes: The Angel of the Lord finds Hagar in her distress in the wilderness.",
    "Lutheran": "The Angel of the Lord finds Hagar in the desert.",
    "Presbyterian": "The Angel of the Lord finds Hagar, demonstrating God's sovereign care even for the outcast.",
    "Pentecostal": "The Angel of the Lord supernaturally finds Hagar in the desert.",
    "Anglican": "The Angel of the Lord finds Hagar by a spring in the wilderness on the way to Shur.",
    "Orthodox": "The Angel of the Lord finds Hagar by a spring in the desert, showing God's providence."
  },
  "8": {
    "General": "And he said, 'Hagar, servant of Sarai, where have you come from, and where are you going?' 'I'm fleeing from my mistress Sarai,' she answered.",
    "Non-Denominational": "The Angel engages Hagar directly, asking about her origin and destination, prompting her honest reply about fleeing Sarai.",
    "Baptist": "The Angel questions Hagar about her situation.",
    "Catholic": "The Angel addresses Hagar specifically ('servant of Sarai') and questions her, eliciting her reason for being there.",
    "Methodist": "The Angel engages Hagar, asking about her situation.",
    "Lutheran": "The Angel questions Hagar.",
    "Presbyterian": "The Angel questions Hagar, acknowledging her identity and situation.",
    "Pentecostal": "The Angel speaks directly to Hagar, asking about her journey.",
    "Anglican": "The Angel addresses Hagar by name and status, asking her origin and destination; Hagar explains she is fleeing Sarai.",
    "Orthodox": "The Angel questions Hagar about her origin and destination."
  },
  "9": {
    "General": "Then the angel of the Lord told her, 'Go back to your mistress and submit to her.'",
    "Non-Denominational": "The Angel gives a difficult command: return to the place of mistreatment and submit to Sarai's authority, implying a purpose in enduring the hardship.",
    "Baptist": "The Angel instructs Hagar to return and submit to Sarai.",
    "Catholic": "The Angel commands Hagar to return and submit to Sarai, a difficult instruction tied to the following promise.",
    "Methodist": "The Angel instructs Hagar to return to Sarai and submit.",
    "Lutheran": "The Angel commands Hagar to return and submit.",
    "Presbyterian": "The Angel commands Hagar to return and submit, part of God's plan.",
    "Pentecostal": "The Angel gives Hagar instructions: return and submit.",
    "Anglican": "The Angel instructs Hagar to return to Sarai and submit to her authority.",
    "Orthodox": "The Angel instructs Hagar to return to her mistress and submit."
  },
  "10": {
    "General": "The angel added, 'I will increase your descendants so much that they will be too numerous to count.'",
    "Non-Denominational": "Accompanying the command is a promise echoing the one given to Abram: Hagar herself will be the mother of countless descendants.",
    "Baptist": "The Angel promises Hagar numerous descendants.",
    "Catholic": "The Angel gives Hagar a promise similar to Abram's: she will have innumerable descendants.",
    "Methodist": "The Angel promises Hagar a vast posterity.",
    "Lutheran": "The Angel promises Hagar countless descendants.",
    "Presbyterian": "The Angel promises Hagar innumerable descendants, a specific blessing for her line.",
    "Pentecostal": "The Angel gives Hagar a great promise: countless descendants.",
    "Anglican": "The Angel promises Hagar that her descendants will be innumerable.",
    "Orthodox": "The Angel promises Hagar exceedingly numerous descendants."
  },
  "11": {
    "General": "The angel of the Lord also said to her: 'You are now pregnant and you will give birth to a son. You shall name him Ishmael, for the Lord has heard your misery.'",
    "Non-Denominational": "The Angel confirms her pregnancy, foretells a son, dictates his name Ishmael ('God hears'), and explicitly states the reason: God has heard/paid attention to her affliction.",
    "Baptist": "The Angel foretells the birth of Ishmael ('God hears'), acknowledging God heard her affliction.",
    "Catholic": "The Angel confirms her pregnancy, announces the birth of a son, commands the name Ishmael ('God hears'), explaining God has heard her affliction.",
    "Methodist": "The Angel announces the birth of a son, names him Ishmael ('God hears'), signifying God's attentiveness to her suffering.",
    "Lutheran": "The Angel names the son Ishmael ('God hears') because God heard her affliction.",
    "Presbyterian": "The Angel names the son Ishmael ('God hears'), signifying God's notice of her affliction.",
    "Pentecostal": "The Angel reveals the son's name, Ishmael, meaning 'God hears' her misery.",
    "Anglican": "The Angel announces she will bear a son named Ishmael, meaning 'God hears,' because the Lord has heard her misery.",
    "Orthodox": "The Angel announces the birth of a son to be named Ishmael ('God hears'), because God heard her affliction."
  },
  "12": {
    "General": "'He will be a wild donkey of a man; his hand will be against everyone and everyone's hand against him, and he will live in hostility toward all his brothers.'",
    "Non-Denominational": "The Angel provides a character prophecy for Ishmael: fiercely independent, nomadic ('wild donkey'), living in conflict with surrounding peoples ('brothers'/relatives).",
    "Baptist": "The Angel describes Ishmael's future character: wild, independent, and living in conflict.",
    "Catholic": "The Angel prophesies Ishmael's character and destiny: fiercely independent ('wild donkey'), prone to conflict, living apart from/in tension with related peoples.",
    "Methodist": "The Angel describes Ishmael's nature: wild, independent, and living in conflict.",
    "Lutheran": "The Angel describes Ishmael as a 'wild donkey of a man,' living in conflict.",
    "Presbyterian": "The Angel describes Ishmael's character: wild, independent, contentious.",
    "Pentecostal": "The Angel gives a prophecy about Ishmael's nature: like a wild donkey, in conflict.",
    "Anglican": "The Angel describes Ishmael's character using the metaphor of a 'wild donkey of a man,' predicting a life of independence and conflict.",
    "Orthodox": "The Angel describes Ishmael's character: free-roaming ('wild donkey') and living in tension with his kin."
  },
  "13": {
    "General": "She gave this name to the Lord who spoke to her: 'You are the God who sees me,' for she said, 'I have now seen the One who sees me.'",
    "Non-Denominational": "Hagar responds to the encounter by naming God based on her experience: 'El Roi' (The God Who Sees Me), acknowledging His awareness of her plight and her surviving a direct encounter.",
    "Baptist": "Hagar names God 'El Roi' (God Who Sees), recognizing His personal awareness of her.",
    "Catholic": "Hagar names God based on her experience: 'El Roi' (God Who Sees), expressing wonder at seeing God (via the Angel) and surviving.",
    "Methodist": "Hagar names God 'The God Who Sees Me,' acknowledging His awareness and her experience of Him.",
    "Lutheran": "Hagar calls God 'El Roi' (God Who Sees), acknowledging He saw her affliction.",
    "Presbyterian": "Hagar names God 'El Roi' (God Who Sees), recognizing His omniscience and care.",
    "Pentecostal": "Hagar gives God a name based on her encounter: 'You are the God Who Sees Me.'",
    "Anglican": "Hagar names the Lord who spoke to her 'El Roi' (God Who Sees), acknowledging that God saw her and she saw Him (or His representative).",
    "Orthodox": "Hagar names God 'El Roi' (The God Who Sees), acknowledging His awareness of her and her direct encounter."
  },
  "14": {
    "General": "That is why the well was called Beer Lahai Roi; it is still there, between Kadesh and Bered.",
    "Non-Denominational": "The well where the encounter occurred is named 'Well of the Living One Who Sees Me,' commemorating the event and God's character revealed there. Its location is specified.",
    "Baptist": "The well is named Beer Lahai Roi to commemorate the event.",
    "Catholic": "The well is named Beer Lahai Roi ('Well of the Living One Who Sees Me') in memory of Hagar's encounter with God.",
    "Methodist": "The well is named Beer Lahai Roi ('Well of the Living One Who Sees Me') after Hagar's experience.",
    "Lutheran": "The well is named Beer Lahai Roi.",
    "Presbyterian": "The well is named Beer Lahai Roi to commemorate God's seeing Hagar.",
    "Pentecostal": "The well is named 'Well of the Living One Who Sees Me' after this encounter.",
    "Anglican": "The well is consequently named Beer Lahai Roi ('Well of the Living One Who Sees Me').",
    "Orthodox": "The well is named Beer Lahai Roi ('Well of the Living One Who Sees Me') commemorating the encounter."
  },
  "15": {
    "General": "So Hagar bore Abram a son, and Abram gave the name Ishmael to the son she had borne.",
    "Non-Denominational": "Hagar obeys, returns, and gives birth. Abram names the son Ishmael, in accordance with the Angel's instruction (likely relayed by Hagar).",
    "Baptist": "Hagar bears Ishmael, and Abram names him according to the Angel's word.",
    "Catholic": "Hagar gives birth to Abram's son, whom Abram names Ishmael as commanded by the Angel.",
    "Methodist": "Hagar bears Abram's son, named Ishmael.",
    "Lutheran": "Hagar bears Ishmael, whom Abram names.",
    "Presbyterian": "Hagar bears Ishmael, and Abram names him.",
    "Pentecostal": "Hagar gives birth to Ishmael, and Abram names him.",
    "Anglican": "Hagar bears Abram a son, whom Abram names Ishmael.",
    "Orthodox": "Hagar bears Abram a son, named Ishmael."
  },
  "16": {
    "General": "Abram was eighty-six years old when Hagar bore him Ishmael.",
    "Non-Denominational": "Notes Abram's advanced age (86), emphasizing the long wait and the birth resulting from the human plan, 11 years after arriving in Canaan.",
    "Baptist": "Records Abram's age (86) at Ishmael's birth.",
    "Catholic": "States Abram's age (86) at the time of Ishmael's birth.",
    "Methodist": "Notes Abram's age when Ishmael was born.",
    "Lutheran": "Abram was 86 when Ishmael was born.",
    "Presbyterian": "Records Abram's age at Ishmael's birth.",
    "Pentecostal": "States Abram's age (86) when Ishmael was born.",
    "Anglican": "States Abram's age (eighty-six) when Ishmael was born.",
    "Orthodox": "Records Abram's age (86) at Ishmael's birth."
  }
} 