{
  "chapterSummary": {
    "General": "Thirteen years after Ishmael's birth, when Abram is 99, God appears as 'God Almighty' (El Shaddai), commanding faithfulness. God reconfirms the covenant, changes Abram's name to Abraham ('father of many nations'), promising numerous descendants, nations, and kings from him. God establishes this as an everlasting covenant, promising Canaan as an everlasting possession and His divine relationship. God institutes circumcision as the required sign of this covenant for Abraham and all males in his household (born or bought), to be performed on the eighth day, with non-compliance resulting in being cut off. God changes Sarai's name to Sarah ('princess') and promises she will bear a son. Abraham laughs in disbelief due to their age but God reaffirms the promise, naming the son Isaac ('he laughs') and establishing the everlasting covenant specifically through him. God also blesses Ishmael, promising he will father twelve rulers and a great nation, but confirms the main covenant line is through Isaac. Abraham immediately obeys, circumcising himself, Ishmael (age 13), and all males in his household that same day.",
    "Non-Denominational": "Focuses on the significant development of the covenant. God reveals a new name/aspect of His character (El Shaddai). Highlights the name changes (Abram to Abraham, Sarai to Sarah) signifying new roles and divine purpose. Emphasizes circumcision as the physical, outward sign marking participation in the covenant community. Notes the specific promise of Isaac as the child of promise, distinguishing his role from Ishmael's, despite God's blessing on Ishmael. Abraham's laughter reflects human doubt, while his immediate obedience demonstrates underlying faith.",
    "Baptist": "Stresses God's revelation as El Shaddai and the call to faithful obedience. Views the name changes as signifying God's sovereign purpose. Emphasizes circumcision as the sign of the Old Covenant, foreshadowing the inward circumcision of the heart in the New Covenant. Highlights the specific promise of Isaac as the covenant heir, through whom the line of redemption continues. Notes Abraham's human reaction (laughter) but ultimate obedience.",
    "Catholic": "Highlights God's self-revelation as 'God Almighty.' Sees the name changes as conferring new identities and missions within God's plan. Understands circumcision as the sacramental sign of the Abrahamic covenant, prefiguring Baptism. Emphasizes the specific promise of Isaac, born through divine intervention, as the heir of the covenant leading towards Christ. Notes Abraham's laughter as human frailty, but his obedience as virtuous.",
    "Methodist": "Focuses on God's powerful self-revelation (El Shaddai) and the call to walk blamelessly. Sees the name changes as indicating God's transformative work and purpose. Views circumcision as the sign sealing the covenant relationship for that era. Highlights the clear promise of Isaac as the specific heir, while acknowledging God's separate blessing for Ishmael. Notes Abraham's initial doubt overcome by obedient action.",
    "Lutheran": "Stresses God's revelation of Himself (El Shaddai) and His command/promise. Views the name changes as part of God's gracious dealing. Sees circumcision as the sign of the Old Covenant, fulfilled in Christ and replaced by Baptism. Emphasizes Isaac as the child of promise, crucial for the lineage leading to Christ, distinguishing him clearly from Ishmael. Notes Abraham's struggle with belief (laughter) but ultimate trust shown in obedience.",
    "Presbyterian": "Highlights God's sovereign appearance as El Shaddai and His covenant commands/promises. Sees the name changes as divinely imposed signs of covenant roles. Understands circumcision as the sign and seal of the covenant of grace in its Old Testament administration. Stresses the specific election of Isaac as the covenant heir, distinct from Ishmael's blessing. Notes Abraham's obedience despite his initial incredulity.",
    "Pentecostal": "Emphasizes the powerful encounter with God Almighty (El Shaddai). Sees the name changes as imparting spiritual identity and destiny. Views circumcision as a vital sign of covenant commitment required by God. Highlights the miraculous promise of Isaac against natural circumstances. Notes Abraham's human reaction (laughter) but powerful demonstration of faith through immediate obedience.",
    "Anglican": "Focuses on God's self-revelation (El Shaddai) and the renewal of the covenant. Views the name changes as significant markers of God's plan. Interprets circumcision as the appointed sign of the Abrahamic covenant. Notes the specific promise regarding Isaac as the designated heir, differentiating his role from Ishmael's blessing. Acknowledges Abraham's human reaction and subsequent obedience.",
    "Orthodox": "Highlights the theophany of God Almighty. Sees the name changes as reflecting new realities brought about by God's blessing. Understands circumcision as the physical mark of the Old Covenant people, fulfilled spiritually in Christ. Stresses the specific promise of Isaac as the chosen seed for the covenant lineage. Notes Abraham's doubt (laughter) but commends his swift obedience."
  },
  "1": {
    "General": "When Abram was ninety-nine years old, the Lord appeared to him and said, 'I am God Almighty (El Shaddai); walk before me faithfully and be blameless.'",
    "Non-Denominational": "Significant time lapse (13 years). God reappears, revealing Himself as 'El Shaddai' (God Almighty/All-Sufficient), emphasizing power needed for the coming promise. Issues a command for covenant faithfulness and integrity.",
    "Baptist": "God appears to Abram (now 99), reveals Himself as El Shaddai, and calls him to a life of faithfulness and integrity.",
    "Catholic": "After 13 years, God appears, revealing His name/attribute El Shaddai (God Almighty). Commands Abraham to walk faithfully in His presence and be perfect/blameless.",
    "Methodist": "God appears to the elderly Abram, revealing Himself as God Almighty and calling for faithful living.",
    "Lutheran": "God appears as El Shaddai (Almighty) and commands Abram to walk faithfully.",
    "Presbyterian": "God sovereignly appears as El Shaddai, commanding Abram to walk in covenant faithfulness and integrity.",
    "Pentecostal": "A powerful appearance of God Almighty (El Shaddai) to Abram, calling him to faithful obedience.",
    "Anglican": "The Lord appears to Abram at age 99, identifying Himself as God Almighty (El Shaddai) and commanding faithfulness.",
    "Orthodox": "God appears to Abram (age 99) as God Almighty (El Shaddai), commanding him to walk before Him and be blameless."
  },
  "2": {
    "General": "'Then I will make my covenant between me and you and will greatly increase your numbers.'",
    "Non-Denominational": "God states His intention to confirm/establish His covenant with Abram personally and reiterates the promise of numerous descendants.",
    "Baptist": "God reaffirms His intention to establish the covenant and multiply Abram.",
    "Catholic": "God declares His intention to establish the covenant and make Abram exceedingly numerous.",
    "Methodist": "God restates His commitment to the covenant and the promise of multiplication.",
    "Lutheran": "God promises to establish His covenant and greatly multiply Abram.",
    "Presbyterian": "God declares His intention to establish His covenant and greatly multiply Abram.",
    "Pentecostal": "God confirms the covenant and the promise of great multiplication.",
    "Anglican": "God states He will confirm His covenant and greatly increase Abram's descendants.",
    "Orthodox": "God confirms His intention to establish the covenant and multiply Abram greatly."
  },
  "3": {
    "General": "Abram fell facedown, and God said to him,",
    "Non-Denominational": "Abram's posture of humility, reverence, and submission in response to God's presence and declaration.",
    "Baptist": "Abram responds with humility and reverence (falling facedown).",
    "Catholic": "Abram prostrates himself in humility and adoration before God speaks further.",
    "Methodist": "Abram shows reverence and humility by falling facedown.",
    "Lutheran": "Abram falls facedown in reverence.",
    "Presbyterian": "Abram responds with appropriate reverence and submission (falling facedown).",
    "Pentecostal": "Abram falls facedown in worship and awe before God.",
    "Anglican": "Abram falls facedown in reverence as God continues to speak.",
    "Orthodox": "Abram falls on his face in reverence before God."
  },
  "4": {
    "General": "'As for me, this is my covenant with you: You will be the father of many nations.'",
    "Non-Denominational": "God personally commits ('As for me') and defines a key aspect of the covenant: Abram's destiny as the progenitor of multiple nations.",
    "Baptist": "God states His part of the covenant: making Abram the father of many nations.",
    "Catholic": "God declares His part of the covenant: Abram will become the father of a multitude of nations.",
    "Methodist": "God confirms His covenant commitment: Abram will father many nations.",
    "Lutheran": "God establishes His covenant: Abram will be the father of many nations.",
    "Presbyterian": "God declares His covenant promise: Abram will be the father of many nations.",
    "Pentecostal": "God declares the covenant promise: Abram will father many nations.",
    "Anglican": "God states His covenant promise: Abram will be the father of many nations.",
    "Orthodox": "God declares His covenant: Abram will be the father of many nations."
  },
  "5": {
    "General": "'No longer will you be called Abram; your name will be Abraham, for I have made you a father of many nations.'",
    "Non-Denominational": "The name change from Abram ('Exalted Father') to Abraham ('Father of a Multitude/Many Nations') signifies and seals this new identity and destiny conferred by God.",
    "Baptist": "God changes Abram's name to Abraham, reflecting the promise of being father of many nations.",
    "Catholic": "God changes Abram's name to Abraham ('Father of Many'), signifying his new role as progenitor of many nations.",
    "Methodist": "God changes Abram's name to Abraham to reflect his destiny as father of many nations.",
    "Lutheran": "God changes Abram's name to Abraham ('Father of Many Nations').",
    "Presbyterian": "God changes Abram's name to Abraham, signifying his covenant role as father of many nations.",
    "Pentecostal": "God gives Abram a new name, Abraham, meaning 'Father of Many Nations'.",
    "Anglican": "God changes Abram's name to Abraham ('Father of Many Nations'), reflecting the promise.",
    "Orthodox": "God changes Abram's name to Abraham ('Father of Many'), signifying his role."
  },
  "6": {
    "General": "'I will make you very fruitful; I will make nations of you, and kings will come from you.'",
    "Non-Denominational": "God elaborates on the promise: extreme fruitfulness, resulting in nations and royal lineages descending from Abraham.",
    "Baptist": "God promises exceptional fruitfulness, resulting in nations and kings.",
    "Catholic": "God promises extraordinary fruitfulness, the formation of nations, and descendants who will be kings.",
    "Methodist": "God promises great fruitfulness, leading to nations and kings.",
    "Lutheran": "God promises fruitfulness, nations, and kings from Abraham.",
    "Presbyterian": "God promises great fruitfulness, including nations and royal lines.",
    "Pentecostal": "God promises Abraham will be very fruitful, fathering nations and kings.",
    "Anglican": "God promises to make Abraham exceedingly fruitful, the source of nations and kings.",
    "Orthodox": "God promises great fruitfulness, the origin of nations and kings."
  },
  "7": {
    "General": "'I will establish my covenant as an everlasting covenant between me and you and your descendants after you for the generations to come, to be your God and the God of your descendants after you.'",
    "Non-Denominational": "God defines the covenant's duration (everlasting) and scope (Abraham and descendants). The core promise is God's personal relationship: 'to be your God.'",
    "Baptist": "God establishes the covenant as everlasting, encompassing Abraham and his descendants, promising His divine relationship.",
    "Catholic": "God establishes the covenant's permanence (everlasting) and includes future generations, promising His divine presence and relationship.",
    "Methodist": "God defines the covenant as everlasting, including descendants, and promising to be their God.",
    "Lutheran": "God establishes the covenant as everlasting, for Abraham and descendants, promising to be their God.",
    "Presbyterian": "God establishes the covenant as everlasting, extending to descendants, promising to be their God.",
    "Pentecostal": "God declares the covenant everlasting, for Abraham and descendants, promising to be their God.",
    "Anglican": "God establishes the covenant as everlasting, for Abraham and his descendants, promising to be their God.",
    "Orthodox": "God establishes the covenant as eternal, for Abraham and his seed, promising to be their God."
  },
  "8": {
    "General": "'The whole land of Canaan, where you now reside as a foreigner, I will give as an everlasting possession to you and your descendants after you; and I will be their God.'",
    "Non-Denominational": "The land promise is reaffirmed: Canaan will be given as an everlasting possession, explicitly linked again to God's promise to be their God.",
    "Baptist": "God reaffirms the promise of Canaan as an everlasting possession, linked to His relationship with them.",
    "Catholic": "God reiterates the promise of Canaan as an everlasting possession for Abraham's descendants, again connected to His promise to be their God.",
    "Methodist": "God restates the promise of Canaan as an everlasting possession, tied to His divine relationship.",
    "Lutheran": "God reaffirms the promise of Canaan as an everlasting possession.",
    "Presbyterian": "God reaffirms the grant of Canaan as an everlasting possession, tied to the covenant relationship.",
    "Pentecostal": "God confirms the promise of Canaan as an everlasting possession.",
    "Anglican": "God confirms the promise of Canaan as an everlasting possession for Abraham's descendants and reiterates He will be their God.",
    "Orthodox": "God promises the land of Canaan as an eternal possession and reaffirms He will be their God."
  },
  "9": {
    "General": "Then God said to Abraham, 'As for you, you must keep my covenant, you and your descendants after you for the generations to come.'",
    "Non-Denominational": "Shifts to human responsibility: Abraham and his descendants are obligated to keep/observe the covenant requirements.",
    "Baptist": "God states Abraham's responsibility: keep the covenant.",
    "Catholic": "God stipulates the human obligation: Abraham and his descendants must observe the covenant.",
    "Methodist": "God outlines the human responsibility: keeping the covenant.",
    "Lutheran": "God commands Abraham and descendants to keep the covenant.",
    "Presbyterian": "God commands Abraham and his descendants to keep the covenant.",
    "Pentecostal": "God gives Abraham his part: keep the covenant.",
    "Anglican": "God instructs Abraham that he and his descendants must keep the covenant.",
    "Orthodox": "God commands Abraham and his seed to keep the covenant."
  },
  "10": {
    "General": "'This is my covenant with you and your descendants after you, the covenant you are to keep: Every male among you shall be circumcised.'",
    "Non-Denominational": "Introduces the specific, required sign of the covenant: circumcision of all males.",
    "Baptist": "God specifies the sign of the covenant: male circumcision.",
    "Catholic": "God institutes the concrete sign of the covenant: circumcision for all males.",
    "Methodist": "God establishes the covenant sign: male circumcision.",
    "Lutheran": "God institutes circumcision as the sign of the covenant.",
    "Presbyterian": "God institutes circumcision as the sign and seal of the covenant.",
    "Pentecostal": "God gives the specific covenant sign: male circumcision.",
    "Anglican": "God specifies the covenant sign: circumcision of every male.",
    "Orthodox": "God institutes circumcision as the sign of the covenant for all males."
  },
  "11": {
    "General": "'You are to undergo circumcision, and it will be the sign of the covenant between me and you.'",
    "Non-Denominational": "Circumcision is explicitly designated as the physical marker signifying the covenant relationship between God and Abraham's people.",
    "Baptist": "Circumcision is the visible sign of the covenant relationship.",
    "Catholic": "Circumcision is mandated as the external sign marking the covenant bond.",
    "Methodist": "Circumcision serves as the tangible sign of the covenant.",
    "Lutheran": "Circumcision is the sign of the covenant.",
    "Presbyterian": "Circumcision is designated as the covenant sign.",
    "Pentecostal": "Circumcision is the physical sign of the covenant.",
    "Anglican": "Circumcision is explicitly stated to be the sign of the covenant.",
    "Orthodox": "Circumcision will serve as the sign of the covenant."
  },
  "12": {
    "General": "'For the generations to come every male among you who is eight days old must be circumcised, including those born in your household or bought with money from a foreigner—those who are not your offspring.'",
    "Non-Denominational": "Specifies the timing (eighth day) and the inclusivity of the sign: applies to all males within the covenant community, whether born into it or joined via servitude/purchase.",
    "Baptist": "Details the practice: on the eighth day, including servants.",
    "Catholic": "Specifies the timing (eighth day) and scope (all household males, born or acquired) for circumcision.",
    "Methodist": "Gives specifics: eighth day, applies to all males in the household.",
    "Lutheran": "Commands circumcision on the eighth day for all males, including servants.",
    "Presbyterian": "Specifies the timing (eighth day) and scope (all household males) of circumcision.",
    "Pentecostal": "Details the command: eighth day, includes everyone in the household.",
    "Anglican": "Specifies the timing (eighth day) and scope (all males, including servants/foreigners) for circumcision.",
    "Orthodox": "Mandates circumcision on the eighth day for all males, including household members not of direct descent."
  },
  "13": {
    "General": "'Whether born in your household or bought with your money, they must be circumcised. My covenant in your flesh is to be an everlasting covenant.'",
    "Non-Denominational": "Reiterates the requirement's breadth and purpose: the physical mark signifies the everlasting nature of the covenant embodied in the people.",
    "Baptist": "Reaffirms the requirement for all males, marking the everlasting covenant physically.",
    "Catholic": "Reiterates the universal requirement within the household, emphasizing the physical mark of the everlasting covenant.",
    "Methodist": "Restates the requirement for all, linking the physical sign to the everlasting covenant.",
    "Lutheran": "Reiterates all must be circumcised as a sign of the everlasting covenant.",
    "Presbyterian": "Reiterates the requirement, emphasizing circumcision as the mark of the everlasting covenant.",
    "Pentecostal": "Emphasizes everyone must be circumcised, marking the everlasting covenant.",
    "Anglican": "Reiterates that all household males must be circumcised, calling it the everlasting covenant in their flesh.",
    "Orthodox": "Reaffirms the necessity of circumcision for all, signifying the eternal covenant physically."
  },
  "14": {
    "General": "'Any uncircumcised male, who has not been circumcised in the flesh, will be cut off from his people; he has broken my covenant.'",
    "Non-Denominational": "States the consequence of disobedience: failure to bear the covenant sign results in exclusion from the covenant community, signifying a breach of the relationship.",
    "Baptist": "Warns of the consequence for non-compliance: being cut off for breaking the covenant.",
    "Catholic": "Specifies the penalty for neglecting circumcision: exclusion from the covenant people for breaking the covenant.",
    "Methodist": "States the serious consequence of failing to be circumcised: exclusion from the community.",
    "Lutheran": "Warns that the uncircumcised breaks the covenant and will be cut off.",
    "Presbyterian": "Specifies the sanction for neglecting the covenant sign: being cut off from the covenant community.",
    "Pentecostal": "Warns that neglecting circumcision means breaking the covenant and being cut off.",
    "Anglican": "States the penalty for not being circumcised: being cut off from the people for breaking the covenant.",
    "Orthodox": "Declares that an uncircumcised male breaks the covenant and shall be cut off from the people."
  },
  "15": {
    "General": "God also said to Abraham, 'As for Sarai your wife, you are no longer to call her Sarai; her name will be Sarah.'",
    "Non-Denominational": "Parallel name change for Sarai ('My Princess') to Sarah ('Princess' or 'Noblewoman'), indicating her elevated role in the covenant plan.",
    "Baptist": "God changes Sarai's name to Sarah, signifying her role in the promise.",
    "Catholic": "God changes Sarai's name to Sarah ('Princess'), signifying her elevated status and role in the covenant.",
    "Methodist": "God changes Sarai's name to Sarah, indicating her key role.",
    "Lutheran": "God changes Sarai's name to Sarah ('Princess').",
    "Presbyterian": "God changes Sarai's name to Sarah, signifying her covenant role.",
    "Pentecostal": "God gives Sarai a new name, Sarah, meaning 'Princess'.",
    "Anglican": "God changes Sarai's name to Sarah.",
    "Orthodox": "God changes Sarai's name to Sarah ('Princess' or 'Ruler')."
  },
  "16": {
    "General": "'I will bless her and will surely give you a son by her. I will bless her so that she will be the mother of nations; kings of peoples will come from her.'",
    "Non-Denominational": "God explicitly promises a son *through Sarah*, blessing her directly and making her, like Abraham, a source of nations and kings.",
    "Baptist": "God promises to bless Sarah and give Abraham a son through her, making her a mother of nations.",
    "Catholic": "God promises to bless Sarah specifically, granting Abraham a son through her and making her a mother of nations and kings.",
    "Methodist": "God promises to bless Sarah, give Abraham a son by her, and make her a mother of nations.",
    "Lutheran": "God promises to bless Sarah, give Abraham a son by her, and make her a mother of nations.",
    "Presbyterian": "God promises to bless Sarah, give Abraham a son through her, making her a mother of nations.",
    "Pentecostal": "God promises to bless Sarah, give them a son through her, making her a mother of nations and kings.",
    "Anglican": "God promises to bless Sarah, give Abraham a son by her, and make her the mother of nations and kings.",
    "Orthodox": "God promises to bless Sarah, give Abraham a son through her, and make her a mother of nations and kings."
  },
  "17": {
    "General": "Abraham fell facedown; he laughed and said to himself, 'Will a son be born to a man a hundred years old? Will Sarah bear a child at the age of ninety?'",
    "Non-Denominational": "Abraham's reaction: reverence (facedown) mixed with incredulous laughter and internal questioning due to their advanced ages.",
    "Baptist": "Abraham reacts with reverence but also laughs in disbelief at the possibility given their ages.",
    "Catholic": "Abraham prostrates himself again but laughs inwardly, expressing human astonishment and doubt at the prospect of childbirth at such ages.",
    "Methodist": "Abraham responds with reverence but also laughs inwardly, finding the promise hard to believe.",
    "Lutheran": "Abraham falls facedown but laughs in disbelief considering their ages.",
    "Presbyterian": "Abraham reacts with reverence but also incredulous laughter and doubt.",
    "Pentecostal": "Abraham falls facedown but laughs, questioning the natural impossibility.",
    "Anglican": "Abraham falls facedown but laughs, questioning the possibility of having a child at their ages.",
    "Orthodox": "Abraham falls facedown but laughs, questioning the biological possibility due to age."
  },
  "18": {
    "General": "And Abraham said to God, 'If only Ishmael might live under your blessing! ('live before you')'",
    "Non-Denominational": "Abraham expresses concern for Ishmael, perhaps seeking confirmation that Ishmael is the intended heir or at least secure in God's favor.",
    "Baptist": "Abraham expresses concern for Ishmael, perhaps thinking he is the promised child.",
    "Catholic": "Abraham expresses concern for his existing son, Ishmael, pleading for him to live under God's favor.",
    "Methodist": "Abraham voices concern for Ishmael, asking for God's blessing upon him.",
    "Lutheran": "Abraham pleads for Ishmael to be blessed.",
    "Presbyterian": "Abraham expresses concern for Ishmael, asking that he might live in God's favor.",
    "Pentecostal": "Abraham asks God to let Ishmael live under His blessing.",
    "Anglican": "Abraham pleads with God for Ishmael to live under His blessing.",
    "Orthodox": "Abraham intercedes for Ishmael, asking that he might live before God."
  },
  "19": {
    "General": "Then God said, 'Yes, but your wife Sarah will bear you a son, and you will call him Isaac. I will establish my covenant with him as an everlasting covenant for his descendants after him.'",
    "Non-Denominational": "God firmly corrects/clarifies: Sarah *will* bear the son, named Isaac ('he laughs'), and the everlasting covenant will be established specifically through *him*.",
    "Baptist": "God reaffirms the promise is through Sarah's son, Isaac, who will carry the everlasting covenant.",
    "Catholic": "God confirms Sarah will bear Isaac ('he laughs'), and the everlasting covenant will be established through him and his line, not Ishmael.",
    "Methodist": "God clarifies: Sarah will bear Isaac, and the everlasting covenant passes through him.",
    "Lutheran": "God reaffirms Sarah will bear Isaac ('he laughs'), through whom the everlasting covenant will pass.",
    "Presbyterian": "God corrects Abraham: Sarah will bear Isaac, and the everlasting covenant will be established through him.",
    "Pentecostal": "God insists: Sarah will bear Isaac, and the everlasting covenant is with him.",
    "Anglican": "God confirms that Sarah will bear Isaac ('he laughs') and that the everlasting covenant will be established with him.",
    "Orthodox": "God confirms Sarah will bear Isaac ('Laughter'), establishing the eternal covenant with him."
  },
  "20": {
    "General": "'And as for Ishmael, I have heard you: I will surely bless him; I will make him fruitful and will greatly increase his numbers. He will be the father of twelve rulers, and I will make him into a great nation.'",
    "Non-Denominational": "God acknowledges Abraham's plea for Ishmael and grants a separate, significant blessing: fruitfulness, twelve rulers (princes), and becoming a great nation.",
    "Baptist": "God assures Abraham that Ishmael will also be blessed, fruitful, and become a great nation with twelve rulers.",
    "Catholic": "God assures Abraham He has heard his prayer for Ishmael, promising him blessings of fertility, twelve princes, and becoming a great nation.",
    "Methodist": "God promises to bless Ishmael too, making him fruitful and the father of twelve rulers/a great nation.",
    "Lutheran": "God promises to bless Ishmael also, making him fruitful and the father of twelve rulers.",
    "Presbyterian": "God assures Abraham that Ishmael will be blessed with fruitfulness and become a great nation.",
    "Pentecostal": "God promises to bless Ishmael, make him fruitful, father twelve rulers, and become a great nation.",
    "Anglican": "God promises to bless Ishmael also, making him fruitful, the father of twelve rulers, and a great nation.",
    "Orthodox": "God hears Abraham regarding Ishmael, promising him blessings, fruitfulness, twelve princes, and becoming a great nation."
  },
  "21": {
    "General": "'But my covenant I will establish with Isaac, whom Sarah will bear to you by this time next year.'",
    "Non-Denominational": "God firmly reiterates the distinction: the primary, everlasting *covenant* relationship belongs exclusively to Isaac, whose birth is predicted within the year.",
    "Baptist": "God clearly distinguishes that His specific covenant is with Isaac, due next year.",
    "Catholic": "God emphatically repeats that His covenant will be established with Isaac, born to Sarah the next year.",
    "Methodist": "God clearly states the covenant promise is established with Isaac, setting a timeframe.",
    "Lutheran": "God reiterates the covenant is with Isaac, to be born the next year.",
    "Presbyterian": "God reiterates that His covenant will be established with Isaac, not Ishmael, specifying the timing.",
    "Pentecostal": "God clarifies again: the covenant is established with Isaac, coming next year.",
    "Anglican": "God reiterates that His covenant will be established with Isaac, specifying the time of his birth.",
    "Orthodox": "God reaffirms that His covenant will be established with Isaac, born at this time next year."
  },
  "22": {
    "General": "When he had finished speaking with Abraham, God went up from him.",
    "Non-Denominational": "Marks the conclusion of this specific divine revelation and encounter.",
    "Baptist": "God concludes His conversation with Abraham.",
    "Catholic": "The divine audience concludes, and God departs from Abraham.",
    "Methodist": "The divine conversation ends, and God departs.",
    "Lutheran": "God finishes speaking and departs.",
    "Presbyterian": "God concludes His revelation to Abraham.",
    "Pentecostal": "God finishes speaking and departs.",
    "Anglican": "God finishes speaking with Abraham and departs.",
    "Orthodox": "God concludes His discourse with Abraham and ascends."
  },
  "23": {
    "General": "On that very day Abraham took his son Ishmael and all those born in his household or bought with his money, every male in his household, and circumcised them, as God told him.",
    "Non-Denominational": "Abraham demonstrates immediate and complete obedience to the command, circumcising Ishmael and all other males under his authority that same day.",
    "Baptist": "Abraham obeys God immediately and fully, circumcising his household.",
    "Catholic": "Abraham demonstrates prompt and exact obedience, circumcising his entire household (Ishmael included) on the same day as commanded.",
    "Methodist": "Abraham obeys immediately, circumcising Ishmael and all males in his household.",
    "Lutheran": "Abraham immediately obeys God and circumcises his household.",
    "Presbyterian": "Abraham demonstrates immediate covenant obedience by circumcising his entire household.",
    "Pentecostal": "Abraham shows faith through immediate action, circumcising everyone that day.",
    "Anglican": "Abraham obeys immediately on the same day, circumcising Ishmael and all the males of his household.",
    "Orthodox": "Abraham immediately obeys God, circumcising Ishmael and all males in his household that day."
  },
  "24": {
    "General": "Abraham was ninety-nine years old when he was circumcised,",
    "Non-Denominational": "Notes Abraham's advanced age when he personally underwent circumcision, fulfilling the command.",
    "Baptist": "Records Abraham's age (99) at his circumcision.",
    "Catholic": "States Abraham's age (99) when he was circumcised.",
    "Methodist": "Notes Abraham's age (99) at circumcision.",
    "Lutheran": "Abraham was 99 when circumcised.",
    "Presbyterian": "Records Abraham's age (99) at circumcision.",
    "Pentecostal": "States Abraham's age (99) when circumcised.",
    "Anglican": "States Abraham's age (ninety-nine) at circumcision.",
    "Orthodox": "Records Abraham's age (99) at his circumcision."
  },
  "25": {
    "General": "and his son Ishmael was thirteen;",
    "Non-Denominational": "Notes Ishmael's age (13) at his circumcision.",
    "Baptist": "Records Ishmael's age (13) at his circumcision.",
    "Catholic": "States Ishmael's age (13) when he was circumcised.",
    "Methodist": "Notes Ishmael's age (13) at circumcision.",
    "Lutheran": "Ishmael was 13 when circumcised.",
    "Presbyterian": "Records Ishmael's age (13) at circumcision.",
    "Pentecostal": "States Ishmael's age (13) when circumcised.",
    "Anglican": "States Ishmael's age (thirteen) at circumcision.",
    "Orthodox": "Records Ishmael's age (13) at his circumcision."
  },
  "26": {
    "General": "Abraham and his son Ishmael were both circumcised on that very day.",
    "Non-Denominational": "Emphasizes the shared timing of the circumcision for both Abraham and Ishmael.",
    "Baptist": "Reiterates Abraham and Ishmael were circumcised the same day.",
    "Catholic": "Emphasizes that Abraham and Ishmael underwent circumcision on the same day.",
    "Methodist": "Highlights Abraham and Ishmael being circumcised the same day.",
    "Lutheran": "Abraham and Ishmael were circumcised the same day.",
    "Presbyterian": "Emphasizes the simultaneous circumcision of Abraham and Ishmael.",
    "Pentecostal": "States Abraham and Ishmael were circumcised that same day.",
    "Anglican": "Reiterates that Abraham and Ishmael were circumcised on the same day.",
    "Orthodox": "Emphasizes Abraham and Ishmael were circumcised on the same day."
  },
  "27": {
    "General": "And every male in Abraham's household, including those born in his household or bought from a foreigner, was circumcised with him.",
    "Non-Denominational": "Reiterates the comprehensive scope of the obedience: all males associated with Abraham's household were included in the covenant sign.",
    "Baptist": "Confirms all males in the household were circumcised.",
    "Catholic": "Confirms the universal application of the command within Abraham's household, including servants.",
    "Methodist": "Confirms all males in the household were circumcised.",
    "Lutheran": "Confirms all males in the household were circumcised.",
    "Presbyterian": "Confirms the circumcision of all males in the household.",
    "Pentecostal": "Confirms every male in the household was circumcised.",
    "Anglican": "Confirms that all males in the household, born or bought, were circumcised with Abraham.",
    "Orthodox": "Reaffirms that all males in Abraham's household were circumcised with him."
  }
} 