{
  "_comment": "Interpretations for Genesis Chapter 20",
  "book": "Genesis",
  "chapter": "20",
  "verses": {
    "1": {
      "General": "Abraham moves from Mamre to the region of the Negev and lives between Kadesh and Shur. For a time he stays in Gerar.",
      "Non-Denominational": "Abraham moves from Mamre to the region of the Negev and lives between Kadesh and Shur. For a time he stays in Gerar.",
      "Baptist": "Narrates Abraham's geographical relocation southward towards Gerar.",
      "Catholic": "Records Abraham's journey southward into the Negev region, temporarily settling in Gerar, a Philistine area.",
      "Methodist": "Describes Abraham's migration pattern, moving south and temporarily residing in Gerar.",
      "Lutheran": "Abraham moves south, eventually settling for a time in Gerar.",
      "Presbyterian": "Narrates Abraham's relocation to the Negev and his stay in Gerar.",
      "Pentecostal": "Abraham relocates his household to the Negev region, staying near Gerar.",
      "Episcopalian/Anglican": "Abraham migrates south to the Negev region and temporarily settles in Gerar.",
      "Orthodox": "Describes Abraham's journey into the Negev and his temporary residence in Gerar.",
      "Other": "Abraham moves from Mamre to the region of the Negev and lives between Kadesh and Shur. For a time he stays in Gerar.",
      "Prefer not to say": "Abraham moves from Mamre to the region of the Negev and lives between Kadesh and Shur. For a time he stays in Gerar."
    },
    "2": {
      "General": "Abraham says of his wife Sarah, 'She is my sister.' Then Abimelech king of Gerar sends for Sarah and takes her.",
      "Non-Denominational": "Abraham says of his wife Sarah, 'She is my sister.' Then Abimelech king of Gerar sends for Sarah and takes her.",
      "Baptist": "Abraham repeats his earlier deception (cf. Gen 12), motivated by fear, leading Abimelech to take Sarah based on this falsehood.",
      "Catholic": "Abraham resorts to the same half-truth/deception used in Egypt, claiming Sarah is his sister out of fear for his life. This leads King Abimelech to take her into his harem.",
      "Methodist": "Fear leads Abraham to repeat his past mistake of deception, resulting in Sarah being taken by the local king.",
      "Lutheran": "Abraham, lacking faith and driven by fear, repeats the sin of deception concerning Sarah, causing Abimelech to take her.",
      "Presbyterian": "Abraham again resorts to deception out of fear, claiming Sarah is his sister, which leads to Abimelech taking her.",
      "Pentecostal": "Abraham repeats the 'sister' deception due to fear, resulting in Abimelech taking Sarah.",
      "Episcopalian/Anglican": "Repeating his earlier fearful deception from Egypt, Abraham claims Sarah is his sister, leading King Abimelech of Gerar to take her.",
      "Orthodox": "Abraham, succumbing to fear, repeats his earlier deception regarding Sarah, leading the pagan king Abimelech to take her.",
      "Other": "Abraham says of his wife Sarah, 'She is my sister.' Then Abimelech king of Gerar sends for Sarah and takes her.",
      "Prefer not to say": "Abraham says of his wife Sarah, 'She is my sister.' Then Abimelech king of Gerar sends for Sarah and takes her."
    },
    "3": {
      "General": "But God comes to Abimelech in a dream one night and says to him, 'You are as good as dead because of the woman you have taken; she is a married woman.'",
      "Non-Denominational": "But God comes to Abimelech in a dream one night and says to him, 'You are as good as dead because of the woman you have taken; she is a married woman.'",
      "Baptist": "God intervenes directly through a dream to warn the pagan king Abimelech, protecting Sarah and revealing the truth.",
      "Catholic": "God intervenes supernaturally through a dream to warn the pagan king Abimelech of his unwitting sin (taking a married woman) and the deadly consequences.",
      "Methodist": "God intervenes in mercy and justice, warning Abimelech in a dream to prevent a greater sin and protect Sarah.",
      "Lutheran": "God mercifully intervenes through a dream, warning Abimelech (a pagan) of his dangerous situation due to Abraham's deception.",
      "Presbyterian": "God directly intervenes via a dream to warn Abimelech, protecting His covenant purposes concerning Sarah despite Abraham's failure.",
      "Pentecostal": "Divine intervention through a dream: God warns Abimelech about Sarah's marital status.",
      "Episcopalian/Anglican": "God intervenes supernaturally, warning King Abimelech in a dream that Sarah is married and he faces death for taking her.",
      "Orthodox": "God intervenes directly, revealing the truth to the pagan king in a dream and warning him of the mortal danger he is in.",
      "Other": "But God comes to Abimelech in a dream one night and says to him, 'You are as good as dead because of the woman you have taken; she is a married woman.'",
      "Prefer not to say": "But God comes to Abimelech in a dream one night and says to him, 'You are as good as dead because of the woman you have taken; she is a married woman.'"
    },
    "4": {
      "General": "Now Abimelech had not gone near her, so he says, 'Lord, will you destroy an innocent nation?'",
      "Non-Denominational": "Now Abimelech had not gone near her, so he says, 'Lord, will you destroy an innocent nation?'",
      "Baptist": "Abimelech protests his innocence, emphasizing he had not consummated the relationship, and appeals to God's justice.",
      "Catholic": "Abimelech asserts his innocence (having not touched Sarah) and appeals to God's justice, questioning if God would punish a nation for an unwitting offense.",
      "Methodist": "Abimelech pleads his case based on his lack of consummation and appeals to God's fairness.",
      "Lutheran": "Abimelech pleads his innocence (he hadn't touched Sarah) and appeals to God's justice, questioning punishment for the unknowing.",
      "Presbyterian": "Abimelech protests his innocence, having not consummated the union, and appeals to God's justice.",
      "Pentecostal": "Abimelech declares his innocence in the matter, having not approached Sarah.",
      "Episcopalian/Anglican": "Abimelech protests his innocence to God, stating he hasn't touched Sarah, and questions if God would destroy an innocent people.",
      "Orthodox": "Abimelech appeals to God's justice, declaring his innocence in action (not having approached Sarah) and questioning collective punishment.",
      "Other": "Now Abimelech had not gone near her, so he says, 'Lord, will you destroy an innocent nation?'",
      "Prefer not to say": "Now Abimelech had not gone near her, so he says, 'Lord, will you destroy an innocent nation?'"
    },
    "5": {
      "General": "'Did he not say to me, \"She is my sister,\" and didn’t she also say, \"He is my brother\"? I have done this with a clear conscience and clean hands.'",
      "Non-Denominational": "'Did he not say to me, \"She is my sister,\" and didn’t she also say, \"He is my brother\"? I have done this with a clear conscience and clean hands.'",
      "Baptist": "Abimelech justifies his actions based on the information given by both Abraham and Sarah, claiming subjective innocence.",
      "Catholic": "Abimelech explains he acted based on the explicit statements of both Abraham and Sarah, claiming he acted in good faith ('clear conscience and clean hands').",
      "Methodist": "Abimelech points to the consistent deception by both Abraham and Sarah as the basis for his actions, claiming innocence of intent.",
      "Lutheran": "Abimelech points out that both Abraham and Sarah perpetuated the deception, thus justifying his claim of acting with integrity based on what he was told.",
      "Presbyterian": "Abimelech defends his actions by citing the consistent testimony of Abraham and Sarah, claiming innocence based on their deception.",
      "Pentecostal": "Abimelech justifies his actions, pointing out that both Abraham and Sarah misled him.",
      "Episcopalian/Anglican": "Abimelech further justifies himself by stating both Abraham and Sarah corroborated the 'sister' story, hence he acted with integrity.",
      "Orthodox": "Abimelech points to the consistent deception from both Abraham and Sarah as the reason for his action, claiming innocence of intent.",
      "Other": "'Did he not say to me, \"She is my sister,\" and didn’t she also say, \"He is my brother\"? I have done this with a clear conscience and clean hands.'",
      "Prefer not to say": "'Did he not say to me, \"She is my sister,\" and didn’t she also say, \"He is my brother\"? I have done this with a clear conscience and clean hands.'"
    },
    "6": {
      "General": "Then God says to him in the dream, 'Yes, I know you did this with a clear conscience, and so I have kept you from sinning against me. That is why I did not let you touch her.'",
      "Non-Denominational": "Then God says to him in the dream, 'Yes, I know you did this with a clear conscience, and so I have kept you from sinning against me. That is why I did not let you touch her.'",
      "Baptist": "God acknowledges Abimelech's subjective innocence but reveals His sovereign intervention prevented the actual sin from occurring.",
      "Catholic": "God affirms Abimelech's lack of malicious intent but clarifies that it was divine intervention ('I have kept you') that prevented him from consummating the union and thus sinning directly against God (by violating marriage).",
      "Methodist": "God acknowledges Abimelech's clear conscience but reveals His prevenient grace prevented the sin, highlighting divine sovereignty in protection.",
      "Lutheran": "God acknowledges Abimelech's subjective innocence but reveals it was God's own intervention that restrained him from sinning and touching Sarah.",
      "Presbyterian": "God acknowledges Abimelech's innocent intent but reveals His sovereign intervention prevented the consummation, thus keeping Abimelech from sinning against Him.",
      "Pentecostal": "God confirms Abimelech's clear conscience but reveals He sovereignly prevented the sin from taking place.",
      "Episcopalian/Anglican": "God acknowledges Abimelech's clear conscience but states it was His own intervention that prevented Abimelech from touching Sarah and thus sinning against God.",
      "Orthodox": "God confirms Abimelech's lack of ill intent but reveals His providential intervention prevented the sin of adultery, demonstrating God's protection over Sarah.",
      "Other": "Then God says to him in the dream, 'Yes, I know you did this with a clear conscience, and so I have kept you from sinning against me. That is why I did not let you touch her.'",
      "Prefer not to say": "Then God says to him in the dream, 'Yes, I know you did this with a clear conscience, and so I have kept you from sinning against me. That is why I did not let you touch her.'"
    },
    "7": {
      "General": "'Now return the man’s wife, for he is a prophet, and he will pray for you and you will live. But if you do not return her, you may be sure that you and all who belong to you will die.'",
      "Non-Denominational": "'Now return the man’s wife, for he is a prophet, and he will pray for you and you will live. But if you do not return her, you may be sure that you and all who belong to you will die.'",
      "Baptist": "God commands the return of Sarah, reveals Abraham's status as a prophet (despite his failing), and links Abimelech's life to Abraham's intercession. Disobedience means death.",
      "Catholic": "God commands restitution (return Sarah), reveals Abraham's status as a prophet (whose prayer is efficacious), and ties Abimelech's fate (life or death for him and his household) to obedience and Abraham's intercession.",
      "Methodist": "God instructs Abimelech to restore Sarah, highlighting Abraham's role as a prophet and mediator. Obedience leads to life through prayer; disobedience leads to death.",
      "Lutheran": "God commands Sarah's return, identifies Abraham as a prophet (despite his sin), and makes Abimelech's life dependent on Abraham's prayer, highlighting intercession. Failure to obey ensures death.",
      "Presbyterian": "God commands Sarah's return, identifies Abraham as a prophet whose intercession is necessary for Abimelech's life, demonstrating covenant protection and the consequence of disobedience.",
      "Pentecostal": "God commands Sarah's return, reveals Abraham is a prophet who will pray for Abimelech's healing, warning of death for disobedience.",
      "Episcopalian/Anglican": "God commands Abimelech to return Sarah, identifying Abraham as a prophet whose intercessory prayer is needed for Abimelech to live. Failure to comply means certain death for his household.",
      "Orthodox": "God commands the return of Sarah, reveals Abraham's prophetic office (linking him to divine communication and intercession), and makes Abimelech's life contingent on obedience and Abraham's prayer.",
      "Other": "'Now return the man’s wife, for he is a prophet, and he will pray for you and you will live. But if you do not return her, you may be sure that you and all who belong to you will die.'",
      "Prefer not to say": "'Now return the man’s wife, for he is a prophet, and he will pray for you and you will live. But if you do not return her, you may be sure that you and all who belong to you will die.'"
    },
    "8": {
      "General": "Early the next morning, Abimelech calls all his officials and tells them everything that had happened, and the men are very frightened.",
      "Non-Denominational": "Early the next morning, Abimelech calls all his officials and tells them everything that had happened, and the men are very frightened.",
      "Baptist": "Abimelech acts promptly on God's warning, informing his court, who react with appropriate fear.",
      "Catholic": "Abimelech responds immediately to the divine warning, informing his advisors, whose fear reflects a recognition of the seriousness of offending the divine.",
      "Methodist": "Abimelech takes the divine warning seriously, sharing it with his officials, who respond with fear.",
      "Lutheran": "Abimelech immediately informs his servants of God's warning, and they react with proper fear.",
      "Presbyterian": "Abimelech acts quickly on the divine revelation, and his officials respond with appropriate fear.",
      "Pentecostal": "Abimelech immediately shares the divine warning, causing fear among his officials.",
      "Episcopalian/Anglican": "Abimelech acts promptly on the warning, informing his officials, who are understandably terrified.",
      "Orthodox": "Abimelech immediately communicates the divine warning to his court, and they react with fear before God's power.",
      "Other": "Early the next morning, Abimelech calls all his officials and tells them everything that had happened, and the men are very frightened.",
      "Prefer not to say": "Early the next morning, Abimelech calls all his officials and tells them everything that had happened, and the men are very frightened."
    },
    "9": {
      "General": "Then Abimelech calls Abraham in and says, 'What have you done to us? How have I wronged you that you brought such great guilt upon me and my kingdom? You have done things to me that should not be done.'",
      "Non-Denominational": "Then Abimelech calls Abraham in and says, 'What have you done to us? How have I wronged you that you brought such great guilt upon me and my kingdom? You have done things to me that should not be done.'",
      "Baptist": "Abimelech confronts Abraham, highlighting the potential disaster caused by Abraham's deception and calling his actions improper.",
      "Catholic": "Abimelech summons Abraham and justly rebukes him, pointing out the grave consequences ('great guilt') Abraham's lie brought upon his innocent kingdom and deeming Abraham's actions morally wrong.",
      "Methodist": "Abimelech directly confronts Abraham about the wrongness and potential consequences of his deception.",
      "Lutheran": "Abimelech rightly rebukes Abraham for the deception that nearly brought disaster upon his kingdom, calling the action inappropriate.",
      "Presbyterian": "Abimelech confronts Abraham, justly accusing him of bringing guilt upon the kingdom through his improper and deceitful actions.",
      "Pentecostal": "Abimelech confronts Abraham, pointing out the severity of the situation caused by his lie.",
      "Episcopalian/Anglican": "Abimelech summons Abraham and rebukes him for his deception, highlighting the guilt and potential disaster it brought upon his kingdom.",
      "Orthodox": "Abimelech confronts Abraham, highlighting the moral wrong and dangerous consequences of Abraham's deceit.",
      "Other": "Then Abimelech calls Abraham in and says, 'What have you done to us? How have I wronged you that you brought such great guilt upon me and my kingdom? You have done things to me that should not be done.'",
      "Prefer not to say": "Then Abimelech calls Abraham in and says, 'What have you done to us? How have I wronged you that you brought such great guilt upon me and my kingdom? You have done things to me that should not be done.'"
    },
    "10": {
      "General": "And Abimelech asks Abraham, 'What was your reason for doing this?'",
      "Non-Denominational": "And Abimelech asks Abraham, 'What was your reason for doing this?'",
      "Baptist": "Abimelech seeks the motivation behind Abraham's dangerous lie.",
      "Catholic": "Abimelech inquires into Abraham's motive for such a serious deception.",
      "Methodist": "Abimelech probes Abraham's reasoning for the deceptive act.",
      "Lutheran": "Abimelech asks Abraham to explain his motive for the deception.",
      "Presbyterian": "Abimelech questions Abraham's motivation for the deception.",
      "Pentecostal": "Abimelech asks Abraham for his reasoning.",
      "Episcopalian/Anglican": "Abimelech asks Abraham to explain his motivation for the deception.",
      "Orthodox": "Abimelech questions Abraham's rationale for his deceitful action.",
      "Other": "And Abimelech asks Abraham, 'What was your reason for doing this?'",
      "Prefer not to say": "And Abimelech asks Abraham, 'What was your reason for doing this?'"
    },
    "11": {
      "General": "Abraham replies, 'I said to myself, \"There is surely no fear of God in this place, and they will kill me because of my wife.\"'",
      "Non-Denominational": "Abraham replies, 'I said to myself, \"There is surely no fear of God in this place, and they will kill me because of my wife.\"'",
      "Baptist": "Abraham admits his motivation was fear, assuming the Gentiles lacked morals ('no fear of God') and would kill him for Sarah.",
      "Catholic": "Abraham explains his rationale: fear based on prejudice. He assumed Gerar lacked reverence for God ('no fear of God') and consequently lacked morality, leading him to fear for his life over Sarah.",
      "Methodist": "Abraham reveals his fear was based on a prejudiced assumption about the morality of the people of Gerar.",
      "Lutheran": "Abraham confesses his motive was fear, stemming from his faithless assumption that the people of Gerar, lacking the 'fear of God', would kill him.",
      "Presbyterian": "Abraham explains his action stemmed from fear, based on the assumption that Gerar lacked the 'fear of God' and moral restraint.",
      "Pentecostal": "Abraham explains his fear was based on the assumption that the locals lacked the fear of God.",
      "Episcopalian/Anglican": "Abraham explains he acted out of fear, assuming there was no 'fear of God' in Gerar and they would kill him for Sarah.",
      "Orthodox": "Abraham reveals his motivation was fear, stemming from a prejudiced judgment that the pagan inhabitants lacked the 'fear of God' and moral restraint.",
      "Other": "Abraham replies, 'I said to myself, \"There is surely no fear of God in this place, and they will kill me because of my wife.\"'",
      "Prefer not to say": "Abraham replies, 'I said to myself, \"There is surely no fear of God in this place, and they will kill me because of my wife.\"'"
    },
    "12": {
      "General": "'Besides, she really is my sister, the daughter of my father though not of my mother; and she became my wife.'",
      "Non-Denominational": "'Besides, she really is my sister, the daughter of my father though not of my mother; and she became my wife.'",
      "Baptist": "Abraham justifies his statement as a half-truth; Sarah was his half-sister.",
      "Catholic": "Abraham offers further justification by revealing the partial truth: Sarah was indeed his half-sister (sharing the same father but not the same mother).",
      "Methodist": "Abraham clarifies the partial truth behind his statement – Sarah was his half-sister.",
      "Lutheran": "Abraham explains the half-truth: Sarah genuinely was his half-sister.",
      "Presbyterian": "Abraham explains the technical truth behind his deception: Sarah was his half-sister.",
      "Pentecostal": "Abraham explains the partial truth: Sarah was his half-sister.",
      "Episcopalian/Anglican": "Abraham adds that she is, in fact, his half-sister (same father, different mother).",
      "Orthodox": "Abraham reveals the half-truth underlying his deception: Sarah was his half-sister.",
      "Other": "'Besides, she really is my sister, the daughter of my father though not of my mother; and she became my wife.'",
      "Prefer not to say": "'Besides, she really is my sister, the daughter of my father though not of my mother; and she became my wife.'"
    },
    "13": {
      "General": "'And when God had me wander from my father’s household, I said to her, \"This is how you can show your love to me: Everywhere we go, say of me, ‘He is my brother.’\"'",
      "Non-Denominational": "'And when God had me wander from my father’s household, I said to her, \"This is how you can show your love to me: Everywhere we go, say of me, ‘He is my brother.’\"'",
      "Baptist": "Abraham reveals this deceptive strategy was a long-standing agreement with Sarah, initiated when he first left home under God's call.",
      "Catholic": "Abraham reveals this deception was a pre-arranged pact with Sarah, dating back to when God called him to leave his homeland, presented as an act of loyalty ('love') from her.",
      "Methodist": "Abraham explains this was a long-term strategy agreed upon with Sarah when they began their journeys.",
      "Lutheran": "Abraham explains this deception was a pre-arranged agreement with Sarah since the time God called him to wander.",
      "Presbyterian": "Abraham reveals the deception was a pre-meditated strategy agreed upon with Sarah when God called him to leave Ur.",
      "Pentecostal": "Abraham explains this deceptive plan was agreed upon with Sarah from the beginning of their journey.",
      "Episcopalian/Anglican": "Abraham explains this deception was a long-standing agreement made with Sarah when God first sent him wandering.",
      "Orthodox": "Abraham reveals the deceptive practice was a pre-established agreement with Sarah since leaving his homeland, framing it as an act of loyalty.",
      "Other": "'And when God had me wander from my father’s household, I said to her, \"This is how you can show your love to me: Everywhere we go, say of me, ‘He is my brother.’\"'",
      "Prefer not to say": "'And when God had me wander from my father’s household, I said to her, \"This is how you can show your love to me: Everywhere we go, say of me, ‘He is my brother.’\"'"
    },
    "14": {
      "General": "Then Abimelech brought sheep and cattle and male and female slaves and gave them to Abraham, and he returned Sarah his wife to him.",
      "Non-Denominational": "Then Abimelech brought sheep and cattle and male and female slaves and gave them to Abraham, and he returned Sarah his wife to him.",
      "Baptist": "Abimelech makes restitution, returning Sarah and giving gifts to Abraham, demonstrating his integrity despite being deceived.",
      "Catholic": "Abimelech acts promptly on God's command: he restores Sarah and provides generous gifts (livestock, slaves) to Abraham as compensation or appeasement.",
      "Methodist": "Abimelech restores Sarah and gives gifts, acting honorably to rectify the situation caused by Abraham's lie.",
      "Lutheran": "Abimelech returns Sarah and gives Abraham generous gifts, acting righteously according to God's command.",
      "Presbyterian": "Abimelech restores Sarah and gives Abraham gifts, demonstrating his desire to make amends and appease God.",
      "Pentecostal": "Abimelech obeys God, returns Sarah, and gives gifts to Abraham.",
      "Episcopalian/Anglican": "Abimelech returns Sarah to Abraham and gives him significant gifts (livestock, slaves) as restitution.",
      "Orthodox": "Abimelech promptly obeys God, returning Sarah and offering gifts to Abraham, demonstrating respect for God's warning.",
      "Other": "Then Abimelech brought sheep and cattle and male and female slaves and gave them to Abraham, and he returned Sarah his wife to him.",
      "Prefer not to say": "Then Abimelech brought sheep and cattle and male and female slaves and gave them to Abraham, and he returned Sarah his wife to him."
    },
    "15": {
      "General": "And Abimelech said, 'My land is before you; live wherever you like.'",
      "Non-Denominational": "And Abimelech said, 'My land is before you; live wherever you like.'",
      "Baptist": "Abimelech further shows goodwill by offering Abraham freedom to settle anywhere in his territory.",
      "Catholic": "Abimelech extends further favor, offering Abraham free settlement rights within his territory.",
      "Methodist": "Abimelech offers Abraham land and security within his kingdom.",
      "Lutheran": "Abimelech offers Abraham freedom to dwell anywhere in his land.",
      "Presbyterian": "Abimelech offers Abraham the right to dwell freely in his land.",
      "Pentecostal": "Abimelech offers Abraham freedom to live in his land.",
      "Episcopalian/Anglican": "Abimelech generously offers Abraham the freedom to settle anywhere in his land.",
      "Orthodox": "Abimelech extends hospitality and favor by granting Abraham permission to live anywhere in Gerar.",
      "Other": "And Abimelech said, 'My land is before you; live wherever you like.'",
      "Prefer not to say": "And Abimelech said, 'My land is before you; live wherever you like.'"
    },
    "16": {
      "General": "To Sarah he said, 'I am giving your brother a thousand shekels of silver. This is to cover the offense against you before all who are with you; you are completely vindicated.'",
      "Non-Denominational": "To Sarah he said, 'I am giving your brother a thousand shekels of silver. This is to cover the offense against you before all who are with you; you are completely vindicated.'",
      "Baptist": "Abimelech specifically addresses Sarah, offering a large sum of money to Abraham (her 'brother') as a public vindication of her honor.",
      "Catholic": "Abimelech addresses Sarah directly, giving a substantial sum (1000 shekels) to Abraham (her supposed brother) as a public gesture to clear her reputation ('cover the offense') and affirm her innocence.",
      "Methodist": "Abimelech makes a public gesture of restitution to Sarah, giving money to restore her honor and publicly clear her name.",
      "Lutheran": "Abimelech gives a large sum to Abraham as a public sign of Sarah's vindication and to cover any reproach against her.",
      "Presbyterian": "Abimelech gives a substantial payment intended as a public sign to vindicate Sarah and clear her reputation.",
      "Pentecostal": "Abimelech gives money to publicly vindicate Sarah's honor.",
      "Episcopalian/Anglican": "Abimelech specifically addresses Sarah, giving Abraham (her 'brother') 1000 shekels of silver as a public sign to vindicate her honor.",
      "Orthodox": "Abimelech addresses Sarah, offering a large sum to Abraham as a public testimony to her innocence and vindication.",
      "Other": "To Sarah he said, 'I am giving your brother a thousand shekels of silver. This is to cover the offense against you before all who are with you; you are completely vindicated.'",
      "Prefer not to say": "To Sarah he said, 'I am giving your brother a thousand shekels of silver. This is to cover the offense against you before all who are with you; you are completely vindicated.'"
    },
    "17": {
      "General": "Then Abraham prayed to God, and God healed Abimelech, his wife and his female slaves so they could have children again,",
      "Non-Denominational": "Then Abraham prayed to God, and God healed Abimelech, his wife and his female slaves so they could have children again,",
      "Baptist": "Abraham fulfills his prophetic role through intercessory prayer, leading to God healing Abimelech's household from barrenness.",
      "Catholic": "Abraham acts as the prophet foretold, interceding for Abimelech. God responds to Abraham's prayer by healing the king and restoring fertility to the women of his household.",
      "Methodist": "Abraham intercedes as instructed, and God responds by healing the affliction (barrenness) brought upon Abimelech's household.",
      "Lutheran": "Abraham prays as God commanded, and God heals Abimelech and his household, demonstrating the power of prophetic intercession.",
      "Presbyterian": "Abraham fulfills his prophetic function by praying for Abimelech, and God heals the household's affliction (infertility).",
      "Pentecostal": "Abraham prays, and God heals Abimelech and his household, restoring fertility.",
      "Episcopalian/Anglican": "Abraham prays for Abimelech as instructed, and God heals Abimelech and removes the barrenness afflicted upon his household.",
      "Orthodox": "Abraham fulfills his role as intercessor, praying for the pagan king, and God heals the affliction He had placed on the household.",
      "Other": "Then Abraham prayed to God, and God healed Abimelech, his wife and his female slaves so they could have children again,",
      "Prefer not to say": "Then Abraham prayed to God, and God healed Abimelech, his wife and his female slaves so they could have children again,"
    },
    "18": {
      "General": "for the Lord had kept all the women in Abimelech’s household from conceiving because of Abraham’s wife Sarah.",
      "Non-Denominational": "for the Lord had kept all the women in Abimelech’s household from conceiving because of Abraham’s wife Sarah.",
      "Baptist": "Explains the nature of the affliction: God had sovereignly prevented childbirth in Abimelech's household as a consequence of Sarah being taken.",
      "Catholic": "Clarifies the earlier consequence: God had inflicted infertility upon Abimelech's entire household because Sarah had been taken.",
      "Methodist": "Reveals the specific judgment God had placed on the household – temporary barrenness – due to the offense concerning Sarah.",
      "Lutheran": "Explains the prior judgment: God had closed the wombs in Abimelech's household because of the situation with Sarah.",
      "Presbyterian": "Explains the judgment God had imposed: infertility upon the household due to Abimelech taking Sarah.",
      "Pentecostal": "Clarifies that God had caused barrenness in the household because of Sarah.",
      "Episcopalian/Anglican": "Explains that the Lord had previously afflicted Abimelech's household with barrenness because he had taken Sarah.",
      "Orthodox": "Clarifies that the infertility experienced by the household was a direct result of God's judgment for taking Sarah.",
      "Other": "for the Lord had kept all the women in Abimelech’s household from conceiving because of Abraham’s wife Sarah.",
      "Prefer not to say": "for the Lord had kept all the women in Abimelech’s household from conceiving because of Abraham’s wife Sarah."
    }
  }
}

</rewritten_file>