{
    "_comment": "Interpretations for Genesis Chapter 21",
    "book": "Genesis",
    "chapter": "21",
    "verses": {
      "1": {
        "General": "Now the Lord was gracious to Sarah as he had said, and the Lord did for Sarah what he had promised.",
        "Non-Denominational": "Now the Lord was gracious to Sarah as he had said, and the Lord did for Sarah what he had promised.",
        "Baptist": "Highlights God's faithfulness in fulfilling His specific promise to Sarah concerning Isaac's birth.",
        "Catholic": "Emphasizes God's fidelity to His word: He visited Sarah with grace and fulfilled His specific promise regarding the conception of Isaac.",
        "Methodist": "God's faithfulness and grace are demonstrated as He fulfills the long-awaited promise to Sarah.",
        "Lutheran": "The Lord demonstrates His faithfulness by acting according to His promise, showing grace to Sarah.",
        "Presbyterian": "Highlights God's sovereign faithfulness in fulfilling His covenant promise to Sarah exactly as He had declared.",
        "Pentecostal": "God's direct intervention and faithfulness are shown in fulfilling the promise to Sarah.",
        "Episcopalian/Anglican": "The narrative emphasizes the Lord's faithfulness in fulfilling His specific promise to Sarah.",
        "Orthodox": "God manifests His grace and faithfulness by fulfilling His promise to Sarah, demonstrating His power over nature.",
        "Other": "Now the Lord was gracious to Sarah as he had said, and the Lord did for Sarah what he had promised.",
        "Prefer not to say": "Now the Lord was gracious to Sarah as he had said, and the Lord did for Sarah what he had promised."
      },
      "2": {
        "General": "Sarah became pregnant and bore a son to Abraham in his old age, at the very time God had promised him.",
        "Non-Denominational": "Sarah became pregnant and bore a son to Abraham in his old age, at the very time God had promised him.",
        "Baptist": "Records the miraculous birth of Isaac, emphasizing the fulfillment at the precise time God had appointed.",
        "Catholic": "Records the miraculous conception and birth of Isaac to elderly Abraham and Sarah, stressing the fulfillment occurred exactly at the divinely appointed time.",
        "Methodist": "The miracle unfolds: Sarah conceives and gives birth to Isaac in Abraham's old age, precisely when God said it would happen.",
        "Lutheran": "Sarah conceives and bears the promised son, Isaac, in Abraham's old age, exactly at the time God foretold.",
        "Presbyterian": "Records the miraculous birth of Isaac to Abraham and Sarah in their old age, emphasizing the fulfillment at the specific time God decreed.",
        "Pentecostal": "The miracle of Isaac's birth occurs exactly as and when God promised.",
        "Episcopalian/Anglican": "Sarah miraculously conceives and bears Isaac in Abraham's old age, precisely at the time God had specified.",
        "Orthodox": "The miraculous birth of Isaac to the aged Abraham and Sarah takes place at the exact time prophesied by God.",
        "Other": "Sarah became pregnant and bore a son to Abraham in his old age, at the very time God had promised him.",
        "Prefer not to say": "Sarah became pregnant and bore a son to Abraham in his old age, at the very time God had promised him."
      },
      "3": {
        "General": "Abraham gave the name Isaac to the son Sarah bore him.",
        "Non-Denominational": "Abraham gave the name Isaac to the son Sarah bore him.",
        "Baptist": "Abraham obeys God by naming the son Isaac ('he laughs'), as previously commanded (Gen 17:19).",
        "Catholic": "Abraham obediently names the child Isaac ('Laughter'), according to God's prior instruction (Gen 17:19).",
        "Methodist": "Abraham names the son Isaac, reflecting the laughter of disbelief (Sarah) and joy (Abraham/Sarah).",
        "Lutheran": "Abraham names the son Isaac ('Laughter') as God commanded.",
        "Presbyterian": "Abraham names his son Isaac ('Laughter'), as commanded by God, acknowledging the fulfillment of the promise.",
        "Pentecostal": "Abraham names the child Isaac, meaning laughter.",
        "Episcopalian/Anglican": "Abraham names the son Isaac ('he laughs'), as instructed by God.",
        "Orthodox": "Abraham gives the child the name Isaac ('Laughter'), signifying the joy and wonder of the fulfillment.",
        "Other": "Abraham gave the name Isaac to the son Sarah bore him.",
        "Prefer not to say": "Abraham gave the name Isaac to the son Sarah bore him."
      },
      "4": {
        "General": "When his son Isaac was eight days old, Abraham circumcised him, as God commanded him.",
        "Non-Denominational": "When his son Isaac was eight days old, Abraham circumcised him, as God commanded him.",
        "Baptist": "Abraham demonstrates continued obedience by circumcising Isaac on the eighth day, fulfilling the covenant sign.",
        "Catholic": "Abraham faithfully observes the covenant sign, circumcising Isaac on the eighth day as explicitly commanded by God (Gen 17:12).",
        "Methodist": "Abraham obeys the covenant requirement, circumcising Isaac as a sign of belonging to God's chosen people.",
        "Lutheran": "Abraham circumcises Isaac on the eighth day, obediently applying the sign of the covenant as commanded.",
        "Presbyterian": "Abraham demonstrates covenant faithfulness by circumcising Isaac on the eighth day, marking him as a child of the covenant.",
        "Pentecostal": "Abraham obeys God's command regarding circumcision as the covenant sign.",
        "Episcopalian/Anglican": "Abraham obediently circumcises Isaac on the eighth day, fulfilling the covenant requirement.",
        "Orthodox": "Abraham fulfills the commandment regarding circumcision, marking Isaac's entrance into the covenant people.",
        "Other": "When his son Isaac was eight days old, Abraham circumcised him, as God commanded him.",
        "Prefer not to say": "When his son Isaac was eight days old, Abraham circumcised him, as God commanded him."
      },
      "5": {
        "General": "Abraham was a hundred years old when his son Isaac was born to him.",
        "Non-Denominational": "Abraham was a hundred years old when his son Isaac was born to him.",
        "Baptist": "Reiterates Abraham's advanced age to emphasize the miraculous nature of the birth.",
        "Catholic": "Restates Abraham's extreme age (100 years) at Isaac's birth, further underscoring the miraculous fulfillment of God's promise.",
        "Methodist": "Highlights Abraham's age (100) to emphasize the miracle and God's timing.",
        "Lutheran": "Abraham's age (100) is noted, highlighting the miracle of the promised birth.",
        "Presbyterian": "Notes Abraham's age (100) to underscore the miraculous nature of Isaac's birth.",
        "Pentecostal": "Emphasizes the miracle by stating Abraham's age (100) at Isaac's birth.",
        "Episcopalian/Anglican": "The text notes Abraham's age (100) to underscore the miracle.",
        "Orthodox": "Reemphasizes Abraham's advanced age (100) to highlight the supernatural character of Isaac's birth.",
        "Other": "Abraham was a hundred years old when his son Isaac was born to him.",
        "Prefer not to say": "Abraham was a hundred years old when his son Isaac was born to him."
      },
      "6": {
        "General": "Sarah said, 'God has brought me laughter, and everyone who hears about this will laugh with me.'",
        "Non-Denominational": "Sarah said, 'God has brought me laughter, and everyone who hears about this will laugh with me.'",
        "Baptist": "Sarah's earlier laughter of doubt is transformed into laughter of joy and testimony; others will share in this joyous miracle.",
        "Catholic": "Sarah expresses profound joy. Her name for the child, Isaac ('Laughter'), initially reflecting disbelief, now signifies God-given joy that will be shared by others who hear.",
        "Methodist": "Sarah's response is pure joy ('laughter'), a transformation from her earlier skepticism. She anticipates shared joy among others.",
        "Lutheran": "Sarah's laughter now is one of pure joy given by God, replacing her earlier laugh of unbelief. This joy is contagious.",
        "Presbyterian": "Sarah acknowledges God as the source of her joyous laughter, transforming her earlier skepticism into public testimony.",
        "Pentecostal": "Sarah declares God has given her joyous laughter, replacing doubt.",
        "Episcopalian/Anglican": "Sarah expresses her joy, stating God has given her 'laughter' (playing on Isaac's name), a joy others will share.",
        "Orthodox": "Sarah articulates her overwhelming joy ('laughter') bestowed by God, turning her earlier doubt into joyful testimony.",
        "Other": "Sarah said, 'God has brought me laughter, and everyone who hears about this will laugh with me.'",
        "Prefer not to say": "Sarah said, 'God has brought me laughter, and everyone who hears about this will laugh with me.'"
      },
      "7": {
        "General": "And she added, 'Who would have said to Abraham that Sarah would nurse children? Yet I have borne him a son in his old age.'",
        "Non-Denominational": "And she added, 'Who would have said to Abraham that Sarah would nurse children? Yet I have borne him a son in his old age.'",
        "Baptist": "Sarah marvels at the impossibility of her situation (nursing a child at her age) now made possible by God.",
        "Catholic": "Sarah reflects on the sheer improbability and miraculous nature of her bearing and nursing a child at such an advanced age.",
        "Methodist": "Sarah reflects on the humanly impossible becoming reality through God's intervention.",
        "Lutheran": "Sarah expresses astonishment at the miracle, highlighting the contrast between human impossibility and God's fulfillment.",
        "Presbyterian": "Sarah voices her amazement at the fulfillment of the promise, emphasizing the humanly impossible nature of her nursing a child.",
        "Pentecostal": "Sarah marvels at the miracle of nursing a child in her old age.",
        "Episcopalian/Anglican": "Sarah expresses amazement at the fulfillment of the promise, emphasizing the unlikelihood of her nursing a child at her age.",
        "Orthodox": "Sarah expresses wonder at the miracle, contrasting the natural impossibility with the reality of God's fulfilled promise.",
        "Other": "And she added, 'Who would have said to Abraham that Sarah would nurse children? Yet I have borne him a son in his old age.'",
        "Prefer not to say": "And she added, 'Who would have said to Abraham that Sarah would nurse children? Yet I have borne him a son in his old age.'"
      },
      "8": {
        "General": "The child grew and was weaned, and on the day Isaac was weaned Abraham held a great feast.",
        "Non-Denominational": "The child grew and was weaned, and on the day Isaac was weaned Abraham held a great feast.",
        "Baptist": "Marks a significant milestone in Isaac's childhood (weaning, often around age 3), celebrated with a communal feast.",
        "Catholic": "Records Isaac reaching the age of weaning (a significant step towards independence in that culture), which Abraham celebrates with a major feast, acknowledging God's blessing.",
        "Methodist": "Isaac's weaning signifies survival through early infancy, prompting a celebratory feast.",
        "Lutheran": "Isaac's weaning is celebrated with a great feast, marking a key stage in his development.",
        "Presbyterian": "Abraham holds a great feast to celebrate the significant milestone of Isaac's weaning.",
        "Pentecostal": "A great feast celebrates the milestone of Isaac's weaning.",
        "Episcopalian/Anglican": "Abraham holds a great feast to celebrate the significant milestone of Isaac's weaning.",
        "Orthodox": "The weaning of Isaac, a major event signifying his healthy development, is celebrated with a large feast.",
        "Other": "The child grew and was weaned, and on the day Isaac was weaned Abraham held a great feast.",
        "Prefer not to say": "The child grew and was weaned, and on the day Isaac was weaned Abraham held a great feast."
      },
      "9": {
        "General": "But Sarah saw that the son whom Hagar the Egyptian had borne to Abraham was mocking,",
        "Non-Denominational": "But Sarah saw that the son whom Hagar the Egyptian had borne to Abraham was mocking,",
        "Baptist": "Conflict arises as Sarah observes Ishmael mocking Isaac, potentially challenging Isaac's position as the sole heir of promise.",
        "Catholic": "Sarah witnesses Ishmael (Hagar's son) mocking Isaac. The nature of the mocking is debated, but it's perceived by Sarah as a threat to Isaac's status as the promised heir.",
        "Methodist": "Household conflict emerges. Sarah perceives Ishmael's actions toward Isaac as mockery and a threat.",
        "Lutheran": "Sarah sees Ishmael mocking Isaac, possibly disputing his status or simply childish antagonism, but perceived as a threat.",
        "Presbyterian": "Sarah observes Ishmael mocking Isaac, viewing it as a challenge to Isaac's unique status as the covenant heir.",
        "Pentecostal": "Sarah sees Ishmael mocking Isaac, creating tension and conflict.",
        "Episcopalian/Anglican": "Sarah sees Ishmael (Hagar's son) mocking Isaac, perceiving this as a threat to the promised child.",
        "Orthodox": "Sarah observes Ishmael mocking Isaac, interpreting this action as a challenge to the promised heir's position and future.",
        "Other": "But Sarah saw that the son whom Hagar the Egyptian had borne to Abraham was mocking,",
        "Prefer not to say": "But Sarah saw that the son whom Hagar the Egyptian had borne to Abraham was mocking,"
      },
      "10": {
        "General": "and she said to Abraham, 'Get rid of that slave woman and her son, for that woman’s son will never share in the inheritance with my son Isaac.'",
        "Non-Denominational": "and she said to Abraham, 'Get rid of that slave woman and her son, for that woman’s son will never share in the inheritance with my son Isaac.'",
        "Baptist": "Sarah demands the expulsion of Hagar and Ishmael to secure Isaac's exclusive inheritance rights, reflecting jealousy and perhaps lack of faith in God's plan.",
        "Catholic": "Driven by maternal protection and perhaps jealousy, Sarah demands Abraham expel Hagar and Ishmael, insisting that Ishmael (the 'slave woman's son') will have no part in the inheritance designated for Isaac.",
        "Methodist": "Sarah reacts fiercely, demanding Hagar and Ishmael be cast out to eliminate any challenge to Isaac's inheritance.",
        "Lutheran": "Sarah demands the expulsion of Hagar and Ishmael, seeking to secure Isaac's inheritance exclusively, mixing maternal concern with harshness.",
        "Presbyterian": "Sarah demands the expulsion of Hagar and Ishmael to ensure Isaac's sole claim to the covenant inheritance.",
        "Pentecostal": "Sarah demands that Hagar and Ishmael be sent away to protect Isaac's inheritance.",
        "Episcopalian/Anglican": "Sarah demands Abraham expel Hagar and Ishmael, arguing Ishmael must not share the inheritance with Isaac.",
        "Orthodox": "Sarah demands the removal of Hagar and Ishmael, motivated by a desire to protect Isaac's unique status as the heir of the promise.",
        "Other": "and she said to Abraham, 'Get rid of that slave woman and her son, for that woman’s son will never share in the inheritance with my son Isaac.'",
        "Prefer not to say": "and she said to Abraham, 'Get rid of that slave woman and her son, for that woman’s son will never share in the inheritance with my son Isaac.'"
      },
      "11": {
        "General": "The matter distressed Abraham greatly because it concerned his son.",
        "Non-Denominational": "The matter distressed Abraham greatly because it concerned his son.",
        "Baptist": "Abraham is grieved by Sarah's demand, reflecting his paternal love for Ishmael.",
        "Catholic": "Abraham is deeply troubled by Sarah's demand, showing natural paternal affection and distress over casting out his son Ishmael.",
        "Methodist": "Abraham experiences significant distress due to his affection for Ishmael and the harshness of Sarah's demand.",
        "Lutheran": "Abraham is greatly distressed by the demand because of his love for his son Ishmael.",
        "Presbyterian": "Abraham is deeply grieved by the request, torn between Sarah's demand and his love for Ishmael.",
        "Pentecostal": "Abraham is greatly distressed because the demand involves his son Ishmael.",
        "Episcopalian/Anglican": "Abraham is deeply distressed by Sarah's demand because Ishmael is also his son.",
        "Orthodox": "Abraham is pained by Sarah's request, reflecting his fatherly love for Ishmael.",
        "Other": "The matter distressed Abraham greatly because it concerned his son.",
        "Prefer not to say": "The matter distressed Abraham greatly because it concerned his son."
      },
      "12": {
        "General": "But God said to him, 'Do not be so distressed about the boy and your slave woman. Listen to whatever Sarah tells you, because it is through Isaac that your offspring will be reckoned.'",
        "Non-Denominational": "But God said to him, 'Do not be so distressed about the boy and your slave woman. Listen to whatever Sarah tells you, because it is through Isaac that your offspring will be reckoned.'",
        "Baptist": "God intervenes, telling Abraham to heed Sarah, confirming that the covenant line runs exclusively through Isaac.",
        "Catholic": "God instructs Abraham not to be distressed and to listen to Sarah in this matter, explicitly confirming that the promised covenant lineage ('offspring') will be established solely through Isaac.",
        "Methodist": "God directs Abraham to follow Sarah's demand, reaffirming Isaac's unique role in the covenant plan.",
        "Lutheran": "God commands Abraham to listen to Sarah, assuring him the covenant promise is tied specifically to Isaac.",
        "Presbyterian": "God commands Abraham to obey Sarah, reaffirming the principle of election: the covenant promise is exclusively through Isaac.",
        "Pentecostal": "God instructs Abraham to listen to Sarah, confirming the covenant line is through Isaac.",
        "Episcopalian/Anglican": "God instructs Abraham to heed Sarah, confirming that the covenant promise is specifically tied to Isaac.",
        "Orthodox": "God directs Abraham to follow Sarah's wish, clarifying that the promised lineage will proceed through Isaac alone.",
        "Other": "But God said to him, 'Do not be so distressed about the boy and your slave woman. Listen to whatever Sarah tells you, because it is through Isaac that your offspring will be reckoned.'",
        "Prefer not to say": "But God said to him, 'Do not be so distressed about the boy and your slave woman. Listen to whatever Sarah tells you, because it is through Isaac that your offspring will be reckoned.'"
      },
      "13": {
        "General": "'I will make the son of the slave woman into a nation also, because he is your offspring.'",
        "Non-Denominational": "'I will make the son of the slave woman into a nation also, because he is your offspring.'",
        "Baptist": "God reassures Abraham by promising to also make Ishmael into a great nation, acknowledging his connection to Abraham.",
        "Catholic": "God comforts Abraham by reiterating His separate promise for Ishmael (Gen 17:20): he too will become a great nation because he is Abraham's son, though outside the primary covenant line.",
        "Methodist": "God assures Abraham of Ishmael's future, promising him nationhood as well, demonstrating God's care extends beyond the primary covenant line.",
        "Lutheran": "God reaffirms His promise concerning Ishmael: he will also become a nation because he is Abraham's seed, showing God's broader blessing.",
        "Presbyterian": "God comforts Abraham by reaffirming His separate promise for Ishmael: he will also father a great nation.",
        "Pentecostal": "God promises to bless Ishmael and make him a nation because he is Abraham's son.",
        "Episcopalian/Anglican": "God reassures Abraham by promising that Ishmael too will become a great nation because he is Abraham's offspring.",
        "Orthodox": "God comforts Abraham with the assurance that Ishmael will also be blessed and become a nation, by virtue of being Abraham's son.",
        "Other": "'I will make the son of the slave woman into a nation also, because he is your offspring.'",
        "Prefer not to say": "'I will make the son of the slave woman into a nation also, because he is your offspring.'"
      },
      "14": {
        "General": "Early the next morning, Abraham took some food and a skin of water and gave them to Hagar. He set them on her shoulders and then sent her off with the boy. She went on her way and wandered in the Desert of Beersheba.",
        "Non-Denominational": "Early the next morning, Abraham took some food and a skin of water and gave them to Hagar. He set them on her shoulders and then sent her off with the boy. She went on her way and wandered in the Desert of Beersheba.",
        "Baptist": "Abraham obeys God, providing minimal provisions for Hagar and Ishmael before sending them away into the wilderness.",
        "Catholic": "Abraham obediently sends Hagar and Ishmael away, providing basic sustenance (food, water skin). Their departure leads them into the harsh wilderness near Beersheba.",
        "Methodist": "Abraham complies with God's instruction, sending Hagar and Ishmael away with provisions into the desert.",
        "Lutheran": "Abraham obeys God, sending Hagar and Ishmael away with necessary provisions.",
        "Presbyterian": "Abraham obeys God, providing for Hagar and Ishmael's immediate needs before sending them into the wilderness.",
        "Pentecostal": "Abraham obeys God and sends Hagar and Ishmael away with provisions.",
        "Episcopalian/Anglican": "Abraham obeys God, providing Hagar with food and water before sending her and Ishmael away into the wilderness of Beersheba.",
        "Orthodox": "Abraham, in obedience to God, sends Hagar and Ishmael away, providing for their immediate needs as they depart into the wilderness.",
        "Other": "Early the next morning, Abraham took some food and a skin of water and gave them to Hagar. He set them on her shoulders and then sent her off with the boy. She went on her way and wandered in the Desert of Beersheba.",
        "Prefer not to say": "Early the next morning, Abraham took some food and a skin of water and gave them to Hagar. He set them on her shoulders and then sent her off with the boy. She went on her way and wandered in the Desert of Beersheba."
      },
      "15": {
        "General": "When the water in the skin was gone, she put the boy under one of the bushes.",
        "Non-Denominational": "When the water in the skin was gone, she put the boy under one of the bushes.",
        "Baptist": "Their provisions run out, leading to desperation in the harsh desert environment.",
        "Catholic": "Their resources depleted, Hagar faces Ishmael's imminent death from thirst and places him under a bush in despair.",
        "Methodist": "Facing dehydration and death, Hagar places Ishmael under a bush, unable to watch him die.",
        "Lutheran": "The water runs out, and Hagar, in despair, places Ishmael under a bush to die.",
        "Presbyterian": "Their supplies exhausted, Hagar places Ishmael under a bush, anticipating his death.",
        "Pentecostal": "Desperation sets in as the water runs out.",
        "Episcopalian/Anglican": "When the water runs out, Hagar places the dying Ishmael under a bush.",
        "Orthodox": "Their resources fail, and Hagar, in extreme distress, places Ishmael aside to await death.",
        "Other": "When the water in the skin was gone, she put the boy under one of the bushes.",
        "Prefer not to say": "When the water in the skin was gone, she put the boy under one of the bushes."
      },
      "16": {
        "General": "Then she went off and sat down about a bowshot away, for she thought, 'I cannot watch the boy die.' And as she sat there, she began to sob.",
        "Non-Denominational": "Then she went off and sat down about a bowshot away, for she thought, 'I cannot watch the boy die.' And as she sat there, she began to sob.",
        "Baptist": "Hagar distances herself, unable to bear watching her son die, expressing her grief through weeping.",
        "Catholic": "Hagar distances herself, overwhelmed by grief and unable to witness her son's death, and breaks down in tears.",
        "Methodist": "Hagar's maternal grief is profound; she cannot watch Ishmael perish and weeps in despair.",
        "Lutheran": "Hagar distances herself in grief, unable to watch Ishmael die, and weeps bitterly.",
        "Presbyterian": "Overcome with grief, Hagar removes herself from Ishmael's side and weeps.",
        "Pentecostal": "Hagar weeps in despair, unable to watch her son die.",
        "Episcopalian/Anglican": "Unable to watch Ishmael die, Hagar sits at a distance and weeps aloud.",
        "Orthodox": "Hagar, in maternal anguish, withdraws from the sight of her dying son and weeps.",
        "Other": "Then she went off and sat down about a bowshot away, for she thought, 'I cannot watch the boy die.' And as she sat there, she began to sob.",
        "Prefer not to say": "Then she went off and sat down about a bowshot away, for she thought, 'I cannot watch the boy die.' And as she sat there, she began to sob."
      },
      "17": {
        "General": "God heard the boy crying, and the angel of God called to Hagar from heaven and said to her, 'What is the matter, Hagar? Do not be afraid; God has heard the boy crying as he lies there.'",
        "Non-Denominational": "God heard the boy crying, and the angel of God called to Hagar from heaven and said to her, 'What is the matter, Hagar? Do not be afraid; God has heard the boy crying as he lies there.'",
        "Baptist": "God responds mercifully not to Hagar's tears, but to the cries of the boy (Ishmael). The angel of God offers comfort and reassurance.",
        "Catholic": "Divine intervention occurs: God hears Ishmael's cry. The angel of God speaks from heaven, comforting Hagar, assuring her not to fear, and confirming God has heard the boy.",
        "Methodist": "God hears Ishmael's cry and intervenes. The angel comforts Hagar, assuring her of God's awareness and care.",
        "Lutheran": "God hears the cry of Ishmael (the boy). The angel of God calls from heaven, comforts Hagar, and assures her God has heard.",
        "Presbyterian": "God hears Ishmael's cry (demonstrating care even outside the primary covenant line). The angel of God intervenes with words of comfort and assurance.",
        "Pentecostal": "God hears Ishmael crying and sends His angel to comfort Hagar and reassure her.",
        "Episcopalian/Anglican": "God hears Ishmael's cry, and the angel of God calls to Hagar from heaven, comforting her and assuring her God has heard the boy.",
        "Orthodox": "God hears the cry of Ishmael. The Angel of the Lord intervenes, addressing Hagar's distress and assuring her of God's attention to the boy.",
        "Other": "God heard the boy crying, and the angel of God called to Hagar from heaven and said to her, 'What is the matter, Hagar? Do not be afraid; God has heard the boy crying as he lies there.'",
        "Prefer not to say": "God heard the boy crying, and the angel of God called to Hagar from heaven and said to her, 'What is the matter, Hagar? Do not be afraid; God has heard the boy crying as he lies there.'"
      },
      "18": {
        "General": "'Lift the boy up and take him by the hand, for I will make him into a great nation.'",
        "Non-Denominational": "'Lift the boy up and take him by the hand, for I will make him into a great nation.'",
        "Baptist": "The angel instructs Hagar to care for Ishmael and reiterates God's promise to make him a great nation.",
        "Catholic": "The angel commands Hagar to tend to Ishmael and reaffirms the divine promise (previously given to Abraham) that Ishmael will father a great nation.",
        "Methodist": "The angel directs Hagar to act in hope, reminding her of God's promise concerning Ishmael's future.",
        "Lutheran": "The angel instructs Hagar to care for Ishmael, reaffirming God's promise to make him a great nation.",
        "Presbyterian": "The angel commands Hagar to care for Ishmael, reiterating God's promise to make him a great nation.",
        "Pentecostal": "The angel instructs Hagar to care for Ishmael, repeating the promise of his future greatness.",
        "Episcopalian/Anglican": "The angel instructs Hagar to care for Ishmael, reaffirming the promise that he will become a great nation.",
        "Orthodox": "The angel instructs Hagar to care for the boy, reaffirming God's promise that Ishmael will be the progenitor of a great nation.",
        "Other": "'Lift the boy up and take him by the hand, for I will make him into a great nation.'",
        "Prefer not to say": "'Lift the boy up and take him by the hand, for I will make him into a great nation.'"
      },
      "19": {
        "General": "Then God opened her eyes and she saw a well of water. So she went and filled the skin with water and gave the boy a drink.",
        "Non-Denominational": "Then God opened her eyes and she saw a well of water. So she went and filled the skin with water and gave the boy a drink.",
        "Baptist": "God miraculously provides for their physical needs by revealing a nearby well.",
        "Catholic": "God provides miraculously: He opens Hagar's eyes to see a well that was likely already there but unnoticed in her distress, enabling her to save Ishmael.",
        "Methodist": "God provides supernaturally, enabling Hagar to see the means of survival (a well).",
        "Lutheran": "God miraculously provides water by opening Hagar's eyes to see a well.",
        "Presbyterian": "God graciously provides for their need by revealing a well of water to Hagar.",
        "Pentecostal": "God supernaturally reveals a well, providing life-saving water.",
        "Episcopalian/Anglican": "God miraculously opens Hagar's eyes to see a well, providing water for Ishmael.",
        "Orthodox": "God intervenes providentially, opening Hagar's eyes to see a source of water, thus saving Ishmael's life.",
        "Other": "Then God opened her eyes and she saw a well of water. So she went and filled the skin with water and gave the boy a drink.",
        "Prefer not to say": "Then God opened her eyes and she saw a well of water. So she went and filled the skin with water and gave the boy a drink."
      },
      "20": {
        "General": "God was with the boy as he grew up. He lived in the desert and became an archer.",
        "Non-Denominational": "God was with the boy as he grew up. He lived in the desert and became an archer.",
        "Baptist": "Affirms God's continued presence and blessing upon Ishmael as he grows into adulthood in the wilderness, skilled in archery.",
        "Catholic": "Confirms God's continued providential care for Ishmael ('God was with the boy') as he matured into a skilled archer living in the desert environment.",
        "Methodist": "God's presence remained with Ishmael, enabling him to thrive in the desert and develop survival skills (archery).",
        "Lutheran": "God remained with Ishmael, blessing him as he grew up in the wilderness and became an archer.",
        "Presbyterian": "Records God's continued providential care for Ishmael ('God was with the boy') as he grew up.",
        "Pentecostal": "God's presence and blessing remained with Ishmael as he grew.",
        "Episcopalian/Anglican": "The text affirms God's presence with Ishmael as he grew up to become a desert-dwelling archer.",
        "Orthodox": "Highlights God's continued providence over Ishmael, who grows up under divine protection in the wilderness.",
        "Other": "God was with the boy as he grew up. He lived in the desert and became an archer.",
        "Prefer not to say": "God was with the boy as he grew up. He lived in the desert and became an archer."
      },
      "21": {
        "General": "While he was living in the Desert of Paran, his mother got a wife for him from Egypt.",
        "Non-Denominational": "While he was living in the Desert of Paran, his mother got a wife for him from Egypt.",
        "Baptist": "Ishmael settles in Paran, and Hagar arranges his marriage to an Egyptian woman, reflecting her own origins.",
        "Catholic": "Ishmael establishes himself in the Desert of Paran. Hagar, his mother, arranges his marriage, choosing a wife from her native Egypt.",
        "Methodist": "Ishmael settles in Paran, and Hagar facilitates his marriage to someone from her homeland, Egypt.",
        "Lutheran": "Ishmael dwells in Paran, and Hagar arranges his marriage to an Egyptian.",
        "Presbyterian": "Ishmael settles in Paran, and Hagar arranges an Egyptian wife for him.",
        "Pentecostal": "Ishmael lives in Paran; Hagar finds him an Egyptian wife.",
        "Episcopalian/Anglican": "Ishmael lives in the Desert of Paran, and Hagar arranges for him to marry a woman from Egypt.",
        "Orthodox": "Ishmael settles in the Paran wilderness, and his mother arranges his marriage to an Egyptian, connecting him back to her origins.",
        "Other": "While he was living in the Desert of Paran, his mother got a wife for him from Egypt.",
        "Prefer not to say": "While he was living in the Desert of Paran, his mother got a wife for him from Egypt."
      },
      "22": {
        "General": "At that time Abimelech and Phicol the commander of his forces said to Abraham, 'God is with you in everything you do.'",
        "Non-Denominational": "At that time Abimelech and Phicol the commander of his forces said to Abraham, 'God is with you in everything you do.'",
        "Baptist": "Abimelech, witnessing Abraham's prosperity and divine protection (despite his flaws), acknowledges God's evident blessing upon him.",
        "Catholic": "King Abimelech and his military commander, Phicol, recognize the undeniable evidence of divine blessing and presence with Abraham in all his endeavors.",
        "Methodist": "Abimelech and his commander observe Abraham's success and attribute it to God's active presence with him.",
        "Lutheran": "Abimelech and his commander Phicol recognize God's blessing and presence accompanying Abraham in all things.",
        "Presbyterian": "Abimelech, having witnessed God's intervention and Abraham's prosperity, acknowledges that God is clearly with Abraham.",
        "Pentecostal": "Abimelech recognizes God's evident blessing and presence with Abraham.",
        "Episcopalian/Anglican": "Abimelech and his army commander Phicol acknowledge to Abraham that God is clearly with him in all his endeavors.",
        "Orthodox": "Abimelech and his commander, observing Abraham's prosperity and God's interventions, explicitly acknowledge God's presence with Abraham.",
        "Other": "At that time Abimelech and Phicol the commander of his forces said to Abraham, 'God is with you in everything you do.'",
        "Prefer not to say": "At that time Abimelech and Phicol the commander of his forces said to Abraham, 'God is with you in everything you do.'"
      },
      "23": {
        "General": "'Now swear to me here before God that you will not deal falsely with me or my children or my descendants. Show to me and the country where you now reside as a foreigner the same kindness I have shown to you.'",
        "Non-Denominational": "'Now swear to me here before God that you will not deal falsely with me or my children or my descendants. Show to me and the country where you now reside as a foreigner the same kindness I have shown to you.'",
        "Baptist": "Seeking security, Abimelech proposes a treaty, asking Abraham to swear loyalty and reciprocity based on the kindness Abimelech has shown.",
        "Catholic": "Recognizing Abraham's divinely backed power, Abimelech seeks a formal treaty sworn before God, ensuring Abraham's future loyalty and fair dealing towards him and his descendants, appealing to past kindness shown.",
        "Methodist": "Abimelech proposes a covenant relationship based on mutual kindness and loyalty, seeking assurance for the future.",
        "Lutheran": "Abimelech requests a sworn oath of loyalty from Abraham, seeking security for the future based on past kindness.",
        "Presbyterian": "Abimelech seeks a formal covenant oath from Abraham, ensuring future peaceful relations based on reciprocal kindness.",
        "Pentecostal": "Abimelech requests an oath of loyalty from Abraham for future security.",
        "Episcopalian/Anglican": "Abimelech requests Abraham swear an oath before God to deal loyally with him and his descendants, reciprocating the kindness shown.",
        "Orthodox": "Abimelech proposes a treaty, asking Abraham to swear by God to maintain peaceful and honest relations, invoking the kindness previously shown.",
        "Other": "'Now swear to me here before God that you will not deal falsely with me or my children or my descendants. Show to me and the country where you now reside as a foreigner the same kindness I have shown to you.'",
        "Prefer not to say": "'Now swear to me here before God that you will not deal falsely with me or my children or my descendants. Show to me and the country where you now reside as a foreigner the same kindness I have shown to you.'"
      },
      "24": {
        "General": "Abraham said, 'I swear it.'",
        "Non-Denominational": "Abraham said, 'I swear it.'",
        "Baptist": "Abraham agrees to the terms of the treaty.",
        "Catholic": "Abraham agrees to Abimelech's proposal and takes the oath.",
        "Methodist": "Abraham consents to the proposed oath of loyalty.",
        "Lutheran": "Abraham agrees and takes the oath.",
        "Presbyterian": "Abraham agrees to swear the oath.",
        "Pentecostal": "Abraham agrees to the oath.",
        "Episcopalian/Anglican": "Abraham agrees to swear the oath.",
        "Orthodox": "Abraham consents to the terms of the treaty.",
        "Other": "Abraham said, 'I swear it.'",
        "Prefer not to say": "Abraham said, 'I swear it.'"
      },
      "25": {
        "General": "Then Abraham complained to Abimelech about a well of water that Abimelech’s servants had seized.",
        "Non-Denominational": "Then Abraham complained to Abimelech about a well of water that Abimelech’s servants had seized.",
        "Baptist": "Abraham raises a point of contention regarding a well seized by Abimelech's servants, seeking resolution within the treaty context.",
        "Catholic": "Having agreed to the treaty, Abraham now raises a specific grievance: the seizure of his well by Abimelech's servants, seeking to resolve this dispute.",
        "Methodist": "Abraham uses the occasion to address a specific conflict over water rights.",
        "Lutheran": "Abraham brings up a specific dispute concerning a well seized by Abimelech's men.",
        "Presbyterian": "Abraham raises a specific complaint regarding a well seized by Abimelech's servants.",
        "Pentecostal": "Abraham complains about a well seized by Abimelech's servants.",
        "Episcopalian/Anglican": "Abraham then complains to Abimelech about a well that Abimelech's servants had seized.",
        "Orthodox": "Abraham brings forth a specific grievance regarding a well that had been unjustly taken by Abimelech's servants.",
        "Other": "Then Abraham complained to Abimelech about a well of water that Abimelech’s servants had seized.",
        "Prefer not to say": "Then Abraham complained to Abimelech about a well of water that Abimelech’s servants had seized."
      },
      "26": {
        "General": "But Abimelech said, 'I don’t know who has done this. You did not tell me, and I heard about it only today.'",
        "Non-Denominational": "But Abimelech said, 'I don’t know who has done this. You did not tell me, and I heard about it only today.'",
        "Baptist": "Abimelech claims ignorance of the seizure, stating he was previously unaware.",
        "Catholic": "Abimelech denies knowledge or authorization of the seizure, claiming this is the first he has heard of it.",
        "Methodist": "Abimelech professes ignorance regarding the servants' actions.",
        "Lutheran": "Abimelech denies any prior knowledge of the well seizure.",
        "Presbyterian": "Abimelech claims ignorance of the incident involving the well.",
        "Pentecostal": "Abimelech denies knowing about the seized well.",
        "Episcopalian/Anglican": "Abimelech professes ignorance, stating he didn't know his servants had done this and hadn't been told before.",
        "Orthodox": "Abimelech declares his ignorance of the servants' actions regarding the well.",
        "Other": "But Abimelech said, 'I don’t know who has done this. You did not tell me, and I heard about it only today.'",
        "Prefer not to say": "But Abimelech said, 'I don’t know who has done this. You did not tell me, and I heard about it only today.'"
      },
      "27": {
        "General": "So Abraham brought sheep and cattle and gave them to Abimelech, and the two men made a treaty.",
        "Non-Denominational": "So Abraham brought sheep and cattle and gave them to Abimelech, and the two men made a treaty.",
        "Baptist": "Abraham gives gifts to Abimelech to formally seal the treaty (covenant).",
        "Catholic": "Abraham presents gifts (sheep, cattle) to Abimelech, and they formally ratify the treaty ('cut a covenant').",
        "Methodist": "Gifts are exchanged to solidify the agreement, and the treaty is formally made.",
        "Lutheran": "Abraham gives gifts to Abimelech as part of the covenant ceremony.",
        "Presbyterian": "Abraham gives gifts to Abimelech as part of the process of formally establishing the covenant treaty.",
        "Pentecostal": "Abraham gives gifts, and the treaty is formally concluded.",
        "Episcopalian/Anglican": "Abraham gives gifts to Abimelech, and they formally make ('cut') a covenant/treaty.",
        "Orthodox": "Abraham offers gifts to seal the agreement, and the two leaders formally establish a treaty.",
        "Other": "So Abraham brought sheep and cattle and gave them to Abimelech, and the two men made a treaty.",
        "Prefer not to say": "So Abraham brought sheep and cattle and gave them to Abimelech, and the two men made a treaty."
      },
      "28": {
        "General": "Abraham set apart seven ewe lambs from the flock,",
        "Non-Denominational": "Abraham set apart seven ewe lambs from the flock,",
        "Baptist": "Abraham designates seven specific lambs for a particular purpose related to the treaty.",
        "Catholic": "Abraham separates seven ewe lambs as a distinct part of the covenant ratification process.",
        "Methodist": "Abraham sets aside seven lambs as a specific component of the agreement.",
        "Lutheran": "Abraham sets apart seven lambs for a specific purpose in the covenant process.",
        "Presbyterian": "Abraham specifically sets aside seven ewe lambs.",
        "Pentecostal": "Abraham sets apart seven lambs.",
        "Episcopalian/Anglican": "Abraham specifically sets aside seven ewe lambs.",
        "Orthodox": "Abraham designates seven lambs for a specific part of the treaty confirmation.",
        "Other": "Abraham set apart seven ewe lambs from the flock,",
        "Prefer not to say": "Abraham set apart seven ewe lambs from the flock,"
      },
      "29": {
        "General": "and Abimelech asked Abraham, 'What is the meaning of these seven ewe lambs you have set apart by themselves?'",
        "Non-Denominational": "and Abimelech asked Abraham, 'What is the meaning of these seven ewe lambs you have set apart by themselves?'",
        "Baptist": "Abimelech inquires about the significance of this specific gesture.",
        "Catholic": "Abimelech asks for the specific meaning behind the setting apart of the seven lambs.",
        "Methodist": "Abimelech seeks clarification on the symbolism of the seven lambs.",
        "Lutheran": "Abimelech asks about the purpose of the seven separated lambs.",
        "Presbyterian": "Abimelech asks about the significance of the seven lambs.",
        "Pentecostal": "Abimelech asks the meaning of the seven lambs.",
        "Episcopalian/Anglican": "Abimelech asks the purpose of these seven specific lambs.",
        "Orthodox": "Abimelech inquires about the symbolic meaning of the seven lambs.",
        "Other": "and Abimelech asked Abraham, 'What is the meaning of these seven ewe lambs you have set apart by themselves?'",
        "Prefer not to say": "and Abimelech asked Abraham, 'What is the meaning of these seven ewe lambs you have set apart by themselves?'"
      },
      "30": {
        "General": "He replied, 'Accept these seven lambs from my hand as a witness that I dug this well.'",
        "Non-Denominational": "He replied, 'Accept these seven lambs from my hand as a witness that I dug this well.'",
        "Baptist": "Abraham explains the seven lambs serve as a formal, public witness/testimony to his ownership of the disputed well.",
        "Catholic": "Abraham clarifies that the seven lambs are a symbolic payment or testimony ('witness') establishing his legal claim to the well he dug.",
        "Methodist": "The lambs serve as a tangible proof and witness to Abraham's right to the well.",
        "Lutheran": "Abraham explains the seven lambs are a formal witness confirming his ownership of the well.",
        "Presbyterian": "Abraham explains the seven lambs function as a legal witness, securing his claim to the well.",
        "Pentecostal": "The seven lambs serve as a witness confirming Abraham dug the well.",
        "Episcopalian/Anglican": "Abraham explains they are to serve as a formal witness confirming that he dug the well.",
        "Orthodox": "Abraham states the seven lambs are a formal testimony ('witness') to establish his ownership of the well.",
        "Other": "He replied, 'Accept these seven lambs from my hand as a witness that I dug this well.'",
        "Prefer not to say": "He replied, 'Accept these seven lambs from my hand as a witness that I dug this well.'"
      },
      "31": {
        "General": "So that place was called Beersheba, because the two men swore an oath there.",
        "Non-Denominational": "So that place was called Beersheba, because the two men swore an oath there.",
        "Baptist": "The location is named Beersheba ('Well of the Oath' or 'Well of Seven') to commemorate the treaty and the oath sworn there.",
        "Catholic": "The site is named Beersheba (meaning 'Well of the Oath' or possibly 'Well of Seven') commemorating the covenant sworn there between Abraham and Abimelech.",
        "Methodist": "The place receives its name, Beersheba, signifying the oath ('sheba') taken there concerning the well.",
        "Lutheran": "The place is named Beersheba ('Well of the Oath' or 'Well of Seven') because of the oath sworn there.",
        "Presbyterian": "The location is named Beersheba ('Well of the Oath' or 'Well of Seven') to commemorate the covenant sworn there.",
        "Pentecostal": "The place is named Beersheba (Well of the Oath) because of the oath made there.",
        "Episcopalian/Anglican": "The place is consequently named Beersheba ('Well of the Oath' or 'Well of Seven') because they swore the oath there.",
        "Orthodox": "The location is named Beersheba ('Well of the Oath') as a perpetual reminder of the treaty sworn between Abraham and Abimelech.",
        "Other": "So that place was called Beersheba, because the two men swore an oath there.",
        "Prefer not to say": "So that place was called Beersheba, because the two men swore an oath there."
      },
      "32": {
        "General": "After the treaty had been made at Beersheba, Abimelech and Phicol the commander of his forces returned to the land of the Philistines.",
        "Non-Denominational": "After the treaty had been made at Beersheba, Abimelech and Phicol the commander of his forces returned to the land of the Philistines.",
        "Baptist": "Records the conclusion of the meeting and the departure of Abimelech and his commander.",
        "Catholic": "With the treaty concluded, Abimelech and his commander depart from Beersheba and return to their own territory.",
        "Methodist": "The agreement finalized, Abimelech and Phicol depart.",
        "Lutheran": "The treaty concluded, Abimelech and Phicol return home.",
        "Presbyterian": "Following the covenant ceremony, Abimelech and Phicol depart.",
        "Pentecostal": "Abimelech and his commander depart after making the treaty.",
        "Episcopalian/Anglican": "Having concluded the treaty, Abimelech and Phicol return to Philistine territory.",
        "Orthodox": "After formalizing the treaty, Abimelech and his commander depart.",
        "Other": "After the treaty had been made at Beersheba, Abimelech and Phicol the commander of his forces returned to the land of the Philistines.",
        "Prefer not to say": "After the treaty had been made at Beersheba, Abimelech and Phicol the commander of his forces returned to the land of the Philistines."
      },
      "33": {
        "General": "Abraham planted a tamarisk tree in Beersheba, and there he called on the name of the Lord, the Eternal God.",
        "Non-Denominational": "Abraham planted a tamarisk tree in Beersheba, and there he called on the name of the Lord, the Eternal God.",
        "Baptist": "Abraham establishes a place of worship at Beersheba, planting a tree (symbol of permanence/life) and invoking the Lord by His title 'Eternal God' (El Olam).",
        "Catholic": "Abraham marks his settlement and claim at Beersheba by planting a tamarisk tree (known for longevity) and consecrates the place by invoking the Lord using the title El Olam ('The Eternal God'), acknowledging God's everlasting nature.",
        "Methodist": "Abraham establishes a place of worship and permanence, planting a tree and calling on God's eternal name (El Olam).",
        "Lutheran": "Abraham plants a tree, signifying settlement, and worships Yahweh, calling Him El Olam ('The Everlasting God').",
        "Presbyterian": "Abraham establishes a memorial (tamarisk tree) and place of worship at Beersheba, calling on the name of Yahweh, El Olam ('The Eternal God').",
        "Pentecostal": "Abraham plants a tree and worships, calling on the name of the Lord, the Eternal God.",
        "Episcopalian/Anglican": "Abraham plants a tamarisk tree at Beersheba (symbolizing permanence) and worships, calling on the name of the Lord, specifically as El Olam ('The Eternal God').",
        "Orthodox": "Abraham establishes a place of long-term settlement and worship, planting a tree and invoking God by the name El Olam ('God Eternal'), acknowledging His timeless sovereignty.",
        "Other": "Abraham planted a tamarisk tree in Beersheba, and there he called on the name of the Lord, the Eternal God.",
        "Prefer not to say": "Abraham planted a tamarisk tree in Beersheba, and there he called on the name of the Lord, the Eternal God."
      },
      "34": {
        "General": "And Abraham stayed in the land of the Philistines for a long time.",
        "Non-Denominational": "And Abraham stayed in the land of the Philistines for a long time.",
        "Baptist": "Indicates a period of extended residence for Abraham in the region of Gerar (Philistine territory).",
        "Catholic": "Notes Abraham's extended period of residence as a foreigner in the Philistine region (specifically Gerar).",
        "Methodist": "Abraham resides in the region for a considerable period following the treaty.",
        "Lutheran": "Abraham lived in the Philistine territory for a significant duration.",
        "Presbyterian": "Records Abraham's lengthy stay in the Philistine region.",
        "Pentecostal": "Abraham lives in the Philistine area for a long time.",
        "Episcopalian/Anglican": "Abraham resides in the Philistine territory (Gerar) for an extended period.",
        "Orthodox": "Indicates a prolonged period of Abraham dwelling in the land of the Philistines.",
        "Other": "And Abraham stayed in the land of the Philistines for a long time.",
        "Prefer not to say": "And Abraham stayed in the land of the Philistines for a long time."
      }
    }
  }