{
  "_comment": "Interpretations for Genesis Chapter 22",
  "book": "Genesis",
  "chapter": "22",
  "verses": {
    "1": {
      "General": "Some time later God tested Abraham. He said to him, 'Abraham!' 'Here I am,' he replied.",
      "Non-Denominational": "Some time later God tested Abraham. He said to him, 'Abraham!' 'Here I am,' he replied.",
      "Baptist": "Introduces a pivotal test of Abraham's faith initiated by God.",
      "Catholic": "Introduces a profound trial ('test') initiated by God to prove Abraham's faith and obedience. Abraham responds with readiness.",
      "Methodist": "Highlights a significant test of faith initiated by God. Abraham responds with attentiveness and availability.",
      "Lutheran": "God initiates a severe test of Abraham's faith. Abraham responds attentively ('Here I am').",
      "Presbyterian": "God sovereignly initiates a test ('tested') of Abraham's faith. Abraham responds with obedient readiness.",
      "Pentecostal": "God tests Abraham's faith. Abraham responds immediately.",
      "Episcopalian/Anglican": "God initiates a test of Abraham's faith. Abraham responds readily.",
      "Orthodox": "Introduces a crucial test of Abraham's faith initiated by God. Abraham's response shows immediate attentiveness.",
      "Other": "Some time later God tested Abraham. He said to him, 'Abraham!' 'Here I am,' he replied.",
      "Prefer not to say": "Some time later God tested Abraham. He said to him, 'Abraham!' 'Here I am,' he replied."
    },
    "2": {
      "General": "Then God said, 'Take your son, your only son, whom you love—Isaac—and go to the region of Moriah. Sacrifice him there as a burnt offering on a mountain I will show you.'",
      "Non-Denominational": "Then God said, 'Take your son, your only son, whom you love—Isaac—and go to the region of Moriah. Sacrifice him there as a burnt offering on a mountain I will show you.'",
      "Baptist": "God commands Abraham to sacrifice Isaac, the son of promise, emphasizing the immense personal cost ('only son, whom you love').",
      "Catholic": "God commands the unthinkable: Abraham must sacrifice Isaac—emphasizing his uniqueness and beloved status—as a burnt offering in Moriah. This tests Abraham's ultimate loyalty.",
      "Methodist": "God gives the command to sacrifice Isaac, emphasizing the depth of Abraham's love for him, setting up an extreme test of obedience.",
      "Lutheran": "God commands Abraham to sacrifice Isaac, the beloved son of promise, as a burnt offering, presenting the ultimate test of faith over natural affection.",
      "Presbyterian": "God commands Abraham to sacrifice Isaac, the unique and beloved son of the covenant, as a supreme test of faith and obedience.",
      "Pentecostal": "God commands the sacrifice of Isaac, the beloved promised son, as a profound test.",
      "Episcopalian/Anglican": "God commands Abraham to sacrifice Isaac, specifically emphasizing his unique status ('only son, whom you love'), as a burnt offering in Moriah.",
      "Orthodox": "God commands Abraham to offer Isaac—described with terms emphasizing his preciousness ('only', 'loved')—as a burnt offering, presenting the ultimate trial of faith.",
      "Other": "Then God said, 'Take your son, your only son, whom you love—Isaac—and go to the region of Moriah. Sacrifice him there as a burnt offering on a mountain I will show you.'",
      "Prefer not to say": "Then God said, 'Take your son, your only son, whom you love—Isaac—and go to the region of Moriah. Sacrifice him there as a burnt offering on a mountain I will show you.'"
    },
    "3": {
      "General": "Early the next morning Abraham got up and loaded his donkey. He took with him two of his servants and his son Isaac. When he had cut enough wood for the burnt offering, he set out for the place God had told him about.",
      "Non-Denominational": "Early the next morning Abraham got up and loaded his donkey. He took with him two of his servants and his son Isaac. When he had cut enough wood for the burnt offering, he set out for the place God had told him about.",
      "Baptist": "Abraham responds with immediate, unquestioning obedience, making preparations without delay.",
      "Catholic": "Abraham demonstrates prompt and resolute obedience, preparing immediately for the journey and the sacrifice without apparent hesitation or questioning.",
      "Methodist": "Abraham's obedience is immediate and practical. He prepares without visible delay or argument.",
      "Lutheran": "Abraham obeys immediately and without recorded question, making all necessary preparations.",
      "Presbyterian": "Abraham demonstrates immediate, unquestioning obedience, preparing diligently for the journey.",
      "Pentecostal": "Abraham shows immediate obedience, preparing early in the morning.",
      "Episcopalian/Anglican": "Abraham obeys promptly, rising early and making all necessary preparations for the journey and the commanded sacrifice.",
      "Orthodox": "Abraham responds with swift and silent obedience, preparing everything necessary for the journey and the offering.",
      "Other": "Early the next morning Abraham got up and loaded his donkey. He took with him two of his servants and his son Isaac. When he had cut enough wood for the burnt offering, he set out for the place God had told him about.",
      "Prefer not to say": "Early the next morning Abraham got up and loaded his donkey. He took with him two of his servants and his son Isaac. When he had cut enough wood for the burnt offering, he set out for the place God had told him about."
    },
    "4": {
      "General": "On the third day Abraham looked up and saw the place in the distance.",
      "Non-Denominational": "On the third day Abraham looked up and saw the place in the distance.",
      "Baptist": "The three-day journey emphasizes the duration Abraham wrestled with the command, culminating in sighting the appointed place.",
      "Catholic": "The three-day journey signifies a period of sustained obedience and perhaps internal struggle before reaching the divinely appointed location.",
      "Methodist": "The duration of the journey underscores the time Abraham had to contemplate the command before arriving at the designated place.",
      "Lutheran": "The three-day journey highlights the time Abraham lived with the dreadful command before seeing the destination.",
      "Presbyterian": "The three-day journey emphasizes the deliberateness and sustained nature of Abraham's obedience.",
      "Pentecostal": "After three days of travel, Abraham identifies the place God indicated.",
      "Episcopalian/Anglican": "After a three-day journey, Abraham sees the designated place for the sacrifice.",
      "Orthodox": "The three-day journey underscores the time Abraham carried the weight of the command before identifying the appointed place.",
      "Other": "On the third day Abraham looked up and saw the place in the distance.",
      "Prefer not to say": "On the third day Abraham looked up and saw the place in the distance."
    },
    "5": {
      "General": "He said to his servants, 'Stay here with the donkey while I and the boy go over there. We will worship and then we will come back to you.'",
      "Non-Denominational": "He said to his servants, 'Stay here with the donkey while I and the boy go over there. We will worship and then we will come back to you.'",
      "Baptist": "Abraham expresses faith, telling his servants 'we' will return, implying belief in Isaac's survival despite the command.",
      "Catholic": "Abraham instructs the servants to wait, expressing a statement of faith ('we will worship and then we will come back') that anticipates both his and Isaac's return, despite the command to sacrifice.",
      "Methodist": "Abraham displays faith in God's ultimate plan, assuring the servants of their return ('we will come back').",
      "Lutheran": "Abraham instructs the servants to wait, expressing remarkable faith by saying 'we' will return, implying trust in God's intervention or resurrection.",
      "Presbyterian": "Abraham confidently declares 'we will come back,' expressing profound faith that God will somehow preserve Isaac or raise him up.",
      "Pentecostal": "Abraham expresses faith by telling the servants 'we' (plural) will return.",
      "Episcopalian/Anglican": "Abraham tells his servants they ('we') will worship and return, expressing faith in a resolution that includes Isaac's survival.",
      "Orthodox": "Abraham instructs the servants to wait, expressing faith ('we will return') that hints at his trust in God's power, perhaps even to raise Isaac (cf. Hebrews 11:19).",
      "Other": "He said to his servants, 'Stay here with the donkey while I and the boy go over there. We will worship and then we will come back to you.'",
      "Prefer not to say": "He said to his servants, 'Stay here with the donkey while I and the boy go over there. We will worship and then we will come back to you.'"
    },
    "6": {
      "General": "Abraham took the wood for the burnt offering and placed it on his son Isaac, and he himself carried the fire and the knife. As the two of them went on together,",
      "Non-Denominational": "Abraham took the wood for the burnt offering and placed it on his son Isaac, and he himself carried the fire and the knife. As the two of them went on together,",
      "Baptist": "Poignantly depicts Isaac carrying the wood for his own sacrifice, while Abraham carries the instruments of death.",
      "Catholic": "A poignant scene: Isaac carries the wood (prefiguring Christ carrying the cross), while Abraham carries the means of sacrifice (fire, knife). They proceed together towards the appointed place.",
      "Methodist": "Highlights the somber journey, with Isaac unknowingly carrying the wood for his sacrifice.",
      "Lutheran": "Isaac carries the wood for his own sacrifice, a detail laden with pathos, while Abraham carries the fire and knife.",
      "Presbyterian": "Depicts the solemn ascent, with Isaac carrying the wood (often seen as a type of Christ carrying the cross).",
      "Pentecostal": "Isaac carries the wood, unaware it is for his own sacrifice.",
      "Episcopalian/Anglican": "Isaac carries the wood for the sacrifice, while Abraham carries the fire and knife, creating a scene of dramatic irony and foreshadowing.",
      "Orthodox": "A deeply symbolic moment: Isaac carries the wood for his own sacrifice (a prefiguration of Christ), while Abraham carries the fire and knife.",
      "Other": "Abraham took the wood for the burnt offering and placed it on his son Isaac, and he himself carried the fire and the knife. As the two of them went on together,",
      "Prefer not to say": "Abraham took the wood for the burnt offering and placed it on his son Isaac, and he himself carried the fire and the knife. As the two of them went on together,"
    },
    "7": {
      "General": "Isaac spoke up and said to his father Abraham, 'Father?' 'Yes, my son?' Abraham replied. 'The fire and wood are here,' Isaac said, 'but where is the lamb for the burnt offering?'",
      "Non-Denominational": "Isaac spoke up and said to his father Abraham, 'Father?' 'Yes, my son?' Abraham replied. 'The fire and wood are here,' Isaac said, 'but where is the lamb for the burnt offering?'",
      "Baptist": "Isaac's innocent question highlights the missing element (the sacrificial lamb) and underscores the tension.",
      "Catholic": "Isaac's innocent and logical question ('Where is the lamb?') heightens the dramatic tension and pierces Abraham's heart.",
      "Methodist": "Isaac's poignant question reveals his awareness of sacrificial ritual but ignorance of his own role.",
      "Lutheran": "Isaac's innocent question about the missing lamb creates immense pathos and dramatic tension.",
      "Presbyterian": "Isaac's trusting, innocent question about the lamb underscores the agonizing nature of Abraham's test.",
      "Pentecostal": "Isaac's innocent question increases the emotional weight of the moment.",
      "Episcopalian/Anglican": "Isaac's innocent question about the lamb dramatically underscores the tension and Abraham's internal conflict.",
      "Orthodox": "Isaac's logical and innocent question about the sacrificial lamb heightens the tension and the weight upon Abraham.",
      "Other": "Isaac spoke up and said to his father Abraham, 'Father?' 'Yes, my son?' Abraham replied. 'The fire and wood are here,' Isaac said, 'but where is the lamb for the burnt offering?'",
      "Prefer not to say": "Isaac spoke up and said to his father Abraham, 'Father?' 'Yes, my son?' Abraham replied. 'The fire and wood are here,' Isaac said, 'but where is the lamb for the burnt offering?'"
    },
    "8": {
      "General": "Abraham answered, 'God himself will provide the lamb for the burnt offering, my son.' And the two of them went on together.",
      "Non-Denominational": "Abraham answered, 'God himself will provide the lamb for the burnt offering, my son.' And the two of them went on together.",
      "Baptist": "Abraham expresses profound faith in God's provision, prophetically declaring God will supply the sacrifice.",
      "Catholic": "Abraham gives a response filled with faith and perhaps prophetic insight: 'God himself will provide the lamb.' This answer trusts God's intervention while possibly having a double meaning.",
      "Methodist": "Abraham responds with faith, expressing trust that God will provide the necessary sacrifice.",
      "Lutheran": "Abraham answers with profound faith, declaring prophetically, 'God himself will provide the lamb.'",
      "Presbyterian": "Abraham answers with remarkable faith, prophetically declaring God's provision ('God will provide for himself the lamb').",
      "Pentecostal": "Abraham expresses faith, stating God will provide the lamb.",
      "Episcopalian/Anglican": "Abraham responds with faith, stating 'God himself will provide the lamb,' trusting in divine provision.",
      "Orthodox": "Abraham responds with deep faith, expressing trust in God's providence to supply the required lamb.",
      "Other": "Abraham answered, 'God himself will provide the lamb for the burnt offering, my son.' And the two of them went on together.",
      "Prefer not to say": "Abraham answered, 'God himself will provide the lamb for the burnt offering, my son.' And the two of them went on together."
    },
    "9": {
      "General": "When they reached the place God had told him about, Abraham built an altar there and arranged the wood on it. He bound his son Isaac and laid him on the altar, on top of the wood.",
      "Non-Denominational": "When they reached the place God had told him about, Abraham built an altar there and arranged the wood on it. He bound his son Isaac and laid him on the altar, on top of the wood.",
      "Baptist": "Abraham proceeds in obedience to the very point of sacrifice, building the altar and binding Isaac.",
      "Catholic": "At the designated place, Abraham proceeds with the preparations in full obedience: building the altar, arranging wood, and binding Isaac (the 'Akedah' - binding), placing him upon the wood.",
      "Methodist": "Abraham follows through with the commanded actions, building the altar and binding Isaac for the sacrifice.",
      "Lutheran": "Abraham proceeds to the final steps of obedience, building the altar, arranging the wood, and binding Isaac upon it.",
      "Presbyterian": "Abraham fully obeys God's command up to the final moment, building the altar and binding Isaac.",
      "Pentecostal": "Abraham obeys completely, preparing the altar and binding Isaac.",
      "Episcopalian/Anglican": "Abraham carries out the preparations meticulously, building the altar, arranging the wood, and binding Isaac upon it.",
      "Orthodox": "Abraham proceeds to fulfill the command, building the altar and binding Isaac upon it, demonstrating complete commitment.",
      "Other": "When they reached the place God had told him about, Abraham built an altar there and arranged the wood on it. He bound his son Isaac and laid him on the altar, on top of the wood.",
      "Prefer not to say": "When they reached the place God had told him about, Abraham built an altar there and arranged the wood on it. He bound his son Isaac and laid him on the altar, on top of the wood."
    },
    "10": {
      "General": "Then he reached out his hand and took the knife to slay his son.",
      "Non-Denominational": "Then he reached out his hand and took the knife to slay his son.",
      "Baptist": "Abraham reaches the apex of the test, knife in hand, fully intending to obey God's command.",
      "Catholic": "The climax of the test: Abraham takes the knife, fully intending to carry out the sacrifice in obedience to God.",
      "Methodist": "Abraham reaches the ultimate point of obedience, ready to sacrifice his son.",
      "Lutheran": "Abraham takes the knife, demonstrating his willingness to complete the sacrifice in obedience.",
      "Presbyterian": "Abraham demonstrates ultimate obedience, taking the knife to slay his son.",
      "Pentecostal": "Abraham is fully prepared to obey God's command.",
      "Episcopalian/Anglican": "Abraham raises the knife, demonstrating his complete willingness to obey God's command.",
      "Orthodox": "The height of obedience: Abraham takes the knife, ready to perform the sacrifice as commanded.",
      "Other": "Then he reached out his hand and took the knife to slay his son.",
      "Prefer not to say": "Then he reached out his hand and took the knife to slay his son."
    },
    "11": {
      "General": "But the angel of the Lord called out to him from heaven, 'Abraham! Abraham!' 'Here I am,' he replied.",
      "Non-Denominational": "But the angel of the Lord called out to him from heaven, 'Abraham! Abraham!' 'Here I am,' he replied.",
      "Baptist": "Divine intervention: The Angel of the Lord stops Abraham at the last moment.",
      "Catholic": "Divine intervention at the critical moment: The Angel of the Lord (often understood as a manifestation of God Himself) calls from heaven, halting the sacrifice. Abraham remains attentive.",
      "Methodist": "God intervenes directly through the Angel of the Lord, stopping the sacrifice.",
      "Lutheran": "The Angel of the Lord intervenes from heaven, calling Abraham's name twice to halt the sacrifice.",
      "Presbyterian": "God intervenes directly through the Angel of the Lord, dramatically stopping the sacrifice.",
      "Pentecostal": "God intervenes through His angel, stopping Abraham.",
      "Episcopalian/Anglican": "The Angel of the Lord intervenes dramatically from heaven, calling to Abraham and halting the sacrifice.",
      "Orthodox": "Divine intervention prevents the sacrifice: The Angel of the Lord calls from heaven, stopping Abraham's hand.",
      "Other": "But the angel of the Lord called out to him from heaven, 'Abraham! Abraham!' 'Here I am,' he replied.",
      "Prefer not to say": "But the angel of the Lord called out to him from heaven, 'Abraham! Abraham!' 'Here I am,' he replied."
    },
    "12": {
      "General": "'Do not lay a hand on the boy,' he said. 'Do not do anything to him. Now I know that you fear God, because you have not withheld from me your son, your only son.'",
      "Non-Denominational": "'Do not lay a hand on the boy,' he said. 'Do not do anything to him. Now I know that you fear God, because you have not withheld from me your son, your only son.'",
      "Baptist": "The Angel confirms the test is complete, acknowledging Abraham's fear of God (reverence, obedience) demonstrated by his willingness to sacrifice Isaac.",
      "Catholic": "The Angel explicitly forbids harming Isaac, declaring the test successful. God now 'knows' (experientially confirms) Abraham's reverence ('fear of God') because he did not withhold his most precious son.",
      "Methodist": "The command is rescinded. Abraham's willingness demonstrated his ultimate reverence ('fear') and trust in God.",
      "Lutheran": "The sacrifice is forbidden. God declares Abraham has passed the test, proving his 'fear of God' (reverent obedience) by not withholding Isaac.",
      "Presbyterian": "The Angel confirms the test is passed. Abraham's willingness to sacrifice Isaac demonstrates his true 'fear of God' (covenant loyalty and obedience).",
      "Pentecostal": "God confirms Abraham passed the test, demonstrating his fear of God by his willingness to obey.",
      "Episcopalian/Anglican": "The Angel forbids the sacrifice, declaring that Abraham has passed the test, proving his 'fear of God' by his willingness to offer Isaac.",
      "Orthodox": "The sacrifice is stayed. The Angel affirms that Abraham's willingness has demonstrated his profound reverence ('fear of God') and obedience.",
      "Other": "'Do not lay a hand on the boy,' he said. 'Do not do anything to him. Now I know that you fear God, because you have not withheld from me your son, your only son.'",
      "Prefer not to say": "'Do not lay a hand on the boy,' he said. 'Do not do anything to him. Now I know that you fear God, because you have not withheld from me your son, your only son.'"
    },
    "13": {
      "General": "Abraham looked up and there in a thicket he saw a ram caught by its horns. He went over and took the ram and sacrificed it as a burnt offering instead of his son.",
      "Non-Denominational": "Abraham looked up and there in a thicket he saw a ram caught by its horns. He went over and took the ram and sacrificed it as a burnt offering instead of his son.",
      "Baptist": "God provides the substitute sacrifice, fulfilling Abraham's earlier prophecy.",
      "Catholic": "God provides the sacrifice He had promised through Abraham's words: a ram caught in a thicket, which Abraham offers as a substitute for Isaac.",
      "Methodist": "God fulfills Abraham's faithful declaration by providing a ram as a substitute sacrifice.",
      "Lutheran": "God provides a substitute sacrifice (a ram), fulfilling Abraham's faithful declaration ('God will provide').",
      "Presbyterian": "God provides the substitutionary sacrifice (a ram), fulfilling Abraham's prophetic statement and demonstrating His grace.",
      "Pentecostal": "God provides the ram as the substitute sacrifice.",
      "Episcopalian/Anglican": "God provides a ram caught in a thicket, which Abraham sacrifices as a substitute for Isaac, fulfilling Abraham's earlier words of faith.",
      "Orthodox": "God provides the substitute offering, a ram, fulfilling Abraham's trustful declaration ('God will provide'). Abraham sacrifices the ram in place of Isaac.",
      "Other": "Abraham looked up and there in a thicket he saw a ram caught by its horns. He went over and took the ram and sacrificed it as a burnt offering instead of his son.",
      "Prefer not to say": "Abraham looked up and there in a thicket he saw a ram caught by its horns. He went over and took the ram and sacrificed it as a burnt offering instead of his son."
    },
    "14": {
      "General": "So Abraham called that place The Lord Will Provide. And to this day it is said, 'On the mountain of the Lord it will be provided.'",
      "Non-Denominational": "So Abraham called that place The Lord Will Provide. And to this day it is said, 'On the mountain of the Lord it will be provided.'",
      "Baptist": "Abraham names the place 'Yahweh-Yireh' ('The Lord Will Provide') to commemorate God's intervention and provision.",
      "Catholic": "Abraham names the place 'Yahweh-Yireh' ('The Lord Will Provide'), commemorating the event. This becomes a proverb: 'On the mountain of the Lord it will be provided,' signifying trust in God's providence in times of need.",
      "Methodist": "Abraham names the site 'The Lord Will Provide' (Yahweh-Yireh), creating a lasting testimony to God's faithfulness.",
      "Lutheran": "Abraham names the place 'Yahweh-Yireh' ('The Lord Will Provide'), memorializing God's provision. This leads to a saying about God providing on His mountain.",
      "Presbyterian": "Abraham names the place Yahweh-Yireh ('The Lord Will Provide'), establishing a memorial to God's faithfulness and provision.",
      "Pentecostal": "Abraham names the place 'The Lord Will Provide' (Yahweh-Yireh).",
      "Episcopalian/Anglican": "Abraham names the place 'Yahweh-Yireh' ('The Lord Will Provide'), establishing a memorial. A proverb arises: 'On the mountain of the Lord it will be provided.'",
      "Orthodox": "Abraham names the place 'The Lord Will Provide' (Yahweh-Yireh), commemorating the divine intervention and provision.",
      "Other": "So Abraham called that place The Lord Will Provide. And to this day it is said, 'On the mountain of the Lord it will be provided.'",
      "Prefer not to say": "So Abraham called that place The Lord Will Provide. And to this day it is said, 'On the mountain of the Lord it will be provided.'"
    },
    "15": {
      "General": "The angel of the Lord called to Abraham from heaven a second time",
      "Non-Denominational": "The angel of the Lord called to Abraham from heaven a second time",
      "Baptist": "The Angel speaks again, this time to pronounce a blessing.",
      "Catholic": "The Angel of the Lord addresses Abraham again from heaven, this time to pronounce a solemn blessing.",
      "Methodist": "A second address by the Angel of the Lord follows the act of obedience and provision.",
      "Lutheran": "The Angel of the Lord calls a second time to deliver a blessing.",
      "Presbyterian": "The Angel of the Lord addresses Abraham again to confirm and expand the covenant promises.",
      "Pentecostal": "The Angel calls again to deliver a blessing.",
      "Episcopalian/Anglican": "The Angel of the Lord calls to Abraham from heaven a second time.",
      "Orthodox": "The Angel of the Lord addresses Abraham once more from heaven.",
      "Other": "The angel of the Lord called to Abraham from heaven a second time",
      "Prefer not to say": "The angel of the Lord called to Abraham from heaven a second time"
    },
    "16": {
      "General": "and said, 'I swear by myself, declares the Lord, that because you have done this and have not withheld your son, your only son,'",
      "Non-Denominational": "and said, 'I swear by myself, declares the Lord, that because you have done this and have not withheld your son, your only son,'",
      "Baptist": "God confirms His covenant promise with an oath ('I swear by myself'), based on Abraham's demonstrated obedience.",
      "Catholic": "God confirms His covenant promises with the most solemn oath possible ('I swear by myself,' declares the Lord), grounding the blessing in Abraham's ultimate act of obedience.",
      "Methodist": "God reaffirms the covenant promises with a divine oath, explicitly linking the blessing to Abraham's obedience.",
      "Lutheran": "God solemnly swears by His own name ('I swear by myself'), confirming His promise as a reward for Abraham's obedience in not withholding Isaac.",
      "Presbyterian": "God confirms the covenant with a self-administered oath ('I swear by myself'), basing the renewed blessing on Abraham's proven obedience.",
      "Pentecostal": "God confirms His promise with an oath based on Abraham's obedience.",
      "Episcopalian/Anglican": "The Lord declares an oath ('I swear by myself') based on Abraham's obedience in not withholding Isaac.",
      "Orthodox": "God makes a solemn oath ('I swear by myself'), the strongest possible affirmation, confirming blessings based on Abraham's demonstrated faithfulness.",
      "Other": "and said, 'I swear by myself, declares the Lord, that because you have done this and have not withheld your son, your only son,'",
      "Prefer not to say": "and said, 'I swear by myself, declares the Lord, that because you have done this and have not withheld your son, your only son,'"
    },
    "17": {
      "General": "'I will surely bless you and make your descendants as numerous as the stars in the sky and as the sand on the seashore. Your descendants will take possession of the cities of their enemies,'",
      "Non-Denominational": "'I will surely bless you and make your descendants as numerous as the stars in the sky and as the sand on the seashore. Your descendants will take possession of the cities of their enemies,'",
      "Baptist": "Reiterates and expands the covenant promises: immense blessing, innumerable descendants, and victory over enemies.",
      "Catholic": "Reaffirms and expands the Abrahamic covenant: abundant blessing, countless descendants (compared to stars and sand), and military dominance over their enemies.",
      "Methodist": "God reaffirms the promises of blessing, numerous descendants, and future victory for Abraham's lineage.",
      "Lutheran": "Restates the covenant promises with amplification: abundant blessing, uncountable descendants, and victory over enemies.",
      "Presbyterian": "God reaffirms and expands the covenant promises: blessing, innumerable descendants, and conquest of their enemies' gates (strategic control).",
      "Pentecostal": "God reaffirms the promise of abundant blessing, countless descendants, and victory.",
      "Episcopalian/Anglican": "God reaffirms the covenant promises: great blessing, descendants as numerous as stars and sand, and power over their enemies.",
      "Orthodox": "God emphatically reaffirms the covenant promises: abundant blessing, innumerable posterity, and dominion over their adversaries.",
      "Other": "'I will surely bless you and make your descendants as numerous as the stars in the sky and as the sand on the seashore. Your descendants will take possession of the cities of their enemies,'",
      "Prefer not to say": "'I will surely bless you and make your descendants as numerous as the stars in the sky and as the sand on the seashore. Your descendants will take possession of the cities of their enemies,'"
    },
    "18": {
      "General": "'and through your offspring all nations on earth will be blessed, because you have obeyed me.'",
      "Non-Denominational": "'and through your offspring all nations on earth will be blessed, because you have obeyed me.'",
      "Baptist": "Confirms the universal scope of the blessing: all nations will be blessed through Abraham's offspring (ultimately fulfilled in Christ), explicitly linking this to Abraham's obedience.",
      "Catholic": "Reiterates the universal dimension of the covenant: through Abraham's 'offspring' (singular, pointing towards Christ), all nations will find blessing. This universal blessing is explicitly tied to Abraham's act of obedience.",
      "Methodist": "Reaffirms the promise that Abraham's lineage will be a source of blessing for all humanity, connecting it directly to his obedience.",
      "Lutheran": "Restates the promise of universal blessing through Abraham's 'seed' (offspring, ultimately Christ), explicitly linking it to Abraham's obedience.",
      "Presbyterian": "God reaffirms the promise that universal blessing will come through Abraham's 'offspring' (seed), explicitly grounding it in Abraham's obedience.",
      "Pentecostal": "God reaffirms the promise that all nations will be blessed through Abraham's offspring because of his obedience.",
      "Episcopalian/Anglican": "God confirms the universal blessing: through Abraham's offspring ('seed'), all nations will be blessed, explicitly because Abraham obeyed.",
      "Orthodox": "Reaffirms the universal scope of the promise: blessing for all nations will come through Abraham's 'seed' (offspring), explicitly linked to his obedience.",
      "Other": "'and through your offspring all nations on earth will be blessed, because you have obeyed me.'",
      "Prefer not to say": "'and through your offspring all nations on earth will be blessed, because you have obeyed me.'"
    },
    "19": {
      "General": "Then Abraham returned to his servants, and they set off together for Beersheba. And Abraham stayed in Beersheba.",
      "Non-Denominational": "Then Abraham returned to his servants, and they set off together for Beersheba. And Abraham stayed in Beersheba.",
      "Baptist": "Abraham rejoins his servants (presumably with Isaac) and returns to Beersheba, his residence.",
      "Catholic": "Abraham and Isaac rejoin the servants, and the entire party returns to Beersheba, where Abraham continues to reside.",
      "Methodist": "The ordeal concluded, Abraham returns with Isaac to the servants and travels back to Beersheba.",
      "Lutheran": "Abraham returns (with Isaac) to the servants, and they journey back to Beersheba.",
      "Presbyterian": "Abraham and Isaac return to the servants, and they travel together back to Beersheba.",
      "Pentecostal": "Abraham and Isaac return, and they travel back to Beersheba.",
      "Episcopalian/Anglican": "Abraham (with Isaac) rejoins his servants, and they return together to Beersheba, where Abraham settles.",
      "Orthodox": "Abraham (implicitly with Isaac) returns to the servants, and they journey back to Beersheba.",
      "Other": "Then Abraham returned to his servants, and they set off together for Beersheba. And Abraham stayed in Beersheba.",
      "Prefer not to say": "Then Abraham returned to his servants, and they set off together for Beersheba. And Abraham stayed in Beersheba."
    },
    "20": {
      "General": "Some time later Abraham was told, 'Milcah is also a mother; she has borne sons to your brother Nahor:'",
      "Non-Denominational": "Some time later Abraham was told, 'Milcah is also a mother; she has borne sons to your brother Nahor:'",
      "Baptist": "Shifts focus to Abraham's extended family, reporting news about his brother Nahor's children.",
      "Catholic": "The narrative shifts to Abraham's relatives: news arrives concerning the children born to his brother Nahor and his wife Milcah.",
      "Methodist": "Provides an update on Abraham's relatives, specifically the family of his brother Nahor.",
      "Lutheran": "News comes to Abraham about his brother Nahor's growing family.",
      "Presbyterian": "The narrative provides a genealogical update on Abraham's brother, Nahor.",
      "Pentecostal": "Abraham receives news about his brother Nahor's family.",
      "Episcopalian/Anglican": "Abraham receives news about his brother Nahor: his wife Milcah has borne sons.",
      "Orthodox": "The focus shifts to Abraham's relatives, detailing the offspring of his brother Nahor.",
      "Other": "Some time later Abraham was told, 'Milcah is also a mother; she has borne sons to your brother Nahor:'",
      "Prefer not to say": "Some time later Abraham was told, 'Milcah is also a mother; she has borne sons to your brother Nahor:'"
    },
    "21": {
      "General": "'Uz the firstborn, Buz his brother, Kemuel (the father of Aram),",
      "Non-Denominational": "'Uz the firstborn, Buz his brother, Kemuel (the father of Aram),",
      "Baptist": "Lists the first three sons of Nahor and Milcah.",
      "Catholic": "Lists the first sons born to Nahor and Milcah: Uz, Buz, and Kemuel (ancestor of the Arameans).",
      "Methodist": "Names the sons of Nahor and Milcah.",
      "Lutheran": "Lists the sons of Nahor and Milcah.",
      "Presbyterian": "Lists the sons of Nahor and Milcah.",
      "Pentecostal": "Names Nahor's sons.",
      "Episcopalian/Anglican": "Names the sons: Uz, Buz, and Kemuel.",
      "Orthodox": "Lists the sons of Nahor by Milcah.",
      "Other": "'Uz the firstborn, Buz his brother, Kemuel (the father of Aram),",
      "Prefer not to say": "'Uz the firstborn, Buz his brother, Kemuel (the father of Aram),"
    },
    "22": {
      "General": "'Kesed, Hazo, Pildash, Jidlaph and Bethuel.'",
      "Non-Denominational": "'Kesed, Hazo, Pildash, Jidlaph and Bethuel.'",
      "Baptist": "Continues the list of Nahor's sons by Milcah.",
      "Catholic": "Continues the list of Nahor and Milcah's sons.",
      "Methodist": "Continues the list of Nahor's sons.",
      "Lutheran": "Continues the list of Nahor's sons.",
      "Presbyterian": "Continues the list of Nahor's sons.",
      "Pentecostal": "Continues naming Nahor's sons.",
      "Episcopalian/Anglican": "Continues the list of sons: Kesed, Hazo, Pildash, Jidlaph, and Bethuel.",
      "Orthodox": "Continues the list of Nahor's sons by Milcah.",
      "Other": "'Kesed, Hazo, Pildash, Jidlaph and Bethuel.'",
      "Prefer not to say": "'Kesed, Hazo, Pildash, Jidlaph and Bethuel.'"
    },
    "23": {
      "General": "Bethuel became the father of Rebekah. Milcah bore these eight sons to Abraham's brother Nahor.",
      "Non-Denominational": "Bethuel became the father of Rebekah. Milcah bore these eight sons to Abraham's brother Nahor.",
      "Baptist": "Highlights Bethuel, the father of Rebekah (Isaac's future wife), linking this genealogy back to the main narrative line.",
      "Catholic": "Highlights the significance of Bethuel as the father of Rebekah, who will become Isaac's wife, thus connecting this genealogy to the continuation of the covenant line.",
      "Methodist": "Significantly notes that Bethuel is Rebekah's father, foreshadowing her role in the covenant story.",
      "Lutheran": "Notes specifically Bethuel, the father of Rebekah, connecting this genealogy to Isaac's future.",
      "Presbyterian": "Specifically mentions Bethuel, the father of Rebekah, preparing for her introduction into the covenant narrative.",
      "Pentecostal": "Highlights Bethuel, the father of Rebekah.",
      "Episcopalian/Anglican": "Specifically notes that Bethuel fathered Rebekah (Isaac's future wife). Summarizes the eight sons Milcah bore to Nahor.",
      "Orthodox": "Highlights the birth of Rebekah through Bethuel, subtly preparing for her future role in the narrative.",
      "Other": "Bethuel became the father of Rebekah. Milcah bore these eight sons to Abraham's brother Nahor.",
      "Prefer not to say": "Bethuel became the father of Rebekah. Milcah bore these eight sons to Abraham's brother Nahor."
    },
    "24": {
      "General": "His concubine, whose name was Reumah, also had sons: Tebah, Gaham, Tahash and Maakah.",
      "Non-Denominational": "His concubine, whose name was Reumah, also had sons: Tebah, Gaham, Tahash and Maakah.",
      "Baptist": "Lists the additional sons of Nahor through his concubine Reumah.",
      "Catholic": "Also lists the sons born to Nahor through his concubine, Reumah.",
      "Methodist": "Lists the sons born to Nahor through his concubine, Reumah.",
      "Lutheran": "Lists the sons born to Nahor by his concubine Reumah.",
      "Presbyterian": "Lists the sons born to Nahor through his concubine, Reumah.",
      "Pentecostal": "Lists Nahor's sons through his concubine Reumah.",
      "Episcopalian/Anglican": "Lists the sons Nahor had by his concubine Reumah.",
      "Orthodox": "Lists the sons born to Nahor through his concubine, Reumah.",
      "Other": "His concubine, whose name was Reumah, also had sons: Tebah, Gaham, Tahash and Maakah.",
      "Prefer not to say": "His concubine, whose name was Reumah, also had sons: Tebah, Gaham, Tahash and Maakah."
    }
  }
} 