{
  "_comment": "Interpretations for Genesis Chapter 23",
  "book": "Genesis",
  "chapter": "23",
  "verses": {
    "1": {
      "General": "Sarah lived to be a hundred and twenty-seven years old.",
      "Non-Denominational": "Sarah lived to be a hundred and twenty-seven years old.",
      "Baptist": "States Sarah's age at death, highlighting her long life as the matriarch.",
      "Catholic": "Records the length of Sarah's life (127 years), the only woman in Scripture whose age at death is explicitly given.",
      "Methodist": "Notes Sarah's lifespan, marking the end of her journey of faith.",
      "Lutheran": "States Sarah's age at the time of her death.",
      "Presbyterian": "Records Sarah's age at death (127 years).",
      "Pentecostal": "States Sarah's age at her death.",
      "Episcopalian/Anglican": "Records Sarah's lifespan as 127 years.",
      "Orthodox": "States the duration of Sarah's life, emphasizing her significance.",
      "Other": "Sarah lived to be a hundred and twenty-seven years old.",
      "Prefer not to say": "Sarah lived to be a hundred and twenty-seven years old."
    },
    "2": {
      "General": "She died at Kiriath Arba (that is, Hebron) in the land of Canaan, and Abraham went to mourn for Sarah and to weep over her.",
      "Non-Denominational": "She died at Kiriath Arba (that is, Hebron) in the land of Canaan, and Abraham went to mourn for Sarah and to weep over her.",
      "Baptist": "Records Sarah's death in Hebron and Abraham's appropriate grief and mourning.",
      "Catholic": "Records the place of Sarah's death (Kiriath Arba/Hebron in Canaan) and Abraham's deep grief and mourning for his wife.",
      "Methodist": "Notes Sarah's death location (Hebron) and Abraham's expression of grief.",
      "Lutheran": "Sarah dies in Hebron (Kiriath Arba) in Canaan. Abraham performs the customary rites of mourning.",
      "Presbyterian": "Sarah dies in Hebron, within the Promised Land. Abraham engages in proper mourning rituals.",
      "Pentecostal": "Sarah dies in Hebron. Abraham mourns her passing.",
      "Episcopalian/Anglican": "Records Sarah's death in Kiriath Arba (Hebron) and Abraham's period of mourning.",
      "Orthodox": "Notes the location of Sarah's death (Hebron) and Abraham's period of mourning for her.",
      "Other": "She died at Kiriath Arba (that is, Hebron) in the land of Canaan, and Abraham went to mourn for Sarah and to weep over her.",
      "Prefer not to say": "She died at Kiriath Arba (that is, Hebron) in the land of Canaan, and Abraham went to mourn for Sarah and to weep over her."
    },
    "3": {
      "General": "Then Abraham rose from beside his dead wife and spoke to the Hittites. He said,",
      "Non-Denominational": "Then Abraham rose from beside his dead wife and spoke to the Hittites. He said,",
      "Baptist": "Abraham transitions from mourning to action, seeking to secure a burial place among the local inhabitants (Hittites).",
      "Catholic": "After the initial period of mourning, Abraham addresses the local population (Hittites, sons of Heth) to negotiate for a burial site.",
      "Methodist": "Abraham moves from private grief to public negotiation to secure a proper burial site.",
      "Lutheran": "Abraham rises from mourning to negotiate with the Hittites (sons of Heth) for a burial place.",
      "Presbyterian": "Abraham concludes his initial mourning and initiates negotiations with the Hittites (sons of Heth).",
      "Pentecostal": "Abraham approaches the Hittites to arrange for Sarah's burial.",
      "Episcopalian/Anglican": "Abraham finishes his initial mourning and addresses the local Hittites.",
      "Orthodox": "Abraham concludes the initial phase of mourning and begins discussions with the local Hittites.",
      "Other": "Then Abraham rose from beside his dead wife and spoke to the Hittites. He said,",
      "Prefer not to say": "Then Abraham rose from beside his dead wife and spoke to the Hittites. He said,"
    },
    "4": {
      "General": "'I am a foreigner and stranger among you. Sell me some property for a burial site here so I can bury my dead.'",
      "Non-Denominational": "'I am a foreigner and stranger among you. Sell me some property for a burial site here so I can bury my dead.'",
      "Baptist": "Abraham acknowledges his status as an alien but requests land ownership for a specific, permanent purpose: burial.",
      "Catholic": "Abraham respectfully acknowledges his status as a resident alien ('foreigner and stranger') and requests to purchase land for a permanent burial site for Sarah.",
      "Methodist": "Abraham identifies himself as an outsider but seeks to purchase land for the essential need of burial.",
      "Lutheran": "Abraham humbly identifies himself as a foreigner and requests to purchase a permanent burial site.",
      "Presbyterian": "Abraham acknowledges his status as a sojourner but asserts his need to purchase land for a burial plot, claiming a foothold in the land.",
      "Pentecostal": "Abraham identifies as a foreigner and asks to buy land for burial.",
      "Episcopalian/Anglican": "Abraham identifies himself as a 'foreigner and stranger' and requests to purchase property for a burial site.",
      "Orthodox": "Abraham, acknowledging his status as an alien, requests the purchase of property for a permanent family tomb.",
      "Other": "'I am a foreigner and stranger among you. Sell me some property for a burial site here so I can bury my dead.'",
      "Prefer not to say": "'I am a foreigner and stranger among you. Sell me some property for a burial site here so I can bury my dead.'"
    },
    "5": {
      "General": "The Hittites replied to Abraham,",
      "Non-Denominational": "The Hittites replied to Abraham,",
      "Baptist": "The Hittites begin their formal response to Abraham's request.",
      "Catholic": "The Hittites formally respond to Abraham's request.",
      "Methodist": "The local leaders respond to Abraham's proposal.",
      "Lutheran": "The Hittites reply to Abraham's request.",
      "Presbyterian": "The Hittites respond formally to Abraham.",
      "Pentecostal": "The Hittites answer Abraham.",
      "Episcopalian/Anglican": "The Hittites respond to Abraham.",
      "Orthodox": "The Hittites begin their formal reply to Abraham.",
      "Other": "The Hittites replied to Abraham,",
      "Prefer not to say": "The Hittites replied to Abraham,"
    },
    "6": {
      "General": "'Sir, listen to us. You are a mighty prince among us. Bury your dead in the choicest of our tombs. None of us will refuse you his tomb for burying your dead.'",
      "Non-Denominational": "'Sir, listen to us. You are a mighty prince among us. Bury your dead in the choicest of our tombs. None of us will refuse you his tomb for burying your dead.'",
      "Baptist": "The Hittites honor Abraham ('mighty prince') and offer him free use of any of their tombs, though not outright ownership of land.",
      "Catholic": "The Hittites show great respect, calling Abraham a 'mighty prince' (or 'prince of God'). They offer him the best of their existing tombs freely for burial, though this avoids selling him land.",
      "Methodist": "They express high regard for Abraham ('mighty prince') and generously offer burial space in their best tombs.",
      "Lutheran": "The Hittites respectfully address Abraham as a 'mighty prince' and generously offer him the use of their best tombs.",
      "Presbyterian": "The Hittites show respect for Abraham ('mighty prince'/'prince of God') and offer him burial rights in their choicest tomb, but strategically avoid selling land.",
      "Pentecostal": "They honor Abraham and offer him the best burial plot freely.",
      "Episcopalian/Anglican": "The Hittites respectfully call Abraham a 'mighty prince' and generously offer him the use of any of their best tombs for burial.",
      "Orthodox": "The Hittites express high esteem for Abraham ('mighty prince') and generously offer him the use of their finest tombs, without granting land ownership.",
      "Other": "'Sir, listen to us. You are a mighty prince among us. Bury your dead in the choicest of our tombs. None of us will refuse you his tomb for burying your dead.'",
      "Prefer not to say": "'Sir, listen to us. You are a mighty prince among us. Bury your dead in the choicest of our tombs. None of us will refuse you his tomb for burying your dead.'"
    },
    "7": {
      "General": "Then Abraham rose and bowed down before the people of the land, the Hittites.",
      "Non-Denominational": "Then Abraham rose and bowed down before the people of the land, the Hittites.",
      "Baptist": "Abraham shows customary respect and gratitude for their offer, bowing before them.",
      "Catholic": "Abraham shows customary respect and humility, bowing before the assembled Hittites in response to their offer.",
      "Methodist": "Abraham responds with customary courtesy, bowing in respect.",
      "Lutheran": "Abraham shows deep respect by bowing down to the Hittites.",
      "Presbyterian": "Abraham shows respect and deference according to custom by bowing.",
      "Pentecostal": "Abraham shows respect by bowing.",
      "Episcopalian/Anglican": "Abraham shows formal respect by bowing to the Hittites.",
      "Orthodox": "Abraham demonstrates respect and courtesy by bowing before the Hittite assembly.",
      "Other": "Then Abraham rose and bowed down before the people of the land, the Hittites.",
      "Prefer not to say": "Then Abraham rose and bowed down before the people of the land, the Hittites."
    },
    "8": {
      "General": "He said to them, 'If you are willing to let me bury my dead, then listen to me and intercede with Ephron son of Zohar on my behalf'",
      "Non-Denominational": "He said to them, 'If you are willing to let me bury my dead, then listen to me and intercede with Ephron son of Zohar on my behalf'",
      "Baptist": "Abraham graciously acknowledges their offer but presses his desire to purchase a specific property owned by Ephron.",
      "Catholic": "Abraham politely steers the negotiation towards his goal: purchasing a specific property. He asks the Hittite assembly to mediate with Ephron, the owner.",
      "Methodist": "Abraham politely redirects, asking them to persuade Ephron to sell a specific piece of land.",
      "Lutheran": "Abraham tactfully asks them to intercede with Ephron son of Zohar on his behalf concerning a specific cave.",
      "Presbyterian": "Abraham respectfully persists in seeking purchase, requesting their help in negotiating with Ephron for a specific cave.",
      "Pentecostal": "Abraham asks them to help him negotiate with Ephron.",
      "Episcopalian/Anglican": "Abraham politely indicates his desire for a specific plot and asks them to intercede with Ephron, son of Zohar.",
      "Orthodox": "Abraham respectfully persists, requesting their mediation with Ephron, the owner of the desired plot.",
      "Other": "He said to them, 'If you are willing to let me bury my dead, then listen to me and intercede with Ephron son of Zohar on my behalf'",
      "Prefer not to say": "He said to them, 'If you are willing to let me bury my dead, then listen to me and intercede with Ephron son of Zohar on my behalf'"
    },
    "9": {
      "General": "'so he will sell me the cave of Machpelah, which belongs to him and is at the end of his field. Ask him to sell it to me for the full price as a burial site among you.'",
      "Non-Denominational": "'so he will sell me the cave of Machpelah, which belongs to him and is at the end of his field. Ask him to sell it to me for the full price as a burial site among you.'",
      "Baptist": "Abraham specifies the Cave of Machpelah and insists on paying the full market price to ensure undisputed ownership.",
      "Catholic": "Abraham specifies the Cave of Machpelah at the edge of Ephron's field and insists on paying the 'full price' to secure permanent, legal ownership as a burial site among them.",
      "Methodist": "He identifies the specific cave (Machpelah) and emphasizes his willingness to pay the full value for secure ownership.",
      "Lutheran": "He identifies the Cave of Machpelah and insists on paying the full price to secure undisputed ownership.",
      "Presbyterian": "Abraham specifies the Cave of Machpelah and insists on paying the full price, securing legal title.",
      "Pentecostal": "Abraham specifies the Cave of Machpelah and offers to pay full price.",
      "Episcopalian/Anglican": "He specifies the Cave of Machpelah and insists on paying the 'full price' for it to secure ownership.",
      "Orthodox": "Abraham clearly identifies the Cave of Machpelah and stresses his intention to purchase it for its full value, ensuring a legitimate transaction.",
      "Other": "'so he will sell me the cave of Machpelah, which belongs to him and is at the end of his field. Ask him to sell it to me for the full price as a burial site among you.'",
      "Prefer not to say": "'so he will sell me the cave of Machpelah, which belongs to him and is at the end of his field. Ask him to sell it to me for the full price as a burial site among you.'"
    },
    "10": {
      "General": "Ephron the Hittite was sitting among his people and he replied to Abraham in the hearing of all the Hittites who had come to the gate of his city.",
      "Non-Denominational": "Ephron the Hittite was sitting among his people and he replied to Abraham in the hearing of all the Hittites who had come to the gate of his city.",
      "Baptist": "Ephron responds publicly at the city gate (the place of legal transactions) in the presence of witnesses.",
      "Catholic": "Ephron, present in the assembly at the city gate (the public forum for legal matters), responds publicly to Abraham's request.",
      "Methodist": "Ephron responds publicly at the city gate, the center for business and legal affairs.",
      "Lutheran": "Ephron replies publicly at the city gate, where legal transactions took place.",
      "Presbyterian": "Ephron responds publicly before witnesses at the city gate, the place for legal transactions.",
      "Pentecostal": "Ephron responds publicly before the town elders.",
      "Episcopalian/Anglican": "Ephron, who is present, replies publicly before all the Hittites at the city gate (the place for transactions).",
      "Orthodox": "Ephron responds publicly within the hearing of the assembly at the city gate, the customary place for legal proceedings.",
      "Other": "Ephron the Hittite was sitting among his people and he replied to Abraham in the hearing of all the Hittites who had come to the gate of his city.",
      "Prefer not to say": "Ephron the Hittite was sitting among his people and he replied to Abraham in the hearing of all the Hittites who had come to the gate of his city."
    },
    "11": {
      "General": "'No, my lord,' he said. 'Listen to me; I give you the field, and I give you the cave that is in it. I give it to you in the presence of my people. Bury your dead.'",
      "Non-Denominational": "'No, my lord,' he said. 'Listen to me; I give you the field, and I give you the cave that is in it. I give it to you in the presence of my people. Bury your dead.'",
      "Baptist": "Ephron makes a grand gesture, offering the field and cave as a gift, potentially a bargaining tactic or avoiding a permanent land sale to a foreigner.",
      "Catholic": "Ephron makes an elaborate, polite refusal to sell, instead offering the entire field and the cave as a 'gift' in front of witnesses. This generous offer may be a customary bargaining prelude or a way to retain ultimate control.",
      "Methodist": "Ephron makes a generous public offer, seemingly gifting the field and cave, though this might be a negotiation tactic.",
      "Lutheran": "Ephron politely offers the field and cave as a gift, a common Ancient Near Eastern bargaining practice.",
      "Presbyterian": "Ephron makes an expansive offer to 'give' the field and cave, likely a customary (and perhaps insincere) bargaining gesture.",
      "Pentecostal": "Ephron offers the land as a gift.",
      "Episcopalian/Anglican": "Ephron makes a seemingly generous offer to 'give' Abraham the field and the cave freely.",
      "Orthodox": "Ephron responds with a grand gesture of offering the field and cave as a gift, typical of Near Eastern negotiation.",
      "Other": "'No, my lord,' he said. 'Listen to me; I give you the field, and I give you the cave that is in it. I give it to you in the presence of my people. Bury your dead.'",
      "Prefer not to say": "'No, my lord,' he said. 'Listen to me; I give you the field, and I give you the cave that is in it. I give it to you in the presence of my people. Bury your dead.'"
    },
    "12": {
      "General": "Again Abraham bowed down before the people of the land",
      "Non-Denominational": "Again Abraham bowed down before the people of the land",
      "Baptist": "Abraham again shows respect but implicitly rejects the 'gift' offer, preparing to insist on purchase.",
      "Catholic": "Abraham again bows respectfully, acknowledging the offer but preparing to insist on a purchase rather than accepting a gift.",
      "Methodist": "Abraham shows respect again, signaling his intent to proceed with the purchase.",
      "Lutheran": "Abraham bows respectfully again, but proceeds to insist on purchasing.",
      "Presbyterian": "Abraham again bows respectfully, maintaining politeness while preparing to counter-offer.",
      "Pentecostal": "Abraham bows again in respect.",
      "Episcopalian/Anglican": "Abraham bows again respectfully, indicating he understands the custom but still intends to purchase.",
      "Orthodox": "Abraham again bows in respect, acknowledging the offer while maintaining his aim to purchase.",
      "Other": "Again Abraham bowed down before the people of the land",
      "Prefer not to say": "Again Abraham bowed down before the people of the land"
    },
    "13": {
      "General": "and he said to Ephron in their hearing, 'Listen to me, if you will. I will pay the price of the field. Accept it from me so I can bury my dead there.'",
      "Non-Denominational": "and he said to Ephron in their hearing, 'Listen to me, if you will. I will pay the price of the field. Accept it from me so I can bury my dead there.'",
      "Baptist": "Abraham politely insists on paying, offering to buy the entire field to secure the cave.",
      "Catholic": "Abraham respectfully insists on paying, offering to buy the whole field (not just the cave) to ensure the transaction is a clear purchase.",
      "Methodist": "Abraham firmly but politely insists on paying for the field to secure undisputed rights.",
      "Lutheran": "Abraham insists on paying the price for the field, ensuring a clear purchase.",
      "Presbyterian": "Abraham politely but firmly insists on purchasing the field for its price.",
      "Pentecostal": "Abraham insists on paying for the field.",
      "Episcopalian/Anglican": "Abraham insists on paying the price for the field, rejecting the offer of a gift.",
      "Orthodox": "Abraham reiterates his desire to purchase, offering to pay the value of the entire field.",
      "Other": "and he said to Ephron in their hearing, 'Listen to me, if you will. I will pay the price of the field. Accept it from me so I can bury my dead there.'",
      "Prefer not to say": "and he said to Ephron in their hearing, 'Listen to me, if you will. I will pay the price of the field. Accept it from me so I can bury my dead there.'"
    },
    "14": {
      "General": "Ephron answered Abraham,",
      "Non-Denominational": "Ephron answered Abraham,",
      "Baptist": "Ephron responds to Abraham's insistence on paying.",
      "Catholic": "Ephron responds to Abraham's insistence on purchase.",
      "Methodist": "Ephron replies to Abraham's counter-offer.",
      "Lutheran": "Ephron replies to Abraham's insistence on paying.",
      "Presbyterian": "Ephron responds to Abraham's offer to buy.",
      "Pentecostal": "Ephron answers.",
      "Episcopalian/Anglican": "Ephron replies to Abraham's insistence on payment.",
      "Orthodox": "Ephron answers Abraham's offer.",
      "Other": "Ephron answered Abraham,",
      "Prefer not to say": "Ephron answered Abraham,"
    },
    "15": {
      "General": "'Listen to me, my lord; the land is worth four hundred shekels of silver, but what is that between me and you? Bury your dead.'",
      "Non-Denominational": "'Listen to me, my lord; the land is worth four hundred shekels of silver, but what is that between me and you? Bury your dead.'",
      "Baptist": "Ephron names an exorbitant price (400 shekels) while pretending it's insignificant, completing the bargaining posture.",
      "Catholic": "Ephron names a very high price (400 shekels of silver) but couches it in polite language, feigning indifference ('what is that between me and you?').",
      "Methodist": "Ephron names a high price (400 shekels) but minimizes its significance, maintaining a posture of generosity.",
      "Lutheran": "Ephron names a high price (400 silver shekels) but downplays it, continuing the bargaining.",
      "Presbyterian": "Ephron names an extremely high price (400 shekels) while feigning nonchalance.",
      "Pentecostal": "Ephron names the price (400 shekels) but pretends it's trivial.",
      "Episcopalian/Anglican": "Ephron states the price (a substantial 400 shekels of silver) while politely minimizing its importance between them.",
      "Orthodox": "Ephron states the price, a significant sum (400 shekels), while maintaining the appearance of generosity.",
      "Other": "'Listen to me, my lord; the land is worth four hundred shekels of silver, but what is that between me and you? Bury your dead.'",
      "Prefer not to say": "'Listen to me, my lord; the land is worth four hundred shekels of silver, but what is that between me and you? Bury your dead.'"
    },
    "16": {
      "General": "Abraham agreed to Ephron's terms and weighed out for him the price he had named in the hearing of the Hittites: four hundred shekels of silver, according to the weight current among the merchants.",
      "Non-Denominational": "Abraham agreed to Ephron's terms and weighed out for him the price he had named in the hearing of the Hittites: four hundred shekels of silver, according to the weight current among the merchants.",
      "Baptist": "Abraham accepts the price without haggling and pays immediately with silver weighed according to the merchant standard, finalizing the transaction publicly.",
      "Catholic": "Abraham accepts Ephron's stated price without haggling and pays the full amount (400 shekels) in silver, weighed according to the recognized commercial standard, ensuring a legally sound transaction before the Hittite witnesses.",
      "Methodist": "Abraham accepts the terms and pays the full amount in silver, weighed by the current standard, making the purchase official.",
      "Lutheran": "Abraham accepts the price without negotiation and pays the agreed amount in silver, according to the standard commercial weight.",
      "Presbyterian": "Abraham agrees to the price without haggling and pays the full amount in silver according to the standard weight, completing the purchase legally.",
      "Pentecostal": "Abraham agrees and pays the full price in standard silver.",
      "Episcopalian/Anglican": "Abraham accepts the price and weighs out the 400 shekels of silver according to the standard merchant weight, completing the transaction publicly.",
      "Orthodox": "Abraham agrees to the terms and weighs out the full price in silver, using the accepted standard weight, publicly confirming the purchase.",
      "Other": "Abraham agreed to Ephron's terms and weighed out for him the price he had named in the hearing of the Hittites: four hundred shekels of silver, according to the weight current among the merchants.",
      "Prefer not to say": "Abraham agreed to Ephron's terms and weighed out for him the price he had named in the hearing of the Hittites: four hundred shekels of silver, according to the weight current among the merchants."
    },
    "17": {
      "General": "So Ephron's field in Machpelah near Mamre—both the field and the cave in it, and all the trees within the borders of the field—was deeded",
      "Non-Denominational": "So Ephron's field in Machpelah near Mamre—both the field and the cave in it, and all the trees within the borders of the field—was deeded",
      "Baptist": "Details the specific property transferred: the field, the cave, and all trees, legally secured for Abraham.",
      "Catholic": "Specifies the property transferred includes the field, the cave within it, and all trees on the property near Mamre. The transaction legally secures ('deeded') this property.",
      "Methodist": "The sale includes the field, the cave, and associated resources (trees), formally transferring ownership.",
      "Lutheran": "The field at Machpelah near Mamre, including the cave and all trees, is formally transferred.",
      "Presbyterian": "The text carefully delineates the property purchased: the field, the cave, and all trees, legally securing it.",
      "Pentecostal": "Details the property purchased: field, cave, and trees.",
      "Episcopalian/Anglican": "Details the full extent of the property purchased: the field in Machpelah near Mamre, the cave within it, and all the trees on the property.",
      "Orthodox": "Specifies the extent of the purchased property—field, cave, and trees—legally secured for Abraham.",
      "Other": "So Ephron's field in Machpelah near Mamre—both the field and the cave in it, and all the trees within the borders of the field—was deeded",
      "Prefer not to say": "So Ephron's field in Machpelah near Mamre—both the field and the cave in it, and all the trees within the borders of the field—was deeded"
    },
    "18": {
      "General": "to Abraham as his property in the presence of all the Hittites who had come to the gate of the city.",
      "Non-Denominational": "to Abraham as his property in the presence of all the Hittites who had come to the gate of the city.",
      "Baptist": "Confirms the transfer of ownership to Abraham, witnessed publicly by the Hittites at the city gate.",
      "Catholic": "Confirms the legal transfer of the property to Abraham, made secure by the public transaction and witnessing by the Hittites at the city gate.",
      "Methodist": "Ownership is formally transferred to Abraham, witnessed by the community leaders.",
      "Lutheran": "The property legally becomes Abraham's, witnessed by the Hittites at the city gate.",
      "Presbyterian": "The property is formally deeded to Abraham in the presence of the Hittite witnesses at the gate.",
      "Pentecostal": "The ownership is transferred to Abraham publicly.",
      "Episcopalian/Anglican": "The property is formally secured ('deeded') to Abraham in the presence of the Hittite witnesses at the city gate.",
      "Orthodox": "Confirms the legal transfer of the property to Abraham, validated by public witness.",
      "Other": "to Abraham as his property in the presence of all the Hittites who had come to the gate of the city.",
      "Prefer not to say": "to Abraham as his property in the presence of all the Hittites who had come to the gate of the city."
    },
    "19": {
      "General": "Afterward, Abraham buried his wife Sarah in the cave in the field of Machpelah near Mamre (which is at Hebron) in the land of Canaan.",
      "Non-Denominational": "Afterward, Abraham buried his wife Sarah in the cave in the field of Machpelah near Mamre (which is at Hebron) in the land of Canaan.",
      "Baptist": "Abraham buries Sarah in the newly acquired cave, establishing the first piece of the Promised Land owned by his family.",
      "Catholic": "Having secured the property, Abraham buries Sarah in the Cave of Machpelah, establishing the first permanent, legally owned piece of the Promised Land for his family.",
      "Methodist": "Abraham buries Sarah in the cave he purchased, marking the family's first owned land in Canaan.",
      "Lutheran": "Abraham buries Sarah in the purchased cave at Machpelah near Hebron.",
      "Presbyterian": "Abraham buries Sarah in the Cave of Machpelah, securing the family's first legal land holding in Canaan.",
      "Pentecostal": "Abraham buries Sarah in the purchased cave.",
      "Episcopalian/Anglican": "Abraham buries Sarah in the cave of the field of Machpelah, the property he had just purchased.",
      "Orthodox": "Abraham buries Sarah in the cave, establishing it as the family tomb and marking the first ownership of land in Canaan.",
      "Other": "Afterward, Abraham buried his wife Sarah in the cave in the field of Machpelah near Mamre (which is at Hebron) in the land of Canaan.",
      "Prefer not to say": "Afterward, Abraham buried his wife Sarah in the cave in the field of Machpelah near Mamre (which is at Hebron) in the land of Canaan."
    },
    "20": {
      "General": "So the field and the cave in it were deeded to Abraham by the Hittites as a burial site.",
      "Non-Denominational": "So the field and the cave in it were deeded to Abraham by the Hittites as a burial site.",
      "Baptist": "Reiterates the secure transfer of the field and cave from the Hittites to Abraham specifically for burial purposes.",
      "Catholic": "Summarizes and confirms the legal transfer of the field and cave from the Hittites to Abraham, secured as a permanent burial property.",
      "Methodist": "Restates the formal transfer of the property from the Hittites to Abraham for use as a burial ground.",
      "Lutheran": "Reaffirms the legal transfer of the field and cave from the Hittites to Abraham as a burial site.",
      "Presbyterian": "Summarizes the transaction: the field and cave were legally secured from the Hittites by Abraham as a burial property.",
      "Pentecostal": "Confirms the property was legally transferred for burial.",
      "Episcopalian/Anglican": "Reiterates that the field and cave were formally secured from the Hittites by Abraham as property for a burial site.",
      "Orthodox": "Concludes by reaffirming the legal transfer of the property from the Hittites to Abraham for the purpose of a burial site.",
      "Other": "So the field and the cave in it were deeded to Abraham by the Hittites as a burial site.",
      "Prefer not to say": "So the field and the cave in it were deeded to Abraham by the Hittites as a burial site."
    }
  }
} 