{
  "_comment": "Interpretations for Genesis Chapter 25",
  "book": "Genesis",
  "chapter": "25",
  "verses": {
    "1": {
      "General": "Abraham had taken another wife, whose name was Keturah.",
      "Non-Denominational": "Abraham had taken another wife, whose name was Keturah.",
      "Baptist": "Abraham marries again after Sarah's death; introduces Keturah.",
      "Catholic": "Records Abraham taking another wife (or possibly a concubine elevated in status after Sarah's death), Keturah, indicating continued life and family expansion even in old age.",
      "Methodist": "Abraham takes a new wife, Keturah, after Sarah's death.",
      "Lutheran": "Abraham takes another wife (or concubine) named Keturah.",
      "Presbyterian": "Notes Abraham taking another wife, Keturah, after Sarah's death.",
      "Pentecostal": "Abraham marries Keturah.",
      "Episcopalian/Anglican": "Records Abraham taking another wife, Keturah, after Sarah's death.",
      "Orthodox": "Notes Abraham's marriage to Keturah following Sarah's death.",
      "Other": "Abraham had taken another wife, whose name was Keturah.",
      "Prefer not to say": "Abraham had taken another wife, whose name was Keturah."
    },
    "2": {
      "General": "She bore him Zimran, Jokshan, Medan, Midian, Ishbak and Shuah.",
      "Non-Denominational": "She bore him Zimran, Jokshan, Medan, Midian, Ishbak and Shuah.",
      "Baptist": "Lists the six sons born to Abraham and Keturah.",
      "Catholic": "Lists the six sons born to Abraham through Keturah: Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah. These sons would become progenitors of various Arab tribes.",
      "Methodist": "Lists the sons born to Abraham and Keturah, founders of various tribes.",
      "Lutheran": "Lists Keturah's six sons by Abraham.",
      "Presbyterian": "Lists the six sons born to Abraham by Keturah.",
      "Pentecostal": "Lists the sons of Abraham and Keturah.",
      "Episcopalian/Anglican": "Lists the six sons Keturah bore to Abraham.",
      "Orthodox": "Enumerates the six sons born to Abraham through Keturah.",
      "Other": "She bore him Zimran, Jokshan, Medan, Midian, Ishbak and Shuah.",
      "Prefer not to say": "She bore him Zimran, Jokshan, Medan, Midian, Ishbak and Shuah."
    },
    "3": {
      "General": "Jokshan was the father of Sheba and Dedan; the descendants of Dedan were the Ashurites, Letushites and Leummites.",
      "Non-Denominational": "Jokshan was the father of Sheba and Dedan; the descendants of Dedan were the Ashurites, Letushites and Leummites.",
      "Baptist": "Details the descendants of Jokshan (Sheba and Dedan) and further descendants of Dedan.",
      "Catholic": "Traces the lineage further through Jokshan (father of Sheba and Dedan) and lists Dedan's descendants (Ashurites, Letushites, Leummites), identifying further tribal groups.",
      "Methodist": "Traces Jokshan's descendants, identifying specific tribal groups.",
      "Lutheran": "Lists descendants of Jokshan (Sheba, Dedan) and Dedan (Ashurites, etc.).",
      "Presbyterian": "Details the descendants of Jokshan and Dedan.",
      "Pentecostal": "Lists descendants of Jokshan and Dedan.",
      "Episcopalian/Anglican": "Details the descendants of Jokshan (Sheba, Dedan) and Dedan (Ashurites, Letushites, Leummites).",
      "Orthodox": "Provides genealogical details for Jokshan and his descendants.",
      "Other": "Jokshan was the father of Sheba and Dedan; the descendants of Dedan were the Ashurites, Letushites and Leummites.",
      "Prefer not to say": "Jokshan was the father of Sheba and Dedan; the descendants of Dedan were the Ashurites, Letushites and Leummites."
    },
    "4": {
      "General": "The sons of Midian were Ephah, Epher, Hanoch, Abida and Eldaah. All these were descendants of Keturah.",
      "Non-Denominational": "The sons of Midian were Ephah, Epher, Hanoch, Abida and Eldaah. All these were descendants of Keturah.",
      "Baptist": "Lists the five sons of Midian (another son of Keturah).",
      "Catholic": "Lists the sons of Midian (Ephah, Epher, Hanoch, Abida, Eldaah) and confirms that all mentioned so far are descendants through Keturah.",
      "Methodist": "Lists the sons of Midian, confirming their descent from Keturah.",
      "Lutheran": "Lists the sons of Midian. Confirms all these are Keturah's descendants.",
      "Presbyterian": "Lists the sons of Midian, descendants of Keturah.",
      "Pentecostal": "Lists the sons of Midian.",
      "Episcopalian/Anglican": "Lists the sons of Midian and confirms all mentioned are descendants of Keturah.",
      "Orthodox": "Lists the sons of Midian, confirming their lineage through Keturah.",
      "Other": "The sons of Midian were Ephah, Epher, Hanoch, Abida and Eldaah. All these were descendants of Keturah.",
      "Prefer not to say": "The sons of Midian were Ephah, Epher, Hanoch, Abida and Eldaah. All these were descendants of Keturah."
    },
    "5": {
      "General": "Abraham left everything he owned to Isaac.",
      "Non-Denominational": "Abraham left everything he owned to Isaac.",
      "Baptist": "Reaffirms Isaac as the sole primary heir of Abraham's entire estate.",
      "Catholic": "Explicitly states that Abraham bequeathed his entire estate ('everything he owned') to Isaac, confirming Isaac's position as the primary heir of the covenant promise and inheritance.",
      "Methodist": "Confirms Isaac as the sole heir of Abraham's possessions, central to the covenant line.",
      "Lutheran": "Abraham designates Isaac as his sole heir, leaving him everything.",
      "Presbyterian": "Emphasizes Isaac's status as the sole heir of Abraham's estate and covenant promise.",
      "Pentecostal": "Isaac is confirmed as the sole heir.",
      "Episcopalian/Anglican": "Confirms that Abraham bequeathed all his possessions to Isaac, the son of the promise.",
      "Orthodox": "States clearly that Abraham designated Isaac as the sole inheritor of his entire estate.",
      "Other": "Abraham left everything he owned to Isaac.",
      "Prefer not to say": "Abraham left everything he owned to Isaac."
    },
    "6": {
      "General": "But while he was still living, he gave gifts to the sons of his concubines and sent them away from his son Isaac to the land of the east.",
      "Non-Denominational": "But while he was still living, he gave gifts to the sons of his concubines and sent them away from his son Isaac to the land of the east.",
      "Baptist": "Abraham provides for his other sons (from Keturah and likely Hagar) with gifts but sends them eastward, separating them from Isaac to avoid inheritance disputes.",
      "Catholic": "Details how Abraham, during his lifetime, provided for the sons of his concubines (likely including Keturah and Hagar) with gifts but strategically sent them away eastward, physically separating them from Isaac to ensure Isaac's undisputed inheritance and primacy in Canaan.",
      "Methodist": "Abraham provides for his other sons but sends them away to the east, securing Isaac's inheritance and position.",
      "Lutheran": "Abraham gives gifts to the sons of his concubines (Keturah, Hagar) but sends them away eastward during his lifetime, separating them from Isaac.",
      "Presbyterian": "Abraham provides gifts for his other sons but sends them eastward, away from Isaac, ensuring clarity regarding inheritance and covenant.",
      "Pentecostal": "Abraham gives gifts to other sons but sends them away from Isaac.",
      "Episcopalian/Anglican": "Abraham gives gifts to the sons of his concubines (Keturah, perhaps Hagar) during his lifetime and sends them away eastward, ensuring Isaac's sole inheritance in Canaan.",
      "Orthodox": "Describes Abraham providing for his sons through concubines with gifts but sending them eastward to prevent future conflict with Isaac over inheritance.",
      "Other": "But while he was still living, he gave gifts to the sons of his concubines and sent them away from his son Isaac to the land of the east.",
      "Prefer not to say": "But while he was still living, he gave gifts to the sons of his concubines and sent them away from his son Isaac to the land of the east."
    },
    "7": {
      "General": "Abraham lived a hundred and seventy-five years.",
      "Non-Denominational": "Abraham lived a hundred and seventy-five years.",
      "Baptist": "States Abraham's total lifespan: 175 years.",
      "Catholic": "Records Abraham's total lifespan as 175 years.",
      "Methodist": "States Abraham's age at death: 175 years.",
      "Lutheran": "Abraham's total lifespan was 175 years.",
      "Presbyterian": "Records Abraham's total lifespan as 175 years.",
      "Pentecostal": "Abraham lived 175 years.",
      "Episcopalian/Anglican": "States Abraham's total lifespan: 175 years.",
      "Orthodox": "Records the total duration of Abraham's life as 175 years.",
      "Other": "Abraham lived a hundred and seventy-five years.",
      "Prefer not to say": "Abraham lived a hundred and seventy-five years."
    },
    "8": {
      "General": "Then Abraham breathed his last and died at a good old age, an old man and full of years; and he was gathered to his people.",
      "Non-Denominational": "Then Abraham breathed his last and died at a good old age, an old man and full of years; and he was gathered to his people.",
      "Baptist": "Describes Abraham's peaceful death at an advanced, satisfying age, using the common euphemism 'gathered to his people' (joining ancestors in death).",
      "Catholic": "Describes Abraham's death peacefully ('breathed his last') at a ripe old age ('good old age, an old man and full of years'), indicating a fulfilled life. The phrase 'gathered to his people' signifies joining his ancestors in the afterlife/Sheol.",
      "Methodist": "Narrates Abraham's peaceful death at a fulfilled old age, being 'gathered to his people' (ancestors).",
      "Lutheran": "Abraham dies peacefully at a very old age, fulfilled ('full of years'), and joins his ancestors ('gathered to his people').",
      "Presbyterian": "Describes Abraham's death as peaceful, occurring at an advanced age after a full life ('gathered to his people').",
      "Pentecostal": "Abraham dies peacefully at a good old age.",
      "Episcopalian/Anglican": "Describes Abraham's peaceful death at a ripe old age, emphasizing a long and fulfilled life ('gathered to his people').",
      "Orthodox": "Records Abraham's peaceful death at an advanced age, signifying a complete life, and his joining his ancestors ('gathered to his people').",
      "Other": "Then Abraham breathed his last and died at a good old age, an old man and full of years; and he was gathered to his people.",
      "Prefer not to say": "Then Abraham breathed his last and died at a good old age, an old man and full of years; and he was gathered to his people."
    },
    "9": {
      "General": "His sons Isaac and Ishmael buried him in the cave of Machpelah near Mamre, in the field of Ephron son of Zohar the Hittite,",
      "Non-Denominational": "His sons Isaac and Ishmael buried him in the cave of Machpelah near Mamre, in the field of Ephron son of Zohar the Hittite,",
      "Baptist": "Isaac (heir) and Ishmael (firstborn) come together to bury Abraham in the family tomb purchased earlier (Cave of Machpelah).",
      "Catholic": "Notably, his sons Isaac and Ishmael cooperate in burying Abraham in the Cave of Machpelah (near Mamre), the burial plot Abraham had previously purchased from Ephron the Hittite.",
      "Methodist": "Isaac and Ishmael jointly bury their father in the Cave of Machpelah.",
      "Lutheran": "His sons, Isaac and Ishmael together, bury Abraham in the Cave of Machpelah, which Abraham had bought.",
      "Presbyterian": "Isaac and Ishmael, his sons, jointly bury Abraham in the family tomb at Machpelah.",
      "Pentecostal": "Isaac and Ishmael bury Abraham together in Machpelah.",
      "Episcopalian/Anglican": "His sons Isaac and Ishmael cooperate to bury Abraham in the Cave of Machpelah, the plot he had purchased.",
      "Orthodox": "Highlights the reunification (at least temporarily) of Isaac and Ishmael to bury their father Abraham in the Cave of Machpelah.",
      "Other": "His sons Isaac and Ishmael buried him in the cave of Machpelah near Mamre, in the field of Ephron son of Zohar the Hittite,",
      "Prefer not to say": "His sons Isaac and Ishmael buried him in the cave of Machpelah near Mamre, in the field of Ephron son of Zohar the Hittite,"
    },
    "10": {
      "General": "the field Abraham had bought from the Hittites. There Abraham was buried with his wife Sarah.",
      "Non-Denominational": "the field Abraham had bought from the Hittites. There Abraham was buried with his wife Sarah.",
      "Baptist": "Reiterates that this was the field Abraham purchased, where Sarah was also buried.",
      "Catholic": "Confirms this is the field Abraham purchased from the Hittites, and notes he is buried there alongside his wife Sarah.",
      "Methodist": "Reconfirms the location as the field purchased by Abraham, where Sarah also lies.",
      "Lutheran": "Reiterates that Abraham bought this field, and he was buried there with Sarah.",
      "Presbyterian": "Confirms the burial site as the one purchased by Abraham, where Sarah was also interred.",
      "Pentecostal": "Abraham is buried with Sarah in the field he bought.",
      "Episcopalian/Anglican": "Reiterates that this is the field purchased from the Hittites, where Abraham was buried alongside Sarah.",
      "Orthodox": "Confirms the location as the field purchased by Abraham, where he was laid to rest with Sarah.",
      "Other": "the field Abraham had bought from the Hittites. There Abraham was buried with his wife Sarah.",
      "Prefer not to say": "the field Abraham had bought from the Hittites. There Abraham was buried with his wife Sarah."
    },
    "11": {
      "General": "After Abraham's death, God blessed his son Isaac, who then lived near Beer Lahai Roi.",
      "Non-Denominational": "After Abraham's death, God blessed his son Isaac, who then lived near Beer Lahai Roi.",
      "Baptist": "Following Abraham's death, God's blessing explicitly passes to Isaac, who resides near Beer Lahai Roi.",
      "Catholic": "States that after Abraham's death, God's blessing was formally upon Isaac. It also notes Isaac's residence near Beer Lahai Roi (the well associated with God's care for Hagar and Ishmael, perhaps signifying God's continued watch over the whole extended family).",
      "Methodist": "God's blessing is explicitly transferred to Isaac after Abraham's death; notes Isaac's residence.",
      "Lutheran": "After Abraham's death, God blesses Isaac. Isaac lived near Beer Lahai Roi.",
      "Presbyterian": "Notes the transfer of God's blessing to Isaac after Abraham's death, and Isaac's location.",
      "Pentecostal": "God blesses Isaac after Abraham's death.",
      "Episcopalian/Anglican": "After Abraham's death, God's blessing rests upon Isaac, who lived near Beer Lahai Roi.",
      "Orthodox": "Highlights the continuation of God's blessing upon Isaac after Abraham's passing, noting his dwelling place.",
      "Other": "After Abraham's death, God blessed his son Isaac, who then lived near Beer Lahai Roi.",
      "Prefer not to say": "After Abraham's death, God blessed his son Isaac, who then lived near Beer Lahai Roi."
    },
    "12": {
      "General": "This is the account of the family line of Abraham's son Ishmael, whom Sarah's slave, Hagar the Egyptian, bore to Abraham.",
      "Non-Denominational": "This is the account of the family line of Abraham's son Ishmael, whom Sarah's slave, Hagar the Egyptian, bore to Abraham.",
      "Baptist": "Introduces the genealogy of Ishmael, explicitly mentioning his mother Hagar.",
      "Catholic": "Introduces the genealogy (toledot) of Ishmael, identifying him as Abraham's son through Hagar, Sarah's Egyptian slave.",
      "Methodist": "Transitions to the genealogy of Ishmael, son of Hagar.",
      "Lutheran": "Introduces the genealogy (toledot) of Ishmael, son of Abraham and Hagar.",
      "Presbyterian": "Introduces the genealogy of Ishmael, son of Abraham through Hagar.",
      "Pentecostal": "Introduces Ishmael's genealogy.",
      "Episcopalian/Anglican": "Introduces the account (toledot) of Ishmael, identifying him as the son of Abraham and Hagar.",
      "Orthodox": "Introduces the genealogy of Ishmael, specifying his parentage through Abraham and Hagar.",
      "Other": "This is the account of the family line of Abraham's son Ishmael, whom Sarah's slave, Hagar the Egyptian, bore to Abraham.",
      "Prefer not to say": "This is the account of the family line of Abraham's son Ishmael, whom Sarah's slave, Hagar the Egyptian, bore to Abraham."
    },
    "13": {
      "General": "These are the names of the sons of Ishmael, listed in the order of their birth: Nebaioth the firstborn of Ishmael, Kedar, Adbeel, Mibsam,",
      "Non-Denominational": "These are the names of the sons of Ishmael, listed in the order of their birth: Nebaioth the firstborn of Ishmael, Kedar, Adbeel, Mibsam,",
      "Baptist": "Begins listing Ishmael's twelve sons, starting with Nebaioth (firstborn), Kedar, Adbeel, and Mibsam.",
      "Catholic": "Begins listing the names of Ishmael's sons in birth order: Nebaioth (firstborn), Kedar, Adbeel, Mibsam.",
      "Methodist": "Starts the list of Ishmael's sons by birth order.",
      "Lutheran": "Lists the first four sons of Ishmael by name and birth order.",
      "Presbyterian": "Begins listing Ishmael's sons in birth order.",
      "Pentecostal": "Lists the first sons of Ishmael.",
      "Episcopalian/Anglican": "Begins the list of Ishmael's sons by name, in birth order.",
      "Orthodox": "Commences the listing of Ishmael's sons by name, following their birth order.",
      "Other": "These are the names of the sons of Ishmael, listed in the order of their birth: Nebaioth the firstborn of Ishmael, Kedar, Adbeel, Mibsam,",
      "Prefer not to say": "These are the names of the sons of Ishmael, listed in the order of their birth: Nebaioth the firstborn of Ishmael, Kedar, Adbeel, Mibsam,"
    },
    "14": {
      "General": "Mishma, Dumah, Massa,",
      "Non-Denominational": "Mishma, Dumah, Massa,",
      "Baptist": "Continues listing Ishmael's sons: Mishma, Dumah, Massa.",
      "Catholic": "Continues the list: Mishma, Dumah, Massa.",
      "Methodist": "Continues the list of sons.",
      "Lutheran": "Lists the next three sons: Mishma, Dumah, Massa.",
      "Presbyterian": "Continues the list: Mishma, Dumah, Massa.",
      "Pentecostal": "Lists more sons of Ishmael.",
      "Episcopalian/Anglican": "Continues the list: Mishma, Dumah, Massa.",
      "Orthodox": "Continues the enumeration of Ishmael's sons.",
      "Other": "Mishma, Dumah, Massa,",
      "Prefer not to say": "Mishma, Dumah, Massa,"
    },
    "15": {
      "General": "Hadad, Tema, Jetur, Naphish and Kedemah.",
      "Non-Denominational": "Hadad, Tema, Jetur, Naphish and Kedemah.",
      "Baptist": "Completes the list of Ishmael's twelve sons: Hadad, Tema, Jetur, Naphish, Kedemah.",
      "Catholic": "Completes the list of twelve sons: Hadad, Tema, Jetur, Naphish, Kedemah.",
      "Methodist": "Completes the list, totaling twelve sons.",
      "Lutheran": "Lists the final five sons, completing the twelve.",
      "Presbyterian": "Completes the list of twelve sons.",
      "Pentecostal": "Lists the remaining sons.",
      "Episcopalian/Anglican": "Completes the list of twelve sons.",
      "Orthodox": "Concludes the list of Ishmael's twelve sons.",
      "Other": "Hadad, Tema, Jetur, Naphish and Kedemah.",
      "Prefer not to say": "Hadad, Tema, Jetur, Naphish and Kedemah."
    },
    "16": {
      "General": "These were the sons of Ishmael, and these are the names of the twelve tribal rulers according to their settlements and camps.",
      "Non-Denominational": "These were the sons of Ishmael, and these are the names of the twelve tribal rulers according to their settlements and camps.",
      "Baptist": "Confirms these twelve sons became rulers of twelve distinct tribes, fulfilling God's promise regarding Ishmael (Gen 17:20).",
      "Catholic": "Confirms these are Ishmael's sons and identifies them as the founders/rulers ('princes' or 'chieftains') of twelve distinct tribes, according to their specific settlements and encampments, fulfilling God's earlier promise to Abraham concerning Ishmael (Gen 17:20).",
      "Methodist": "Identifies these sons as founders of twelve tribes, fulfilling God's promise concerning Ishmael.",
      "Lutheran": "These twelve sons became rulers of twelve tribes, fulfilling God's promise (Gen 17:20).",
      "Presbyterian": "Identifies these twelve sons as tribal rulers, fulfilling God's promise regarding Ishmael.",
      "Pentecostal": "These sons became rulers of twelve tribes, as promised.",
      "Episcopalian/Anglican": "Confirms these are the sons of Ishmael, who became twelve tribal rulers according to their settlements, fulfilling God's promise.",
      "Orthodox": "Identifies these twelve sons as the eponymous ancestors of twelve tribes, fulfilling the divine promise regarding Ishmael.",
      "Other": "These were the sons of Ishmael, and these are the names of the twelve tribal rulers according to their settlements and camps.",
      "Prefer not to say": "These were the sons of Ishmael, and these are the names of the twelve tribal rulers according to their settlements and camps."
    },
    "17": {
      "General": "Ishmael lived a hundred and thirty-seven years. He breathed his last and died, and he was gathered to his people.",
      "Non-Denominational": "Ishmael lived a hundred and thirty-seven years. He breathed his last and died, and he was gathered to his people.",
      "Baptist": "States Ishmael's lifespan (137 years) and his death, using the same 'gathered to his people' phrasing as for Abraham.",
      "Catholic": "Records Ishmael's lifespan (137 years) and his death, using the same formula ('breathed his last... gathered to his people') as for Abraham, indicating a natural end after a completed life.",
      "Methodist": "States Ishmael's age at death (137) and notes his passing similarly to Abraham's.",
      "Lutheran": "Ishmael lived 137 years and died ('gathered to his people').",
      "Presbyterian": "Records Ishmael's lifespan (137 years) and death.",
      "Pentecostal": "Ishmael lived 137 years and died.",
      "Episcopalian/Anglican": "States Ishmael's lifespan (137 years) and describes his death using the same formula as Abraham ('gathered to his people').",
      "Orthodox": "Records Ishmael's lifespan (137 years) and his death, employing the same phrasing used for Abraham.",
      "Other": "Ishmael lived a hundred and thirty-seven years. He breathed his last and died, and he was gathered to his people.",
      "Prefer not to say": "Ishmael lived a hundred and thirty-seven years. He breathed his last and died, and he was gathered to his people."
    },
    "18": {
      "General": "His descendants settled in the area from Havilah to Shur, near the eastern border of Egypt, as you go toward Ashur. And they lived in hostility toward all the tribes related to them.",
      "Non-Denominational": "His descendants settled in the area from Havilah to Shur, near the eastern border of Egypt, as you go toward Ashur. And they lived in hostility toward all the tribes related to them.",
      "Baptist": "Describes the geographical settlement area of Ishmael's descendants (northern Arabia) and notes their contentious relationship ('lived in hostility' or 'lived in defiance of') with their relatives (especially Isaac's line), possibly fulfilling Gen 16:12.",
      "Catholic": "Describes the geographical territory occupied by Ishmael's descendants (stretching across northern Arabia, from Havilah near the Persian Gulf towards Shur near Egypt/Assyria). It concludes by noting they 'lived in hostility toward' (or 'settled in defiance of' or 'camped alongside') all their relatives, reflecting the tension prophesied in Gen 16:12.",
      "Methodist": "Describes the territory of Ishmael's descendants and notes their often adversarial relationship with related tribes.",
      "Lutheran": "Describes the territory of Ishmael's descendants (Havilah to Shur, towards Assyria). Notes they lived 'in hostility toward' (or 'opposite' / 'in the face of') their relatives (cf. Gen 16:12).",
      "Presbyterian": "Describes the location of Ishmael's descendants and notes their relationship of tension or opposition ('lived in hostility toward') with their relatives.",
      "Pentecostal": "Describes where Ishmael's descendants lived and their hostile relations.",
      "Episcopalian/Anglican": "Describes the geographical extent of the Ishmaelites' territory and notes that they 'lived in hostility toward' (or 'settled alongside/opposite') their relatives, possibly referencing Gen 16:12.",
      "Orthodox": "Defines the geographical region inhabited by Ishmael's descendants and notes their often antagonistic relationship ('lived in hostility') with neighboring kindred tribes.",
      "Other": "His descendants settled in the area from Havilah to Shur, near the eastern border of Egypt, as you go toward Ashur. And they lived in hostility toward all the tribes related to them.",
      "Prefer not to say": "His descendants settled in the area from Havilah to Shur, near the eastern border of Egypt, as you go toward Ashur. And they lived in hostility toward all the tribes related to them."
    },
    "19": {
      "General": "This is the account of the family line of Abraham's son Isaac.",
      "Non-Denominational": "This is the account of the family line of Abraham's son Isaac.",
      "Baptist": "Introduces the genealogy and story of Isaac, the primary covenant heir.",
      "Catholic": "Introduces the next major section, the genealogy (toledot) of Isaac, Abraham's son through Sarah, the bearer of the covenant promise.",
      "Methodist": "Transitions to the main covenant line through Isaac's genealogy.",
      "Lutheran": "Introduces the genealogy (toledot) of Isaac, Abraham's son.",
      "Presbyterian": "Introduces the genealogy (toledot) of Isaac, the covenant heir.",
      "Pentecostal": "Introduces Isaac's genealogy.",
      "Episcopalian/Anglican": "Introduces the account (toledot) of Isaac, Abraham's son.",
      "Orthodox": "Introduces the genealogy of Isaac, the son carrying the primary covenant line.",
      "Other": "This is the account of the family line of Abraham's son Isaac.",
      "Prefer not to say": "This is the account of the family line of Abraham's son Isaac."
    },
    "20": {
      "General": "Abraham became the father of Isaac, and Isaac was forty years old when he married Rebekah daughter of Bethuel the Aramean from Paddan Aram and sister of Laban the Aramean.",
      "Non-Denominational": "Abraham became the father of Isaac, and Isaac was forty years old when he married Rebekah daughter of Bethuel the Aramean from Paddan Aram and sister of Laban the Aramean.",
      "Baptist": "Restates Abraham fathering Isaac, gives Isaac's age at marriage (40), and identifies Rebekah's lineage (daughter of Bethuel, sister of Laban, from Paddan Aram).",
      "Catholic": "Links Isaac directly to Abraham ('Abraham became the father of Isaac'). States Isaac's age (40) when he married Rebekah, explicitly identifying her father (Bethuel the Aramean from Paddan Aram) and brother (Laban the Aramean).",
      "Methodist": "States Isaac's age at marriage (40) and reiterates Rebekah's family connections.",
      "Lutheran": "Abraham fathered Isaac. Isaac was 40 when he married Rebekah (daughter of Bethuel the Aramean, sister of Laban the Aramean, from Paddan Aram).",
      "Presbyterian": "States Isaac was 40 at his marriage to Rebekah, identifying her Aramean lineage (Bethuel, Laban, Paddan Aram).",
      "Pentecostal": "Isaac married Rebekah at age 40; identifies her family.",
      "Episcopalian/Anglican": "States Isaac was 40 when he married Rebekah, identifying her father (Bethuel the Aramean), brother (Laban the Aramean), and place of origin (Paddan Aram).",
      "Orthodox": "Records Isaac's age (40) at his marriage to Rebekah and specifies her Aramean lineage and origin.",
      "Other": "Abraham became the father of Isaac, and Isaac was forty years old when he married Rebekah daughter of Bethuel the Aramean from Paddan Aram and sister of Laban the Aramean.",
      "Prefer not to say": "Abraham became the father of Isaac, and Isaac was forty years old when he married Rebekah daughter of Bethuel the Aramean from Paddan Aram and sister of Laban the Aramean."
    },
    "21": {
      "General": "Isaac prayed to the Lord on behalf of his wife, because she was childless. The Lord answered his prayer, and his wife Rebekah became pregnant.",
      "Non-Denominational": "Isaac prayed to the Lord on behalf of his wife, because she was childless. The Lord answered his prayer, and his wife Rebekah became pregnant.",
      "Baptist": "Isaac intercedes for Rebekah's barrenness (a recurring theme); God answers his prayer, and Rebekah conceives.",
      "Catholic": "Highlights Isaac's prayer to the Lord specifically because Rebekah was barren (mirroring Sarah's earlier situation). The Lord answers Isaac's prayer, and Rebekah conceives, showing divine intervention is needed for the covenant line.",
      "Methodist": "Isaac prays for Rebekah's infertility, and God answers, enabling her to conceive. Echoes the theme of divine intervention in conception.",
      "Lutheran": "Isaac prays for Rebekah because she is barren. Yahweh answers his prayer, and she conceives.",
      "Presbyterian": "Isaac prays concerning Rebekah's barrenness, and God answers his prayer, enabling conception. Continues theme of divine role in covenant births.",
      "Pentecostal": "Isaac prays for barren Rebekah; God answers, and she conceives.",
      "Episcopalian/Anglican": "Isaac prays for Rebekah due to her barrenness, and the Lord answers his prayer, allowing her to conceive.",
      "Orthodox": "Notes Isaac's prayer addressing Rebekah's barrenness and God's positive response, resulting in her conception, emphasizing divine action in continuing the lineage.",
      "Other": "Isaac prayed to the Lord on behalf of his wife, because she was childless. The Lord answered his prayer, and his wife Rebekah became pregnant.",
      "Prefer not to say": "Isaac prayed to the Lord on behalf of his wife, because she was childless. The Lord answered his prayer, and his wife Rebekah became pregnant."
    },
    "22": {
      "General": "The babies jostled each other within her, and she said, \"Why is this happening to me?\" So she went to inquire of the Lord.",
      "Non-Denominational": "The babies jostled each other within her, and she said, \"Why is this happening to me?\" So she went to inquire of the Lord.",
      "Baptist": "Rebekah experiences a difficult pregnancy (violent struggle within) and seeks divine guidance ('inquire of the Lord') to understand it.",
      "Catholic": "Describes a tumultuous pregnancy, with the babies struggling violently within Rebekah. Distressed, she asks, 'Why is this happening to me?' (or 'If so, why do I live?') and seeks divine insight ('went to inquire of the Lord').",
      "Methodist": "Rebekah experiences a difficult, struggling pregnancy and seeks understanding from God.",
      "Lutheran": "The children struggle violently within her womb. Distressed, Rebekah inquires of Yahweh.",
      "Presbyterian": "Rebekah experiences a difficult pregnancy with internal struggle, leading her to seek understanding from the Lord.",
      "Pentecostal": "Rebekah has a difficult pregnancy and asks God why.",
      "Episcopalian/Anglican": "Rebekah experiences a violent struggle within her womb during pregnancy, causing distress and leading her to seek an explanation from the Lord.",
      "Orthodox": "Describes the unusual and difficult nature of Rebekah's pregnancy due to the internal struggle, prompting her to seek divine clarification.",
      "Other": "The babies jostled each other within her, and she said, \"Why is this happening to me?\" So she went to inquire of the Lord.",
      "Prefer not to say": "The babies jostled each other within her, and she said, \"Why is this happening to me?\" So she went to inquire of the Lord."
    },
    "23": {
      "General": "The Lord said to her, \"Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.\"",
      "Non-Denominational": "The Lord said to her, \"Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.\"",
      "Baptist": "God reveals the struggle signifies two nations (peoples) originating from her twins, destined for separation and rivalry, with the unusual prophecy that the older will serve the younger.",
      "Catholic": "The Lord reveals the meaning: the struggle represents two distinct nations/peoples originating from her womb. They will be divided, one stronger than the other, and counter-culturally, the older (firstborn) will serve the younger. This oracle foreshadows the future relationship between Edom (Esau) and Israel (Jacob).",
      "Methodist": "God reveals the struggle represents two nations destined for conflict, with the prophecy that the older son will serve the younger, reversing typical birth order expectations.",
      "Lutheran": "Yahweh reveals to her: two nations are in her womb, destined to be separate peoples. One will be stronger, and the older will serve the younger (a divine reversal of primogeniture).",
      "Presbyterian": "God reveals the internal struggle signifies two nations, destined for division and rivalry, with the elder serving the younger—a reversal of natural order foreshadowing Jacob's ascendancy.",
      "Pentecostal": "God reveals she carries two nations; the older will serve the younger.",
      "Episcopalian/Anglican": "The Lord reveals that she carries two nations/peoples who will be divided. One will be stronger, and, significantly, the older will serve the younger.",
      "Orthodox": "God reveals the struggle's significance: two nations are within her, destined for separation and unequal status, with the prophecy that the elder will serve the younger, indicating a divine choice that overrides natural birth order.",
      "Other": "The Lord said to her, \"Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.\"",
      "Prefer not to say": "The Lord said to her, \"Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.\""
    },
    "24": {
      "General": "When the time came for her to give birth, there were twin boys in her womb.",
      "Non-Denominational": "When the time came for her to give birth, there were twin boys in her womb.",
      "Baptist": "Confirms the birth involves twin boys, as implied by the prophecy.",
      "Catholic": "Confirms the prophecy's basis: at the time of birth, it is revealed she indeed carried twin boys.",
      "Methodist": "Confirms the birth of twin boys.",
      "Lutheran": "At birth, it is confirmed she has twin boys.",
      "Presbyterian": "Confirms the birth of twins.",
      "Pentecostal": "Confirms she has twin boys.",
      "Episcopalian/Anglican": "Confirms the presence of twin boys at the time of birth.",
      "Orthodox": "Confirms the delivery of twin boys.",
      "Other": "When the time came for her to give birth, there were twin boys in her womb.",
      "Prefer not to say": "When the time came for her to give birth, there were twin boys in her womb."
    },
    "25": {
      "General": "The first to come out was red, and his whole body was like a hairy garment; so they named him Esau.",
      "Non-Denominational": "The first to come out was red, and his whole body was like a hairy garment; so they named him Esau.",
      "Baptist": "Describes the firstborn: reddish complexion and very hairy. Named Esau (possibly related to 'hairy' or 'red').",
      "Catholic": "Describes the appearance of the first twin: reddish ('admoni') and covered in hair ('like a hairy garment'). He is named Esau, a name possibly linked to 'hairy' (se'ar) or perhaps Edom ('red').",
      "Methodist": "Describes the firstborn, Esau, as red and hairy.",
      "Lutheran": "Describes the firstborn: red and hairy. Named Esau (playing on 'hairy').",
      "Presbyterian": "Describes the firstborn, Esau, noting his reddish, hairy appearance and name.",
      "Pentecostal": "Describes Esau as red and hairy.",
      "Episcopalian/Anglican": "Describes the first twin born: red and very hairy. He is named Esau (possibly related to Hebrew for 'hairy').",
      "Orthodox": "Describes the physical appearance of the first twin (red, hairy) and records his name, Esau.",
      "Other": "The first to come out was red, and his whole body was like a hairy garment; so they named him Esau.",
      "Prefer not to say": "The first to come out was red, and his whole body was like a hairy garment; so they named him Esau."
    },
    "26": {
      "General": "After this, his brother came out, with his hand grasping Esau's heel; so he was named Jacob. Isaac was sixty years old when Rebekah gave birth to them.",
      "Non-Denominational": "After this, his brother came out, with his hand grasping Esau's heel; so he was named Jacob. Isaac was sixty years old when Rebekah gave birth to them.",
      "Baptist": "Describes the second twin emerging, grasping Esau's heel. Named Jacob (meaning 'he grasps the heel' or 'he supplants'). Notes Isaac's age (60) at their birth.",
      "Catholic": "Describes the birth of the second twin, emerging while grasping Esau's heel. This action leads to his name, Jacob (Ya'aqov), related to the Hebrew word for 'heel' ('aqev') and carrying connotations of 'supplanter' or 'one who follows closely'. Also notes Isaac was 60 years old when they were born (20 years after marriage).",
      "Methodist": "Describes the second twin, Jacob, grasping Esau's heel, hence his name (meaning 'supplanter' or 'heel-grabber'). Notes Isaac's age at their birth (60).",
      "Lutheran": "The second twin comes out grasping Esau's heel. Named Jacob (playing on 'heel' and 'supplanter'). Isaac was 60.",
      "Presbyterian": "Describes Jacob's birth, grasping Esau's heel, linking to his name ('supplanter'). Notes Isaac's age (60).",
      "Pentecostal": "Jacob is born grasping Esau's heel; named accordingly. Isaac was 60.",
      "Episcopalian/Anglican": "Describes the second twin emerging grasping Esau's heel, leading to the name Jacob (related to Hebrew for 'heel', implies 'supplanter'). States Isaac's age (60) at their birth.",
      "Orthodox": "Describes Jacob's birth, holding Esau's heel, which forms the basis for his name (related to 'heel'/'supplanter'). Records Isaac's age (60) at the time.",
      "Other": "After this, his brother came out, with his hand grasping Esau's heel; so he was named Jacob. Isaac was sixty years old when Rebekah gave birth to them.",
      "Prefer not to say": "After this, his brother came out, with his hand grasping Esau's heel; so he was named Jacob. Isaac was sixty years old when Rebekah gave birth to them."
    },
    "27": {
      "General": "The boys grew up, and Esau became a skillful hunter, a man of the open country, while Jacob was content to stay at home among the tents.",
      "Non-Denominational": "The boys grew up, and Esau became a skillful hunter, a man of the open country, while Jacob was content to stay at home among the tents.",
      "Baptist": "Contrasts the developing characters: Esau, the rugged outdoorsman/hunter; Jacob, the quieter, home-dwelling man.",
      "Catholic": "Contrasts the twins' characters as they mature: Esau develops into a skillful hunter, a man of the field ('open country'), while Jacob is described as a 'quiet' or 'mild' man (Hebrew: tam), preferring to stay among the tents (implying domesticity or perhaps integrity).",
      "Methodist": "Contrasts the personalities and lifestyles: Esau the outdoorsman, Jacob the homebody.",
      "Lutheran": "Contrasts the twins as they grow: Esau becomes a hunter, a man of the field; Jacob is a 'quiet'/'mild' (tam) man, dwelling in tents.",
      "Presbyterian": "Contrasts the differing characters and lifestyles: Esau the hunter/outdoorsman, Jacob the quiet tent-dweller.",
      "Pentecostal": "Contrasts Esau the hunter and Jacob the quiet homebody.",
      "Episcopalian/Anglican": "Contrasts the developing characters: Esau the skillful hunter ('man of the field'), Jacob the quiet man ('dwelling in tents').",
      "Orthodox": "Highlights the diverging personalities and lifestyles of the twins as they mature: Esau the hunter and outdoorsman, Jacob the quieter tent-dweller.",
      "Other": "The boys grew up, and Esau became a skillful hunter, a man of the open country, while Jacob was content to stay at home among the tents.",
      "Prefer not to say": "The boys grew up, and Esau became a skillful hunter, a man of the open country, while Jacob was content to stay at home among the tents."
    },
    "28": {
      "General": "Isaac, who had a taste for wild game, loved Esau, but Rebekah loved Jacob.",
      "Non-Denominational": "Isaac, who had a taste for wild game, loved Esau, but Rebekah loved Jacob.",
      "Baptist": "Highlights parental favoritism: Isaac favors Esau (due to his hunting provisions), while Rebekah favors Jacob. This sets up future family conflict.",
      "Catholic": "Reveals parental favoritism that fuels future conflict: Isaac favors Esau, partly because he enjoys the game Esau hunts ('had a taste for wild game'), while Rebekah favors Jacob.",
      "Methodist": "Shows damaging parental favoritism: Isaac preferring Esau (for the game), Rebekah preferring Jacob.",
      "Lutheran": "Parental favoritism develops: Isaac loves Esau (because of the game), but Rebekah loves Jacob.",
      "Presbyterian": "Reveals parental favoritism, sowing seeds of conflict: Isaac favors Esau (linked to his hunting), Rebekah favors Jacob.",
      "Pentecostal": "Parental favoritism: Isaac loves Esau, Rebekah loves Jacob.",
      "Episcopalian/Anglican": "Highlights the parental favoritism: Isaac loved Esau (because he ate his game), but Rebekah loved Jacob.",
      "Orthodox": "Points out the differing parental affections—Isaac favoring Esau (connected to his provision of game) and Rebekah favoring Jacob—which becomes a source of familial tension.",
      "Other": "Isaac, who had a taste for wild game, loved Esau, but Rebekah loved Jacob.",
      "Prefer not to say": "Isaac, who had a taste for wild game, loved Esau, but Rebekah loved Jacob."
    },
    "29": {
      "General": "Once when Jacob was cooking some stew, Esau came in from the open country, famished.",
      "Non-Denominational": "Once when Jacob was cooking some stew, Esau came in from the open country, famished.",
      "Baptist": "Sets the scene for the birthright incident: Jacob cooking, Esau returning from the field extremely hungry.",
      "Catholic": "Sets the scene for the pivotal birthright incident: Jacob is cooking stew when Esau returns from hunting ('open country'), exhausted and extremely hungry ('famished').",
      "Methodist": "Introduces the incident: Jacob cooking, Esau returning exhausted and hungry.",
      "Lutheran": "Sets the scene: Jacob cooking stew, Esau comes in from the field famished.",
      "Presbyterian": "Sets the context for the birthright exchange: Jacob cooking, Esau returning famished.",
      "Pentecostal": "Sets the scene: Jacob cooking, Esau returning hungry.",
      "Episcopalian/Anglican": "Sets the scene for the birthright exchange: Jacob cooking stew, Esau returning from the field famished.",
      "Orthodox": "Establishes the setting for the birthright transaction: Jacob preparing food while Esau returns famished from the field.",
      "Other": "Once when Jacob was cooking some stew, Esau came in from the open country, famished.",
      "Prefer not to say": "Once when Jacob was cooking some stew, Esau came in from the open country, famished."
    },
    "30": {
      "General": "He said to Jacob, \"Quick, let me have some of that red stew! I'm famished!\" (That is why he was also called Edom.)",
      "Non-Denominational": "He said to Jacob, \"Quick, let me have some of that red stew! I'm famished!\" (That is why he was also called Edom.)",
      "Baptist": "Esau impatiently demands the stew due to his hunger. Explains the origin of his other name, Edom ('red'), linked to the red stew.",
      "Catholic": "Esau demands urgently, 'Quick, let me gulp down some of that red stuff!' emphasizing his exhaustion and hunger. A parenthetical note links this incident and the 'red' stew to Esau's alternative name/designation, Edom (meaning 'red').",
      "Methodist": "Esau impulsively demands the 'red stew' due to hunger. Notes the connection to his name Edom ('red').",
      "Lutheran": "Esau demands some of the 'red stuff' because he is famished. This explains his name Edom ('red').",
      "Presbyterian": "Esau impatiently demands the 'red stew'. Connects this to his name Edom ('red').",
      "Pentecostal": "Esau demands the red stew. Explains his name Edom.",
      "Episcopalian/Anglican": "Esau demands some of the 'red stew' due to his hunger. Explains this is why he was called Edom ('Red').",
      "Orthodox": "Esau impulsively demands the 'red' stew. Explanatory note connects this event to the name Edom ('Red').",
      "Other": "He said to Jacob, \"Quick, let me have some of that red stew! I'm famished!\" (That is why he was also called Edom.)",
      "Prefer not to say": "He said to Jacob, \"Quick, let me have some of that red stew! I'm famished!\" (That is why he was also called Edom.)"
    },
    "31": {
      "General": "Jacob replied, \"First sell me your birthright.\"",
      "Non-Denominational": "Jacob replied, \"First sell me your birthright.\"",
      "Baptist": "Jacob sees an opportunity and demands Esau's birthright (privileges of the firstborn) in exchange for the food.",
      "Catholic": "Jacob shrewdly seizes the opportunity presented by Esau's desperation, demanding Esau sell him his birthright (the rights and double inheritance portion belonging to the firstborn) in exchange for the stew.",
      "Methodist": "Jacob opportunistically demands Esau's birthright in exchange for the stew.",
      "Lutheran": "Jacob immediately demands Esau sell him his birthright in exchange for the food.",
      "Presbyterian": "Jacob opportunistically bargains, demanding the birthright for the stew.",
      "Pentecostal": "Jacob demands the birthright for the stew.",
      "Episcopalian/Anglican": "Jacob opportunistically demands that Esau sell him his birthright first.",
      "Orthodox": "Jacob opportunistically bargains, demanding Esau's birthright as the price for the food.",
      "Other": "Jacob replied, \"First sell me your birthright.\"",
      "Prefer not to say": "Jacob replied, \"First sell me your birthright.\""
    },
    "32": {
      "General": "\"Look, I am about to die,\" Esau said. \"What good is the birthright to me?\"",
      "Non-Denominational": "\"Look, I am about to die,\" Esau said. \"What good is the birthright to me?\"",
      "Baptist": "Esau, driven by immediate physical hunger, dismisses the long-term value of the birthright as useless to him in his perceived imminent death from starvation.",
      "Catholic": "Esau, exaggerating his condition due to hunger ('Look, I am about to die!'), dismisses the future value of the birthright, prioritizing immediate gratification over his long-term inheritance and status.",
      "Methodist": "Esau, focused only on his immediate hunger, devalues his birthright, seeing no use for it if he 'dies'.",
      "Lutheran": "Esau, exaggerating his hunger ('I am about to die'), dismisses the value of the birthright.",
      "Presbyterian": "Esau dismisses the future value of the birthright in favor of immediate gratification.",
      "Pentecostal": "Esau dismisses the birthright due to hunger.",
      "Episcopalian/Anglican": "Esau, focused on his immediate hunger ('I am about to die'), dismisses the value of the future birthright.",
      "Orthodox": "Esau, prioritizing immediate physical need over future privilege, declares the birthright worthless to him in his famished state.",
      "Other": "\"Look, I am about to die,\" Esau said. \"What good is the birthright to me?\"",
      "Prefer not to say": "\"Look, I am about to die,\" Esau said. \"What good is the birthright to me?\""
    },
    "33": {
      "General": "But Jacob said, \"Swear to me first.\" So he swore an oath to him, selling his birthright to Jacob.",
      "Non-Denominational": "But Jacob said, \"Swear to me first.\" So he swore an oath to him, selling his birthright to Jacob.",
      "Baptist": "Jacob insists on a formal oath to seal the deal. Esau complies, formally selling his birthright.",
      "Catholic": "Jacob presses his advantage, demanding a solemn oath to formalize the transaction. Esau swears the oath, thereby legally selling/transferring his birthright to Jacob.",
      "Methodist": "Jacob secures the deal with an oath, and Esau formally sells his birthright.",
      "Lutheran": "Jacob insists on an oath. Esau swears and sells his birthright to Jacob.",
      "Presbyterian": "Jacob insists on an oath to formalize the sale. Esau complies.",
      "Pentecostal": "Jacob makes Esau swear an oath to sell the birthright.",
      "Episcopalian/Anglican": "Jacob insists Esau swear an oath first. Esau complies, formally selling his birthright to Jacob.",
      "Orthodox": "Jacob insists on formalizing the agreement with an oath, which Esau provides, thereby completing the sale of his birthright.",
      "Other": "But Jacob said, \"Swear to me first.\" So he swore an oath to him, selling his birthright to Jacob.",
      "Prefer not to say": "But Jacob said, \"Swear to me first.\" So he swore an oath to him, selling his birthright to Jacob."
    },
    "34": {
      "General": "Then Jacob gave Esau some bread and some lentil stew. He ate and drank, and then got up and left. So Esau despised his birthright.",
      "Non-Denominational": "Then Jacob gave Esau some bread and some lentil stew. He ate and drank, and then got up and left. So Esau despised his birthright.",
      "Baptist": "Jacob fulfills his side (gives bread and lentil stew). Esau eats and leaves, demonstrating his contempt ('despised') for the birthright he so easily traded away.",
      "Catholic": "Jacob provides the agreed-upon food (bread and lentil stew). Esau eats, drinks, and leaves casually. The narrative explicitly states Esau 'despised' (showed contempt for, treated lightly) his birthright, highlighting his lack of appreciation for its significance.",
      "Methodist": "Jacob gives Esau the food. Esau eats and leaves, showing his disregard ('despised') for the significant birthright he traded for temporary satisfaction.",
      "Lutheran": "Jacob gives Esau bread and lentil stew. Esau eats and leaves. The text concludes that Esau despised/treated lightly his birthright.",
      "Presbyterian": "Jacob gives Esau the stew. Esau eats and leaves, demonstrating his contempt ('despised') for the birthright.",
      "Pentecostal": "Jacob gives Esau food. Esau showed he despised his birthright.",
      "Episcopalian/Anglican": "Jacob gives Esau bread and lentil stew. Esau eats and leaves. The text concludes starkly: 'So Esau despised his birthright.'",
      "Orthodox": "Jacob provides the food. Esau consumes it and departs. The narrative explicitly judges Esau's action as despising (holding in contempt) his birthright.",
      "Other": "Then Jacob gave Esau some bread and some lentil stew. He ate and drank, and then got up and left. So Esau despised his birthright.",
      "Prefer not to say": "Then Jacob gave Esau some bread and some lentil stew. He ate and drank, and then got up and left. So Esau despised his birthright."
    }
  }
} 