{
  "_comment": "Interpretations for Genesis Chapter 26",
  "book": "Genesis",
  "chapter": "26",
  "verses": {
    "1": {
      "General": "Now there was a famine in the land—besides the previous famine in Abraham's time—and Isaac went to Abimelek king of the Philistines in Gerar.",
      "Non-Denominational": "Now there was a famine in the land—besides the previous famine in Abraham's time—and Isaac went to Abimelek king of the Philistines in Gerar.",
      "Baptist": "A famine occurs (distinct from the one in Abraham's time), prompting Isaac to travel to Gerar, ruled by Abimelek (likely a title or name used by successive Philistine kings).",
      "Catholic": "Records a famine in Canaan (distinct from the one during Abraham's life, Gen 12), causing Isaac to relocate to Gerar, a Philistine region ruled by King Abimelek (possibly the same name/title as the king Abraham encountered, or his successor).",
      "Methodist": "A new famine drives Isaac to Gerar, ruled by Abimelek, king of the Philistines, mirroring an earlier event with Abraham.",
      "Lutheran": "Another famine (distinct from Abraham's time) leads Isaac to go to Abimelek, king of the Philistines, in Gerar.",
      "Presbyterian": "A famine prompts Isaac to go to Gerar, ruled by Abimelek, king of the Philistines, recalling Abraham's similar journey.",
      "Pentecostal": "Famine causes Isaac to go to Abimelek in Gerar.",
      "Episcopalian/Anglican": "Records a famine (separate from the one in Abraham's time) leading Isaac to Gerar, ruled by Abimelek, king of the Philistines.",
      "Orthodox": "Notes a famine, distinct from that in Abraham's era, which leads Isaac to seek refuge in Gerar under the Philistine king Abimelek.",
      "Other": "Now there was a famine in the land—besides the previous famine in Abraham's time—and Isaac went to Abimelek king of the Philistines in Gerar.",
      "Prefer not to say": "Now there was a famine in the land—besides the previous famine in Abraham's time—and Isaac went to Abimelek king of the Philistines in Gerar."
    },
    "2": {
      "General": "The Lord appeared to Isaac and said, \"Do not go down to Egypt; live in the land where I tell you to live.",
      "Non-Denominational": "The Lord appeared to Isaac and said, \"Do not go down to Egypt; live in the land where I tell you to live.",
      "Baptist": "God appears to Isaac, specifically forbidding him from going to Egypt (unlike Abraham) and commanding him to stay in the land God designates (Canaan).",
      "Catholic": "The Lord appears directly to Isaac, commanding him *not* to go down to Egypt (a common refuge during famine, but perhaps symbolically representing reliance on human power over divine promise) but to remain in the land God directs him to.",
      "Methodist": "God appears to Isaac, forbids him from going to Egypt, and commands him to stay in the land God chooses.",
      "Lutheran": "Yahweh appears to Isaac and commands him not to go to Egypt, but to stay in the land Yahweh directs.",
      "Presbyterian": "God intervenes, instructing Isaac not to go to Egypt but to remain in the land designated by God, reinforcing the covenant connection to Canaan.",
      "Pentecostal": "God appears to Isaac, tells him not to go to Egypt, but stay where God leads.",
      "Episcopalian/Anglican": "The Lord appears to Isaac, instructing him not to go to Egypt but to dwell in the land God shows him.",
      "Orthodox": "Records a theophany where God instructs Isaac to avoid Egypt and remain within the land divinely appointed for him.",
      "Other": "The Lord appeared to Isaac and said, \"Do not go down to Egypt; live in the land where I tell you to live.",
      "Prefer not to say": "The Lord appeared to Isaac and said, \"Do not go down to Egypt; live in the land where I tell you to live."
    },
    "3": {
      "General": "Stay in this land for a while, and I will be with you and will bless you. For to you and your descendants I will give all these lands and will confirm the oath I swore to your father Abraham.",
      "Non-Denominational": "Stay in this land for a while, and I will be with you and will bless you. For to you and your descendants I will give all these lands and will confirm the oath I swore to your father Abraham.",
      "Baptist": "God promises His presence and blessing if Isaac obeys, reiterating the covenant promises made to Abraham: the land grant and confirmation of the sworn oath.",
      "Catholic": "God promises His presence ('I will be with you') and blessing upon Isaac if he sojourns in this land. God explicitly reaffirms the Abrahamic covenant with Isaac: the promise of the land ('all these lands') for him and his descendants, and the confirmation of the oath sworn to Abraham.",
      "Methodist": "God promises His presence, blessing, the land grant, and the confirmation of the covenant oath made to Abraham, contingent on Isaac's obedience.",
      "Lutheran": "God promises presence ('I will be with you') and blessing, reaffirming the land promise ('all these lands') to Isaac and his descendants, confirming the oath made to Abraham.",
      "Presbyterian": "God promises His presence and blessing to Isaac, reaffirming the land promise and the covenant oath made to Abraham.",
      "Pentecostal": "God promises presence, blessing, land, and confirms the oath made to Abraham.",
      "Episcopalian/Anglican": "God promises to be with and bless Isaac if he stays, reaffirming the promise of the land to him and his descendants and confirming the oath sworn to Abraham.",
      "Orthodox": "God assures Isaac of His presence and blessing during his sojourn, reaffirming the covenantal land promise and the oath previously sworn to Abraham.",
      "Other": "Stay in this land for a while, and I will be with you and will bless you. For to you and your descendants I will give all these lands and will confirm the oath I swore to your father Abraham.",
      "Prefer not to say": "Stay in this land for a while, and I will be with you and will bless you. For to you and your descendants I will give all these lands and will confirm the oath I swore to your father Abraham."
    },
    "4": {
      "General": "I will make your descendants as numerous as the stars in the sky and will give them all these lands, and through your offspring all nations on earth will be blessed,",
      "Non-Denominational": "I will make your descendants as numerous as the stars in the sky and will give them all these lands, and through your offspring all nations on earth will be blessed,",
      "Baptist": "Further elements of the Abrahamic covenant are repeated to Isaac: innumerable descendants (like stars), possession of the lands, and the universal blessing through his offspring.",
      "Catholic": "God reiterates further aspects of the Abrahamic promise to Isaac: countless descendants ('numerous as the stars'), the gift of the lands, and the crucial promise that through Isaac's offspring ('seed'), all nations on earth will find blessing.",
      "Methodist": "God repeats the promises of numerous descendants and the universal blessing through Isaac's line.",
      "Lutheran": "God repeats the promise of numerous descendants (like stars) and the universal blessing through Isaac's offspring.",
      "Presbyterian": "Restates the covenant promises: innumerable descendants, possession of the land, and universal blessing through his seed.",
      "Pentecostal": "God repeats promises: descendants like stars, land, and universal blessing through offspring.",
      "Episcopalian/Anglican": "God reiterates the promises of descendants as numerous as stars, the gift of the lands, and the blessing of all nations through Isaac's offspring.",
      "Orthodox": "Restates key elements of the Abrahamic covenant transferred to Isaac: innumerable posterity, inheritance of the lands, and the mediation of blessing to all nations through his lineage.",
      "Other": "I will make your descendants as numerous as the stars in the sky and will give them all these lands, and through your offspring all nations on earth will be blessed,",
      "Prefer not to say": "I will make your descendants as numerous as the stars in the sky and will give them all these lands, and through your offspring all nations on earth will be blessed,"
    },
    "5": {
      "General": "because Abraham obeyed me and did everything I required of him, keeping my commands, my decrees and my instructions.\"",
      "Non-Denominational": "because Abraham obeyed me and did everything I required of him, keeping my commands, my decrees and my instructions.\"",
      "Baptist": "God explicitly links the continuation of the covenant blessings to Abraham's faithfulness and obedience to God's requirements, commands, decrees, and instructions.",
      "Catholic": "God explicitly states the reason for confirming the covenant with Isaac: Abraham's exemplary obedience ('obeyed me') and faithfulness in keeping God's specific requirements ('commands, decrees, instructions/laws'). This highlights obedience as a key component of the covenant relationship.",
      "Methodist": "God grounds the covenant continuation in Abraham's faithful obedience to God's various requirements.",
      "Lutheran": "The reason for this blessing is Abraham's obedience to God's voice and keeping His charge, commandments, statutes, and laws.",
      "Presbyterian": "Links the fulfillment of the covenant to Abraham's prior obedience and faithfulness to God's commands.",
      "Pentecostal": "Blessings are linked to Abraham's obedience.",
      "Episcopalian/Anglican": "God explicitly links the continuation of these promises to Abraham's obedience and faithfulness to God's requirements (commands, decrees, laws).",
      "Orthodox": "Explicitly attributes the confirmation of the covenant promises to Isaac on the basis of Abraham's demonstrated obedience and adherence to God's commandments and precepts.",
      "Other": "because Abraham obeyed me and did everything I required of him, keeping my commands, my decrees and my instructions.\"",
      "Prefer not to say": "because Abraham obeyed me and did everything I required of him, keeping my commands, my decrees and my instructions.\""
    },
    "6": {
      "General": "So Isaac stayed in Gerar.",
      "Non-Denominational": "So Isaac stayed in Gerar.",
      "Baptist": "Isaac obeys God's command and remains in Gerar.",
      "Catholic": "Isaac demonstrates obedience to God's command by remaining in Gerar, despite the famine.",
      "Methodist": "Isaac obeys God and settles in Gerar.",
      "Lutheran": "Isaac obeys and stays in Gerar.",
      "Presbyterian": "Isaac obeys God's instruction and remains in Gerar.",
      "Pentecostal": "Isaac obeys and stays in Gerar.",
      "Episcopalian/Anglican": "Isaac obeys the divine command and stays in Gerar.",
      "Orthodox": "Isaac complies with the divine directive and remains in Gerar.",
      "Other": "So Isaac stayed in Gerar.",
      "Prefer not to say": "So Isaac stayed in Gerar."
    },
    "7": {
      "General": "When the men of that place asked him about his wife, he said, \"She is my sister,\" because he was afraid to say, \"She is my wife.\" He thought, \"The men of this place might kill me on account of Rebekah, because she is beautiful.\"",
      "Non-Denominational": "When the men of that place asked him about his wife, he said, \"She is my sister,\" because he was afraid to say, \"She is my wife.\" He thought, \"The men of this place might kill me on account of Rebekah, because she is beautiful.\"",
      "Baptist": "Repeating his father's lapse, Isaac, fearing for his life due to Rebekah's beauty, tells the men of Gerar she is his sister.",
      "Catholic": "In a direct parallel to Abraham's actions (Gen 12 & 20), Isaac, fearing the men of Gerar might kill him to take the beautiful Rebekah, claims she is his sister when asked about her. This shows a lapse in faith/trust in God's protection despite the recent promises.",
      "Methodist": "Isaac repeats his father's mistake out of fear, claiming Rebekah is his sister because of her beauty, fearing the local men might kill him for her.",
      "Lutheran": "Mirroring Abraham's failure, Isaac, fearing for his life because Rebekah is beautiful, tells the men of Gerar she is his sister.",
      "Presbyterian": "Isaac repeats his father's sin of deception, claiming Rebekah is his sister out of fear for his own safety due to her beauty.",
      "Pentecostal": "Isaac repeats Abraham's sin, calling Rebekah his sister out of fear.",
      "Episcopalian/Anglican": "Echoing Abraham's earlier deceptions, Isaac, fearing for his life because of Rebekah's beauty, tells the local men she is his sister.",
      "Orthodox": "Paralleling Abraham's earlier behavior, Isaac, motivated by fear for his life due to Rebekah's attractiveness, falsely claims she is his sister.",
      "Other": "When the men of that place asked him about his wife, he said, \"She is my sister,\" because he was afraid to say, \"She is my wife.\" He thought, \"The men of this place might kill me on account of Rebekah, because she is beautiful.\"",
      "Prefer not to say": "When the men of that place asked him about his wife, he said, \"She is my sister,\" because he was afraid to say, \"She is my wife.\" He thought, \"The men of this place might kill me on account of Rebekah, because she is beautiful.\""
    },
    "8": {
      "General": "When Isaac had been there a long time, Abimelek king of the Philistines looked down from a window and saw Isaac caressing his wife Rebekah.",
      "Non-Denominational": "When Isaac had been there a long time, Abimelek king of the Philistines looked down from a window and saw Isaac caressing his wife Rebekah.",
      "Baptist": "After a considerable time, Abimelek observes Isaac showing affection ('caressing' or 'playing with') Rebekah in a way that reveals their true relationship.",
      "Catholic": "After a prolonged stay, Abimelek happens to observe Isaac interacting affectionately ('caressing' or 'fondling' - suggesting intimacy beyond a sibling relationship) with Rebekah, revealing the deception.",
      "Methodist": "Abimelek eventually discovers the truth by observing Isaac's affectionate behavior towards Rebekah.",
      "Lutheran": "After some time, Abimelek sees Isaac showing marital affection ('caressing'/'fondling') toward Rebekah, exposing the lie.",
      "Presbyterian": "Abimelek inadvertently discovers the truth by observing Isaac's intimate interaction with Rebekah.",
      "Pentecostal": "Abimelek sees Isaac being intimate with Rebekah and realizes the truth.",
      "Episcopalian/Anglican": "After Isaac had been there a long time, Abimelek observes Isaac showing affection (caressing/fondling) to Rebekah, revealing she is his wife.",
      "Orthodox": "After a period, King Abimelek observes an intimate moment between Isaac and Rebekah, inconsistent with a sibling relationship, thus uncovering the deception.",
      "Other": "When Isaac had been there a long time, Abimelek king of the Philistines looked down from a window and saw Isaac caressing his wife Rebekah.",
      "Prefer not to say": "When Isaac had been there a long time, Abimelek king of the Philistines looked down from a window and saw Isaac caressing his wife Rebekah."
    },
    "9": {
      "General": "So Abimelek summoned Isaac and said, \"She is really your wife! Why did you say, 'She is my sister'?\" Isaac answered him, \"Because I thought I might lose my life on account of her.\"",
      "Non-Denominational": "So Abimelek summoned Isaac and said, \"She is really your wife! Why did you say, 'She is my sister'?\" Isaac answered him, \"Because I thought I might lose my life on account of her.\"",
      "Baptist": "Abimelek confronts Isaac, pointing out the obvious truth and demanding an explanation for the lie. Isaac admits his fear was the motive.",
      "Catholic": "Abimelek summons Isaac, confronts him directly ('She is really your wife!'), and demands an explanation for the dangerous deception. Isaac confesses his motive was fear for his life.",
      "Methodist": "Abimelek confronts Isaac about the deception. Isaac admits he lied out of fear for his life.",
      "Lutheran": "Abimelek confronts Isaac, stating the obvious ('She is your wife!') and asking why he lied. Isaac repeats his reason: fear of being killed.",
      "Presbyterian": "Abimelek confronts Isaac about the deception. Isaac confesses his fear.",
      "Pentecostal": "Abimelek confronts Isaac, who admits he lied out of fear.",
      "Episcopalian/Anglican": "Abimelek confronts Isaac, stating plainly she is his wife and asking for the reason behind the lie. Isaac admits his fear of being killed.",
      "Orthodox": "Abimelek summons Isaac, directly challenging the falsehood and demanding an explanation. Isaac reiterates his fear for his safety as the reason.",
      "Other": "So Abimelek summoned Isaac and said, \"She is really your wife! Why did you say, 'She is my sister'?\" Isaac answered him, \"Because I thought I might lose my life on account of her.\"",
      "Prefer not to say": "So Abimelek summoned Isaac and said, \"She is really your wife! Why did you say, 'She is my sister'?\" Isaac answered him, \"Because I thought I might lose my life on account of her.\""
    },
    "10": {
      "General": "Then Abimelek said, \"What is this you have done to us? One of the men might well have slept with your wife, and you would have brought guilt upon us.\"",
      "Non-Denominational": "Then Abimelek said, \"What is this you have done to us? One of the men might well have slept with your wife, and you would have brought guilt upon us.\"",
      "Baptist": "Abimelek rebukes Isaac, highlighting the serious potential consequences: one of his men could have unknowingly committed adultery, bringing corporate guilt upon the Philistines.",
      "Catholic": "Abimelek sharply rebukes Isaac, pointing out the extreme danger his deception created. Someone ('one of the people') could easily have committed adultery with Rebekah unknowingly, thereby bringing collective guilt/sin upon Abimelek and his people.",
      "Methodist": "Abimelek rebukes Isaac for the potential sin and communal guilt his lie could have caused if someone had taken Rebekah.",
      "Lutheran": "Abimelek rebukes Isaac for the reckless endangerment; someone could have easily slept with Rebekah, bringing guilt upon the Philistines.",
      "Presbyterian": "Abimelek rebukes Isaac, highlighting the potential for communal guilt had someone unknowingly sinned with Rebekah.",
      "Pentecostal": "Abimelek rebukes Isaac for potentially causing sin and guilt among his people.",
      "Episcopalian/Anglican": "Abimelek rebukes Isaac, emphasizing the potential consequences: someone might have unknowingly slept with Rebekah, bringing guilt upon Abimelek's people.",
      "Orthodox": "Abimelek reprimands Isaac, stressing the grave potential consequences of the deceit, namely the inadvertent sin of adultery and the resultant communal guilt.",
      "Other": "Then Abimelek said, \"What is this you have done to us? One of the men might well have slept with your wife, and you would have brought guilt upon us.\"",
      "Prefer not to say": "Then Abimelek said, \"What is this you have done to us? One of the men might well have slept with your wife, and you would have brought guilt upon us.\""
    },
    "11": {
      "General": "So Abimelek gave orders to all his people: \"Anyone who harms this man or his wife shall surely be put to death.\"",
      "Non-Denominational": "So Abimelek gave orders to all his people: \"Anyone who harms this man or his wife shall surely be put to death.\"",
      "Baptist": "Acting protectively (and perhaps fearing divine retribution), Abimelek issues a decree threatening death to anyone who harms Isaac or Rebekah.",
      "Catholic": "Abimelek, recognizing Isaac's connection to a powerful God (or simply acting justly), issues a royal decree protecting Isaac and Rebekah, threatening capital punishment for anyone who harms ('touches') either of them.",
      "Methodist": "Abimelek issues a protective decree, threatening death to anyone who harms Isaac or Rebekah.",
      "Lutheran": "Abimelek issues a protective order: anyone who harms ('touches') Isaac or Rebekah will be executed.",
      "Presbyterian": "Abimelek issues a protective decree for Isaac and Rebekah, under penalty of death.",
      "Pentecostal": "Abimelek orders protection for Isaac and Rebekah.",
      "Episcopalian/Anglican": "Abimelek issues a protective command to all his people, decreeing death for anyone who harms ('touches') Isaac or Rebekah.",
      "Orthodox": "King Abimelek issues an edict ensuring the safety of Isaac and Rebekah, imposing the death penalty on any transgressor.",
      "Other": "So Abimelek gave orders to all his people: \"Anyone who harms this man or his wife shall surely be put to death.\"",
      "Prefer not to say": "So Abimelek gave orders to all his people: \"Anyone who harms this man or his wife shall surely be put to death.\""
    },
    "12": {
      "General": "Isaac planted crops in that land and the same year reaped a hundredfold, because the Lord blessed him.",
      "Non-Denominational": "Isaac planted crops in that land and the same year reaped a hundredfold, because the Lord blessed him.",
      "Baptist": "Despite the famine conditions and being in foreign territory, Isaac experiences miraculous agricultural success (a hundredfold yield) as a direct result of God's blessing.",
      "Catholic": "Demonstrating God's faithfulness to His promise (v. 3), Isaac sows crops in Gerar (during the famine) and reaps an extraordinary harvest ('a hundredfold') in the same year, explicitly attributed to the Lord's blessing.",
      "Methodist": "Isaac experiences supernatural prosperity in farming (hundredfold harvest during famine) due to God's blessing.",
      "Lutheran": "Isaac sows crops in Gerar and reaps a miraculous hundredfold harvest that year because Yahweh blessed him.",
      "Presbyterian": "Despite the famine, Isaac sows crops and reaps a hundredfold harvest, demonstrating God's blessing upon him.",
      "Pentecostal": "God blesses Isaac with a hundredfold harvest during famine.",
      "Episcopalian/Anglican": "Isaac farms the land and reaps an extraordinary harvest (a hundredfold), explicitly because the Lord blessed him, fulfilling the promise of v. 3.",
      "Orthodox": "Illustrating divine favour, Isaac engages in agriculture and achieves an exceptional harvest (hundredfold yield) within the same year, attributed directly to God's blessing.",
      "Other": "Isaac planted crops in that land and the same year reaped a hundredfold, because the Lord blessed him.",
      "Prefer not to say": "Isaac planted crops in that land and the same year reaped a hundredfold, because the Lord blessed him."
    },
    "13": {
      "General": "The man became rich, and his wealth continued to grow until he became very wealthy.",
      "Non-Denominational": "The man became rich, and his wealth continued to grow until he became very wealthy.",
      "Baptist": "Isaac's prosperity increases significantly, making him a very wealthy man.",
      "Catholic": "Isaac's wealth grows progressively ('became rich... continued to grow... became very wealthy'), indicating sustained divine favor and material success.",
      "Methodist": "Isaac's wealth grows significantly, making him very prosperous.",
      "Lutheran": "Isaac becomes increasingly wealthy.",
      "Presbyterian": "Isaac accumulates significant wealth and becomes very prosperous.",
      "Pentecostal": "Isaac becomes very rich.",
      "Episcopalian/Anglican": "Isaac accumulates great wealth and continues to prosper significantly.",
      "Orthodox": "Isaac accumulates substantial wealth, experiencing continuous growth in prosperity.",
      "Other": "The man became rich, and his wealth continued to grow until he became very wealthy.",
      "Prefer not to say": "The man became rich, and his wealth continued to grow until he became very wealthy."
    },
    "14": {
      "General": "He had so many flocks and herds and servants that the Philistines envied him.",
      "Non-Denominational": "He had so many flocks and herds and servants that the Philistines envied him.",
      "Baptist": "His wealth (specifically flocks, herds, numerous servants) becomes so great that it incites the envy of the local Philistines.",
      "Catholic": "His tangible wealth consists of extensive livestock ('flocks and herds') and a large household staff ('servants'). This visible prosperity leads to envy from the native Philistine population.",
      "Methodist": "His great wealth in livestock and servants causes the Philistines to become envious.",
      "Lutheran": "His wealth in livestock and servants leads the Philistines to envy him.",
      "Presbyterian": "His extensive possessions (flocks, herds, servants) provoke the envy of the Philistines.",
      "Pentecostal": "His wealth (flocks, herds, servants) makes the Philistines envious.",
      "Episcopalian/Anglican": "His wealth consists of large numbers of flocks, herds, and servants, leading the Philistines to envy him.",
      "Orthodox": "His prosperity, evidenced by abundant livestock and numerous servants, provokes envy among the local Philistines.",
      "Other": "He had so many flocks and herds and servants that the Philistines envied him.",
      "Prefer not to say": "He had so many flocks and herds and servants that the Philistines envied him."
    },
    "15": {
      "General": "So all the wells that his father's servants had dug in the time of his father Abraham, the Philistines stopped up, filling them with earth.",
      "Non-Denominational": "So all the wells that his father's servants had dug in the time of his father Abraham, the Philistines stopped up, filling them with earth.",
      "Baptist": "Out of envy and likely a desire to hinder Isaac, the Philistines maliciously fill in the wells previously dug by Abraham's servants (vital resources in a dry land).",
      "Catholic": "Acting out of envy, the Philistines sabotage Isaac's resources by stopping up the wells that Abraham's servants had dug previously, filling them with earth. This targets a critical resource (water) and disputes Abraham's (and thus Isaac's) established rights.",
      "Methodist": "The envious Philistines sabotage Isaac by stopping up the wells dug by Abraham's servants, a vital resource.",
      "Lutheran": "Out of envy, the Philistines stop up the wells Abraham's servants had dug, filling them with dirt.",
      "Presbyterian": "In an act of envious hostility, the Philistines stop up the wells dug previously by Abraham's servants.",
      "Pentecostal": "Envious Philistines stop up Abraham's old wells.",
      "Episcopalian/Anglican": "Driven by envy, the Philistines stop up all the wells Abraham's servants had dug, filling them with earth.",
      "Orthodox": "Motivated by envy, the Philistines obstruct Isaac's access to water by filling the wells previously dug by his father Abraham's servants.",
      "Other": "So all the wells that his father's servants had dug in the time of his father Abraham, the Philistines stopped up, filling them with earth.",
      "Prefer not to say": "So all the wells that his father's servants had dug in the time of his father Abraham, the Philistines stopped up, filling them with earth."
    },
    "16": {
      "General": "Then Abimelek said to Isaac, \"Move away from us; you have become too powerful for us.\"",
      "Non-Denominational": "Then Abimelek said to Isaac, \"Move away from us; you have become too powerful for us.\"",
      "Baptist": "Abimelek, likely pressured by his people's envy and fearing Isaac's growing strength, asks Isaac to leave Gerar.",
      "Catholic": "King Abimelek, likely reflecting the sentiments of his envious people and perhaps feeling threatened by Isaac's evident prosperity and divine blessing, formally asks Isaac to leave Gerar, stating, 'You have become too powerful for us.'",
      "Methodist": "Abimelek asks Isaac to leave because his prosperity and power have become threatening to the Philistines.",
      "Lutheran": "Abimelek tells Isaac to leave because he has become too powerful/numerous for the Philistines.",
      "Presbyterian": "Abimelek asks Isaac to leave, acknowledging Isaac's superior power/prosperity as a threat.",
      "Pentecostal": "Abimelek asks Isaac to leave because he is too powerful.",
      "Episcopalian/Anglican": "Abimelek asks Isaac to move away, stating that Isaac has become too powerful compared to the Philistines.",
      "Orthodox": "King Abimelek requests Isaac's departure, citing Isaac's excessive power and influence as a cause for concern.",
      "Other": "Then Abimelek said to Isaac, \"Move away from us; you have become too powerful for us.\"",
      "Prefer not to say": "Then Abimelek said to Isaac, \"Move away from us; you have become too powerful for us.\""
    },
    "17": {
      "General": "So Isaac moved away from there and encamped in the Valley of Gerar and settled there.",
      "Non-Denominational": "So Isaac moved away from there and encamped in the Valley of Gerar and settled there.",
      "Baptist": "Isaac complies peacefully, relocating to the nearby Valley of Gerar.",
      "Catholic": "Isaac complies with Abimelek's request, moving away from the city center and setting up camp in the Valley of Gerar, settling there temporarily.",
      "Methodist": "Isaac complies and moves to the Valley of Gerar to live.",
      "Lutheran": "Isaac leaves and camps in the Valley of Gerar, settling there.",
      "Presbyterian": "Isaac complies and relocates to the Valley of Gerar.",
      "Pentecostal": "Isaac moves to the Valley of Gerar.",
      "Episcopalian/Anglican": "Isaac departs and camps in the Valley of Gerar, settling there.",
      "Orthodox": "Isaac complies, relocating his encampment to the Valley of Gerar.",
      "Other": "So Isaac moved away from there and encamped in the Valley of Gerar and settled there.",
      "Prefer not to say": "So Isaac moved away from there and encamped in the Valley of Gerar and settled there."
    },
    "18": {
      "General": "Isaac reopened the wells that had been dug in the time of his father Abraham, which the Philistines had stopped up after Abraham died, and he gave them the same names his father had given them.",
      "Non-Denominational": "Isaac reopened the wells that had been dug in the time of his father Abraham, which the Philistines had stopped up after Abraham died, and he gave them the same names his father had given them.",
      "Baptist": "Isaac asserts his inheritance rights by reopening the wells dug by Abraham that the Philistines had filled. He renames them with their original names, emphasizing continuity.",
      "Catholic": "Isaac actively reclaims his father's legacy and water rights by reopening the wells dug during Abraham's time which the Philistines had maliciously stopped. Significantly, he restores the original names Abraham had given them, asserting continuity and rightful inheritance.",
      "Methodist": "Isaac re-digs the wells of his father Abraham that the Philistines had filled, restoring their original names.",
      "Lutheran": "Isaac reopens the wells Abraham had dug (which the Philistines stopped after Abraham's death), restoring their original names.",
      "Presbyterian": "Isaac reclaims his father's wells, reopening them and restoring their original names, asserting his inheritance.",
      "Pentecostal": "Isaac reopens Abraham's wells and gives them the same names.",
      "Episcopalian/Anglican": "Isaac reopens the wells dug in Abraham's time, which the Philistines had stopped, and restores the names his father had given them.",
      "Orthodox": "Isaac undertakes the restoration of the wells dug by his father, which the Philistines had blocked, and significantly, restores their original names, affirming his lineage and rights.",
      "Other": "Isaac reopened the wells that had been dug in the time of his father Abraham, which the Philistines had stopped up after Abraham died, and he gave them the same names his father had given them.",
      "Prefer not to say": "Isaac reopened the wells that had been dug in the time of his father Abraham, which the Philistines had stopped up after Abraham died, and he gave them the same names his father had given them."
    },
    "19": {
      "General": "Isaac's servants dug in the valley and discovered a well of fresh water there.",
      "Non-Denominational": "Isaac's servants dug in the valley and discovered a well of fresh water there.",
      "Baptist": "Isaac's servants also dig a new well in the valley, finding a source of fresh ('living' or flowing) water.",
      "Catholic": "While reclaiming old wells, Isaac's servants also dig a new one in the valley and discover a source of fresh, flowing ('living') water, indicating continued blessing and resourcefulness.",
      "Methodist": "His servants dig a new well and find fresh, flowing water.",
      "Lutheran": "Isaac's servants dig a new well in the valley and find 'living' (fresh, flowing) water.",
      "Presbyterian": "Isaac's servants dig a new well, successfully finding fresh water.",
      "Pentecostal": "Isaac's servants find a new well of fresh water.",
      "Episcopalian/Anglican": "Isaac's servants dig in the valley and find a well of fresh ('living') water.",
      "Orthodox": "Isaac's servants successfully dig a new well in the valley, finding a source of fresh ('living') water.",
      "Other": "Isaac's servants dug in the valley and discovered a well of fresh water there.",
      "Prefer not to say": "Isaac's servants dug in the valley and discovered a well of fresh water there."
    },
    "20": {
      "General": "But the herders of Gerar quarreled with Isaac's herders and said, \"The water is ours!\" So he named the well Esek, because they disputed with him.",
      "Non-Denominational": "But the herders of Gerar quarreled with Isaac's herders and said, \"The water is ours!\" So he named the well Esek, because they disputed with him.",
      "Baptist": "Conflict arises immediately as the local Gerar herders claim ownership of the new well. Isaac names it Esek ('dispute' or 'contention') due to the quarrel.",
      "Catholic": "However, the local shepherds ('herders') of Gerar immediately dispute ownership of this new well, claiming, 'The water is ours!' This leads Isaac to name the well Esek (meaning 'contention' or 'dispute') to memorialize the conflict.",
      "Methodist": "Conflict arises as Gerar's herders claim the new well. Isaac names it Esek ('Dispute').",
      "Lutheran": "The shepherds of Gerar quarrel over the new well, claiming it. Isaac names it Esek ('Contention').",
      "Presbyterian": "Conflict erupts as Gerar's herders claim the new well. Isaac names it Esek ('Dispute').",
      "Pentecostal": "Local herders quarrel over the well; Isaac names it Esek (Dispute).",
      "Episcopalian/Anglican": "The herdsmen of Gerar quarrel with Isaac's herdsmen over the new well, claiming ownership. Isaac names it Esek ('Dispute').",
      "Orthodox": "Conflict arises as the local herders of Gerar contest Isaac's claim to the newly discovered well. Isaac names it Esek ('Contention') reflecting this dispute.",
      "Other": "But the herders of Gerar quarreled with Isaac's herders and said, \"The water is ours!\" So he named the well Esek, because they disputed with him.",
      "Prefer not to say": "But the herders of Gerar quarreled with Isaac's herders and said, \"The water is ours!\" So he named the well Esek, because they disputed with him."
    },
    "21": {
      "General": "Then they dug another well, but they quarreled over that one also; so he named it Sitnah.",
      "Non-Denominational": "Then they dug another well, but they quarreled over that one also; so he named it Sitnah.",
      "Baptist": "Isaac's servants dig another well, but it too becomes a source of conflict. Isaac names this one Sitnah ('opposition' or 'hostility').",
      "Catholic": "Isaac's servants dig a second new well, only to face the same contention from the Gerar herders. Isaac names this well Sitnah (meaning 'opposition' or 'enmity'), reflecting the ongoing hostility.",
      "Methodist": "They dig another well, face the same quarrel, and Isaac names it Sitnah ('Opposition').",
      "Lutheran": "They dig another well, and the Gerar shepherds quarrel over it too. Isaac names it Sitnah ('Enmity'/'Accusation').",
      "Presbyterian": "They dig a second well, which also leads to conflict. Isaac names it Sitnah ('Hostility').",
      "Pentecostal": "They dig another well, face quarrels again; Isaac names it Sitnah (Hostility).",
      "Episcopalian/Anglican": "They dig another well, which also leads to quarreling. Isaac names this one Sitnah ('Hostility').",
      "Orthodox": "A second well dug by Isaac's servants also becomes a point of contention, leading Isaac to name it Sitnah ('Enmity').",
      "Other": "Then they dug another well, but they quarreled over that one also; so he named it Sitnah.",
      "Prefer not to say": "Then they dug another well, but they quarreled over that one also; so he named it Sitnah."
    },
    "22": {
      "General": "He moved on from there and dug another well, and no one quarreled over it. He named it Rehoboth, saying, \"Now the Lord has given us room and we will flourish in the land.\"",
      "Non-Denominational": "He moved on from there and dug another well, and no one quarreled over it. He named it Rehoboth, saying, \"Now the Lord has given us room and we will flourish in the land.\"",
      "Baptist": "Isaac relocates again, digs a third well, and this time faces no opposition. He names it Rehoboth ('broad places' or 'room'), recognizing God's provision of space and anticipating future flourishing in the land.",
      "Catholic": "Isaac chooses peace over conflict, moving away again. His servants dig a third well, and this time, there is no dispute. Isaac names it Rehoboth (meaning 'wide spaces' or 'room'), acknowledging that the Lord has finally made space for them and expressing confidence in their future prosperity ('flourish') in the land.",
      "Methodist": "Isaac moves again, digs a third well without conflict, and names it Rehoboth ('Room' or 'Broad Spaces'), acknowledging God's provision and anticipating growth.",
      "Lutheran": "Isaac moves away, digs another well, and faces no quarrel. He names it Rehoboth ('Wide Spaces'), acknowledging Yahweh has made room for them to flourish.",
      "Presbyterian": "Isaac moves again, digs a third well without dispute, and names it Rehoboth ('Broad Places'), crediting God with providing space for them to flourish.",
      "Pentecostal": "Isaac moves, digs a third well without quarrels; names it Rehoboth (Room), acknowledging God's provision.",
      "Episcopalian/Anglican": "Isaac moves on, digs another well without dispute, and names it Rehoboth ('Broad Spaces'), acknowledging that the Lord has made room for them to flourish.",
      "Orthodox": "Relocating once more, Isaac digs a third well which remains uncontested. He names it Rehoboth ('Wide Spaces'), attributing the newfound peace and space to God's provision and anticipating prosperity.",
      "Other": "He moved on from there and dug another well, and no one quarreled over it. He named it Rehoboth, saying, \"Now the Lord has given us room and we will flourish in the land.\"",
      "Prefer not to say": "He moved on from there and dug another well, and no one quarreled over it. He named it Rehoboth, saying, \"Now the Lord has given us room and we will flourish in the land.\""
    },
    "23": {
      "General": "From there he went up to Beersheba.",
      "Non-Denominational": "From there he went up to Beersheba.",
      "Baptist": "Isaac travels onward to Beersheba, a location significantly associated with his father Abraham.",
      "Catholic": "Isaac then moves northward from the Valley of Gerar ('went up') to Beersheba, a place deeply connected with Abraham's history and covenant experiences.",
      "Methodist": "Isaac moves again, traveling to Beersheba, a place significant to Abraham.",
      "Lutheran": "Isaac moves from Rehoboth up to Beersheba.",
      "Presbyterian": "Isaac moves again, going up to Beersheba, a site linked to Abraham.",
      "Pentecostal": "Isaac goes to Beersheba.",
      "Episcopalian/Anglican": "Isaac journeys from there up to Beersheba.",
      "Orthodox": "Isaac journeys further to Beersheba, a location holding significance from Abraham's life.",
      "Other": "From there he went up to Beersheba.",
      "Prefer not to say": "From there he went up to Beersheba."
    },
    "24": {
      "General": "That night the Lord appeared to him and said, \"I am the God of your father Abraham. Do not be afraid, for I am with you; I will bless you and will increase your descendants for the sake of my servant Abraham.\"",
      "Non-Denominational": "That night the Lord appeared to him and said, \"I am the God of your father Abraham. Do not be afraid, for I am with you; I will bless you and will increase your descendants for the sake of my servant Abraham.\"",
      "Baptist": "God appears to Isaac again that night in Beersheba, identifying Himself as Abraham's God, offering reassurance ('Do not be afraid'), promising His presence, blessing, and multiplication of descendants, explicitly for Abraham's sake.",
      "Catholic": "On the very night of his arrival in Beersheba, the Lord appears to Isaac again. God identifies Himself ('I am the God of your father Abraham'), offers reassurance ('Do not be afraid'), repeats the promise of His presence ('I am with you'), blessing, and numerous descendants, explicitly grounding these promises in His covenant relationship with Abraham ('for the sake of my servant Abraham').",
      "Methodist": "God appears to Isaac that night, identifying Himself as Abraham's God, reassuring him, promising His presence, blessing, and descendants, all because of Abraham.",
      "Lutheran": "That night, Yahweh appears to Isaac, identifying Himself as the God of Abraham. He reassures Isaac ('Do not fear'), promises His presence, blessing, and multiplication of descendants 'for the sake of my servant Abraham.'",
      "Presbyterian": "God appears again to Isaac at Beersheba, identifying Himself as Abraham's God, reassuring him ('Do not be afraid'), promising His presence, blessing, and numerous descendants, all for Abraham's sake.",
      "Pentecostal": "God appears to Isaac, reassures him, promises presence, blessing, descendants for Abraham's sake.",
      "Episcopalian/Anglican": "The Lord appears to Isaac that night, identifying Himself as the God of Abraham, offering reassurance ('Do not be afraid'), and reaffirming the promises of His presence, blessing, and numerous descendants for Abraham's sake.",
      "Orthodox": "In Beersheba, God appears to Isaac that night, identifying Himself with Abraham, offering reassurance against fear, and reaffirming promises of divine presence, blessing, and posterity, citing His commitment to Abraham.",
      "Other": "That night the Lord appeared to him and said, \"I am the God of your father Abraham. Do not be afraid, for I am with you; I will bless you and will increase your descendants for the sake of my servant Abraham.\"",
      "Prefer not to say": "That night the Lord appeared to him and said, \"I am the God of your father Abraham. Do not be afraid, for I am with you; I will bless you and will increase your descendants for the sake of my servant Abraham.\""
    },
    "25": {
      "General": "Isaac built an altar there and called on the name of the Lord. There he pitched his tent, and there his servants dug a well.",
      "Non-Denominational": "Isaac built an altar there and called on the name of the Lord. There he pitched his tent, and there his servants dug a well.",
      "Baptist": "In response to God's appearance and promises, Isaac builds an altar (an act of worship), calls on God's name (public profession of faith/worship), pitches his tent (settles), and digs a well (establishes life source).",
      "Catholic": "In response to this theophany, Isaac performs acts establishing his claim and worship: he builds an altar (a place for sacrifice and worship), calls on the name of the Lord (public worship and invocation), pitches his tent (indicating settlement), and has his servants dig a well (securing a water source, essential for settlement).",
      "Methodist": "Isaac responds in worship by building an altar and calling on God's name; he also establishes his presence by pitching his tent and digging a well.",
      "Lutheran": "Isaac responds by building an altar, calling on Yahweh's name (worship), pitching his tent, and digging a well.",
      "Presbyterian": "In response to God's revelation, Isaac builds an altar, calls on God's name in worship, pitches his tent, and digs a well, establishing his presence at Beersheba.",
      "Pentecostal": "Isaac worships (builds altar, calls on God), settles (pitches tent), and digs a well.",
      "Episcopalian/Anglican": "In response to God's appearance, Isaac builds an altar, invokes the Lord's name in worship, pitches his tent, and his servants dig a well.",
      "Orthodox": "Responding to the divine encounter, Isaac establishes a place of worship (builds an altar, invokes God's name), sets up his dwelling (pitches tent), and secures water (digs well).",
      "Other": "Isaac built an altar there and called on the name of the Lord. There he pitched his tent, and there his servants dug a well.",
      "Prefer not to say": "Isaac built an altar there and called on the name of the Lord. There he pitched his tent, and there his servants dug a well."
    },
    "26": {
      "General": "Meanwhile, Abimelek had come to him from Gerar, with Ahuzzath his personal adviser and Phicol the commander of his forces.",
      "Non-Denominational": "Meanwhile, Abimelek had come to him from Gerar, with Ahuzzath his personal adviser and Phicol the commander of his forces.",
      "Baptist": "Abimelek, along with his advisor (Ahuzzath) and military commander (Phicol - same name/title as in Abraham's time), travels from Gerar to visit Isaac in Beersheba.",
      "Catholic": "King Abimelek makes a formal visit to Isaac at Beersheba, traveling from Gerar accompanied by his advisor Ahuzzath and the commander of his army, Phicol (this name/title also appeared with the Abimelek who dealt with Abraham, Gen 21:22, suggesting either the same long-serving official or a hereditary title).",
      "Methodist": "Abimelek, with his advisor Ahuzzath and commander Phicol, comes from Gerar to visit Isaac.",
      "Lutheran": "Abimelek comes from Gerar to Isaac, accompanied by his advisor Ahuzzath and military commander Phicol.",
      "Presbyterian": "Abimelek, accompanied by his advisor Ahuzzath and commander Phicol, travels from Gerar to meet Isaac.",
      "Pentecostal": "Abimelek, Ahuzzath, and Phicol come from Gerar to Isaac.",
      "Episcopalian/Anglican": "Abimelek comes to Isaac from Gerar, accompanied by his advisor Ahuzzath and his army commander Phicol.",
      "Orthodox": "King Abimelek, accompanied by his advisor Ahuzzath and military commander Phicol, journeys from Gerar to meet Isaac.",
      "Other": "Meanwhile, Abimelek had come to him from Gerar, with Ahuzzath his personal adviser and Phicol the commander of his forces.",
      "Prefer not to say": "Meanwhile, Abimelek had come to him from Gerar, with Ahuzzath his personal adviser and Phicol the commander of his forces."
    },
    "27": {
      "General": "Isaac asked them, \"Why have you come to me, since you were hostile to me and sent me away?\"",
      "Non-Denominational": "Isaac asked them, \"Why have you come to me, since you were hostile to me and sent me away?\"",
      "Baptist": "Isaac questions their motives, reminding them of their previous hostility and his expulsion from Gerar.",
      "Catholic": "Isaac, recalling their recent hostile actions (envy, stopping wells) and his expulsion, questions the reason for their visit: 'Why have you come to me, seeing that you hate me and have sent me away from you?'",
      "Methodist": "Isaac challenges their visit, reminding them of their hostility and having sent him away.",
      "Lutheran": "Isaac questions their presence, reminding them they were hostile and sent him away.",
      "Presbyterian": "Isaac questions their motives, recalling their previous hostility and his expulsion.",
      "Pentecostal": "Isaac questions why they came, reminding them of their hostility.",
      "Episcopalian/Anglican": "Isaac questions their reason for coming, reminding them of their previous hostility and having sent him away.",
      "Orthodox": "Isaac questions the purpose of their visit, reminding them of their prior hostile actions and his forced departure.",
      "Other": "Isaac asked them, \"Why have you come to me, since you were hostile to me and sent me away?\"",
      "Prefer not to say": "Isaac asked them, \"Why have you come to me, since you were hostile to me and sent me away?\""
    },
    "28": {
      "General": "They answered, \"We saw clearly that the Lord was with you; so we said, 'There ought to be a sworn agreement between us'—between us and you. Let us make a treaty with you",
      "Non-Denominational": "They answered, \"We saw clearly that the Lord was with you; so we said, 'There ought to be a sworn agreement between us'—between us and you. Let us make a treaty with you",
      "Baptist": "Abimelek and his delegation explicitly acknowledge God's evident presence with Isaac ('We saw clearly that the Lord was with you') as the reason for seeking a formal, sworn treaty (covenant) of non-aggression.",
      "Catholic": "Abimelek's delegation explicitly states their motivation: they have clearly perceived that the Lord is with Isaac ('We saw plainly that the Lord was with you'). Recognizing this divine backing, they propose a formal, sworn oath ('a sworn agreement') or treaty ('covenant') between themselves and Isaac.",
      "Methodist": "They acknowledge seeing God's evident blessing on Isaac ('the Lord was with you') and propose a sworn treaty between them.",
      "Lutheran": "They confess they clearly saw Yahweh was with Isaac. Therefore, they propose a sworn covenant (treaty) between them.",
      "Presbyterian": "They explicitly acknowledge God's presence with Isaac ('We saw clearly that the Lord was with you') and propose a sworn treaty (covenant) based on this recognition.",
      "Pentecostal": "They admit seeing God was with Isaac and propose a treaty.",
      "Episcopalian/Anglican": "They explicitly state they recognized the Lord's presence with Isaac and propose a sworn agreement, a treaty between them.",
      "Orthodox": "They explicitly state their recognition of God's manifest presence with Isaac ('We saw clearly that the Lord was with you') as the basis for proposing a formal sworn treaty.",
      "Other": "They answered, \"We saw clearly that the Lord was with you; so we said, 'There ought to be a sworn agreement between us'—between us and you. Let us make a treaty with you",
      "Prefer not to say": "They answered, \"We saw clearly that the Lord was with you; so we said, 'There ought to be a sworn agreement between us'—between us and you. Let us make a treaty with you"
    },
    "29": {
      "General": "that you will do us no harm, just as we did not harm you but always treated you well and sent you away peacefully. And now you are blessed by the Lord.\"",
      "Non-Denominational": "that you will do us no harm, just as we did not harm you but always treated you well and sent you away peacefully. And now you are blessed by the Lord.\"",
      "Baptist": "The proposed treaty is one of mutual non-aggression. They claim they treated Isaac well (somewhat glossing over the well disputes and expulsion) and reiterate their observation that Isaac is now clearly blessed by God.",
      "Catholic": "The specific term of the treaty is mutual non-aggression: Isaac should do them no harm. They justify this by claiming (somewhat selectively) that they did not harm ('touch') him, treated him only well, and sent him away in peace. They conclude by reaffirming their observation: 'You are now the blessed of the Lord.'",
      "Methodist": "The treaty term is mutual non-aggression. They claim good treatment (downplaying earlier conflict) and acknowledge Isaac as blessed by God.",
      "Lutheran": "The proposed treaty is for mutual non-aggression. They claim they didn't harm Isaac, only treated him well, and sent him away peacefully (a slightly revised history). They again state, 'You are now the blessed of Yahweh.'",
      "Presbyterian": "The treaty's term is non-aggression. They claim past good treatment (ignoring the hostility) and acknowledge Isaac's status as blessed by God.",
      "Pentecostal": "Treaty asks for non-aggression; they claim they treated him well and acknowledge God's blessing on him.",
      "Episcopalian/Anglican": "The treaty's condition is that Isaac will do them no harm, just as (they claim) they did not harm him but treated him well and sent him away peacefully. They reiterate, 'You are now the blessed of the Lord.'",
      "Orthodox": "The treaty proposed is for mutual non-harm. They present their past actions in a positive light (claiming good treatment and peaceful dismissal) and conclude by reaffirming Isaac's status as one blessed by the Lord.",
      "Other": "that you will do us no harm, just as we did not harm you but always treated you well and sent you away peacefully. And now you are blessed by the Lord.\"",
      "Prefer not to say": "that you will do us no harm, just as we did not harm you but always treated you well and sent you away peacefully. And now you are blessed by the Lord.\""
    },
    "30": {
      "General": "Isaac then made a feast for them, and they ate and drank.",
      "Non-Denominational": "Isaac then made a feast for them, and they ate and drank.",
      "Baptist": "Isaac agrees to the proposal and hosts a ceremonial feast for Abimelek and his men, signifying acceptance and fellowship.",
      "Catholic": "Isaac accepts their proposal and hosts a formal feast for Abimelek and his companions. Sharing a meal together was a common way to seal agreements and signify peace and fellowship in the ancient Near East.",
      "Methodist": "Isaac agrees and holds a feast for them, a common practice for sealing treaties.",
      "Lutheran": "Isaac accepts by preparing a feast, and they eat and drink together (a covenant meal).",
      "Presbyterian": "Isaac agrees and prepares a feast for them, signifying the establishment of the treaty.",
      "Pentecostal": "Isaac agrees and makes a feast.",
      "Episcopalian/Anglican": "Isaac makes a feast for them, and they eat and drink together, sealing the agreement.",
      "Orthodox": "Isaac consents and prepares a feast for the delegation, signifying agreement and fellowship through the shared meal.",
      "Other": "Isaac then made a feast for them, and they ate and drank.",
      "Prefer not to say": "Isaac then made a feast for them, and they ate and drank."
    },
    "31": {
      "General": "Early the next morning the men swore an oath to each other. Then Isaac sent them on their way, and they went away peacefully.",
      "Non-Denominational": "Early the next morning the men swore an oath to each other. Then Isaac sent them on their way, and they went away peacefully.",
      "Baptist": "The treaty is formally ratified the next morning with mutual oaths. Isaac then sends them back to Gerar in peace.",
      "Catholic": "The agreement is formally solemnized the following morning when the parties exchange mutual oaths ('swore an oath to each other'). Following the ratification, Isaac dismisses Abimelek's party, and they depart in peace ('shalom').",
      "Methodist": "They formally swear oaths to each other the next morning, and Isaac sends them away peacefully.",
      "Lutheran": "The next morning, they formally swear oaths to each other. Isaac then sends them away, and they depart in peace.",
      "Presbyterian": "The treaty is formalized with mutual oaths the next morning, after which Isaac sends them away peacefully.",
      "Pentecostal": "They swear oaths the next morning; Isaac sends them away in peace.",
      "Episcopalian/Anglican": "Early the next morning, they exchange sworn oaths. Isaac then sends them away, and they depart peacefully.",
      "Orthodox": "The treaty is formally confirmed the next morning through the exchange of mutual oaths. Isaac then bids them farewell, and they depart amicably.",
      "Other": "Early the next morning the men swore an oath to each other. Then Isaac sent them on their way, and they went away peacefully.",
      "Prefer not to say": "Early the next morning the men swore an oath to each other. Then Isaac sent them on their way, and they went away peacefully."
    },
    "32": {
      "General": "That same day Isaac's servants came and told him about the well they had dug. They said, \"We've found water!\"",
      "Non-Denominational": "That same day Isaac's servants came and told him about the well they had dug. They said, \"We've found water!\"",
      "Baptist": "Coinciding with the treaty, Isaac's servants report success in digging the well at Beersheba, announcing, 'We have found water!'",
      "Catholic": "Significantly, on the very day the treaty is finalized ('That same day'), Isaac's servants report success regarding the well they had been digging at Beersheba (mentioned in v. 25), declaring, 'We have found water!'",
      "Methodist": "On the same day the treaty is made, Isaac's servants report finding water in the well they were digging at Beersheba.",
      "Lutheran": "On the same day the treaty is made, Isaac's servants report finding water in the well they had dug (v. 25).",
      "Presbyterian": "On the very day the treaty is made, Isaac's servants report finding water in the well at Beersheba.",
      "Pentecostal": "On the same day, Isaac's servants report finding water in the well.",
      "Episcopalian/Anglican": "On the same day the treaty was sworn, Isaac's servants report finding water in the well they had dug.",
      "Orthodox": "Coincidentally, on the same day the treaty is ratified, Isaac's servants announce the successful discovery of water in the well at Beersheba.",
      "Other": "That same day Isaac's servants came and told him about the well they had dug. They said, \"We've found water!\"",
      "Prefer not to say": "That same day Isaac's servants came and told him about the well they had dug. They said, \"We've found water!\""
    },
    "33": {
      "General": "He called it Shibah, and to this day the name of the town has been Beersheba.",
      "Non-Denominational": "He called it Shibah, and to this day the name of the town has been Beersheba.",
      "Baptist": "Isaac names the well Shibah (meaning 'oath' or possibly related to 'seven'). The text connects this naming to the established name of the town, Beersheba ('Well of the Oath' or 'Well of Seven').",
      "Catholic": "Isaac names this well Shibah (similar to the Hebrew word for 'oath', shevu'ah, possibly also recalling the seven lambs in Abraham's treaty, Gen 21:28-30). The narrator then provides an etiology, linking this event to the name of the town: Beersheba ('Well of the Oath' or perhaps 'Well of Seven').",
      "Methodist": "Isaac names the well Shibah ('Oath'). The place becomes known as Beersheba ('Well of the Oath').",
      "Lutheran": "Isaac calls the well Shibah ('Oath'). This explains the name of the city Beersheba ('Well of the Oath').",
      "Presbyterian": "Isaac names the well Shibah ('Oath'), connecting it etymologically to the name of the town, Beersheba ('Well of the Oath').",
      "Pentecostal": "Isaac names the well Shibah (Oath), explaining the town name Beersheba.",
      "Episcopalian/Anglican": "Isaac names the well Shibah (related to 'oath'). The text links this to the name of the town, Beersheba ('Well of the Oath').",
      "Orthodox": "Isaac names the well Shibah (related to 'oath'). The narrative provides an etiological explanation for the town's name, Beersheba ('Well of the Oath' or 'Well of Seven').",
      "Other": "He called it Shibah, and to this day the name of the town has been Beersheba.",
      "Prefer not to say": "He called it Shibah, and to this day the name of the town has been Beersheba."
    },
    "34": {
      "General": "When Esau was forty years old, he married Judith daughter of Beeri the Hittite, and also Basemath daughter of Elon the Hittite.",
      "Non-Denominational": "When Esau was forty years old, he married Judith daughter of Beeri the Hittite, and also Basemath daughter of Elon the Hittite.",
      "Baptist": "The chapter concludes with a brief note: Esau, at age 40, marries two Hittite women, Judith and Basemath.",
      "Catholic": "A concluding note shifts back to Isaac's family: Esau reaches the age of 40 (the age Isaac was when he married Rebekah) and marries two local Canaanite women: Judith daughter of Beeri the Hittite, and Basemath daughter of Elon the Hittite.",
      "Methodist": "Briefly notes Esau, at age 40, marrying two Hittite women, Judith and Basemath.",
      "Lutheran": "Esau, at age 40, marries two Hittite women: Judith and Basemath.",
      "Presbyterian": "Records Esau marrying two Hittite women (Judith and Basemath) at age 40.",
      "Pentecostal": "Esau marries two Hittite women at age 40.",
      "Episcopalian/Anglican": "Records that Esau, at age 40, married two Hittite women, Judith and Basemath.",
      "Orthodox": "The chapter concludes by noting Esau's marriage at age 40 to two Hittite women, Judith and Basemath.",
      "Other": "When Esau was forty years old, he married Judith daughter of Beeri the Hittite, and also Basemath daughter of Elon the Hittite.",
      "Prefer not to say": "When Esau was forty years old, he married Judith daughter of Beeri the Hittite, and also Basemath daughter of Elon the Hittite."
    },
    "35": {
      "General": "These marriages were a source of grief to Isaac and Rebekah.",
      "Non-Denominational": "These marriages were a source of grief to Isaac and Rebekah.",
      "Baptist": "These marriages cause bitterness and grief for Isaac and Rebekah, likely due to marrying outside the covenant family and into the local Canaanite population.",
      "Catholic": "These marriages are explicitly stated to be a source of bitterness and grief ('bitterness of spirit') for Isaac and Rebekah. This likely stems from Esau marrying Canaanite women, contrary to the family's practice (cf. Gen 24:3) and potentially threatening the purity of the covenant line.",
      "Methodist": "These marriages cause Isaac and Rebekah grief, likely because they were Canaanite women outside the covenant family.",
      "Lutheran": "These marriages cause bitterness/grief for Isaac and Rebekah (likely because they were Hittites/Canaanites).",
      "Presbyterian": "These marriages are a source of grief to Isaac and Rebekah, highlighting the problem of marrying foreign women outside the covenant line.",
      "Pentecostal": "These marriages grieve Isaac and Rebekah.",
      "Episcopalian/Anglican": "These marriages cause grief ('bitterness of spirit') to Isaac and Rebekah, likely due to Esau marrying foreign, Canaanite women.",
      "Orthodox": "Explicitly states that Esau's choice of Hittite wives caused significant grief and bitterness for his parents, Isaac and Rebekah.",
      "Other": "These marriages were a source of grief to Isaac and Rebekah.",
      "Prefer not to say": "These marriages were a source of grief to Isaac and Rebekah."
    }
  }
} 