{
  "_comment": "Interpretations for Genesis Chapter 27",
  "book": "Genesis",
  "chapter": "27",
  "verses": {
  "1": {
      "General": "When Isaac was old and his eyes were so weak that he could no longer see, he called for Esau his older son and said to him, \"My son.\" \"Here I am,\" he answered.",
      "Non-Denominational": "When Isaac was old and his eyes were so weak that he could no longer see, he called for Esau his older son and said to him, \"My son.\" \"Here I am,\" he answered.",
      "Baptist": "Isaac, now old and blind, summons Esau, his favored elder son, intending to give him the patriarchal blessing.",
      "Catholic": "Sets the scene: Isaac is old, and his eyesight has failed ('eyes were dim, so that he could not see'). He summons Esau, identified as his 'older son', indicating his intention to bestow the primary patriarchal blessing upon him.",
      "Methodist": "Isaac, old and blind, calls for his older son Esau, initiating the process for the patriarchal blessing.",
      "Lutheran": "Isaac is old and blind. He calls for Esau, his older son.",
      "Presbyterian": "Isaac, old and blind, summons Esau, his elder son, intending to bestow the patriarchal blessing.",
      "Pentecostal": "Old, blind Isaac calls for Esau.",
      "Episcopalian/Anglican": "Isaac, old and blind, summons his older son Esau.",
      "Orthodox": "Describes Isaac in old age, afflicted with blindness, summoning his elder son Esau.",
      "Other": "When Isaac was old and his eyes were so weak that he could no longer see, he called for Esau his older son and said to him, \"My son.\" \"Here I am,\" he answered.",
      "Prefer not to say": "When Isaac was old and his eyes were so weak that he could no longer see, he called for Esau his older son and said to him, \"My son.\" \"Here I am,\" he answered."
  },
  "2": {
      "General": "Isaac said, \"I am now an old man and don't know the day of my death.",
      "Non-Denominational": "Isaac said, \"I am now an old man and don't know the day of my death.",
      "Baptist": "Isaac expresses his sense of impending death as the reason for initiating the blessing process.",
      "Catholic": "Isaac states his rationale: he is old and uncertain of when he will die ('don't know the day of my death'), implying urgency in passing on the blessing.",
      "Methodist": "Isaac cites his old age and uncertainty about death as the reason for giving the blessing now.",
      "Lutheran": "Isaac states his reason: he is old and doesn't know when he will die.",
      "Presbyterian": "Isaac states his advanced age and uncertainty of life's end as the reason for giving the blessing.",
      "Pentecostal": "Isaac cites old age and impending death.",
      "Episcopalian/Anglican": "Isaac explains his motivation: his old age and the uncertainty of his time of death.",
      "Orthodox": "Isaac articulates his reason for action: advanced age and the uncertainty of his remaining lifespan.",
      "Other": "Isaac said, \"I am now an old man and don't know the day of my death.",
      "Prefer not to say": "Isaac said, \"I am now an old man and don't know the day of my death."
  },
  "3": {
      "General": "Now then, get your equipment—your quiver and bow—and go out to the open country to hunt some wild game for me.",
      "Non-Denominational": "Now then, get your equipment—your quiver and bow—and go out to the open country to hunt some wild game for me.",
      "Baptist": "He instructs Esau to perform his characteristic role: hunt wild game using his bow and quiver.",
      "Catholic": "He instructs Esau, the skillful hunter, to take his hunting gear ('quiver and bow') and procure some wild game.",
      "Methodist": "He instructs Esau to hunt wild game, using his familiar skills.",
      "Lutheran": "He instructs Esau to hunt game with his bow and quiver.",
      "Presbyterian": "Instructs Esau to use his hunting skills to procure wild game.",
      "Pentecostal": "He tells Esau to hunt game.",
      "Episcopalian/Anglican": "He instructs Esau to take his hunting gear and hunt wild game.",
      "Orthodox": "He directs Esau to utilize his hunting prowess to obtain wild game.",
      "Other": "Now then, get your equipment—your quiver and bow—and go out to the open country to hunt some wild game for me.",
      "Prefer not to say": "Now then, get your equipment—your quiver and bow—and go out to the open country to hunt some wild game for me."
  },
  "4": {
      "General": "Prepare me the kind of tasty food I like and bring it to me to eat, so that I may give you my blessing before I die.\"",
      "Non-Denominational": "Prepare me the kind of tasty food I like and bring it to me to eat, so that I may give you my blessing before I die.\"",
      "Baptist": "Isaac requests Esau prepare a specific savory dish he enjoys, linking the meal to the bestowal of the blessing before his death.",
      "Catholic": "Isaac requests Esau prepare the game into a specific savory dish ('tasty food I like'). This preparatory meal is explicitly linked to the giving of the blessing ('so that my soul may bless you before I die'). The meal serves as a prelude and perhaps a sensory confirmation (since he cannot see) for the blessing ceremony.",
      "Methodist": "Isaac asks Esau to prepare the game in a specific way he enjoys, setting the stage for the blessing which follows the meal.",
      "Lutheran": "Esau is to prepare the food the way Isaac likes it, so Isaac can eat and then bestow his blessing before dying.",
      "Presbyterian": "Requests Esau prepare the game as a savory dish Isaac enjoys, linking this meal to the formal blessing.",
      "Pentecostal": "He asks Esau to prepare the food he likes so he can bless him before death.",
      "Episcopalian/Anglican": "Isaac instructs Esau to prepare the game into the savory food he loves, so that he can eat and then give Esau his blessing before death.",
      "Orthodox": "He instructs Esau to prepare the game according to his preference, linking the consumption of this specific meal to the act of conferring the blessing before his death.",
      "Other": "Prepare me the kind of tasty food I like and bring it to me to eat, so that I may give you my blessing before I die.\"",
      "Prefer not to say": "Prepare me the kind of tasty food I like and bring it to me to eat, so that I may give you my blessing before I die.\""
  },
  "5": {
      "General": "Now Rebekah was listening as Isaac spoke to his son Esau. When Esau left for the open country to hunt game and bring it back,",
      "Non-Denominational": "Now Rebekah was listening as Isaac spoke to his son Esau. When Esau left for the open country to hunt game and bring it back,",
      "Baptist": "Rebekah overhears Isaac's instructions to Esau. As Esau departs to hunt, Rebekah begins to formulate her plan.",
      "Catholic": "Crucially, Rebekah overhears this conversation between Isaac and Esau. As soon as Esau leaves to hunt the game, Rebekah sets her counter-plan in motion.",
      "Methodist": "Rebekah overhears Isaac's plan for Esau and begins her own scheme as Esau leaves.",
      "Lutheran": "Rebekah overhears Isaac's instructions to Esau. When Esau leaves to hunt...",
      "Presbyterian": "Rebekah overhears Isaac's instructions to Esau and initiates her plan once Esau leaves.",
      "Pentecostal": "Rebekah overhears Isaac and Esau; Esau leaves to hunt.",
      "Episcopalian/Anglican": "Rebekah overhears Isaac speaking to Esau. As Esau leaves to hunt...",
      "Orthodox": "Rebekah eavesdrops on the conversation between Isaac and Esau, and upon Esau's departure to hunt, she initiates her scheme.",
      "Other": "Now Rebekah was listening as Isaac spoke to his son Esau. When Esau left for the open country to hunt game and bring it back,",
      "Prefer not to say": "Now Rebekah was listening as Isaac spoke to his son Esau. When Esau left for the open country to hunt game and bring it back,"
  },
  "6": {
      "General": "Rebekah said to her son Jacob, \"Look, I overheard your father say to your brother Esau,",
      "Non-Denominational": "Rebekah said to her son Jacob, \"Look, I overheard your father say to your brother Esau,",
      "Baptist": "Rebekah immediately informs Jacob, her favored son, about the conversation she overheard.",
      "Catholic": "Rebekah immediately goes to her favored son, Jacob, and relays what she overheard Isaac telling Esau.",
      "Methodist": "Rebekah informs Jacob about what she overheard Isaac telling Esau.",
      "Lutheran": "...Rebekah tells Jacob what she overheard Isaac telling Esau.",
      "Presbyterian": "Rebekah reports Isaac's instructions to Jacob.",
      "Pentecostal": "Rebekah tells Jacob what she heard.",
      "Episcopalian/Anglican": "Rebekah reports to her son Jacob what she overheard Isaac saying to Esau.",
      "Orthodox": "Rebekah promptly informs her preferred son, Jacob, of the instructions Isaac gave to Esau.",
      "Other": "Rebekah said to her son Jacob, \"Look, I overheard your father say to your brother Esau,",
      "Prefer not to say": "Rebekah said to her son Jacob, \"Look, I overheard your father say to your brother Esau,"
  },
  "7": {
      "General": "‘Bring me some game and prepare me some tasty food to eat, so that I may give you my blessing in the presence of the Lord before I die.’",
      "Non-Denominational": "‘Bring me some game and prepare me some tasty food to eat, so that I may give you my blessing in the presence of the Lord before I die.’",
      "Baptist": "She repeats Isaac's instructions to Esau regarding the hunt, the meal, and the intended blessing (adding 'in the presence of the Lord').",
      "Catholic": "She accurately repeats Isaac's request for game and tasty food, linked to the purpose of giving Esau the blessing. Rebekah adds the phrase 'in the presence of the Lord', perhaps emphasizing the solemnity and divine witness she believes should rightly fall on Jacob.",
      "Methodist": "She repeats Isaac's instructions to Esau about the meal and the blessing (adding 'in the presence of the Lord').",
      "Lutheran": "She relays Isaac's request for game and tasty food, leading to the blessing 'before Yahweh' before death.",
      "Presbyterian": "She accurately relays Isaac's request for game, food, and the blessing (adding 'in the presence of the Lord').",
      "Pentecostal": "She repeats Isaac's words about the food and blessing.",
      "Episcopalian/Anglican": "She quotes Isaac's request for game and tasty food, leading to the blessing 'in the presence of the Lord' before death.",
      "Orthodox": "She accurately conveys Isaac's request for game and the prepared meal as prerequisites for bestowing the blessing, adding the solemn phrase 'in the presence of the Lord'.",
      "Other": "‘Bring me some game and prepare me some tasty food to eat, so that I may give you my blessing in the presence of the Lord before I die.’",
      "Prefer not to say": "‘Bring me some game and prepare me some tasty food to eat, so that I may give you my blessing in the presence of the Lord before I die.’"
  },
  "8": {
      "General": "Now, my son, listen carefully and do what I tell you:",
      "Non-Denominational": "Now, my son, listen carefully and do what I tell you:",
      "Baptist": "Rebekah asserts her authority and instructs Jacob to obey her plan precisely.",
      "Catholic": "Rebekah firmly instructs Jacob to listen to her and follow her instructions exactly.",
      "Methodist": "Rebekah instructs Jacob to listen and follow her plan.",
      "Lutheran": "Rebekah commands Jacob to obey her instructions.",
      "Presbyterian": "Rebekah instructs Jacob to obey her plan.",
      "Pentecostal": "Rebekah commands Jacob to obey her.",
      "Episcopalian/Anglican": "Rebekah commands Jacob to listen and obey her instructions.",
      "Orthodox": "Rebekah issues a command to Jacob, demanding his careful attention and obedience.",
      "Other": "Now, my son, listen carefully and do what I tell you:",
      "Prefer not to say": "Now, my son, listen carefully and do what I tell you:"
  },
  "9": {
      "General": "Go out to the flock and bring me two choice young goats, so I can prepare some tasty food for your father, just the way he likes it.",
      "Non-Denominational": "Go out to the flock and bring me two choice young goats, so I can prepare some tasty food for your father, just the way he likes it.",
      "Baptist": "Her plan involves substituting goat meat for game. She instructs Jacob to fetch two good young goats for her to cook in the style Isaac prefers.",
      "Catholic": "She instructs Jacob to bring her two choice young goats from the flock. She will use these to prepare the savory dish Isaac loves, substituting domestic meat for the wild game Esau is hunting.",
      "Methodist": "She tells Jacob to get two young goats so she can prepare the savory dish Isaac likes, substituting it for Esau's game.",
      "Lutheran": "Jacob is to bring two good young goats, which Rebekah will prepare into the tasty food Isaac likes.",
      "Presbyterian": "Instructs Jacob to bring two young goats for her to prepare as the savory dish Isaac likes, substituting for game.",
      "Pentecostal": "She tells Jacob to get goats for her to cook like Isaac likes.",
      "Episcopalian/Anglican": "She instructs Jacob to fetch two choice young goats for her to prepare into the savory food Isaac loves.",
      "Orthodox": "She directs Jacob to select two prime young goats from the flock, which she intends to prepare in the manner favoured by Isaac, substituting it for the wild game.",
      "Other": "Go out to the flock and bring me two choice young goats, so I can prepare some tasty food for your father, just the way he likes it.",
      "Prefer not to say": "Go out to the flock and bring me two choice young goats, so I can prepare some tasty food for your father, just the way he likes it."
  },
  "10": {
      "General": "Then take it to your father to eat, so that he may give you his blessing before he dies.\"",
      "Non-Denominational": "Then take it to your father to eat, so that he may give you his blessing before he dies.\"",
      "Baptist": "Jacob is then to present this substituted meal to Isaac, intending to receive the blessing meant for Esau.",
      "Catholic": "Jacob's role is then to take this prepared food to Isaac, pretending to be Esau, so that Isaac will eat and bestow the blessing upon Jacob instead.",
      "Methodist": "Jacob is to take this food to Isaac so that Isaac will bless him (Jacob) instead of Esau.",
      "Lutheran": "Jacob is then to take the food to Isaac, so Isaac will eat and bless Jacob before he dies.",
      "Presbyterian": "Jacob is then to take this food to Isaac to receive the blessing intended for Esau.",
      "Pentecostal": "Jacob is to take the food to Isaac to receive the blessing.",
      "Episcopalian/Anglican": "Jacob is then to take this food to Isaac to eat, so that Isaac will give Jacob the blessing before his death.",
      "Orthodox": "Jacob is instructed to present this meal to Isaac, enabling Isaac to eat and subsequently confer the blessing upon Jacob.",
      "Other": "Then take it to your father to eat, so that he may give you his blessing before he dies.\"",
      "Prefer not to say": "Then take it to your father to eat, so that he may give you his blessing before he dies.\""
  },
  "11": {
      "General": "Jacob said to Rebekah his mother, \"But my brother Esau is a hairy man while I have smooth skin.",
      "Non-Denominational": "Jacob said to Rebekah his mother, \"But my brother Esau is a hairy man while I have smooth skin.",
      "Baptist": "Jacob raises a practical objection: the physical difference between his smooth skin and Esau's hairiness could expose the deception.",
      "Catholic": "Jacob immediately raises a practical objection based on the distinct physical difference between the twins: Esau is very hairy, while Jacob has smooth skin. This difference risks exposing the impersonation.",
      "Methodist": "Jacob points out the risk: Esau is hairy, but he is smooth-skinned, a difference Isaac might detect.",
      "Lutheran": "Jacob objects: Esau is hairy, but he is smooth-skinned.",
      "Presbyterian": "Jacob raises the objection of the physical difference (Esau's hairiness vs. his smooth skin) which could reveal the deception.",
      "Pentecostal": "Jacob objects: Esau is hairy, he is smooth.",
      "Episcopalian/Anglican": "Jacob raises an objection: the physical difference between Esau (hairy) and himself (smooth skin).",
      "Orthodox": "Jacob voices a practical concern regarding the significant physical disparity between himself (smooth-skinned) and the hairy Esau, which could betray the impersonation.",
      "Other": "Jacob said to Rebekah his mother, \"But my brother Esau is a hairy man while I have smooth skin.",
      "Prefer not to say": "Jacob said to Rebekah his mother, \"But my brother Esau is a hairy man while I have smooth skin."
  },
  "12": {
      "General": "What if my father touches me? I would appear to be tricking him and would bring down a curse on myself rather than a blessing.\"",
      "Non-Denominational": "What if my father touches me? I would appear to be tricking him and would bring down a curse on myself rather than a blessing.\"",
      "Baptist": "He fears that if Isaac touches him, the trickery will be revealed, resulting in a curse instead of the desired blessing.",
      "Catholic": "He worries that if his blind father touches him, the deception will be discovered ('I would appear to be tricking him'). Instead of receiving the blessing, he fears he will incur a curse for his deceit.",
      "Methodist": "He fears Isaac touching him will reveal the trick, leading to a curse instead of a blessing.",
      "Lutheran": "He fears Isaac might touch him, discover the deception, and curse him instead of blessing him.",
      "Presbyterian": "He fears that if Isaac touches him, the deception will be revealed, and he will receive a curse instead of a blessing.",
      "Pentecostal": "He fears Isaac will touch him, discover the trick, and curse him.",
      "Episcopalian/Anglican": "He expresses fear that if Isaac touches him, he will be revealed as a deceiver and bring a curse upon himself instead of a blessing.",
      "Orthodox": "He fears tactile identification by his father, which would expose the deceit and likely result in a curse rather than the intended blessing.",
      "Other": "What if my father touches me? I would appear to be tricking him and would bring down a curse on myself rather than a blessing.\"",
      "Prefer not to say": "What if my father touches me? I would appear to be tricking him and would bring down a curse on myself rather than a blessing.\""
  },
  "13": {
      "General": "His mother said to him, \"My son, let the curse fall on me. Just do what I say; go and get them for me.\"",
      "Non-Denominational": "His mother said to him, \"My son, let the curse fall on me. Just do what I say; go and get them for me.\"",
      "Baptist": "Rebekah takes responsibility for any potential curse, urging Jacob to proceed with fetching the goats as instructed.",
      "Catholic": "Rebekah resolutely dismisses Jacob's fear, taking the potential curse upon herself ('Let your curse be on me, my son!'). She insists he simply obey her command and get the goats.",
      "Methodist": "Rebekah takes responsibility for any curse ('Let the curse fall on me') and insists Jacob obey her.",
      "Lutheran": "Rebekah dismisses his fear, taking any potential curse upon herself ('Upon me be your curse, my son!'), and insists he obey.",
      "Presbyterian": "Rebekah overrides his objection, taking responsibility for any potential curse ('Let the curse fall on me') and demanding obedience.",
      "Pentecostal": "Rebekah takes responsibility for any curse and tells Jacob to obey.",
      "Episcopalian/Anglican": "Rebekah accepts responsibility for any potential curse ('Let your curse be on me') and commands Jacob to obey and fetch the goats.",
      "Orthodox": "Rebekah assumes responsibility for any negative consequences, declaring 'Let the curse fall on me', and firmly reiterates her command for Jacob to obey.",
      "Other": "His mother said to him, \"My son, let the curse fall on me. Just do what I say; go and get them for me.\"",
      "Prefer not to say": "His mother said to him, \"My son, let the curse fall on me. Just do what I say; go and get them for me.\""
  },
  "14": {
      "General": "So he went and got them and brought them to his mother, and she prepared some tasty food, just the way his father liked it.",
      "Non-Denominational": "So he went and got them and brought them to his mother, and she prepared some tasty food, just the way his father liked it.",
      "Baptist": "Jacob obeys, brings the goats, and Rebekah prepares the savory dish Isaac enjoys.",
      "Catholic": "Jacob complies, fetches the goats, and gives them to Rebekah. She then prepares the savory dish exactly as Isaac liked it.",
      "Methodist": "Jacob obeys, gets the goats, and Rebekah prepares the food as Isaac likes it.",
      "Lutheran": "Jacob obeys, gets the goats, and Rebekah prepares the tasty food Isaac liked.",
      "Presbyterian": "Jacob obeys, fetches the goats, and Rebekah prepares the dish Isaac enjoys.",
      "Pentecostal": "Jacob obeys; Rebekah cooks the food.",
      "Episcopalian/Anglican": "Jacob obeys, fetches the goats, and Rebekah prepares the savory food Isaac loved.",
      "Orthodox": "Jacob complies with his mother's directive, retrieves the goats, and Rebekah prepares the meal according to Isaac's preference.",
      "Other": "So he went and got them and brought them to his mother, and she prepared some tasty food, just the way his father liked it.",
      "Prefer not to say": "So he went and got them and brought them to his mother, and she prepared some tasty food, just the way his father liked it."
  },
  "15": {
      "General": "Then Rebekah took the best clothes of Esau her older son, which she had in the house, and put them on her younger son Jacob.",
      "Non-Denominational": "Then Rebekah took the best clothes of Esau her older son, which she had in the house, and put them on her younger son Jacob.",
      "Baptist": "Rebekah takes Esau's best clothes (likely carrying his scent) and puts them on Jacob to aid the deception.",
      "Catholic": "Rebekah takes Esau's best clothes (perhaps carrying his distinctive scent, important for deceiving the blind Isaac) and dresses Jacob in them.",
      "Methodist": "Rebekah dresses Jacob in Esau's best clothes, likely for the scent, to aid the deception.",
      "Lutheran": "Rebekah takes Esau's best clothes and puts them on Jacob.",
      "Presbyterian": "Rebekah dresses Jacob in Esau's best clothes, likely to mimic his scent.",
      "Pentecostal": "Rebekah puts Esau's best clothes on Jacob.",
      "Episcopalian/Anglican": "Rebekah takes Esau's finest clothes and puts them on Jacob.",
      "Orthodox": "Rebekah retrieves Esau's finest garments and dresses Jacob in them, likely to provide Isaac with a familiar scent.",
      "Other": "Then Rebekah took the best clothes of Esau her older son, which she had in the house, and put them on her younger son Jacob.",
      "Prefer not to say": "Then Rebekah took the best clothes of Esau her older son, which she had in the house, and put them on her younger son Jacob."
  },
  "16": {
      "General": "She also covered his hands and the smooth part of his neck with the goatskins.",
      "Non-Denominational": "She also covered his hands and the smooth part of his neck with the goatskins.",
      "Baptist": "She covers Jacob's smooth hands and neck with the goatskins to mimic Esau's hairiness, addressing Jacob's earlier concern.",
      "Catholic": "To complete the tactile deception, she covers Jacob's smooth hands and the smooth part of his neck with the skins of the young goats, simulating Esau's hairy feel.",
      "Methodist": "She covers Jacob's hands and neck with goatskins to simulate Esau's hairy skin.",
      "Lutheran": "She covers Jacob's hands and smooth neck with the goatskins to mimic Esau's feel.",
      "Presbyterian": "She covers Jacob's smooth hands and neck with goatskins to mimic Esau's hairy texture.",
      "Pentecostal": "She covers Jacob's hands and neck with goatskins.",
      "Episcopalian/Anglican": "She covers Jacob's hands and the smooth part of his neck with the goatskins to mimic Esau's hairy skin.",
      "Orthodox": "To address the tactile difference, she covers Jacob's hands and neck with the goatskins, simulating Esau's hairiness.",
      "Other": "She also covered his hands and the smooth part of his neck with the goatskins.",
      "Prefer not to say": "She also covered his hands and the smooth part of his neck with the goatskins."
  },
  "17": {
      "General": "Then she handed to her son Jacob the tasty food and the bread she had made.",
      "Non-Denominational": "Then she handed to her son Jacob the tasty food and the bread she had made.",
      "Baptist": "Rebekah gives the prepared food (savory dish and bread) to Jacob to take to Isaac.",
      "Catholic": "Fully prepared and disguised, Rebekah hands the savory food and bread she has made to Jacob.",
      "Methodist": "She gives Jacob the prepared food and bread.",
      "Lutheran": "She gives the food and bread to Jacob.",
      "Presbyterian": "She gives Jacob the prepared food to take to Isaac.",
      "Pentecostal": "She gives Jacob the food.",
      "Episcopalian/Anglican": "She hands the prepared food and bread to Jacob.",
      "Orthodox": "Rebekah gives the prepared meal and bread to Jacob for presentation to Isaac.",
      "Other": "Then she handed to her son Jacob the tasty food and the bread she had made.",
      "Prefer not to say": "Then she handed to her son Jacob the tasty food and the bread she had made."
  },
  "18": {
      "General": "He went to his father and said, \"My father.\" \"Yes, my son,\" Isaac answered. \"Who is it?\"",
      "Non-Denominational": "He went to his father and said, \"My father.\" \"Yes, my son,\" Isaac answered. \"Who is it?\"",
      "Baptist": "Jacob approaches Isaac, addressing him as 'My father.' Isaac responds but, being blind, asks for identification.",
      "Catholic": "Jacob approaches Isaac and addresses him. Isaac responds but, being unable to see, immediately asks for identification ('Who is it?').",
      "Methodist": "Jacob goes to Isaac. Isaac, being blind, asks who is addressing him.",
      "Lutheran": "Jacob approaches Isaac. Isaac responds but asks who it is.",
      "Presbyterian": "Jacob approaches Isaac, who responds but asks for identification due to blindness.",
      "Pentecostal": "Jacob approaches Isaac, who asks who it is.",
      "Episcopalian/Anglican": "Jacob goes to Isaac; Isaac responds but asks for identification.",
      "Orthodox": "Jacob approaches his father. Isaac acknowledges him but, due to his blindness, inquires about his identity.",
      "Other": "He went to his father and said, \"My father.\" \"Yes, my son,\" Isaac answered. \"Who is it?\"",
      "Prefer not to say": "He went to his father and said, \"My father.\" \"Yes, my son,\" Isaac answered. \"Who is it?\""
  },
  "19": {
      "General": "Jacob said to his father, \"I am Esau your firstborn. I have done as you told me. Please sit up and eat some of my game, so that you may give me your blessing.\"",
      "Non-Denominational": "Jacob said to his father, \"I am Esau your firstborn. I have done as you told me. Please sit up and eat some of my game, so that you may give me your blessing.\"",
      "Baptist": "Jacob lies directly, claiming to be Esau the firstborn, stating he has fulfilled the hunting request, and asks Isaac to eat so he can receive the blessing.",
      "Catholic": "Jacob baldly lies, claiming, 'I am Esau your firstborn.' He asserts he has followed Isaac's instructions regarding the hunt and urges Isaac to eat the prepared 'game' so that Isaac can give him the blessing.",
      "Methodist": "Jacob lies directly, claiming to be Esau the firstborn, asserting he has brought the requested game, and asking Isaac to eat and give the blessing.",
      "Lutheran": "Jacob lies, claiming to be Esau the firstborn, saying he did as instructed, and asking Isaac to eat the 'game' and give the blessing.",
      "Presbyterian": "Jacob lies directly, claiming to be Esau the firstborn, stating he has fulfilled the request, and asks Isaac to eat and give the blessing.",
      "Pentecostal": "Jacob lies, claiming to be Esau, and asks for the blessing after Isaac eats.",
      "Episcopalian/Anglican": "Jacob lies, identifying himself as Esau the firstborn, claiming to have done as instructed, and urging Isaac to eat the 'game' and give the blessing.",
      "Orthodox": "Jacob engages in direct falsehood, identifying himself as Esau the firstborn, claiming fulfillment of the hunting task, and requesting Isaac eat so the blessing can be conferred.",
      "Other": "Jacob said to his father, \"I am Esau your firstborn. I have done as you told me. Please sit up and eat some of my game, so that you may give me your blessing.\"",
      "Prefer not to say": "Jacob said to his father, \"I am Esau your firstborn. I have done as you told me. Please sit up and eat some of my game, so that you may give me your blessing.\""
  },
  "20": {
      "General": "Isaac asked his son, \"How did you find it so quickly, my son?\" \"The Lord your God gave me success,\" he replied.",
      "Non-Denominational": "Isaac asked his son, \"How did you find it so quickly, my son?\" \"The Lord your God gave me success,\" he replied.",
      "Baptist": "Isaac expresses surprise at the speed of the 'hunt.' Jacob compounds his lie with blasphemy, attributing his speed to God's intervention.",
      "Catholic": "Isaac expresses surprise at the speed with which 'Esau' seemingly completed the hunt ('How did you find it so quickly?'). Jacob deepens the deception by invoking God's name, falsely claiming, 'The Lord your God granted me success.'",
      "Methodist": "Isaac questions the speed of the 'hunt.' Jacob lies further, invoking God's name to explain his quick success.",
      "Lutheran": "Isaac questions the speed. Jacob lies further, claiming Yahweh gave him success.",
      "Presbyterian": "Isaac is suspicious about the speed. Jacob compounds the lie by falsely attributing his quick return to God's help.",
      "Pentecostal": "Isaac questions the speed; Jacob lies, saying God helped him.",
      "Episcopalian/Anglican": "Isaac questions the speed of the supposed hunt. Jacob replies with a further lie, attributing his speed to 'The Lord your God.'",
      "Orthodox": "Isaac expresses surprise at the rapidity of the alleged hunt. Jacob compounds the deceit by falsely attributing his swiftness to divine assistance.",
      "Other": "Isaac asked his son, \"How did you find it so quickly, my son?\" \"The Lord your God gave me success,\" he replied.",
      "Prefer not to say": "Isaac asked his son, \"How did you find it so quickly, my son?\" \"The Lord your God gave me success,\" he replied."
  },
  "21": {
      "General": "Then Isaac said to Jacob, \"Come near so I can touch you, my son, to know whether you really are my son Esau or not.\"",
      "Non-Denominational": "Then Isaac said to Jacob, \"Come near so I can touch you, my son, to know whether you really are my son Esau or not.\"",
      "Baptist": "Still uncertain (perhaps due to the voice or speed), Isaac seeks tactile confirmation, asking Jacob to come closer so he can touch him.",
      "Catholic": "Isaac, still perhaps suspicious (voice? speed?), seeks confirmation through touch, asking Jacob to come near so he can feel him and ascertain if he truly is Esau.",
      "Methodist": "Isaac remains uncertain and asks Jacob to come near so he can touch him to verify his identity.",
      "Lutheran": "Isaac, still uncertain, asks Jacob to come near so he can touch him and verify if he is Esau.",
      "Presbyterian": "Still suspicious, Isaac requests Jacob come near for tactile identification.",
      "Pentecostal": "Isaac, still unsure, asks Jacob to come near so he can touch him.",
      "Episcopalian/Anglican": "Isaac, still needing verification, asks Jacob to come near so he can touch him to confirm if he is Esau.",
      "Orthodox": "Remaining uncertain, Isaac requests Jacob approach so he can use touch to verify his identity.",
      "Other": "Then Isaac said to Jacob, \"Come near so I can touch you, my son, to know whether you really are my son Esau or not.\"",
      "Prefer not to say": "Then Isaac said to Jacob, \"Come near so I can touch you, my son, to know whether you really are my son Esau or not.\""
  },
  "22": {
      "General": "Jacob went close to his father Isaac, who touched him and said, \"The voice is the voice of Jacob, but the hands are the hands of Esau.\"",
      "Non-Denominational": "Jacob went close to his father Isaac, who touched him and said, \"The voice is the voice of Jacob, but the hands are the hands of Esau.\"",
      "Baptist": "Jacob complies. Isaac touches him and notes the discrepancy: the voice sounds like Jacob, but the hands (covered in goatskin) feel hairy like Esau's.",
      "Catholic": "Jacob approaches, and Isaac touches him. Isaac voices his confusion: the voice sounds like Jacob, but the hands (covered by the goatskins) feel like the hairy hands of Esau. The deception is working, but Isaac remains partially unconvinced.",
      "Methodist": "Jacob goes near, Isaac touches him and expresses confusion: the voice sounds like Jacob, but the hands feel like Esau's.",
      "Lutheran": "Jacob approaches, Isaac touches him and notes the conflicting evidence: 'The voice is Jacob's voice, but the hands are the hands of Esau.'",
      "Presbyterian": "Isaac touches Jacob and notes the discrepancy: Jacob's voice but Esau's hands (due to the goatskins).",
      "Pentecostal": "Isaac touches Jacob, noting the voice is Jacob's but the hands are Esau's.",
      "Episcopalian/Anglican": "Jacob approaches, Isaac touches him and voices his confusion: the voice sounds like Jacob, but the hands feel like Esau's.",
      "Orthodox": "Jacob approaches, and upon touching him, Isaac verbalizes his confusion caused by the conflicting sensory input: Jacob's voice but Esau's hairy hands.",
      "Other": "Jacob went close to his father Isaac, who touched him and said, \"The voice is the voice of Jacob, but the hands are the hands of Esau.\"",
      "Prefer not to say": "Jacob went close to his father Isaac, who touched him and said, \"The voice is the voice of Jacob, but the hands are the hands of Esau.\""
  },
  "23": {
      "General": "He did not recognize him, for his hands were hairy like those of his brother Esau; so he proceeded to bless him.",
      "Non-Denominational": "He did not recognize him, for his hands were hairy like those of his brother Esau; so he proceeded to bless him.",
      "Baptist": "Despite the vocal discrepancy, the tactile evidence (hairy hands) convinces Isaac, or at least overrides his doubt. He fails to recognize Jacob and prepares to give the blessing.",
      "Catholic": "Ultimately, the tactile evidence of the hairy hands convinces Isaac (or overrides his doubt). The narrator states Isaac 'did not recognize him' because the hands felt like Esau's. Convinced, Isaac prepares to bestow the blessing.",
      "Methodist": "The hairy hands convince Isaac, overriding the voice. He fails to recognize the deception and proceeds with the blessing.",
      "Lutheran": "Isaac fails to recognize Jacob because his hands felt hairy like Esau's, so he prepares to bless him.",
      "Presbyterian": "Despite the doubt raised by the voice, the hairy hands persuade Isaac. He fails to recognize Jacob and proceeds to bless him.",
      "Pentecostal": "Isaac doesn't recognize him due to the hairy hands and proceeds to bless him.",
      "Episcopalian/Anglican": "Isaac failed to recognize Jacob because his hands felt hairy like Esau's, so he prepared to bless him.",
      "Orthodox": "Ultimately, the tactile sensation of the hairy hands overrides Isaac's auditory suspicion, leading him to fail to recognize Jacob and proceed with the blessing.",
      "Other": "He did not recognize him, for his hands were hairy like those of his brother Esau; so he proceeded to bless him.",
      "Prefer not to say": "He did not recognize him, for his hands were hairy like those of his brother Esau; so he proceeded to bless him."
  },
  "24": {
      "General": "\"Are you really my son Esau?\" Isaac asked. \"I am,\" he replied.",
      "Non-Denominational": "\"Are you really my son Esau?\" Isaac asked. \"I am,\" he replied.",
      "Baptist": "Isaac asks one final, direct question for confirmation. Jacob gives a final, direct lie.",
      "Catholic": "Seeking final confirmation despite the conflicting evidence, Isaac asks directly, 'Are you really my son Esau?' Jacob gives a simple, direct, and false affirmation: 'I am.'",
      "Methodist": "Isaac asks for final verbal confirmation. Jacob gives a direct lie: 'I am.'",
      "Lutheran": "Isaac asks one more time, 'Are you really my son Esau?' Jacob lies again, 'I am.'",
      "Presbyterian": "Isaac asks for direct confirmation ('Are you really my son Esau?'). Jacob confirms the lie ('I am').",
      "Pentecostal": "Isaac asks directly if he is Esau. Jacob lies, 'I am.'",
      "Episcopalian/Anglican": "Isaac asks for one last confirmation, 'Are you really my son Esau?' Jacob replies with the lie, 'I am.'",
      "Orthodox": "In a final attempt at verification, Isaac directly asks, 'Are you really my son Esau?' Jacob responds with a definitive falsehood, 'I am.'",
      "Other": "\"Are you really my son Esau?\" Isaac asked. \"I am,\" he replied.",
      "Prefer not to say": "\"Are you really my son Esau?\" Isaac asked. \"I am,\" he replied."
  },
  "25": {
      "General": "Then he said, \"My son, bring me some of your game to eat, so that I may give you my blessing.\" Jacob brought it to him and he ate; and he brought some wine and he drank.",
      "Non-Denominational": "Then he said, \"My son, bring me some of your game to eat, so that I may give you my blessing.\" Jacob brought it to him and he ate; and he brought some wine and he drank.",
      "Baptist": "Convinced (or choosing to ignore doubts), Isaac asks for the food. Jacob serves the prepared goat meat and wine, which Isaac consumes, completing the prelude to the blessing.",
      "Catholic": "Satisfied by the false confirmation, Isaac instructs Jacob ('my son') to serve the 'game' so he can eat and proceed with the blessing. Jacob serves the food (prepared goat) and wine, and Isaac eats and drinks.",
      "Methodist": "Isaac, now convinced, asks for the food. Jacob serves the goat meat and wine, and Isaac eats and drinks.",
      "Lutheran": "Isaac asks for the food to eat before the blessing. Jacob serves it, and Isaac eats the goat meat and drinks the wine.",
      "Presbyterian": "Convinced, Isaac asks for the food. Jacob serves the meal (goat meat) and wine, which Isaac consumes.",
      "Pentecostal": "Isaac asks for the food; Jacob serves it, and Isaac eats and drinks.",
      "Episcopalian/Anglican": "Isaac instructs Jacob to serve the 'game.' Jacob brings the food and wine, and Isaac eats and drinks.",
      "Orthodox": "Now seemingly convinced, Isaac requests the meal. Jacob serves the prepared food and wine, which Isaac consumes, setting the stage for the blessing.",
      "Other": "Then he said, \"My son, bring me some of your game to eat, so that I may give you my blessing.\" Jacob brought it to him and he ate; and he brought some wine and he drank.",
      "Prefer not to say": "Then he said, \"My son, bring me some of your game to eat, so that I may give you my blessing.\" Jacob brought it to him and he ate; and he brought some wine and he drank."
  },
  "26": {
      "General": "Then his father Isaac said to him, \"Come near now and kiss me, my son.\"",
      "Non-Denominational": "Then his father Isaac said to him, \"Come near now and kiss me, my son.\"",
      "Baptist": "Isaac asks Jacob (believing him to be Esau) to come close for a kiss, an act of affection preceding the blessing, which also allows Isaac to smell him.",
      "Catholic": "Isaac asks Jacob (whom he believes to be Esau) to come near and kiss him. This is likely an expression of affection before the blessing, but it also serves as another (unintentional) sensory check – proximity allows Isaac to smell the person.",
      "Methodist": "Isaac asks Jacob (believing him Esau) to come near and kiss him, an act of affection which also allows him to smell Jacob.",
      "Lutheran": "Isaac asks Jacob (thinking he's Esau) to come near and kiss him.",
      "Presbyterian": "Isaac asks Jacob (believed to be Esau) to come near and kiss him, an act allowing for closer sensory perception (smell).",
      "Pentecostal": "Isaac asks Jacob (thinking he's Esau) to kiss him.",
      "Episcopalian/Anglican": "Isaac asks Jacob (believing him to be Esau) to come near and kiss him.",
      "Orthodox": "Isaac requests Jacob (mistaken for Esau) approach and kiss him, an intimate gesture providing another sensory clue (smell).",
      "Other": "Then his father Isaac said to him, \"Come near now and kiss me, my son.\"",
      "Prefer not to say": "Then his father Isaac said to him, \"Come near now and kiss me, my son.\""
  },
  "27": {
      "General": "So he went to him and kissed him. When Isaac caught the smell of his clothes, he blessed him and said, \"Ah, the smell of my son is like the smell of a field that the Lord has blessed.",
      "Non-Denominational": "So he went to him and kissed him. When Isaac caught the smell of his clothes, he blessed him and said, \"Ah, the smell of my son is like the smell of a field that the Lord has blessed.",
      "Baptist": "Jacob kisses Isaac. Isaac smells Esau's clothes (worn by Jacob) and, associating the outdoor/field scent with Esau and God's blessing on nature, begins the formal blessing.",
      "Catholic": "Jacob obeys and kisses Isaac. As Isaac smells the scent of Esau's clothes (which Jacob is wearing), this seems to provide the final confirmation for him. He begins the blessing, associating the smell with the outdoors ('the smell of a field') and divine blessing ('that the Lord has blessed').",
      "Methodist": "Jacob kisses him. Isaac smells Esau's clothes on Jacob, associates the outdoor scent with Esau and divine blessing, and begins the blessing.",
      "Lutheran": "Jacob kisses him. Isaac smells Esau's clothes and is convinced. He begins the blessing, comparing the smell to a field blessed by Yahweh.",
      "Presbyterian": "Jacob kisses Isaac. Smelling Esau's clothes on Jacob confirms the deception for Isaac, who compares the scent to a blessed field and begins the blessing.",
      "Pentecostal": "Jacob kisses Isaac. Isaac smells Esau's clothes, is convinced, and begins the blessing.",
      "Episcopalian/Anglican": "Jacob kisses Isaac. Isaac smells his clothes (Esau's) and begins the blessing, comparing the scent to a field blessed by the Lord.",
      "Orthodox": "Jacob complies. Upon smelling the garments (Esau's clothes worn by Jacob), Isaac seems finally convinced and commences the blessing, likening the scent to a divinely blessed field.",
      "Other": "So he went to him and kissed him. When Isaac caught the smell of his clothes, he blessed him and said, \"Ah, the smell of my son is like the smell of a field that the Lord has blessed.",
      "Prefer not to say": "So he went to him and kissed him. When Isaac caught the smell of his clothes, he blessed him and said, \"Ah, the smell of my son is like the smell of a field that the Lord has blessed."
  },
  "28": {
      "General": "May God give you heaven's dew and earth's richness— an abundance of grain and new wine.",
      "Non-Denominational": "May God give you heaven's dew and earth's richness— an abundance of grain and new wine.",
      "Baptist": "The blessing invokes divine provision of agricultural abundance: dew (essential moisture), fertile earth, and plentiful grain and wine.",
      "Catholic": "The blessing begins by invoking God's provision of fertility and abundance: dew from heaven (vital for agriculture in Canaan), the richness of the earth, and abundant harvests of grain and new wine.",
      "Methodist": "The blessing invokes agricultural prosperity: dew, fertile earth, grain, and wine.",
      "Lutheran": "The blessing invokes fertility and prosperity: dew from heaven, richness of the earth, abundant grain and wine.",
      "Presbyterian": "The blessing invokes material prosperity and agricultural abundance (dew, richness of earth, grain, wine).",
      "Pentecostal": "Blessing asks for agricultural abundance (dew, richness, grain, wine).",
      "Episcopalian/Anglican": "The blessing invokes prosperity and fertility: dew from heaven, richness of the earth, abundance of grain and new wine.",
      "Orthodox": "The blessing commences with invocations for agricultural prosperity and abundance, requesting dew, fertile land, and plentiful harvests of grain and wine.",
      "Other": "May God give you heaven's dew and earth's richness— an abundance of grain and new wine.",
      "Prefer not to say": "May God give you heaven's dew and earth's richness— an abundance of grain and new wine."
  },
  "29": {
      "General": "May nations serve you and peoples bow down to you. Be lord over your brothers, and may the sons of your mother bow down to you. May those who curse you be cursed and those who bless you be blessed.\"",
      "Non-Denominational": "May nations serve you and peoples bow down to you. Be lord over your brothers, and may the sons of your mother bow down to you. May those who curse you be cursed and those who bless you be blessed.\"",
      "Baptist": "The blessing confers dominion over nations and peoples, specific lordship over his brothers (fulfilling Gen 25:23), and invokes the Abrahamic formula of blessing for blessers and cursing for cursers.",
      "Catholic": "The blessing bestows political dominance ('May nations serve you and peoples bow down to you') and preeminence within the family ('Be lord over your brothers, and may the sons of your mother bow down to you'), directly fulfilling the prophecy given to Rebekah (Gen 25:23). It concludes by applying the protective formula of the Abrahamic covenant: curses on those who curse him, and blessings on those who bless him.",
      "Methodist": "The blessing grants dominion over nations and lordship over his brothers (fulfilling prophecy), concluding with the Abrahamic covenant formula of blessing/cursing.",
      "Lutheran": "The blessing confers dominion over nations and lordship over his relatives ('brothers', 'mother's sons'), fulfilling Gen 25:23. It includes the covenant formula: cursers cursed, blessers blessed.",
      "Presbyterian": "The blessing confers dominion over nations and preeminence over his brothers (fulfilling Gen 25:23), and applies the covenant formula of reciprocal blessing and cursing.",
      "Pentecostal": "Blessing grants dominion over nations, lordship over brothers, and the Abrahamic blessing/cursing formula.",
      "Episcopalian/Anglican": "The blessing confers dominion over peoples and nations, authority over his brothers (fulfilling Gen 25:23), and invokes the Abrahamic covenantal formula (cursing cursers, blessing blessers).",
      "Orthodox": "The blessing confers supremacy over other nations and familial preeminence (lordship over brothers, fulfilling Gen 25:23). It concludes by invoking the Abrahamic covenant's protective blessing/curse formula.",
      "Other": "May nations serve you and peoples bow down to you. Be lord over your brothers, and may the sons of your mother bow down to you. May those who curse you be cursed and those who bless you be blessed.\"",
      "Prefer not to say": "May nations serve you and peoples bow down to you. Be lord over your brothers, and may the sons of your mother bow down to you. May those who curse you be cursed and those who bless you be blessed.\""
  },
  "30": {
      "General": "After Isaac finished blessing him and Jacob had scarcely left his father's presence, his brother Esau came in from hunting.",
      "Non-Denominational": "After Isaac finished blessing him and Jacob had scarcely left his father's presence, his brother Esau came in from hunting.",
      "Baptist": "Immediately after Isaac finishes the blessing and Jacob leaves, Esau returns from his successful hunt.",
      "Catholic": "The timing is dramatic: Isaac has just finished pronouncing the irrevocable blessing, and Jacob has barely left the room, when Esau returns from his hunt.",
      "Methodist": "Immediately after Jacob receives the blessing and leaves, Esau returns from hunting.",
      "Lutheran": "Just as Isaac finishes blessing Jacob and Jacob leaves, Esau returns from hunting.",
      "Presbyterian": "Immediately after Isaac finishes the blessing and Jacob departs, Esau returns from his hunt.",
      "Pentecostal": "Just as Jacob leaves after the blessing, Esau returns from hunting.",
      "Episcopalian/Anglican": "Immediately after Isaac finished blessing Jacob and Jacob left, Esau returned from hunting.",
      "Orthodox": "With dramatic timing, immediately following the conclusion of the blessing and Jacob's departure, Esau arrives back from his hunting expedition.",
      "Other": "After Isaac finished blessing him and Jacob had scarcely left his father's presence, his brother Esau came in from hunting.",
      "Prefer not to say": "After Isaac finished blessing him and Jacob had scarcely left his father's presence, his brother Esau came in from hunting."
  },
  "31": {
      "General": "He too prepared some tasty food and brought it to his father. Then he said to him, \"My father, please sit up and eat some of my game, so that you may give me your blessing.\"",
      "Non-Denominational": "He too prepared some tasty food and brought it to his father. Then he said to him, \"My father, please sit up and eat some of my game, so that you may give me your blessing.\"",
      "Baptist": "Esau prepares the game as requested and brings it to Isaac, expecting to receive the blessing after Isaac eats.",
      "Catholic": "Esau prepares his own savory dish from the game he hunted and brings it to Isaac, inviting him to eat so that Isaac can give him the blessing, unaware it has already been given to Jacob.",
      "Methodist": "Esau prepares the game and brings it to Isaac, expecting the blessing as promised.",
      "Lutheran": "Esau prepares his tasty food and brings it to Isaac, asking him to eat and give the blessing.",
      "Presbyterian": "Esau prepares the game and brings it to Isaac, anticipating the promised blessing.",
      "Pentecostal": "Esau prepares the food and asks Isaac to eat and bless him.",
      "Episcopalian/Anglican": "Esau prepares his savory food and brings it to Isaac, asking him to eat so he can receive the blessing.",
      "Orthodox": "Esau prepares the requested meal from his hunt and presents it to Isaac, anticipating the bestowal of the blessing following the meal.",
      "Other": "He too prepared some tasty food and brought it to his father. Then he said to him, \"My father, please sit up and eat some of my game, so that you may give me your blessing.\"",
      "Prefer not to say": "He too prepared some tasty food and brought it to his father. Then he said to him, \"My father, please sit up and eat some of my game, so that you may give me your blessing.\""
  },
  "32": {
      "General": "His father Isaac asked him, \"Who are you?\" \"I am your son,\" he answered, \"your firstborn, Esau.\"",
      "Non-Denominational": "His father Isaac asked him, \"Who are you?\" \"I am your son,\" he answered, \"your firstborn, Esau.\"",
      "Baptist": "Isaac, confused by another son arriving with food, again asks for identification. Esau identifies himself correctly as the firstborn.",
      "Catholic": "Isaac, confused by the arrival of another claimant with food, asks again, 'Who are you?' Esau truthfully identifies himself: 'I am your son, your firstborn, Esau.'",
      "Methodist": "Isaac, confused, asks who it is. Esau identifies himself truthfully.",
      "Lutheran": "Isaac asks, 'Who are you?' Esau identifies himself: 'I am your son, your firstborn, Esau.'",
      "Presbyterian": "Confused, Isaac asks for identification. Esau truthfully identifies himself as the firstborn.",
      "Pentecostal": "Isaac asks who he is. Esau identifies himself.",
      "Episcopalian/Anglican": "Isaac asks for identification. Esau identifies himself truthfully as the firstborn son, Esau.",
      "Orthodox": "Isaac, perplexed by this second arrival, inquires about the identity. Esau truthfully identifies himself as the firstborn son.",
      "Other": "His father Isaac asked him, \"Who are you?\" \"I am your son,\" he answered, \"your firstborn, Esau.\"",
      "Prefer not to say": "His father Isaac asked him, \"Who are you?\" \"I am your son,\" he answered, \"your firstborn, Esau.\""
  },
  "33": {
      "General": "Isaac trembled violently and said, \"Who was it, then, that hunted game and brought it to me? I ate it just before you came and I blessed him—and indeed he will be blessed!\"",
      "Non-Denominational": "Isaac trembled violently and said, \"Who was it, then, that hunted game and brought it to me? I ate it just before you came and I blessed him—and indeed he will be blessed!\"",
      "Baptist": "Realizing the deception, Isaac trembles violently with shock and distress. He reveals someone else brought food, whom he ate from and blessed just moments before Esau arrived. Crucially, he affirms the blessing given is irrevocable ('indeed he will be blessed!').",
      "Catholic": "The realization of the deception hits Isaac with full force, causing him to tremble violently. He asks Esau in distress, 'Who was it then that hunted game and brought it to me? I ate it all before you came, and I have blessed him!' Significantly, Isaac recognizes the binding, irrevocable nature of the spoken patriarchal blessing, adding, 'Yes, and he shall be blessed!'",
      "Methodist": "Isaac realizes the deception and trembles violently. He reveals someone else came, whom he ate from and blessed, affirming the blessing is irrevocable ('indeed he will be blessed!').",
      "Lutheran": "Isaac trembles violently upon realizing the deception. He asks who brought him food earlier, stating he ate and blessed that person, and crucially affirms, 'and he *shall* be blessed!' (The blessing is irrevocable).",
      "Presbyterian": "Isaac realizes the deception and trembles violently. He reveals someone else brought food and received the blessing, affirming its irrevocability ('indeed he will be blessed!').",
      "Pentecostal": "Isaac trembles violently, realizes what happened, reveals he blessed someone else, and affirms the blessing stands.",
      "Episcopalian/Anglican": "Isaac trembles violently with the realization of the deception. He reveals that someone else brought food, whom he ate from and blessed, affirming the blessing's irrevocability ('and indeed he will be blessed!').",
      "Orthodox": "The revelation of the deception causes Isaac to tremble violently. He explains to Esau that another person provided the meal and received the blessing just prior, and crucially affirms the irrevocability of the blessing bestowed ('indeed he will be blessed!').",
      "Other": "Isaac trembled violently and said, \"Who was it, then, that hunted game and brought it to me? I ate it just before you came and I blessed him—and indeed he will be blessed!\"",
      "Prefer not to say": "Isaac trembled violently and said, \"Who was it, then, that hunted game and brought it to me? I ate it just before you came and I blessed him—and indeed he will be blessed!\""
  },
  "34": {
      "General": "When Esau heard his father's words, he burst out with a loud and bitter cry and said to his father, \"Bless me—me too, my father!\"",
      "Non-Denominational": "When Esau heard his father's words, he burst out with a loud and bitter cry and said to his father, \"Bless me—me too, my father!\"",
      "Baptist": "Esau reacts with extreme anguish (a loud, bitter cry) upon hearing the blessing has been stolen and pleads desperately for a blessing for himself as well.",
      "Catholic": "Upon hearing Isaac's words and realizing the blessing is gone, Esau reacts with intense anguish, crying out 'loudly and bitterly'. He desperately pleads with his father, 'Bless me, even me also, O my father!'",
      "Methodist": "Esau reacts with loud and bitter anguish, pleading with Isaac to bless him too.",
      "Lutheran": "Esau cries out loudly and bitterly, pleading with Isaac to bless him too.",
      "Presbyterian": "Esau reacts with loud and bitter anguish, desperately pleading for a blessing for himself.",
      "Pentecostal": "Esau cries loudly and bitterly, begging for a blessing too.",
      "Episcopalian/Anglican": "Esau cries out loudly and bitterly upon hearing this, pleading with Isaac to bless him too.",
      "Orthodox": "Hearing his father's confirmation, Esau reacts with extreme distress, emitting a loud and bitter cry, and desperately implores Isaac for a blessing for himself as well.",
      "Other": "When Esau heard his father's words, he burst out with a loud and bitter cry and said to his father, \"Bless me—me too, my father!\"",
      "Prefer not to say": "When Esau heard his father's words, he burst out with a loud and bitter cry and said to his father, \"Bless me—me too, my father!\""
  },
  "35": {
      "General": "But he said, \"Your brother came deceitfully and took your blessing.\"",
      "Non-Denominational": "But he said, \"Your brother came deceitfully and took your blessing.\"",
      "Baptist": "Isaac explains that Jacob obtained the blessing through deceit.",
      "Catholic": "Isaac explicitly states what happened: 'Your brother came deceitfully (with cunning/trickery) and has taken away your blessing.'",
      "Methodist": "Isaac explains that Jacob used deceit to take Esau's blessing.",
      "Lutheran": "Isaac explains, 'Your brother came deceitfully and took your blessing.'",
      "Presbyterian": "Isaac confirms Jacob obtained the blessing through deceit.",
      "Pentecostal": "Isaac says Jacob came deceitfully and took the blessing.",
      "Episcopalian/Anglican": "Isaac explains that Jacob came deceitfully and took Esau's blessing.",
      "Orthodox": "Isaac clarifies that Jacob employed deceit to acquire the blessing intended for Esau.",
      "Other": "But he said, \"Your brother came deceitfully and took your blessing.\"",
      "Prefer not to say": "But he said, \"Your brother came deceitfully and took your blessing.\""
  },
  "36": {
      "General": "Esau said, \"Isn't he rightly named Jacob? This is the second time he has taken advantage of me: He took my birthright, and now he's taken my blessing!\" Then he asked, \"Haven't you reserved any blessing for me?\"",
      "Non-Denominational": "Esau said, \"Isn't he rightly named Jacob? This is the second time he has taken advantage of me: He took my birthright, and now he's taken my blessing!\" Then he asked, \"Haven't you reserved any blessing for me?\"",
      "Baptist": "Esau bitterly connects Jacob's name (supplanter) to his actions, recalling both the loss of his birthright and now the blessing. He desperately asks if Isaac has any blessing left for him.",
      "Catholic": "Esau bitterly remarks on the appropriateness of Jacob's name ('Isn't he rightly named Jacob?' i.e., Supplanter), linking it to his actions. He recounts Jacob's deceptions: first taking his birthright (Gen 25), and now stealing his blessing. He desperately asks Isaac if there isn't *any* blessing remaining for him.",
      "Methodist": "Esau connects Jacob's name ('Supplanter') to his actions, recalling the loss of both birthright and blessing, and desperately asks if any blessing remains.",
      "Lutheran": "Esau bitterly connects Jacob's name (Supplanter) to his actions, recalling how Jacob took both his birthright and now his blessing. He desperately asks if Isaac has reserved any blessing for him.",
      "Presbyterian": "Esau bitterly notes the appropriateness of Jacob's name ('supplanter'), recalling the previous loss of the birthright and now the blessing. He pleads for any remaining blessing.",
      "Pentecostal": "Esau connects Jacob's name (Supplanter) to taking his birthright and now his blessing. He asks if any blessing is left.",
      "Episcopalian/Anglican": "Esau bitterly links Jacob's name ('Supplanter') to his actions, recalling the loss of the birthright and now the blessing. He asks if Isaac has reserved any blessing for him.",
      "Orthodox": "Esau bitterly connects Jacob's name (implying 'supplanter') with his actions, citing the previous loss of the birthright and the current theft of the blessing. He desperately inquires if any blessing has been reserved for him.",
      "Other": "Esau said, \"Isn't he rightly named Jacob? This is the second time he has taken advantage of me: He took my birthright, and now he's taken my blessing!\" Then he asked, \"Haven't you reserved any blessing for me?\"",
      "Prefer not to say": "Esau said, \"Isn't he rightly named Jacob? This is the second time he has taken advantage of me: He took my birthright, and now he's taken my blessing!\" Then he asked, \"Haven't you reserved any blessing for me?\""
  },
  "37": {
      "General": "Isaac answered Esau, \"I have made him lord over you and have made all his relatives his servants, and I have sustained him with grain and new wine. So what can I possibly do for you, my son?\"",
      "Non-Denominational": "Isaac answered Esau, \"I have made him lord over you and have made all his relatives his servants, and I have sustained him with grain and new wine. So what can I possibly do for you, my son?\"",
      "Baptist": "Isaac explains the primary elements of the blessing already given to Jacob (lordship over relatives, provision of abundance) cannot be undone or replicated, leaving nothing comparable for Esau.",
      "Catholic": "Isaac explains the content and finality of the blessing already given to Jacob: he has irrevocably made Jacob lord over Esau and his relatives ('brothers'), designated them as Jacob's servants, and endowed Jacob with agricultural abundance ('grain and new wine'). Given this comprehensive blessing, Isaac sadly asks, 'What then can I do for you, my son?' implying the primary blessing is exhausted.",
      "Methodist": "Isaac reiterates the key parts of the blessing given to Jacob (lordship, provision) which are now irrevocable, asking rhetorically what is left for Esau.",
      "Lutheran": "Isaac explains he has already made Jacob lord over Esau and his relatives, sustained him with grain and wine (the core blessing). 'What then can I do for you, my son?'",
      "Presbyterian": "Isaac explains the core elements of the blessing given to Jacob (lordship over Esau, abundance) are irrevocable, leaving little else to bestow.",
      "Pentecostal": "Isaac explains he made Jacob lord over Esau and gave him abundance, so what is left?",
      "Episcopalian/Anglican": "Isaac explains the irrevocable nature of the blessing: he has made Jacob lord over Esau and his relatives and sustained him with abundance. He asks what, therefore, he can do for Esau.",
      "Orthodox": "Isaac clarifies the irrevocable terms of the blessing already bestowed upon Jacob, including lordship over Esau and provision of sustenance, rhetorically asking what remains for Esau.",
      "Other": "Isaac answered Esau, \"I have made him lord over you and have made all his relatives his servants, and I have sustained him with grain and new wine. So what can I possibly do for you, my son?\"",
      "Prefer not to say": "Isaac answered Esau, \"I have made him lord over you and have made all his relatives his servants, and I have sustained him with grain and new wine. So what can I possibly do for you, my son?\""
  },
  "38": {
      "General": "Esau said to his father, \"Do you have only one blessing, my father? Bless me too, my father!\" Then Esau wept aloud.",
      "Non-Denominational": "Esau said to his father, \"Do you have only one blessing, my father? Bless me too, my father!\" Then Esau wept aloud.",
      "Baptist": "Esau desperately pleads again, asking if Isaac possesses only one blessing, and weeps loudly in his anguish and frustration.",
      "Catholic": "Esau persists, desperately asking if Isaac possesses only the single primary blessing ('Have you only one blessing, my father?'). He repeats his plea, 'Bless me, even me also, O my father!' and then breaks down, weeping aloud.",
      "Methodist": "Esau pleads again, asking if Isaac only has one blessing, and weeps aloud in distress.",
      "Lutheran": "Esau persists, 'Have you only one blessing, my father? Bless me, me also!' Then Esau weeps loudly.",
      "Presbyterian": "Esau pleads again, asking if there is only one blessing, and weeps aloud in his grief.",
      "Pentecostal": "Esau asks if there is only one blessing, pleads again, and weeps aloud.",
      "Episcopalian/Anglican": "Esau desperately asks if Isaac has only one blessing and pleads again to be blessed, weeping aloud.",
      "Orthodox": "Esau persistently pleads, questioning if Isaac possesses only a single blessing, and repeats his request amidst loud weeping.",
      "Other": "Esau said to his father, \"Do you have only one blessing, my father? Bless me too, my father!\" Then Esau wept aloud.",
      "Prefer not to say": "Esau said to his father, \"Do you have only one blessing, my father? Bless me too, my father!\" Then Esau wept aloud."
  },
  "39": {
      "General": "His father Isaac answered him, \"Your dwelling will be away from the earth's richness, away from the dew of heaven above.",
      "Non-Denominational": "His father Isaac answered him, \"Your dwelling will be away from the earth's richness, away from the dew of heaven above.",
      "Baptist": "Moved by Esau's plea, Isaac gives a secondary, contrasting blessing (or prophecy): Esau's dwelling will lack the agricultural richness and dew given to Jacob.",
      "Catholic": "Isaac, moved by Esau's weeping, finally gives him a blessing, but it stands in stark contrast to Jacob's. It prophesies Esau's dwelling place will be 'away from' (or some translations suggest 'of', implying participation but not the fullness) the fertile richness of the earth and the life-giving dew of heaven.",
      "Methodist": "Isaac gives Esau a blessing, but it contrasts sharply with Jacob's: predicting a dwelling away from earth's richness and heavenly dew.",
      "Lutheran": "Isaac gives Esau a secondary blessing/prophecy: his dwelling will be away from the richness of the earth and the dew of heaven.",
      "Presbyterian": "Isaac bestows a secondary blessing, contrasting with Jacob's: Esau's dwelling will be away from the earth's fertility and dew.",
      "Pentecostal": "Isaac gives Esau a blessing: dwelling away from earth's richness and dew.",
      "Episcopalian/Anglican": "Isaac gives Esau a blessing, contrasting with Jacob's: his dwelling will be away from the earth's richness and the dew of heaven.",
      "Orthodox": "Isaac confers a blessing upon Esau, but its terms contrast sharply with Jacob's, predicting a dwelling place removed from the fertile richness of the earth and the dew from heaven.",
      "Other": "His father Isaac answered him, \"Your dwelling will be away from the earth's richness, away from the dew of heaven above.",
      "Prefer not to say": "His father Isaac answered him, \"Your dwelling will be away from the earth's richness, away from the dew of heaven above."
  },
  "40": {
      "General": "You will live by the sword and you will serve your brother. But when you grow restless, you will throw his yoke from off your neck.\"",
      "Non-Denominational": "You will live by the sword and you will serve your brother. But when you grow restless, you will throw his yoke from off your neck.\"",
      "Baptist": "Esau's future involves violence ('live by the sword') and servitude to Jacob ('serve your brother'), but with a prediction of eventual rebellion ('throw his yoke from off your neck').",
      "Catholic": "The prophecy continues: Esau's descendants (Edomites) will live by violence and warfare ('live by the sword') and will be subservient to Jacob's descendants ('serve your brother'). However, it includes a prediction of future rebellion: when Esau/Edom 'grows restless' (or 'breaks loose'), he will successfully throw off Jacob/Israel's dominion ('yoke').",
      "Methodist": "Predicts a life of violence ('by the sword'), servitude to Jacob, but also eventual, temporary rebellion against that servitude.",
      "Lutheran": "Esau will live by the sword and serve his brother (Jacob), but eventually, he will grow restless and break Jacob's yoke from his neck.",
      "Presbyterian": "Predicts Esau will live by violence ('sword') and serve Jacob, but will eventually rebel and break free from his dominion ('yoke').",
      "Pentecostal": "Blessing predicts living by the sword, serving Jacob, but eventually rebelling.",
      "Episcopalian/Anglican": "He will live by the sword and serve his brother, but predicts a time when he will grow restless and break free from his brother's dominion ('yoke').",
      "Orthodox": "Predicts a life characterized by violence ('live by the sword') and subordination to Jacob, yet also foretells a future time of rebellion and liberation from this subservience.",
      "Other": "You will live by the sword and you will serve your brother. But when you grow restless, you will throw his yoke from off your neck.\"",
      "Prefer not to say": "You will live by the sword and you will serve your brother. But when you grow restless, you will throw his yoke from off your neck.\""
  },
  "41": {
      "General": "Esau held a grudge against Jacob because of the blessing his father had given him. He said to himself, \"The days of mourning for my father are near; then I will kill my brother Jacob.\"",
      "Non-Denominational": "Esau held a grudge against Jacob because of the blessing his father had given him. He said to himself, \"The days of mourning for my father are near; then I will kill my brother Jacob.\"",
      "Baptist": "Esau harbors deep resentment and hatred toward Jacob over the stolen blessing. He resolves to kill Jacob after Isaac's death and the subsequent mourning period.",
      "Catholic": "Esau nurses a deep grudge ('hated') against Jacob specifically because of the stolen blessing. He secretly resolves to murder Jacob, planning to wait until after Isaac dies and the official mourning period is over.",
      "Methodist": "Esau holds a grudge against Jacob for the stolen blessing and plots to kill him after their father's death.",
      "Lutheran": "Esau holds a grudge against Jacob because of the blessing and plots to kill Jacob after Isaac's death.",
      "Presbyterian": "Esau harbors a murderous grudge against Jacob due to the stolen blessing, planning to kill him after Isaac's death.",
      "Pentecostal": "Esau holds a grudge and plots to kill Jacob after Isaac dies.",
      "Episcopalian/Anglican": "Esau holds a grudge against Jacob because of the blessing and plans to kill him after the mourning period for Isaac.",
      "Orthodox": "Esau develops a deep-seated animosity towards Jacob due to the lost blessing and secretly resolves to kill him following the period of mourning for Isaac.",
      "Other": "Esau held a grudge against Jacob because of the blessing his father had given him. He said to himself, \"The days of mourning for my father are near; then I will kill my brother Jacob.\"",
      "Prefer not to say": "Esau held a grudge against Jacob because of the blessing his father had given him. He said to himself, \"The days of mourning for my father are near; then I will kill my brother Jacob.\""
  },
  "42": {
      "General": "When Rebekah was told what her older son Esau had said, she sent for her younger son Jacob and said to him, \"Your brother Esau is planning to avenge himself by killing you.",
      "Non-Denominational": "When Rebekah was told what her older son Esau had said, she sent for her younger son Jacob and said to him, \"Your brother Esau is planning to avenge himself by killing you.",
      "Baptist": "Rebekah learns of Esau's murderous plan (how is unspecified) and warns Jacob that Esau intends to kill him.",
      "Catholic": "Somehow, Rebekah learns of Esau's murderous intent ('what her older son Esau had said'). She summons Jacob and warns him directly that Esau is consoling himself with the plan to kill Jacob.",
      "Methodist": "Rebekah learns of Esau's plan to kill Jacob and warns Jacob.",
      "Lutheran": "Rebekah finds out about Esau's plan and warns Jacob that Esau intends to kill him.",
      "Presbyterian": "Rebekah learns of Esau's murderous plan and warns Jacob.",
      "Pentecostal": "Rebekah learns of Esau's plan and warns Jacob.",
      "Episcopalian/Anglican": "Rebekah is informed of Esau's murderous intentions and warns Jacob.",
      "Orthodox": "Rebekah becomes aware of Esau's vengeful plan and warns Jacob of the impending danger to his life.",
      "Other": "When Rebekah was told what her older son Esau had said, she sent for her younger son Jacob and said to him, \"Your brother Esau is planning to avenge himself by killing you.",
      "Prefer not to say": "When Rebekah was told what her older son Esau had said, she sent for her younger son Jacob and said to him, \"Your brother Esau is planning to avenge himself by killing you."
  },
  "43": {
      "General": "Now then, my son, do what I say: Flee at once to my brother Laban in Harran.",
      "Non-Denominational": "Now then, my son, do what I say: Flee at once to my brother Laban in Harran.",
      "Baptist": "Acting decisively to protect Jacob, Rebekah instructs him to flee immediately to her brother Laban in Harran (their ancestral homeland).",
      "Catholic": "Rebekah again takes charge, instructing Jacob ('Now then, my son, obey my voice') to flee immediately for safety to her brother Laban's household in Harran.",
      "Methodist": "Rebekah instructs Jacob to flee immediately to her brother Laban in Harran for safety.",
      "Lutheran": "Rebekah commands Jacob to flee at once to her brother Laban in Haran.",
      "Presbyterian": "Rebekah instructs Jacob to flee immediately to her brother Laban in Harran.",
      "Pentecostal": "Rebekah tells Jacob to flee to her brother Laban in Haran.",
      "Episcopalian/Anglican": "Rebekah commands Jacob to flee at once to her brother Laban in Haran.",
      "Orthodox": "Rebekah directs Jacob to flee immediately to her brother Laban in Harran for refuge.",
      "Other": "Now then, my son, do what I say: Flee at once to my brother Laban in Harran.",
      "Prefer not to say": "Now then, my son, do what I say: Flee at once to my brother Laban in Harran."
  },
  "44": {
      "General": "Stay with him for a while until your brother's fury subsides.",
      "Non-Denominational": "Stay with him for a while until your brother's fury subsides.",
      "Baptist": "She advises him to stay there temporarily until Esau's anger cools down.",
      "Catholic": "She advises him to stay with Laban for a limited time ('a while') until Esau's intense anger ('fury') diminishes.",
      "Methodist": "She advises him to stay there only until Esau's anger cools.",
      "Lutheran": "He should stay there for a while until Esau's anger subsides.",
      "Presbyterian": "Advises Jacob to stay with Laban temporarily until Esau's anger passes.",
      "Pentecostal": "She tells him to stay until Esau cools down.",
      "Episcopalian/Anglican": "She instructs him to stay there for a time until Esau's anger subsides.",
      "Orthodox": "She instructs him to remain with Laban for a period until Esau's rage abates.",
      "Other": "Stay with him for a while until your brother's fury subsides.",
      "Prefer not to say": "Stay with him for a while until your brother's fury subsides."
  },
  "45": {
      "General": "When your brother is no longer angry with you and forgets what you did to him, I'll send word for you to come back from there. Why should I lose both of you in one day?\"",
      "Non-Denominational": "When your brother is no longer angry with you and forgets what you did to him, I'll send word for you to come back from there. Why should I lose both of you in one day?\"",
      "Baptist": "Rebekah promises to send for Jacob once Esau is no longer angry and has forgotten the offense. She expresses her fear of losing both sons in one day (one to murder, the other likely to banishment or blood vengeance).",
      "Catholic": "Rebekah assures Jacob she will send word for him to return once Esau's anger has passed and he has forgotten the incident. She voices her maternal fear: 'Why should I be bereaved of you both in one day?' (fearing Esau might kill Jacob, and then Esau might be killed in vengeance or exiled).",
      "Methodist": "Rebekah promises to recall Jacob when Esau's anger fades, expressing fear of losing both sons in one day (through murder and potential retribution/exile).",
      "Lutheran": "When Esau's anger fades and he forgets, Rebekah will send for Jacob. She fears losing both sons in one day (murder and consequence).",
      "Presbyterian": "Promises to send for Jacob when Esau's anger subsides, expressing fear of losing both sons in one day (murder and its consequences).",
      "Pentecostal": "She promises to send for him when Esau forgets, fearing losing both sons.",
      "Episcopalian/Anglican": "She promises to send for Jacob when Esau's anger passes, expressing her fear of losing both sons in one day.",
      "Orthodox": "Rebekah assures Jacob she will notify him when Esau's anger has cooled and the incident is forgotten, articulating her fear of losing both sons simultaneously (one through murder, the other through consequence).",
      "Other": "When your brother is no longer angry with you and forgets what you did to him, I'll send word for you to come back from there. Why should I lose both of you in one day?\"",
      "Prefer not to say": "When your brother is no longer angry with you and forgets what you did to him, I'll send word for you to come back from there. Why should I lose both of you in one day?\""
  },
  "46": {
      "General": "Then Rebekah said to Isaac, \"I'm disgusted with living because of these Hittite women. If Jacob takes a wife from among the women of this land, from Hittite women like these, my life will not be worth living.\"",
      "Non-Denominational": "Then Rebekah said to Isaac, \"I'm disgusted with living because of these Hittite women. If Jacob takes a wife from among the women of this land, from Hittite women like these, my life will not be worth living.\"",
      "Baptist": "Shifting tactics to persuade Isaac, Rebekah expresses her deep distress over Esau's Hittite wives and states her life would be unbearable if Jacob also marries a local Canaanite woman.",
      "Catholic": "Rebekah now presents a different reason (perhaps the more palatable one for Isaac) for sending Jacob away. She expresses her profound displeasure and weariness ('I am weary of my life') because of Esau's Hittite wives. She tells Isaac that if Jacob also marries a local Hittite woman, her life would be worthless. This cleverly frames Jacob's departure as a mission to find a suitable wife from their own kin, aligning with Isaac's likely preferences (cf. Gen 24).",
      "Methodist": "Rebekah complains to Isaac about Esau's Hittite wives, framing Jacob's necessary departure as a mission to prevent him from also marrying a local woman, which she claims would make her life unbearable.",
      "Lutheran": "Rebekah complains to Isaac about Esau's Hittite wives, saying she is weary of life because of them. She argues that if Jacob also marries a Hittite, her life won't be worth living (providing Isaac a reason to send Jacob away).",
      "Presbyterian": "Rebekah expresses her frustration with Esau's Hittite wives to Isaac, framing Jacob's departure as necessary to prevent him also marrying a local woman, which would make her life unbearable.",
      "Pentecostal": "Rebekah complains to Isaac about Esau's wives, saying life won't be worth living if Jacob marries a Hittite too.",
      "Episcopalian/Anglican": "Rebekah expresses her disgust with Esau's Hittite wives to Isaac, stating that if Jacob were also to marry a local woman like them, her life would not be worth living.",
      "Orthodox": "Rebekah expresses her deep aversion to Esau's Hittite wives to Isaac, stating that Jacob marrying a similar woman would render her own life meaningless, thus providing a rationale for sending Jacob away to find a wife elsewhere.",
      "Other": "Then Rebekah said to Isaac, \"I'm disgusted with living because of these Hittite women. If Jacob takes a wife from among the women of this land, from Hittite women like these, my life will not be worth living.\"",
      "Prefer not to say": "Then Rebekah said to Isaac, \"I'm disgusted with living because of these Hittite women. If Jacob takes a wife from among the women of this land, from Hittite women like these, my life will not be worth living.\""
    }
  }
} 