{
  "_comment": "Interpretations for Genesis Chapter 28",
  "book": "Genesis",
  "chapter": "28",
  "verses": {
    "1": {
      "General": "So Isaac called for Jacob and blessed him. Then he commanded him: \"Do not marry a Canaanite woman.",
      "Non-Denominational": "So Isaac called for Jacob and blessed him. Then he commanded him: \"Do not marry a Canaanite woman.",
      "Baptist": "Acting on Rebekah's concern (and perhaps his own realization), Isaac formally calls Jacob, gives him a (likely reaffirming) blessing, and explicitly commands him not to marry a Canaanite woman.",
      "Catholic": "Isaac formally summons Jacob, blesses him (this blessing likely confirms/supplements the one obtained by deception), and gives him a direct command: not to take a wife from among the Canaanite women, reinforcing the family's endogamous practice aimed at preserving the covenant lineage.",
      "Methodist": "Isaac formally blesses Jacob and commands him not to marry a Canaanite woman, reinforcing the family standard.",
      "Lutheran": "Isaac calls Jacob, blesses him, and commands him not to marry a Canaanite woman.",
      "Presbyterian": "Isaac summons Jacob, blesses him formally, and commands him not to marry a Canaanite woman, upholding the family's practice.",
      "Pentecostal": "Isaac blesses Jacob and commands him not to marry a Canaanite.",
      "Episcopalian/Anglican": "Isaac summons Jacob, blesses him, and explicitly commands him not to marry a Canaanite woman.",
      "Orthodox": "Isaac summons Jacob, confers a blessing upon him, and issues an explicit prohibition against marrying a Canaanite woman, upholding the family's tradition.",
      "Other": "So Isaac called for Jacob and blessed him. Then he commanded him: \"Do not marry a Canaanite woman.",
      "Prefer not to say": "So Isaac called for Jacob and blessed him. Then he commanded him: \"Do not marry a Canaanite woman."
    },
    "2": {
      "General": "Go at once to Paddan Aram, to the house of your mother's father Bethuel. Take a wife for yourself there, from among the daughters of Laban your mother's brother.",
      "Non-Denominational": "Go at once to Paddan Aram, to the house of your mother's father Bethuel. Take a wife for yourself there, from among the daughters of Laban your mother's brother.",
      "Baptist": "Isaac instructs Jacob to travel to Paddan Aram (Mesopotamia), to the household of his maternal grandfather Bethuel, specifically to find a wife among the daughters of Laban (his uncle).",
      "Catholic": "Isaac directs Jacob to go immediately to Paddan Aram (the region in Mesopotamia where Rebekah's family lived), specifically to the household of Bethuel (his maternal grandfather), and to choose a wife from the daughters of Laban (his maternal uncle). This mirrors the instructions given for finding Isaac's own wife (Gen 24).",
      "Methodist": "Isaac instructs Jacob to go to Paddan Aram, to Bethuel's house, and find a wife among the daughters of his uncle Laban, following the family precedent.",
      "Lutheran": "Isaac instructs Jacob to go to Paddan Aram, to Bethuel's house, and marry one of Laban's daughters.",
      "Presbyterian": "Instructs Jacob to travel to Paddan Aram to find a wife from the family of Bethuel, specifically from the daughters of Laban.",
      "Pentecostal": "Isaac tells Jacob to go to Paddan Aram and marry one of Laban's daughters.",
      "Episcopalian/Anglican": "Isaac instructs Jacob to go to Paddan Aram, to the house of Bethuel, and take a wife from the daughters of Laban, his mother's brother.",
      "Orthodox": "Isaac directs Jacob to journey to Paddan Aram, to the household of his maternal grandfather Bethuel, and select a wife from among the daughters of his uncle Laban.",
      "Other": "Go at once to Paddan Aram, to the house of your mother's father Bethuel. Take a wife for yourself there, from among the daughters of Laban your mother's brother.",
      "Prefer not to say": "Go at once to Paddan Aram, to the house of your mother's father Bethuel. Take a wife for yourself there, from among the daughters of Laban your mother's brother."
    },
    "3": {
      "General": "May God Almighty bless you and make you fruitful and increase your numbers until you become a community of peoples.",
      "Non-Denominational": "May God Almighty bless you and make you fruitful and increase your numbers until you become a community of peoples.",
      "Baptist": "Isaac invokes God Almighty (El Shaddai) to bless Jacob with fertility and multiplication, echoing covenant promises, leading to a multitude ('community' or 'assembly') of peoples.",
      "Catholic": "Isaac pronounces a blessing invoking God Almighty (El Shaddai, a name associated with fertility and covenant promises, cf. Gen 17:1). He asks God to make Jacob fruitful, multiply him exceedingly, and cause him to become a great 'assembly (or company) of peoples'.",
      "Methodist": "Isaac invokes God Almighty (El Shaddai) to bless Jacob with fruitfulness and multiplication into a community of peoples, echoing covenant themes.",
      "Lutheran": "Isaac invokes God Almighty (El Shaddai) to bless Jacob, make him fruitful and numerous, becoming an assembly of peoples.",
      "Presbyterian": "Invokes God Almighty (El Shaddai) to bless Jacob with fruitfulness and multiplication, becoming a community of peoples.",
      "Pentecostal": "Isaac asks God Almighty to bless Jacob with fruitfulness and many descendants.",
      "Episcopalian/Anglican": "Isaac invokes God Almighty (El Shaddai) to bless Jacob with fruitfulness and multiplication, so that he becomes a community of peoples.",
      "Orthodox": "Isaac invokes God Almighty (El Shaddai) to bestow upon Jacob blessings of fertility and multiplication, resulting in a large assembly of peoples.",
      "Other": "May God Almighty bless you and make you fruitful and increase your numbers until you become a community of peoples.",
      "Prefer not to say": "May God Almighty bless you and make you fruitful and increase your numbers until you become a community of peoples."
    },
    "4": {
      "General": "May he give you and your descendants the blessing given to Abraham, so that you may take possession of the land where you now reside as a foreigner, the land God gave to Abraham.\"",
      "Non-Denominational": "May he give you and your descendants the blessing given to Abraham, so that you may take possession of the land where you now reside as a foreigner, the land God gave to Abraham.\"",
      "Baptist": "He explicitly prays for Jacob to inherit the blessing of Abraham, specifically mentioning the promise of possessing the land of Canaan, which God gave to Abraham.",
      "Catholic": "Isaac explicitly prays that God will bestow upon Jacob and his descendants the specific 'blessing of Abraham'. This includes inheriting the land where he currently resides as an alien ('land of your sojournings'), confirming it as the land God promised to Abraham.",
      "Methodist": "Isaac explicitly asks God to give Jacob the blessing of Abraham, including possession of the land of Canaan.",
      "Lutheran": "Isaac asks God to give Jacob the blessing of Abraham, so he may possess the land of his sojournings, which God gave to Abraham.",
      "Presbyterian": "Prays for Jacob to receive the blessing of Abraham, including the promise of possessing the land of Canaan.",
      "Pentecostal": "Isaac asks God to give Jacob Abraham's blessing, including the land.",
      "Episcopalian/Anglican": "Isaac prays that God will give Jacob and his descendants the blessing of Abraham, enabling them to possess the land of his sojourning, which God gave to Abraham.",
      "Orthodox": "Isaac prays for the bestowal of the Abrahamic blessing upon Jacob and his lineage, specifically including the promise of inheriting the land of Canaan, originally granted to Abraham.",
      "Other": "May he give you and your descendants the blessing given to Abraham, so that you may take possession of the land where you now reside as a foreigner, the land God gave to Abraham.\"",
      "Prefer not to say": "May he give you and your descendants the blessing given to Abraham, so that you may take possession of the land where you now reside as a foreigner, the land God gave to Abraham.\""
    },
    "5": {
      "General": "Then Isaac sent Jacob on his way, and he went to Paddan Aram, to Laban son of Bethuel the Aramean, the brother of Rebekah, who was the mother of Jacob and Esau.",
      "Non-Denominational": "Then Isaac sent Jacob on his way, and he went to Paddan Aram, to Laban son of Bethuel the Aramean, the brother of Rebekah, who was the mother of Jacob and Esau.",
      "Baptist": "Isaac formally sends Jacob off. Jacob departs for Paddan Aram, heading towards Laban, who is identified again by his relationship to Bethuel and Rebekah (Jacob and Esau's mother).",
      "Catholic": "Isaac formally sends Jacob away on his mission. Jacob departs for Paddan Aram, heading to Laban. The text reiterates Laban's lineage (son of Bethuel the Aramean) and his relationship to Rebekah (mother of both Jacob and Esau), reinforcing the family connections.",
      "Methodist": "Isaac sends Jacob away. Jacob departs for Paddan Aram to Laban, whose family connections are reiterated.",
      "Lutheran": "Isaac sends Jacob away. Jacob goes to Paddan Aram, to Laban (son of Bethuel the Aramean, brother of Rebekah).",
      "Presbyterian": "Isaac sends Jacob away to Paddan Aram, to Laban, identified again as Rebekah's brother.",
      "Pentecostal": "Isaac sends Jacob away; Jacob goes to Laban in Paddan Aram.",
      "Episcopalian/Anglican": "Isaac sends Jacob away, and he travels to Paddan Aram, to Laban son of Bethuel the Aramean, Rebekah's brother.",
      "Orthodox": "Isaac formally dispatches Jacob, who then commences his journey to Paddan Aram, specifically to Laban, identified by his lineage and relation to Rebekah.",
      "Other": "Then Isaac sent Jacob on his way, and he went to Paddan Aram, to Laban son of Bethuel the Aramean, the brother of Rebekah, who was the mother of Jacob and Esau.",
      "Prefer not to say": "Then Isaac sent Jacob on his way, and he went to Paddan Aram, to Laban son of Bethuel the Aramean, the brother of Rebekah, who was the mother of Jacob and Esau."
    },
    "6": {
      "General": "Now Esau learned that Isaac had blessed Jacob and had sent him away to Paddan Aram to take a wife from there, and that when he blessed him he commanded him, \"Do not marry a Canaanite woman,\"",
      "Non-Denominational": "Now Esau learned that Isaac had blessed Jacob and had sent him away to Paddan Aram to take a wife from there, and that when he blessed him he commanded him, \"Do not marry a Canaanite woman,\"",
      "Baptist": "Esau becomes aware that Isaac blessed Jacob (the formal blessing, not just the stolen one) and sent him specifically to Paddan Aram to find a wife, commanding him to avoid Canaanite women.",
      "Catholic": "Esau learns about these recent events: that Isaac formally blessed Jacob, sent him to Paddan Aram specifically to find a wife from their kin, and explicitly forbade him from marrying a Canaanite woman.",
      "Methodist": "Esau learns that Isaac blessed Jacob and sent him to Paddan Aram to find a non-Canaanite wife.",
      "Lutheran": "Esau learns that Isaac blessed Jacob and sent him to Paddan Aram to marry from there, forbidding marriage to a Canaanite woman.",
      "Presbyterian": "Esau learns that Isaac blessed Jacob and sent him away to Paddan Aram to marry a relative, forbidding marriage to a Canaanite.",
      "Pentecostal": "Esau learns Isaac blessed Jacob and sent him to Paddan Aram to find a wife, forbidding marriage to a Canaanite.",
      "Episcopalian/Anglican": "Esau learns that Isaac had blessed Jacob and sent him to Paddan Aram to find a wife there, commanding him not to marry a Canaanite woman.",
      "Orthodox": "Esau becomes aware that Isaac conferred a blessing upon Jacob and dispatched him to Paddan Aram to procure a wife from their relatives, explicitly prohibiting marriage with Canaanite women.",
      "Other": "Now Esau learned that Isaac had blessed Jacob and had sent him away to Paddan Aram to take a wife from there, and that when he blessed him he commanded him, \"Do not marry a Canaanite woman,\"",
      "Prefer not to say": "Now Esau learned that Isaac had blessed Jacob and had sent him away to Paddan Aram to take a wife from there, and that when he blessed him he commanded him, \"Do not marry a Canaanite woman,\""
    },
    "7": {
      "General": "and that Jacob had obeyed his father and mother and had gone to Paddan Aram.",
      "Non-Denominational": "and that Jacob had obeyed his father and mother and had gone to Paddan Aram.",
      "Baptist": "Esau also learns that Jacob obeyed Isaac and Rebekah and actually left for Paddan Aram.",
      "Catholic": "Esau also finds out that Jacob had obeyed both his father and mother and had departed for Paddan Aram as instructed.",
      "Methodist": "Esau learns Jacob obeyed his parents and left for Paddan Aram.",
      "Lutheran": "Esau learns Jacob obeyed his parents and went to Paddan Aram.",
      "Presbyterian": "Learns that Jacob obeyed his parents and departed for Paddan Aram.",
      "Pentecostal": "Learns Jacob obeyed and went to Paddan Aram.",
      "Episcopalian/Anglican": "And he learns that Jacob obeyed his parents and went to Paddan Aram.",
      "Orthodox": "Furthermore, Esau learns that Jacob complied with his parents' instructions and departed for Paddan Aram.",
      "Other": "and that Jacob had obeyed his father and mother and had gone to Paddan Aram.",
      "Prefer not to say": "and that Jacob had obeyed his father and mother and had gone to Paddan Aram."
    },
    "8": {
      "General": "Esau then realized how displeasing the Canaanite women were to his father Isaac;",
      "Non-Denominational": "Esau then realized how displeasing the Canaanite women were to his father Isaac;",
      "Baptist": "Seeing Isaac explicitly forbid Jacob from marrying Canaanites and sending him away for a wife, Esau finally realizes the extent to which his own Hittite/Canaanite wives displeased his father.",
      "Catholic": "Witnessing Isaac's actions (blessing Jacob, sending him away specifically to avoid Canaanite wives), Esau finally understands how negatively Isaac viewed marrying Canaanite women (like Esau's own wives).",
      "Methodist": "Observing Isaac's actions towards Jacob, Esau realizes how much his father disapproved of marrying Canaanite women.",
      "Lutheran": "Esau then realizes how much Isaac disapproved of Canaanite women.",
      "Presbyterian": "Esau realizes from Isaac's actions regarding Jacob how much Isaac disapproved of Canaanite wives.",
      "Pentecostal": "Esau realizes Isaac disliked Canaanite women.",
      "Episcopalian/Anglican": "Esau realizes from Isaac's instructions to Jacob how displeasing the Canaanite women were to his father.",
      "Orthodox": "Observing Isaac's directive to Jacob, Esau grasps the depth of his father's disapproval regarding marriage to Canaanite women.",
      "Other": "Esau then realized how displeasing the Canaanite women were to his father Isaac;",
      "Prefer not to say": "Esau then realized how displeasing the Canaanite women were to his father Isaac;"
    },
    "9": {
      "General": "so he went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Ishmael son of Abraham, in addition to the wives he already had.",
      "Non-Denominational": "so he went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Ishmael son of Abraham, in addition to the wives he already had.",
      "Baptist": "In a misguided attempt to please Isaac (or perhaps align himself with another branch of Abraham's family), Esau marries Mahalath, daughter of Ishmael (Abraham's son) and sister of Nebaioth, adding her to his existing wives.",
      "Catholic": "In an attempt (perhaps misguided) to appease his father or align himself with Abrahamic kin outside the direct Canaanite line, Esau goes to his uncle Ishmael (Abraham's other son) and marries Ishmael's daughter Mahalath (sister of Nebaioth), adding her as a third wife alongside his Hittite wives.",
      "Methodist": "Trying to please his father, Esau marries Mahalath, daughter of Ishmael (Abraham's son), adding a relative (but not from Rebekah's line) as a wife.",
      "Lutheran": "So Esau marries Mahalath, daughter of Ishmael (Abraham's son) and sister of Nebaioth, in addition to his Hittite wives (attempting to marry within the extended family, though not the preferred line).",
      "Presbyterian": "In an attempt to gain favor, Esau marries within the extended Abrahamic family, taking Mahalath, daughter of Ishmael, as an additional wife.",
      "Pentecostal": "Esau marries Ishmael's daughter Mahalath, in addition to his other wives.",
      "Episcopalian/Anglican": "Esau goes to Ishmael and marries Mahalath, daughter of Ishmael (Abraham's son) and sister of Nebaioth, in addition to his existing wives.",
      "Orthodox": "Consequently, Esau seeks a wife from within the broader Abrahamic lineage by marrying Mahalath, the daughter of Ishmael (Abraham's son), in addition to his existing Hittite wives.",
      "Other": "so he went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Ishmael son of Abraham, in addition to the wives he already had.",
      "Prefer not to say": "so he went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Ishmael son of Abraham, in addition to the wives he already had."
    },
    "10": {
      "General": "Jacob left Beersheba and set out for Harran.",
      "Non-Denominational": "Jacob left Beersheba and set out for Harran.",
      "Baptist": "The narrative returns to Jacob, recording his departure from Beersheba, heading towards Harran as instructed.",
      "Catholic": "The focus shifts back to Jacob, who begins his journey, leaving Beersheba (in the south of Canaan) and heading northeast towards Harran (in Paddan Aram).",
      "Methodist": "Jacob begins his journey, leaving Beersheba and heading towards Harran.",
      "Lutheran": "Jacob departs from Beersheba on his journey to Haran.",
      "Presbyterian": "Jacob departs from Beersheba, beginning his journey to Harran.",
      "Pentecostal": "Jacob leaves Beersheba for Haran.",
      "Episcopalian/Anglican": "Jacob departs from Beersheba and begins his journey to Haran.",
      "Orthodox": "Jacob commences his journey, departing from Beersheba en route to Harran.",
      "Other": "Jacob left Beersheba and set out for Harran.",
      "Prefer not to say": "Jacob left Beersheba and set out for Harran."
    },
    "11": {
      "General": "When he reached a certain place, he stopped for the night because the sun had set. Taking one of the stones there, he put it under his head and lay down to sleep.",
      "Non-Denominational": "When he reached a certain place, he stopped for the night because the sun had set. Taking one of the stones there, he put it under his head and lay down to sleep.",
      "Baptist": "Traveling alone, Jacob stops for the night at an unspecified location as darkness falls. He uses a stone for a pillow and lies down to sleep outdoors.",
      "Catholic": "As sunset occurs, Jacob reaches an unspecified ('a certain') place and prepares to spend the night there. He takes one of the local stones to use as a pillow and lies down to sleep directly on the ground.",
      "Methodist": "Jacob stops at an unspecified place for the night at sunset, using a stone as a pillow.",
      "Lutheran": "At sunset, Jacob stops at a certain place for the night, using a stone for a pillow.",
      "Presbyterian": "Jacob stops at an unnamed location at sunset, using a stone for a pillow.",
      "Pentecostal": "Jacob stops at a certain place at sunset, uses a stone for a pillow, and sleeps.",
      "Episcopalian/Anglican": "Reaching a certain place at sunset, Jacob prepares to sleep there, using a stone for a pillow.",
      "Orthodox": "Upon reaching an unspecified location at sunset, Jacob prepares to rest for the night, utilizing a stone as a headrest.",
      "Other": "When he reached a certain place, he stopped for the night because the sun had set. Taking one of the stones there, he put it under his head and lay down to sleep.",
      "Prefer not to say": "When he reached a certain place, he stopped for the night because the sun had set. Taking one of the stones there, he put it under his head and lay down to sleep."
    },
    "12": {
      "General": "He had a dream in which he saw a stairway resting on the earth, with its top reaching to heaven, and the angels of God were ascending and descending on it.",
      "Non-Denominational": "He had a dream in which he saw a stairway resting on the earth, with its top reaching to heaven, and the angels of God were ascending and descending on it.",
      "Baptist": "Jacob has a significant dream featuring a stairway (or ladder) connecting earth and heaven. Angels of God are seen moving up and down this connection point.",
      "Catholic": "Jacob experiences a profound dream: he sees a structure ('stairway' or 'ladder', Hebrew: sullam) firmly planted on the earth but reaching all the way to heaven. On this structure, the angels (messengers) of God are continuously ascending and descending, indicating constant traffic and communication between the divine and earthly realms at this specific location.",
      "Methodist": "Jacob dreams of a stairway/ladder connecting earth and heaven, with angels ascending and descending, signifying connection and communication between God and humanity.",
      "Lutheran": "Jacob dreams of a stairway/ladder set on earth reaching heaven, with angels of God ascending and descending on it.",
      "Presbyterian": "Jacob dreams of a stairway/ladder connecting earth and heaven, with angels ascending and descending, symbolizing a link between the divine and human realms.",
      "Pentecostal": "Jacob dreams of a stairway/ladder between earth and heaven, with angels going up and down.",
      "Episcopalian/Anglican": "Jacob dreams of a stairway/ladder reaching from earth to heaven, with God's angels ascending and descending on it.",
      "Orthodox": "Jacob has a dream featuring a stairway/ladder bridging earth and heaven, upon which angels of God are ascending and descending, signifying a nexus of divine-human interaction.",
      "Other": "He had a dream in which he saw a stairway resting on the earth, with its top reaching to heaven, and the angels of God were ascending and descending on it.",
      "Prefer not to say": "He had a dream in which he saw a stairway resting on the earth, with its top reaching to heaven, and the angels of God were ascending and descending on it."
    },
    "13": {
      "General": "There above it stood the Lord, and he said: \"I am the Lord, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you are lying.",
      "Non-Denominational": "There above it stood the Lord, and he said: \"I am the Lord, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you are lying.",
      "Baptist": "God Himself stands above (or beside) the stairway in the dream. He identifies Himself as the covenant God of Abraham and Isaac and directly reaffirms the land promise to Jacob and his descendants, specifically mentioning the ground Jacob is currently on.",
      "Catholic": "The Lord Himself is revealed standing above the stairway (or 'beside him'). God identifies Himself explicitly as Yahweh, the covenant God connected to both Abraham and Isaac. He then directly repeats the core land promise to Jacob: the very ground he is lying on will be given to him and his descendants.",
      "Methodist": "God stands above/beside the stairway, identifies Himself as the covenant God of Abraham and Isaac, and personally reaffirms the land promise to Jacob.",
      "Lutheran": "Yahweh stands above/beside it and identifies Himself as the God of Abraham and Isaac. He promises the land Jacob is lying on to him and his descendants.",
      "Presbyterian": "God reveals Himself standing above the stairway, identifies Himself as the God of Abraham and Isaac, and reaffirms the land promise to Jacob personally.",
      "Pentecostal": "God stands above it, identifies Himself as God of Abraham and Isaac, and promises Jacob the land he's on.",
      "Episcopalian/Anglican": "The Lord stands above/beside it, identifies Himself as the God of Abraham and Isaac, and promises the land Jacob is lying on to him and his descendants.",
      "Orthodox": "God Himself is manifest above the stairway, identifying Himself as Yahweh, the God of Abraham and Isaac. He directly reiterates the land covenant, promising the very ground Jacob occupies to him and his posterity.",
      "Other": "There above it stood the Lord, and he said: \"I am the Lord, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you are lying.",
      "Prefer not to say": "There above it stood the Lord, and he said: \"I am the Lord, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you are lying."
    },
    "14": {
      "General": "Your descendants will be like the dust of the earth, and you will spread out to the west and to the east, to the north and to the south. All peoples on earth will be blessed through you and your offspring.",
      "Non-Denominational": "Your descendants will be like the dust of the earth, and you will spread out to the west and to the east, to the north and to the south. All peoples on earth will be blessed through you and your offspring.",
      "Baptist": "God reiterates the promise of countless descendants (like dust) who will spread out in all directions. He also repeats the promise of universal blessing mediated through Jacob and his offspring.",
      "Catholic": "God repeats the promise of innumerable descendants ('like the dust of the earth') who will expand and spread out in all directions (west, east, north, south), implying widespread territorial possession. He also reaffirms the promise that all families/peoples on earth will find blessing through Jacob and his offspring ('seed').",
      "Methodist": "God repeats the promises of numerous descendants (like dust), expansion in all directions, and universal blessing through Jacob's line.",
      "Lutheran": "God promises descendants like dust, spreading in all directions. Repeats the universal blessing promise through Jacob and his offspring.",
      "Presbyterian": "Reiterates the promises of innumerable descendants (like dust), expansion in all directions, and universal blessing through Jacob and his line.",
      "Pentecostal": "God promises descendants like dust, expansion, and universal blessing through Jacob.",
      "Episcopalian/Anglican": "God promises descendants like the dust of the earth, spreading out in all directions, and repeats the promise that all peoples will be blessed through Jacob and his offspring.",
      "Orthodox": "God reiterates the promise of immense posterity (like dust), geographical expansion in all directions, and the mediation of blessing to all peoples through Jacob and his lineage.",
      "Other": "Your descendants will be like the dust of the earth, and you will spread out to the west and to the east, to the north and to the south. All peoples on earth will be blessed through you and your offspring.",
      "Prefer not to say": "Your descendants will be like the dust of the earth, and you will spread out to the west and to the east, to the north and to the south. All peoples on earth will be blessed through you and your offspring."
    },
    "15": {
      "General": "I am with you and will watch over you wherever you go, and I will bring you back to this land. I will not leave you until I have done what I have promised you.\"",
      "Non-Denominational": "I am with you and will watch over you wherever you go, and I will bring you back to this land. I will not leave you until I have done what I have promised you.\"",
      "Baptist": "God gives Jacob personal assurance: divine presence ('I am with you'), protection ('watch over you wherever you go'), a promise of return to Canaan ('bring you back to this land'), and a guarantee of faithfulness until all promises are fulfilled.",
      "Catholic": "God gives Jacob specific personal assurances relevant to his current situation as a fugitive: promise of divine presence ('I am with you'), constant protection ('will watch over you wherever you go'), guarantee of safe return to Canaan ('will bring you back to this land'), and a steadfast commitment ('I will not leave you until I have done what I have promised you').",
      "Methodist": "God offers personal assurance to Jacob: His presence, protection during the journey, guaranteed return to the land, and unwavering commitment until all promises are fulfilled.",
      "Lutheran": "God gives personal promises to Jacob: divine presence ('I am with you'), protection ('watch over you wherever you go'), return to the land, and steadfast commitment until fulfillment ('I will not leave you until I have done...').",
      "Presbyterian": "God offers personal promises to Jacob: divine presence, protection on his journey, guaranteed return to Canaan, and unwavering commitment until His promises are fulfilled.",
      "Pentecostal": "God promises Jacob presence, protection, return to the land, and fulfillment of all promises.",
      "Episcopalian/Anglican": "God makes personal promises to Jacob: His presence, protection wherever Jacob goes, safe return to the land, and commitment until all promises are fulfilled.",
      "Orthodox": "God provides personal assurances to Jacob: divine presence, protection throughout his travels, guaranteed return to Canaan, and unwavering commitment until the complete fulfillment of His promises.",
      "Other": "I am with you and will watch over you wherever you go, and I will bring you back to this land. I will not leave you until I have done what I have promised you.\"",
      "Prefer not to say": "I am with you and will watch over you wherever you go, and I will bring you back to this land. I will not leave you until I have done what I have promised you.\""
    },
    "16": {
      "General": "When Jacob awoke from his sleep, he thought, \"Surely the Lord is in this place, and I was not aware of it.\"",
      "Non-Denominational": "When Jacob awoke from his sleep, he thought, \"Surely the Lord is in this place, and I was not aware of it.\"",
      "Baptist": "Jacob awakens from the dream with a profound realization: God is present in this seemingly ordinary place, something he hadn't previously recognized.",
      "Catholic": "Jacob awakes with a startling realization: 'Surely the Lord (Yahweh) is in this place, and I did not know it!' He recognizes the sanctity of the location due to the divine encounter, which he hadn't perceived before the dream.",
      "Methodist": "Jacob awakes with the realization that God is truly present in this location, which he hadn't known before.",
      "Lutheran": "Jacob awakes and realizes with awe, 'Surely Yahweh is in this place, and I did not know it!'",
      "Presbyterian": "Jacob awakes with the realization of God's unexpected presence in that location ('Surely the Lord is in this place, and I was not aware of it').",
      "Pentecostal": "Jacob wakes up realizing God is in that place, unaware before.",
      "Episcopalian/Anglican": "Jacob awakes and realizes with awe that the Lord is present in that specific place, though he hadn't known it before.",
      "Orthodox": "Upon awakening, Jacob experiences a profound awareness of God's unanticipated presence in that specific location, admitting his prior unawareness.",
      "Other": "When Jacob awoke from his sleep, he thought, \"Surely the Lord is in this place, and I was not aware of it.\"",
      "Prefer not to say": "When Jacob awoke from his sleep, he thought, \"Surely the Lord is in this place, and I was not aware of it.\""
    },
    "17": {
      "General": "He was afraid and said, \"How awesome is this place! This is none other than the house of God; this is the gate of heaven.\"",
      "Non-Denominational": "He was afraid and said, \"How awesome is this place! This is none other than the house of God; this is the gate of heaven.\"",
      "Baptist": "Filled with awe and fear (reverence), Jacob declares the place awesome, identifying it as the very dwelling place of God ('house of God') and the entrance point to the heavenly realm ('gate of heaven').",
      "Catholic": "He is filled with fear (reverential awe) and exclaims, 'How awesome (fear-inspiring) is this place!' He identifies it as a sacred space, nothing less than the 'house of God' (Beth-El) and the 'gate of heaven', the point of access between the divine and earthly realms revealed in his dream.",
      "Methodist": "Filled with reverential fear, Jacob declares the place 'awesome,' identifying it as God's house and the gate of heaven, a point of divine access.",
      "Lutheran": "Jacob is filled with awe/fear and exclaims, 'How awesome is this place! This is none other than the house of God, and this is the gate of heaven.'",
      "Presbyterian": "Filled with reverential fear, Jacob proclaims the site's awesomeness, identifying it as the 'house of God' and the 'gate of heaven'.",
      "Pentecostal": "Jacob is afraid (in awe) and calls the place awesome, the house of God, the gate of heaven.",
      "Episcopalian/Anglican": "He reacts with fear/awe, proclaiming the place 'awesome' and identifying it as the 'house of God' and the 'gate of heaven.'",
      "Orthodox": "Overcome with reverential fear, Jacob exclaims about the awesomeness of the location, identifying it as the veritable 'house of God' and the 'gate of heaven'.",
      "Other": "He was afraid and said, \"How awesome is this place! This is none other than the house of God; this is the gate of heaven.\"",
      "Prefer not to say": "He was afraid and said, \"How awesome is this place! This is none other than the house of God; this is the gate of heaven.\""
    },
    "18": {
      "General": "Early the next morning Jacob took the stone he had placed under his head and set it up as a pillar and poured oil on top of it.",
      "Non-Denominational": "Early the next morning Jacob took the stone he had placed under his head and set it up as a pillar and poured oil on top of it.",
      "Baptist": "In response to the dream, Jacob takes the stone he used as a pillow, sets it upright as a sacred pillar (matzevah), and consecrates it by pouring oil on it, marking the site.",
      "Catholic": "The next morning, Jacob acts to commemorate the experience. He takes the stone he had used as a pillow, sets it up vertically as a sacred pillar or monument (Hebrew: matzevah), and consecrates it by anointing it with oil. This marks the location as sacred.",
      "Methodist": "Jacob takes the stone pillow, sets it up as a sacred pillar, and consecrates it with oil to mark the holy place.",
      "Lutheran": "Jacob gets up early, takes the stone pillow, sets it up as a pillar (matzevah), and consecrates it by pouring oil on it.",
      "Presbyterian": "Jacob takes the stone pillow, sets it up as a sacred pillar, and pours oil on it, consecrating the site of his revelation.",
      "Pentecostal": "Jacob sets up the stone pillow as a pillar and pours oil on it, consecrating it.",
      "Episcopalian/Anglican": "Early the next morning, Jacob sets up the stone he used as a pillow as a sacred pillar and consecrates it by pouring oil on it.",
      "Orthodox": "The following morning, Jacob erects the stone he used as a headrest into a sacred pillar (matzevah) and consecrates it by anointing it with oil, thus marking the holy site.",
      "Other": "Early the next morning Jacob took the stone he had placed under his head and set it up as a pillar and poured oil on top of it.",
      "Prefer not to say": "Early the next morning Jacob took the stone he had placed under his head and set it up as a pillar and poured oil on top of it."
    },
    "19": {
      "General": "He called that place Bethel, though the city used to be called Luz.",
      "Non-Denominational": "He called that place Bethel, though the city used to be called Luz.",
      "Baptist": "Jacob names the location Bethel ('House of God'), reflecting his experience. The narrator notes its previous name was Luz.",
      "Catholic": "Jacob formally names the site Bethel (meaning 'House of God'), directly reflecting his declaration in v. 17. The narrator provides context by mentioning the nearby town was originally called Luz.",
      "Methodist": "Jacob names the place Bethel ('House of God'). The text notes the nearby town was formerly Luz.",
      "Lutheran": "Jacob names the place Bethel ('House of God'). The narrator notes the city was previously called Luz.",
      "Presbyterian": "Jacob names the site Bethel ('House of God'), noting its previous name was Luz.",
      "Pentecostal": "Jacob names the place Bethel (House of God), previously Luz.",
      "Episcopalian/Anglican": "Jacob names the place Bethel ('House of God'), noting the city was formerly called Luz.",
      "Orthodox": "Jacob bestows the name Bethel ('House of God') upon the location, commemorating his divine encounter. The narrator adds that the nearby city was previously known as Luz.",
      "Other": "He called that place Bethel, though the city used to be called Luz.",
      "Prefer not to say": "He called that place Bethel, though the city used to be called Luz."
    },
    "20": {
      "General": "Then Jacob made a vow, saying, \"If God will be with me and will watch over me on this journey I am taking and will give me food to eat and clothes to wear",
      "Non-Denominational": "Then Jacob made a vow, saying, \"If God will be with me and will watch over me on this journey I am taking and will give me food to eat and clothes to wear",
      "Baptist": "Jacob makes a conditional vow to God, predicated on God fulfilling the promises just made: divine presence, protection on the journey, and provision of basic needs (food and clothing).",
      "Catholic": "Jacob responds to God's promises by making a conditional vow. The conditions ('If God will be with me...') directly echo the assurances God just gave him (v. 15): divine presence, protection on his journey, and provision of basic necessities ('food to eat and clothes to wear').",
      "Methodist": "Jacob makes a conditional vow, asking God to fulfill His promises of presence, protection, and provision (food, clothes) on the journey.",
      "Lutheran": "Jacob makes a conditional vow: If God will fulfill His promises (be with him, protect him on the journey, provide food and clothing)...",
      "Presbyterian": "Jacob makes a conditional vow, dependent on God fulfilling His promises of presence, protection, and provision during his journey.",
      "Pentecostal": "Jacob makes a conditional vow: if God will be with him, protect him, and provide food and clothes...",
      "Episcopalian/Anglican": "Jacob makes a conditional vow, stating the conditions based on God's promises: His presence, protection on the journey, and provision of food and clothing.",
      "Orthodox": "Jacob articulates a conditional vow, contingent upon God fulfilling the promises of presence, protection during his journey, and provision of essential sustenance and clothing.",
      "Other": "Then Jacob made a vow, saying, \"If God will be with me and will watch over me on this journey I am taking and will give me food to eat and clothes to wear",
      "Prefer not to say": "Then Jacob made a vow, saying, \"If God will be with me and will watch over me on this journey I am taking and will give me food to eat and clothes to wear"
    },
    "21": {
      "General": "so that I return safely to my father's household, then the Lord will be my God",
      "Non-Denominational": "so that I return safely to my father's household, then the Lord will be my God",
      "Baptist": "The final condition is a safe return to his father's home. If these conditions are met, Jacob vows to acknowledge Yahweh as his personal God.",
      "Catholic": "The final condition is a safe return ('in peace', shalom) to his father's house. If God fulfills all these conditions, Jacob pledges his allegiance: 'then the Lord (Yahweh) shall be my God'.",
      "Methodist": "...and enable his safe return home, then Jacob vows that Yahweh will be his personal God.",
      "Lutheran": "...and if Jacob returns safely to his father's house, then Jacob vows that Yahweh will be his God.",
      "Presbyterian": "...and ensures his safe return home, then Jacob vows Yahweh will be his God.",
      "Pentecostal": "...and if he returns safely home, then the Lord will be his God.",
      "Episcopalian/Anglican": "...and enables him to return safely to his father's house, then Jacob vows that the Lord will be his God.",
      "Orthodox": "...and facilitate his safe return to his paternal home, then Jacob pledges that Yahweh shall be his personal God.",
      "Other": "so that I return safely to my father's household, then the Lord will be my God",
      "Prefer not to say": "so that I return safely to my father's household, then the Lord will be my God"
    },
    "22": {
      "General": "and this stone that I have set up as a pillar will be God's house, and of all that you give me I will give you a tenth.\"",
      "Non-Denominational": "and this stone that I have set up as a pillar will be God's house, and of all that you give me I will give you a tenth.\"",
      "Baptist": "Jacob further vows that the consecrated stone pillar will mark a place of worship ('God's house') and that he will dedicate a tithe (a tenth) of all his future possessions/increase back to God.",
      "Catholic": "Jacob concludes his vow with two specific commitments: first, the stone pillar he erected will be designated as 'God's house' (a place of worship and divine presence); second, he promises to give God a tithe ('a tenth') of all the material blessings and possessions God provides him.",
      "Methodist": "He also vows that the stone pillar will be designated God's house (a place of worship) and that he will give God a tenth (tithe) of all his increase.",
      "Lutheran": "Furthermore, Jacob vows this stone pillar will be God's house, and he will give God a tenth (tithe) of everything God gives him.",
      "Presbyterian": "Further vows that this stone pillar will be God's house (a sacred site) and that he will give a tenth (tithe) of all his possessions to God.",
      "Pentecostal": "...and this stone will be God's house, and Jacob will give God a tenth of all he receives.",
      "Episcopalian/Anglican": "And Jacob vows that the stone pillar will be God's house, and he will give God a tenth of all that God gives him.",
      "Orthodox": "Jacob additionally vows that the erected stone pillar shall be designated as 'God's house' and pledges to return to God a tithe (a tenth) of all possessions bestowed upon him.",
      "Other": "and this stone that I have set up as a pillar will be God's house, and of all that you give me I will give you a tenth.\"",
      "Prefer not to say": "and this stone that I have set up as a pillar will be God's house, and of all that you give me I will give you a tenth.\""
    }
  }
} 