{
  "_comment": "Interpretations for Genesis Chapter 29",
  "book": "Genesis",
  "chapter": "29",
  "verses": {
    "1": {
      "General": "Then Jacob continued on his journey and came to the land of the eastern peoples.",
      "Non-Denominational": "Then Jacob continued on his journey and came to the land of the eastern peoples.",
      "Baptist": "Jacob resumes his journey eastward, eventually arriving in the region inhabited by his relatives (the 'eastern peoples').",
      "Catholic": "Jacob resumes his journey ('lifted up his feet') and travels eastward until he reaches the region of the 'eastern peoples' (Mesopotamia, specifically the area around Harran).",
      "Methodist": "Jacob continues his journey eastward and arrives in the land of his relatives.",
      "Lutheran": "Jacob continues his journey and arrives in the land of the eastern peoples (Mesopotamia).",
      "Presbyterian": "Jacob continues his journey eastward, arriving in the region of his relatives.",
      "Pentecostal": "Jacob continues his journey and reaches the land of the eastern peoples.",
      "Episcopalian/Anglican": "Jacob continues his journey and arrives in the land of the eastern peoples.",
      "Orthodox": "Jacob resumes his travels and reaches the territory of the eastern peoples (Mesopotamia).",
      "Other": "Then Jacob continued on his journey and came to the land of the eastern peoples.",
      "Prefer not to say": "Then Jacob continued on his journey and came to the land of the eastern peoples."
    },
    "2": {
      "General": "There he saw a well in the open country, with three flocks of sheep lying near it because the flocks were watered from that well. The stone over the mouth of the well was large.",
      "Non-Denominational": "There he saw a well in the open country, with three flocks of sheep lying near it because the flocks were watered from that well. The stone over the mouth of the well was large.",
      "Baptist": "He comes upon a well in a field with three flocks waiting nearby. The well is covered by a large stone, indicating a communal and perhaps regulated water source.",
      "Catholic": "He observes a well in a field with three flocks of sheep resting beside it, indicating it's a watering place. A large stone covers the mouth of the well, suggesting it required collective effort to open and protected the water source.",
      "Methodist": "He finds a well in a field where three flocks wait to be watered; a large stone covers the well.",
      "Lutheran": "He sees a well in a field with three flocks nearby, waiting to be watered. A large stone covers the well.",
      "Presbyterian": "He encounters a well covered by a large stone, with three flocks waiting nearby to be watered.",
      "Pentecostal": "Jacob sees a well covered by a large stone, with three flocks waiting.",
      "Episcopalian/Anglican": "He sees a well in a field covered by a large stone, with three flocks waiting nearby to be watered.",
      "Orthodox": "He encounters a well in the open country, secured by a large stone, with three flocks resting nearby awaiting water.",
      "Other": "There he saw a well in the open country, with three flocks of sheep lying near it because the flocks were watered from that well. The stone over the mouth of the well was large.",
      "Prefer not to say": "There he saw a well in the open country, with three flocks of sheep lying near it because the flocks were watered from that well. The stone over the mouth of the well was large."
    },
    "3": {
      "General": "When all the flocks were gathered there, the shepherds would roll the stone away from the well's mouth and water the sheep. Then they would return the stone to its place over the mouth of the well.",
      "Non-Denominational": "When all the flocks were gathered there, the shepherds would roll the stone away from the well's mouth and water the sheep. Then they would return the stone to its place over the mouth of the well.",
      "Baptist": "Describes the custom: only when all shepherds and flocks assigned to that well arrived would they cooperate to roll away the heavy stone, water their sheep, and then replace the stone.",
      "Catholic": "The narrator explains the local custom: the shepherds would wait until all the flocks designated for that well were gathered. Only then would they collectively roll the large stone away, water all the sheep, and immediately replace the stone to protect the well.",
      "Methodist": "Explains the custom: shepherds gathered all flocks before collectively rolling the stone, watering, and replacing the stone.",
      "Lutheran": "Explains the custom: all the flocks had to be gathered before the shepherds rolled the stone away, watered the sheep, and replaced the stone.",
      "Presbyterian": "Explains the local custom: all flocks gathered before the shepherds collectively moved the stone, watered the sheep, and replaced the stone.",
      "Pentecostal": "Explains the custom: all flocks gathered, then shepherds moved the stone, watered, and replaced it.",
      "Episcopalian/Anglican": "Explains the custom: all flocks gathered before the shepherds rolled the stone away, watered the sheep, and then replaced the stone.",
      "Orthodox": "Details the local practice: the heavy stone was removed only when all designated flocks were present, after which the sheep were watered, and the stone promptly replaced.",
      "Other": "When all the flocks were gathered there, the shepherds would roll the stone away from the well's mouth and water the sheep. Then they would return the stone to its place over the mouth of the well.",
      "Prefer not to say": "When all the flocks were gathered there, the shepherds would roll the stone away from the well's mouth and water the sheep. Then they would return the stone to its place over the mouth of the well."
    },
    "4": {
      "General": "Jacob asked the shepherds, \"My brothers, where are you from?\" \"We're from Harran,\" they replied.",
      "Non-Denominational": "Jacob asked the shepherds, \"My brothers, where are you from?\" \"We're from Harran,\" they replied.",
      "Baptist": "Jacob initiates conversation, addressing them courteously ('My brothers'). He learns they are from Harran, his intended destination.",
      "Catholic": "Jacob engages the shepherds politely ('My brothers') and asks their origin. They confirm they are from Harran, the very place Jacob is seeking.",
      "Methodist": "Jacob politely inquires about the shepherds' origin and learns they are from Harran, his destination.",
      "Lutheran": "Jacob asks the shepherds where they are from; they reply they are from Haran.",
      "Presbyterian": "Jacob inquires about the shepherds' origin and learns they are from Harran.",
      "Pentecostal": "Jacob asks the shepherds where they're from; they say Haran.",
      "Episcopalian/Anglican": "Jacob asks the shepherds their origin; they confirm they are from Haran.",
      "Orthodox": "Jacob inquires of the shepherds' place of origin, and they confirm they hail from Harran.",
      "Other": "Jacob asked the shepherds, \"My brothers, where are you from?\" \"We're from Harran,\" they replied.",
      "Prefer not to say": "Jacob asked the shepherds, \"My brothers, where are you from?\" \"We're from Harran,\" they replied."
    },
    "5": {
      "General": "He said to them, \"Do you know Laban, Nahor's grandson?\" \"Yes, we know him,\" they answered.",
      "Non-Denominational": "He said to them, \"Do you know Laban, Nahor's grandson?\" \"Yes, we know him,\" they answered.",
      "Baptist": "Jacob specifically asks if they know Laban, identifying him via his grandfather Nahor (Abraham's brother). They confirm they know him.",
      "Catholic": "Jacob asks specifically if they know Laban, identifying him as the grandson of Nahor (Abraham's brother, linking him to Jacob's own lineage). The shepherds affirm that they know Laban.",
      "Methodist": "Jacob asks if they know Laban (Nahor's grandson); they confirm they do.",
      "Lutheran": "Jacob asks if they know Laban son of Nahor (using 'son' broadly for descendant). They confirm they know him.",
      "Presbyterian": "Jacob asks if they know Laban (grandson of Nahor). They confirm their acquaintance.",
      "Pentecostal": "Jacob asks if they know Laban; they say yes.",
      "Episcopalian/Anglican": "Jacob inquires if they know Laban, grandson of Nahor. They confirm that they do.",
      "Orthodox": "Jacob specifically asks about Laban, identifying him through his grandfather Nahor. The shepherds affirm their acquaintance with Laban.",
      "Other": "He said to them, \"Do you know Laban, Nahor's grandson?\" \"Yes, we know him,\" they answered.",
      "Prefer not to say": "He said to them, \"Do you know Laban, Nahor's grandson?\" \"Yes, we know him,\" they answered."
    },
    "6": {
      "General": "Then Jacob asked them, \"Is he well?\" \"Yes, he is,\" they said, \"and here comes his daughter Rachel with the sheep.\"",
      "Non-Denominational": "Then Jacob asked them, \"Is he well?\" \"Yes, he is,\" they said, \"and here comes his daughter Rachel with the sheep.\"",
      "Baptist": "Jacob inquires about Laban's well-being. The shepherds confirm Laban is well and, significantly, point out Laban's daughter Rachel approaching with her father's sheep.",
      "Catholic": "Jacob inquires about Laban's well-being ('Is he well?' or 'Is it peace/shalom with him?'). They confirm he is well and, providentially, point out that Laban's daughter Rachel is just then approaching with the family's flock.",
      "Methodist": "Jacob asks about Laban's welfare. They confirm he is well and point out his daughter Rachel approaching with sheep.",
      "Lutheran": "Jacob asks if Laban is well ('Is it peace with him?'). They say yes and point out Rachel, Laban's daughter, approaching with the sheep.",
      "Presbyterian": "Jacob inquires about Laban's well-being. They confirm he is well and identify Rachel, Laban's daughter, approaching with sheep.",
      "Pentecostal": "Jacob asks if Laban is well; they say yes and point out Rachel approaching with sheep.",
      "Episcopalian/Anglican": "Jacob asks if Laban is well. They confirm he is and announce the arrival of his daughter Rachel with the sheep.",
      "Orthodox": "Jacob inquires about Laban's health. The shepherds affirm his well-being and simultaneously announce the arrival of his daughter Rachel with the flock.",
      "Other": "Then Jacob asked them, \"Is he well?\" \"Yes, he is,\" they said, \"and here comes his daughter Rachel with the sheep.\"",
      "Prefer not to say": "Then Jacob asked them, \"Is he well?\" \"Yes, he is,\" they said, \"and here comes his daughter Rachel with the sheep.\""
    },
    "7": {
      "General": "\"Look,\" he said, \"the sun is still high; it's not time for the flocks to be gathered. Water the sheep and take them back to pasture.\"",
      "Non-Denominational": "\"Look,\" he said, \"the sun is still high; it's not time for the flocks to be gathered. Water the sheep and take them back to pasture.\"",
      "Baptist": "Jacob, perhaps trying to facilitate meeting Rachel or simply noting inefficiency, points out it's still daytime and suggests they water the sheep now and let them continue grazing rather than waiting.",
      "Catholic": "Jacob, perhaps eager to interact with Rachel sooner or displaying initiative, points out it's still high day ('the sun is still high') and therefore not yet time to gather the flocks for the evening. He suggests the shepherds water their sheep now and let them graze longer.",
      "Methodist": "Jacob points out it's still early and suggests they water the sheep now instead of waiting for all flocks, questioning their custom or eager to meet Rachel.",
      "Lutheran": "Jacob points out it's still daytime, not time to gather flocks, suggesting they water the sheep now and let them graze more.",
      "Presbyterian": "Jacob observes it is still daytime and suggests they water the sheep immediately rather than waiting according to custom.",
      "Pentecostal": "Jacob suggests they water the sheep now since it's still daytime.",
      "Episcopalian/Anglican": "Jacob points out that it is still broad daylight and not time to gather the flocks, suggesting they water the sheep and let them graze further.",
      "Orthodox": "Jacob observes that it is still early in the day and suggests the shepherds water their flocks immediately rather than adhering to the custom of waiting for all to gather.",
      "Other": "\"Look,\" he said, \"the sun is still high; it's not time for the flocks to be gathered. Water the sheep and take them back to pasture.\"",
      "Prefer not to say": "\"Look,\" he said, \"the sun is still high; it's not time for the flocks to be gathered. Water the sheep and take them back to pasture.\""
    },
    "8": {
      "General": "\"We can't,\" they replied, \"until all the flocks are gathered and the stone has been rolled away from the mouth of the well. Then we will water the sheep.\"",
      "Non-Denominational": "\"We can't,\" they replied, \"until all the flocks are gathered and the stone has been rolled away from the mouth of the well. Then we will water the sheep.\"",
      "Baptist": "The shepherds reiterate the established custom: they cannot water individually but must wait for all flocks and collective effort to move the stone.",
      "Catholic": "The shepherds reiterate their adherence to the established custom: they cannot water the sheep until all the flocks have gathered and the stone is collectively rolled away.",
      "Methodist": "The shepherds explain they must follow the custom of waiting for all flocks before rolling the stone.",
      "Lutheran": "They explain they cannot until all flocks are gathered and the stone is rolled away, following the custom.",
      "Presbyterian": "The shepherds reiterate that custom requires all flocks to gather before the stone is moved.",
      "Pentecostal": "They explain they must wait for all flocks to gather before moving the stone.",
      "Episcopalian/Anglican": "They explain they cannot water the sheep until all the flocks are gathered and the stone is rolled away, adhering to the local custom.",
      "Orthodox": "The shepherds reiterate their obligation to follow the established procedure, requiring the presence of all flocks before moving the stone.",
      "Other": "\"We can't,\" they replied, \"until all the flocks are gathered and the stone has been rolled away from the mouth of the well. Then we will water the sheep.\"",
      "Prefer not to say": "\"We can't,\" they replied, \"until all the flocks are gathered and the stone has been rolled away from the mouth of the well. Then we will water the sheep.\""
    },
    "9": {
      "General": "While he was still speaking with them, Rachel came with her father's sheep, for she was a shepherd.",
      "Non-Denominational": "While he was still speaking with them, Rachel came with her father's sheep, for she was a shepherd.",
      "Baptist": "As Jacob is talking with the shepherds, Rachel arrives with Laban's flock. The text notes she herself worked as a shepherd.",
      "Catholic": "While Jacob is still conversing with the shepherds, Rachel arrives with her father Laban's flock. The narrator explicitly states that she personally tended the sheep ('she was a shepherd'), indicating her active role.",
      "Methodist": "Rachel arrives with her father's sheep while Jacob is talking; the text notes she worked as a shepherd.",
      "Lutheran": "While Jacob is still talking, Rachel arrives with her father's sheep, as she was a shepherdess.",
      "Presbyterian": "Rachel arrives with her father's flock while Jacob is speaking; she is identified as a shepherdess.",
      "Pentecostal": "Rachel arrives with her father's sheep while Jacob is talking; she is a shepherdess.",
      "Episcopalian/Anglican": "While Jacob is speaking, Rachel arrives with her father's sheep, as she was a shepherdess.",
      "Orthodox": "During Jacob's conversation, Rachel arrives tending her father's flock, explicitly identified as a shepherdess.",
      "Other": "While he was still speaking with them, Rachel came with her father's sheep, for she was a shepherd.",
      "Prefer not to say": "While he was still speaking with them, Rachel came with her father's sheep, for she was a shepherd."
    },
    "10": {
      "General": "When Jacob saw Rachel daughter of his uncle Laban, and Laban's sheep, he went over and rolled the stone away from the mouth of the well and watered his uncle's sheep.",
      "Non-Denominational": "When Jacob saw Rachel daughter of his uncle Laban, and Laban's sheep, he went over and rolled the stone away from the mouth of the well and watered his uncle's sheep.",
      "Baptist": "Upon seeing his cousin Rachel and his uncle Laban's sheep, Jacob, perhaps motivated by attraction, helpfulness, or a show of strength, single-handedly rolls away the large stone (contrary to custom) and waters Laban's flock.",
      "Catholic": "Upon seeing Rachel (identified as the daughter of his mother's brother, Laban) and her flock, Jacob takes immediate action. Displaying remarkable strength (and disregarding the local custom requiring collective effort), he single-handedly rolls the large stone away from the well's mouth and waters his uncle Laban's sheep.",
      "Methodist": "Seeing his cousin Rachel and her sheep, Jacob takes initiative, single-handedly rolls away the large stone (breaking custom), and waters his uncle's flock.",
      "Lutheran": "Seeing Rachel (his cousin) and Laban's sheep, Jacob goes, rolls the stone away by himself, and waters his uncle's flock.",
      "Presbyterian": "Upon seeing Rachel and Laban's sheep, Jacob unilaterally rolls away the large stone and waters his uncle's flock, displaying strength and initiative.",
      "Pentecostal": "Jacob sees Rachel, rolls the stone away by himself, and waters Laban's sheep.",
      "Episcopalian/Anglican": "When Jacob sees Rachel and his uncle Laban's sheep, he single-handedly rolls the stone from the well's mouth and waters the flock.",
      "Orthodox": "Upon recognizing Rachel and his uncle's flock, Jacob unilaterally removes the large stone from the well (demonstrating strength and disregarding custom) and waters Laban's sheep.",
      "Other": "When Jacob saw Rachel daughter of his uncle Laban, and Laban's sheep, he went over and rolled the stone away from the mouth of the well and watered his uncle's sheep.",
      "Prefer not to say": "When Jacob saw Rachel daughter of his uncle Laban, and Laban's sheep, he went over and rolled the stone away from the mouth of the well and watered his uncle's sheep."
    },
    "11": {
      "General": "Then Jacob kissed Rachel and began to weep aloud.",
      "Non-Denominational": "Then Jacob kissed Rachel and began to weep aloud.",
      "Baptist": "Overcome with emotion (relief at finding kin, perhaps joy, gratitude to God), Jacob kisses his cousin Rachel and weeps loudly.",
      "Catholic": "Immediately after this act of service, Jacob kisses Rachel (likely a customary greeting among relatives) and is overcome with emotion, weeping aloud – perhaps from relief at reaching his destination, joy at finding family, gratitude for God's guidance, or the release of tension from his journey.",
      "Methodist": "Jacob kisses Rachel (a relative's greeting) and weeps aloud, overcome with emotion.",
      "Lutheran": "Jacob kisses Rachel and weeps loudly (likely from relief and emotion finding family).",
      "Presbyterian": "Jacob kisses Rachel (familial greeting) and weeps aloud, overcome by emotion upon meeting his relative.",
      "Pentecostal": "Jacob kisses Rachel and weeps loudly.",
      "Episcopalian/Anglican": "Jacob kisses Rachel and then weeps aloud, overcome with emotion.",
      "Orthodox": "Jacob kisses Rachel (a familial greeting) and begins to weep loudly, overcome by the emotions of arriving and meeting kin.",
      "Other": "Then Jacob kissed Rachel and began to weep aloud.",
      "Prefer not to say": "Then Jacob kissed Rachel and began to weep aloud."
    },
    "12": {
      "General": "He had told Rachel that he was a relative of her father and a son of Rebekah. So she ran and told her father.",
      "Non-Denominational": "He had told Rachel that he was a relative of her father and a son of Rebekah. So she ran and told her father.",
      "Baptist": "Jacob identifies himself to Rachel as her father's relative and Rebekah's son. Rachel runs to inform her father Laban of Jacob's arrival.",
      "Catholic": "Jacob identifies himself to Rachel, explaining he is her father's kinsman ('a relative') and specifically Rebekah's son. Upon hearing this news, Rachel runs to tell her father, Laban.",
      "Methodist": "Jacob identifies himself as Laban's relative and Rebekah's son. Rachel runs to tell Laban.",
      "Lutheran": "Jacob explains he is Laban's relative and Rebekah's son. Rachel runs to tell her father.",
      "Presbyterian": "Jacob identifies himself to Rachel as Laban's relative and Rebekah's son. Rachel runs to inform Laban.",
      "Pentecostal": "Jacob identifies himself; Rachel runs to tell Laban.",
      "Episcopalian/Anglican": "Jacob identifies himself to Rachel as her father's relative and Rebekah's son. She runs to tell her father.",
      "Orthodox": "Jacob reveals his identity to Rachel as a kinsman of her father and the son of Rebekah. Rachel promptly runs to inform Laban.",
      "Other": "He had told Rachel that he was a relative of her father and a son of Rebekah. So she ran and told her father.",
      "Prefer not to say": "He had told Rachel that he was a relative of her father and a son of Rebekah. So she ran and told her father."
    },
    "13": {
      "General": "As soon as Laban heard the news about Jacob, his sister's son, he hurried to meet him. He embraced him and kissed him and brought him to his home. Then Jacob told Laban all that had happened to him.",
      "Non-Denominational": "As soon as Laban heard the news about Jacob, his sister's son, he hurried to meet him. He embraced him and kissed him and brought him to his home. Then Jacob told Laban all that had happened to him.",
      "Baptist": "Laban, upon hearing the news of his nephew Jacob's arrival, hurries to meet him, embraces and kisses him in welcome, and brings him into his home. Jacob then recounts his story ('all that had happened') to Laban.",
      "Catholic": "Upon hearing the news about his sister's son, Jacob, Laban rushes out to meet him. He greets him warmly with an embrace and kiss (customary familial welcome) and brings him into his house. There, Jacob recounts the events that led him there ('all these things').",
      "Methodist": "Laban hears the news, hurries to meet Jacob, greets him warmly (embrace, kiss), brings him home, and Jacob recounts his story.",
      "Lutheran": "When Laban hears about Jacob (his sister's son), he hurries, embraces, kisses him, and brings him home. Jacob tells Laban everything.",
      "Presbyterian": "Laban hurries to meet Jacob upon hearing the news, greets him warmly, brings him home, and Jacob relates his experiences.",
      "Pentecostal": "Laban hears, hurries to meet Jacob, greets him warmly, takes him home; Jacob tells his story.",
      "Episcopalian/Anglican": "Upon hearing the news about Jacob, Laban hurries to meet him, embraces and kisses him, and brings him to his home. Jacob then tells Laban all that has happened.",
      "Orthodox": "Upon receiving the news of his nephew Jacob, Laban hastily goes to meet him, greets him affectionately with an embrace and kiss, and welcomes him into his home, whereupon Jacob relates his recent experiences.",
      "Other": "As soon as Laban heard the news about Jacob, his sister's son, he hurried to meet him. He embraced him and kissed him and brought him to his home. Then Jacob told Laban all that had happened to him.",
      "Prefer not to say": "As soon as Laban heard the news about Jacob, his sister's son, he hurried to meet him. He embraced him and kissed him and brought him to his home. Then Jacob told Laban all that had happened to him."
    },
    "14": {
      "General": "Then Laban said to him, \"You are my own flesh and blood.\" After Jacob had stayed with him for a whole month,",
      "Non-Denominational": "Then Laban said to him, \"You are my own flesh and blood.\" After Jacob had stayed with him for a whole month,",
      "Baptist": "Laban acknowledges their close kinship ('my own flesh and blood' or 'my bone and my flesh'). Jacob stays with Laban for a month.",
      "Catholic": "Laban affirms their close family tie, declaring, 'Surely you are my bone and my flesh!' Jacob then resides with Laban for a full month.",
      "Methodist": "Laban affirms their kinship ('my own flesh and blood'). Jacob stays with Laban for a month.",
      "Lutheran": "Laban affirms their kinship: 'Surely you are my bone and my flesh!' Jacob stays with him for a month.",
      "Presbyterian": "Laban acknowledges their close kinship. Jacob stays with him for a month.",
      "Pentecostal": "Laban affirms kinship; Jacob stays a month.",
      "Episcopalian/Anglican": "Laban acknowledges their kinship ('my bone and my flesh'). Jacob stays with him for a month.",
      "Orthodox": "Laban affirms their close consanguinity ('my bone and my flesh'). Jacob resides with Laban for a period of one month.",
      "Other": "Then Laban said to him, \"You are my own flesh and blood.\" After Jacob had stayed with him for a whole month,",
      "Prefer not to say": "Then Laban said to him, \"You are my own flesh and blood.\" After Jacob had stayed with him for a whole month,"
    },
    "15": {
      "General": "Laban said to him, \"Just because you are a relative of mine, should you work for me for nothing? Tell me what your wages should be.\"",
      "Non-Denominational": "Laban said to him, \"Just because you are a relative of mine, should you work for me for nothing? Tell me what your wages should be.\"",
      "Baptist": "After a month, Laban initiates a discussion about wages, acknowledging Jacob shouldn't work for free just because he's family and asking Jacob to name his price.",
      "Catholic": "Laban raises the issue of compensation, suggesting that Jacob, despite being a relative, shouldn't work without wages. He opens negotiations by asking Jacob to state his desired wage ('Tell me, what shall your wages be?').",
      "Methodist": "Laban raises the issue of wages, saying Jacob shouldn't work for free just because he's family, and asks Jacob to propose a wage.",
      "Lutheran": "Laban initiates wage negotiations, saying Jacob shouldn't work for free just because he's a relative, and asks Jacob to name his wages.",
      "Presbyterian": "Laban initiates wage discussions, stating Jacob shouldn't work for free due to kinship and asking him to propose terms.",
      "Pentecostal": "Laban asks Jacob what wages he wants, saying he shouldn't work for free.",
      "Episcopalian/Anglican": "Laban raises the topic of wages, stating Jacob shouldn't work for nothing just because he is a relative, and asks Jacob to name his terms.",
      "Orthodox": "Laban broaches the subject of compensation, asserting that kinship should not preclude wages, and invites Jacob to state his desired remuneration.",
      "Other": "Laban said to him, \"Just because you are a relative of mine, should you work for me for nothing? Tell me what your wages should be.\"",
      "Prefer not to say": "Laban said to him, \"Just because you are a relative of mine, should you work for me for nothing? Tell me what your wages should be.\""
    },
    "16": {
      "General": "Now Laban had two daughters; the name of the older was Leah, and the name of the younger was Rachel.",
      "Non-Denominational": "Now Laban had two daughters; the name of the older was Leah, and the name of the younger was Rachel.",
      "Baptist": "Introduces Laban's two daughters: Leah (older) and Rachel (younger).",
      "Catholic": "The narrator introduces Laban's two daughters, providing crucial background for the subsequent events: the older daughter was named Leah, and the younger was named Rachel.",
      "Methodist": "Introduces Laban's daughters: Leah (older) and Rachel (younger).",
      "Lutheran": "Introduces Laban's two daughters: Leah (older) and Rachel (younger).",
      "Presbyterian": "Introduces Laban's daughters: Leah (older) and Rachel (younger).",
      "Pentecostal": "Introduces Leah (older) and Rachel (younger), Laban's daughters.",
      "Episcopalian/Anglican": "Introduces Laban's two daughters: Leah (older) and Rachel (younger).",
      "Orthodox": "Introduces Laban's two daughters: the elder, Leah, and the younger, Rachel.",
      "Other": "Now Laban had two daughters; the name of the older was Leah, and the name of the younger was Rachel.",
      "Prefer not to say": "Now Laban had two daughters; the name of the older was Leah, and the name of the younger was Rachel."
    },
    "17": {
      "General": "Leah had weak eyes, but Rachel had a lovely figure and was beautiful.",
      "Non-Denominational": "Leah had weak eyes, but Rachel had a lovely figure and was beautiful.",
      "Baptist": "Contrasts the sisters' appearance: Leah had 'weak' or 'tender' eyes (perhaps lacking sparkle, or simply less attractive), while Rachel was physically beautiful in form and appearance.",
      "Catholic": "Contrasts the sisters' appearances: Leah's eyes were 'weak' or 'delicate' (Hebrew: rak, interpretation debated – could mean unattractive, tender, or simply lacking luster compared to Rachel's), whereas Rachel is described as having a beautiful figure and overall stunning appearance ('lovely in form and beautiful').",
      "Methodist": "Describes Leah as having 'weak' eyes, while Rachel was beautiful in form and appearance.",
      "Lutheran": "Leah's eyes were weak/delicate, but Rachel was beautiful in form and appearance.",
      "Presbyterian": "Contrasts the sisters: Leah had 'weak' eyes, while Rachel was beautiful in form and face.",
      "Pentecostal": "Describes Leah's weak eyes and Rachel's beauty.",
      "Episcopalian/Anglican": "Describes Leah as having 'weak' or 'tender' eyes, while Rachel was beautiful in form and appearance.",
      "Orthodox": "Contrasts the physical attributes of the sisters: Leah possessed 'weak' or 'tender' eyes, whereas Rachel was exceptionally beautiful in both figure and countenance.",
      "Other": "Leah had weak eyes, but Rachel had a lovely figure and was beautiful.",
      "Prefer not to say": "Leah had weak eyes, but Rachel had a lovely figure and was beautiful."
    },
    "18": {
      "General": "Jacob was in love with Rachel and said, \"I'll work for you seven years in return for your younger daughter Rachel.\"",
      "Non-Denominational": "Jacob was in love with Rachel and said, \"I'll work for you seven years in return for your younger daughter Rachel.\"",
      "Baptist": "Jacob, smitten with the beautiful Rachel, proposes his wages: seven years of labor in exchange for marrying Rachel.",
      "Catholic": "Jacob had fallen in love with Rachel. He proposes his terms to Laban: 'I will serve you seven years for your younger daughter Rachel.' He offers a significant period of labor as a bride price.",
      "Methodist": "Jacob, in love with Rachel, offers to work for Laban for seven years in exchange for marrying Rachel.",
      "Lutheran": "Jacob loved Rachel and offers to work seven years for Laban in exchange for Rachel.",
      "Presbyterian": "Jacob, being in love with Rachel, offers seven years of service to Laban as a bride price for her.",
      "Pentecostal": "Jacob loves Rachel and offers to work seven years for her.",
      "Episcopalian/Anglican": "Jacob, being in love with Rachel, offers to serve Laban for seven years in return for Rachel.",
      "Orthodox": "Jacob, having fallen in love with Rachel, proposes to serve Laban for seven years as the bride price for Rachel.",
      "Other": "Jacob was in love with Rachel and said, \"I'll work for you seven years in return for your younger daughter Rachel.\"",
      "Prefer not to say": "Jacob was in love with Rachel and said, \"I'll work for you seven years in return for your younger daughter Rachel.\""
    },
    "19": {
      "General": "Laban answered, \"It's better that I give her to you than to some other man. Stay here with me.\"",
      "Non-Denominational": "Laban answered, \"It's better that I give her to you than to some other man. Stay here with me.\"",
      "Baptist": "Laban agrees readily, stating it's better to give Rachel to a relative (Jacob) than an outsider, and invites Jacob to stay and fulfill the agreement.",
      "Catholic": "Laban agrees to the terms, reasoning, 'It is better that I give her to you than that I should give her to any other man.' He confirms the arrangement, telling Jacob to stay with him (implying acceptance of the seven years' service).",
      "Methodist": "Laban agrees, preferring to marry Rachel to a relative, and tells Jacob to stay.",
      "Lutheran": "Laban agrees, saying it's better to give her to Jacob (a relative) than another man, and tells him to stay.",
      "Presbyterian": "Laban agrees to the arrangement, preferring Jacob as a son-in-law over a stranger, and confirms Jacob should stay.",
      "Pentecostal": "Laban agrees, saying it's better Jacob marry her than someone else.",
      "Episcopalian/Anglican": "Laban agrees, stating it is better to give her to Jacob (a relative) than to another man, and invites him to stay.",
      "Orthodox": "Laban consents to the proposal, deeming it preferable to give Rachel to a kinsman rather than an outsider, and bids Jacob remain with him.",
      "Other": "Laban answered, \"It's better that I give her to you than to some other man. Stay here with me.\"",
      "Prefer not to say": "Laban answered, \"It's better that I give her to you than to some other man. Stay here with me.\""
    },
    "20": {
      "General": "So Jacob served seven years to get Rachel, but they seemed like only a few days to him because of his love for her.",
      "Non-Denominational": "So Jacob served seven years to get Rachel, but they seemed like only a few days to him because of his love for her.",
      "Baptist": "Jacob fulfills the seven years of labor. The time passes quickly for him due to the depth of his love for Rachel.",
      "Catholic": "Jacob fulfills his part of the bargain, serving Laban for seven years. The narrator emphasizes the power of Jacob's love for Rachel, stating that the long period of service 'seemed to him but a few days, because of the love he had for her.'",
      "Methodist": "Jacob completes the seven years of service, which felt short due to his great love for Rachel.",
      "Lutheran": "Jacob serves the seven years for Rachel, but the time seems short because of his love for her.",
      "Presbyterian": "Jacob completes the seven years of service for Rachel, the time passing quickly due to his love for her.",
      "Pentecostal": "Jacob serves seven years, but it feels like a few days because he loves Rachel.",
      "Episcopalian/Anglican": "Jacob serves the seven years for Rachel, but the time seemed short because of his love for her.",
      "Orthodox": "Jacob completes the agreed-upon seven years of service, a period that felt brief to him due to the intensity of his love for Rachel.",
      "Other": "So Jacob served seven years to get Rachel, but they seemed like only a few days to him because of his love for her.",
      "Prefer not to say": "So Jacob served seven years to get Rachel, but they seemed like only a few days to him because of his love for her."
    },
    "21": {
      "General": "Then Jacob said to Laban, \"Give me my wife. My time is completed, and I want to make love to her.\"",
      "Non-Denominational": "Then Jacob said to Laban, \"Give me my wife. My time is completed, and I want to make love to her.\"",
      "Baptist": "After completing the seven years, Jacob formally requests Laban to give him Rachel as his wife so he can consummate the marriage.",
      "Catholic": "Having completed the agreed service, Jacob formally asks Laban to fulfill his end of the bargain: 'Give me my wife, for my time is completed, that I may go in to her' (a euphemism for marital relations/consummation).",
      "Methodist": "Jacob asks Laban for Rachel, stating his service is complete and he wishes to consummate the marriage.",
      "Lutheran": "After seven years, Jacob asks Laban for his wife (Rachel) as the time is complete, so he can consummate the marriage.",
      "Presbyterian": "After seven years, Jacob asks Laban for Rachel, his time of service being complete, so he can consummate the marriage.",
      "Pentecostal": "Jacob asks Laban for his wife Rachel, saying his time is up.",
      "Episcopalian/Anglican": "Jacob asks Laban for his wife Rachel, stating his term of service is complete and he wants to consummate the marriage.",
      "Orthodox": "Upon completing the service period, Jacob requests Laban deliver his wife, Rachel, so that the marriage can be consummated.",
      "Other": "Then Jacob said to Laban, \"Give me my wife. My time is completed, and I want to make love to her.\"",
      "Prefer not to say": "Then Jacob said to Laban, \"Give me my wife. My time is completed, and I want to make love to her.\""
    },
    "22": {
      "General": "So Laban brought together all the people of the place and gave a feast.",
      "Non-Denominational": "So Laban brought together all the people of the place and gave a feast.",
      "Baptist": "Laban prepares a wedding feast, inviting the local community.",
      "Catholic": "Laban arranges a wedding feast, gathering together all the men of the place to celebrate.",
      "Methodist": "Laban holds a wedding feast for the community.",
      "Lutheran": "Laban gathers the local people and holds a wedding feast.",
      "Presbyterian": "Laban gathers the community and prepares a wedding feast.",
      "Pentecostal": "Laban holds a wedding feast.",
      "Episcopalian/Anglican": "Laban gathers the local people and holds a wedding feast.",
      "Orthodox": "Laban organizes a wedding feast, inviting the local inhabitants.",
      "Other": "So Laban brought together all the people of the place and gave a feast.",
      "Prefer not to say": "So Laban brought together all the people of the place and gave a feast."
    },
    "23": {
      "General": "But when evening came, he took his daughter Leah and brought her to Jacob, and Jacob made love to her.",
      "Non-Denominational": "But when evening came, he took his daughter Leah and brought her to Jacob, and Jacob made love to her.",
      "Baptist": "Under the cover of darkness (and likely custom involving veiling the bride), Laban deceptively substitutes Leah for Rachel. Jacob, unaware, consummates the marriage with Leah.",
      "Catholic": "Under the cover of evening darkness, Laban executes his deceit. He brings his older daughter, Leah (likely veiled according to custom), to Jacob instead of Rachel. Jacob, unaware of the substitution, consummates the marriage with Leah.",
      "Methodist": "Laban deceives Jacob, substituting Leah for Rachel in the evening darkness; Jacob consummates the marriage with Leah unknowingly.",
      "Lutheran": "In the evening, Laban deceives Jacob by bringing Leah (likely veiled) instead of Rachel. Jacob consummates the marriage with Leah.",
      "Presbyterian": "Laban deceives Jacob, substituting Leah for Rachel under cover of darkness. Jacob unknowingly consummates the marriage with Leah.",
      "Pentecostal": "Laban deceives Jacob, giving him Leah instead of Rachel at night; Jacob consummates the marriage.",
      "Episcopalian/Anglican": "In the evening, Laban deceptively brings Leah to Jacob instead of Rachel, and Jacob consummates the marriage with her.",
      "Orthodox": "Under the concealment of night, Laban practices deceit by presenting Leah to Jacob instead of Rachel. Jacob, unaware of the substitution, consummates the marriage with Leah.",
      "Other": "But when evening came, he took his daughter Leah and brought her to Jacob, and Jacob made love to her.",
      "Prefer not to say": "But when evening came, he took his daughter Leah and brought her to Jacob, and Jacob made love to her."
    },
    "24": {
      "General": "And Laban gave his servant Zilpah to his daughter Leah as her attendant.",
      "Non-Denominational": "And Laban gave his servant Zilpah to his daughter Leah as her attendant.",
      "Baptist": "Laban provides his servant Zilpah as a handmaid to Leah, part of the marriage arrangement.",
      "Catholic": "As part of the marriage provision, Laban gives his female servant Zilpah to his daughter Leah to be her handmaid.",
      "Methodist": "Laban gives the servant Zilpah to Leah as her handmaid.",
      "Lutheran": "Laban gives his servant Zilpah to Leah as her maid.",
      "Presbyterian": "Laban assigns his servant Zilpah to Leah as her handmaid.",
      "Pentecostal": "Laban gives Zilpah to Leah as her servant.",
      "Episcopalian/Anglican": "Laban gives his servant Zilpah to Leah as her maidservant.",
      "Orthodox": "Laban assigns his maidservant Zilpah to his daughter Leah.",
      "Other": "And Laban gave his servant Zilpah to his daughter Leah as her attendant.",
      "Prefer not to say": "And Laban gave his servant Zilpah to his daughter Leah as her attendant."
    },
    "25": {
      "General": "When morning came, there was Leah! So Jacob said to Laban, \"What is this you have done to me? I served you for Rachel, didn't I? Why have you deceived me?\"",
      "Non-Denominational": "When morning came, there was Leah! So Jacob said to Laban, \"What is this you have done to me? I served you for Rachel, didn't I? Why have you deceived me?\"",
      "Baptist": "In the morning light, Jacob discovers the deception. He confronts Laban angrily, reminding him the agreement was for Rachel and accusing Laban of deceit.",
      "Catholic": "In the morning light, Jacob discovers the switch: 'Behold, it was Leah!' He immediately confronts Laban, demanding an explanation: 'What is this you have done to me? Did I not serve you for Rachel? Why then have you deceived me?' The deceiver (Jacob) now experiences being deceived.",
      "Methodist": "Jacob discovers the deception in the morning and confronts Laban, reminding him he served for Rachel and accusing him of deceit.",
      "Lutheran": "In the morning, Jacob discovers it is Leah. He confronts Laban, asking why he deceived him after Jacob served for Rachel.",
      "Presbyterian": "Jacob discovers the deception in the morning and confronts Laban, accusing him of deceit after fulfilling the service for Rachel.",
      "Pentecostal": "Jacob discovers Leah in the morning and confronts Laban about the deception.",
      "Episcopalian/Anglican": "In the morning, Jacob discovers the deception ('it was Leah!') and confronts Laban, reminding him he served for Rachel and asking why Laban deceived him.",
      "Orthodox": "With the morning light, Jacob discovers the substitution and confronts Laban, questioning the deceit given that his service was explicitly for Rachel.",
      "Other": "When morning came, there was Leah! So Jacob said to Laban, \"What is this you have done to me? I served you for Rachel, didn't I? Why have you deceived me?\"",
      "Prefer not to say": "When morning came, there was Leah! So Jacob said to Laban, \"What is this you have done to me? I served you for Rachel, didn't I? Why have you deceived me?\""
    },
    "26": {
      "General": "Laban replied, \"It is not our custom here to give the younger daughter in marriage before the older one.",
      "Non-Denominational": "Laban replied, \"It is not our custom here to give the younger daughter in marriage before the older one.",
      "Baptist": "Laban offers a justification based on local custom: the older daughter must marry before the younger. (He conveniently failed to mention this earlier.)",
      "Catholic": "Laban justifies his actions by appealing to local custom: 'It is not so done in our country, to give the younger before the firstborn.' He implies Jacob should have known or inquired about this custom, conveniently unmentioned during the initial agreement.",
      "Methodist": "Laban justifies his deceit by citing local custom: the older daughter must marry first (a custom not mentioned earlier).",
      "Lutheran": "Laban claims it is not their custom to give the younger daughter in marriage before the older.",
      "Presbyterian": "Laban justifies the deception by citing local custom requiring the elder daughter to marry first.",
      "Pentecostal": "Laban justifies it by saying local custom is to marry the older daughter first.",
      "Episcopalian/Anglican": "Laban justifies his action by citing local custom: the younger daughter is not given in marriage before the firstborn.",
      "Orthodox": "Laban justifies his deceit by invoking local custom, stating it is not permissible to give the younger daughter in marriage before the elder.",
      "Other": "Laban replied, \"It is not our custom here to give the younger daughter in marriage before the older one.",
      "Prefer not to say": "Laban replied, \"It is not our custom here to give the younger daughter in marriage before the older one."
    },
    "27": {
      "General": "Finish this daughter's bridal week; then we will give you the younger one also, in return for another seven years of work.\"",
      "Non-Denominational": "Finish this daughter's bridal week; then we will give you the younger one also, in return for another seven years of work.\"",
      "Baptist": "Laban proposes a solution: complete the traditional seven-day wedding celebration for Leah, after which Laban will give Rachel to Jacob as well, but only in exchange for another seven years of labor.",
      "Catholic": "Laban proposes a way forward: Jacob should complete the customary seven-day wedding feast/celebration for Leah. After that week, Laban will also give him Rachel in marriage, but the price is another seven years of service to Laban.",
      "Methodist": "Laban offers Rachel after Leah's bridal week (seven days), but demands another seven years of work from Jacob in return.",
      "Lutheran": "Laban proposes Jacob complete Leah's bridal week (7 days), and then he will give him Rachel also, in exchange for another seven years of work.",
      "Presbyterian": "Laban proposes Jacob complete Leah's bridal week, after which he can marry Rachel in exchange for another seven years of service.",
      "Pentecostal": "Laban proposes Jacob finish Leah's bridal week, then marry Rachel and work another seven years.",
      "Episcopalian/Anglican": "Laban proposes that Jacob complete Leah's bridal week, and then Laban will give him Rachel too, in return for another seven years of service.",
      "Orthodox": "Laban proposes that Jacob fulfill the week-long bridal festivities for Leah, after which Rachel will also be given to him, conditional upon Jacob committing to another seven years of service.",
      "Other": "Finish this daughter's bridal week; then we will give you the younger one also, in return for another seven years of work.\"",
      "Prefer not to say": "Finish this daughter's bridal week; then we will give you the younger one also, in return for another seven years of work.\""
    },
    "28": {
      "General": "And Jacob did so. He finished the week with Leah, and then Laban gave him his daughter Rachel to be his wife.",
      "Non-Denominational": "And Jacob did so. He finished the week with Leah, and then Laban gave him his daughter Rachel to be his wife.",
      "Baptist": "Jacob agrees to Laban's terms, finishes Leah's bridal week, and then marries Rachel.",
      "Catholic": "Jacob accepts Laban's terms. He completes Leah's bridal week, and then Laban formally gives him Rachel as his wife as well.",
      "Methodist": "Jacob agrees, finishes Leah's week, and Laban gives him Rachel as his wife.",
      "Lutheran": "Jacob agrees, finishes Leah's week, and Laban gives him Rachel as his wife.",
      "Presbyterian": "Jacob agrees, completes Leah's bridal week, and Laban gives him Rachel as his wife.",
      "Pentecostal": "Jacob agrees, finishes Leah's week, and marries Rachel.",
      "Episcopalian/Anglican": "Jacob complies, finishing Leah's week, and then Laban gives him Rachel as his wife.",
      "Orthodox": "Jacob accepts the arrangement, completes Leah's bridal week, and subsequently Laban gives him Rachel in marriage.",
      "Other": "And Jacob did so. He finished the week with Leah, and then Laban gave him his daughter Rachel to be his wife.",
      "Prefer not to say": "And Jacob did so. He finished the week with Leah, and then Laban gave him his daughter Rachel to be his wife."
    },
    "29": {
      "General": "Laban gave his servant Bilhah to his daughter Rachel as her attendant.",
      "Non-Denominational": "Laban gave his servant Bilhah to his daughter Rachel as her attendant.",
      "Baptist": "Laban provides his servant Bilhah as a handmaid to Rachel.",
      "Catholic": "Laban gives his female servant Bilhah to Rachel to be her handmaid, parallel to giving Zilpah to Leah.",
      "Methodist": "Laban gives the servant Bilhah to Rachel as her handmaid.",
      "Lutheran": "Laban gives his servant Bilhah to Rachel as her maid.",
      "Presbyterian": "Laban assigns his servant Bilhah to Rachel as her handmaid.",
      "Pentecostal": "Laban gives Bilhah to Rachel as her servant.",
      "Episcopalian/Anglican": "Laban gives his servant Bilhah to Rachel as her maidservant.",
      "Orthodox": "Laban assigns his maidservant Bilhah to his daughter Rachel.",
      "Other": "Laban gave his servant Bilhah to his daughter Rachel as her attendant.",
      "Prefer not to say": "Laban gave his servant Bilhah to his daughter Rachel as her attendant."
    },
    "30": {
      "General": "Jacob made love to Rachel also, and his love for Rachel was greater than his love for Leah. And he worked for Laban another seven years.",
      "Non-Denominational": "Jacob made love to Rachel also, and his love for Rachel was greater than his love for Leah. And he worked for Laban another seven years.",
      "Baptist": "Jacob consummates his marriage with Rachel. The text explicitly states his greater love for Rachel compared to Leah. He then begins working the additional seven years for Laban.",
      "Catholic": "Jacob consummates his marriage with Rachel as well. The narrative explicitly states Jacob's preference: 'his love for Rachel was greater than his love for Leah.' He then begins fulfilling his obligation to serve Laban for the second seven-year period.",
      "Methodist": "Jacob consummates the marriage with Rachel, loving her more than Leah. He then works the additional seven years for Laban.",
      "Lutheran": "Jacob consummates the marriage with Rachel. He loved Rachel more than Leah. Jacob serves Laban another seven years.",
      "Presbyterian": "Jacob consummates the marriage with Rachel, whom he loved more than Leah. He begins the additional seven years of service.",
      "Pentecostal": "Jacob consummates marriage with Rachel, loves her more than Leah, and works another seven years.",
      "Episcopalian/Anglican": "Jacob consummates his marriage with Rachel, loving her more than Leah. He serves Laban for another seven years.",
      "Orthodox": "Jacob consummates the marriage with Rachel, his affection for her explicitly noted as greater than for Leah. He commences the second seven-year period of service to Laban.",
      "Other": "Jacob made love to Rachel also, and his love for Rachel was greater than his love for Leah. And he worked for Laban another seven years.",
      "Prefer not to say": "Jacob made love to Rachel also, and his love for Rachel was greater than his love for Leah. And he worked for Laban another seven years."
    },
    "31": {
      "General": "When the Lord saw that Leah was not loved, he enabled her to conceive, but Rachel remained childless.",
      "Non-Denominational": "When the Lord saw that Leah was not loved, he enabled her to conceive, but Rachel remained childless.",
      "Baptist": "God observes Leah's situation (being unloved or less loved) and intervenes providentially by opening her womb (allowing her to conceive), while Rachel, the beloved wife, remains barren.",
      "Catholic": "The Lord takes notice of Leah's plight ('saw that Leah was hated' or unloved/less loved). In compassion or to balance the situation, God 'opened her womb' (enabled her to conceive), while the favored wife, Rachel, remained barren.",
      "Methodist": "God sees Leah is unloved and opens her womb, allowing her to conceive, while Rachel remains barren.",
      "Lutheran": "Yahweh sees Leah is unloved/hated and opens her womb, while Rachel remains barren.",
      "Presbyterian": "God observes Leah is unloved and enables her to conceive, while Rachel, the favored wife, remains barren.",
      "Pentecostal": "God sees Leah is unloved and opens her womb; Rachel is barren.",
      "Episcopalian/Anglican": "The Lord, seeing Leah was unloved, opened her womb, while Rachel remained barren.",
      "Orthodox": "Observing that Leah was unloved, the Lord enabled her to conceive, whereas Rachel, despite being favored, remained childless.",
      "Other": "When the Lord saw that Leah was not loved, he enabled her to conceive, but Rachel remained childless.",
      "Prefer not to say": "When the Lord saw that Leah was not loved, he enabled her to conceive, but Rachel remained childless."
    },
    "32": {
      "General": "Leah became pregnant and gave birth to a son. She named him Reuben, for she said, \"It is because the Lord has seen my misery. Surely my husband will love me now.\"",
      "Non-Denominational": "Leah became pregnant and gave birth to a son. She named him Reuben, for she said, \"It is because the Lord has seen my misery. Surely my husband will love me now.\"",
      "Baptist": "Leah conceives and bears Jacob's first son. She names him Reuben (meaning related to 'see' or 'behold a son'), expressing hope that God has seen her affliction and that this son will cause Jacob to love her.",
      "Catholic": "Leah conceives and gives birth to Jacob's first son. She names him Reuben (playing on Hebrew words for 'see' and 'son'), explaining, 'Because the Lord has looked upon my affliction; for now my husband will love me.' Her naming reflects both acknowledgment of God's intervention and her deep longing for Jacob's love.",
      "Methodist": "Leah bears a son, names him Reuben ('See, a Son'), acknowledging God saw her misery and hoping Jacob will now love her.",
      "Lutheran": "Leah conceives and bears a son. She names him Reuben ('See, a son!'), saying Yahweh has seen her affliction and hoping Jacob will now love her.",
      "Presbyterian": "Leah bears Jacob's first son, naming him Reuben ('See, a son'), acknowledging God saw her affliction and hoping this will earn Jacob's love.",
      "Pentecostal": "Leah bears Reuben ('See, a Son'), hoping Jacob will love her now because God saw her misery.",
      "Episcopalian/Anglican": "Leah conceives and bears a son, naming him Reuben ('See, a Son'), stating the Lord saw her affliction and hoping Jacob will now love her.",
      "Orthodox": "Leah conceives and bears a son, whom she names Reuben (punning on 'see' and 'son'), articulating that God observed her distress and expressing hope that the birth will garner Jacob's affection.",
      "Other": "Leah became pregnant and gave birth to a son. She named him Reuben, for she said, \"It is because the Lord has seen my misery. Surely my husband will love me now.\"",
      "Prefer not to say": "Leah became pregnant and gave birth to a son. She named him Reuben, for she said, \"It is because the Lord has seen my misery. Surely my husband will love me now.\""
    },
    "33": {
      "General": "She conceived again, and when she gave birth to a son she said, \"Because the Lord heard that I am not loved, he gave me this one too.\" So she named him Simeon.",
      "Non-Denominational": "She conceived again, and when she gave birth to a son she said, \"Because the Lord heard that I am not loved, he gave me this one too.\" So she named him Simeon.",
      "Baptist": "Leah bears a second son. She names him Simeon (related to the Hebrew word 'to hear'), acknowledging God heard she was unloved and gave her another son.",
      "Catholic": "Leah conceives again and bears a second son. She names him Simeon (related to Hebrew shama, 'to hear'), explaining, 'Because the Lord has heard that I am hated (unloved), he has given me this son also.' Again, the name reflects God's awareness of her pain.",
      "Methodist": "Leah bears a second son, names him Simeon ('Hearing'), stating God heard she was unloved and gave her another son.",
      "Lutheran": "Leah bears a second son, names him Simeon ('Hearing'), because Yahweh heard she was unloved/hated.",
      "Presbyterian": "Leah bears a second son, naming him Simeon ('Hearing'), because God heard she was unloved.",
      "Pentecostal": "Leah bears Simeon ('Hearing'), because God heard she was unloved.",
      "Episcopalian/Anglican": "Leah bears a second son, naming him Simeon ('Hearing'), because the Lord heard she was unloved.",
      "Orthodox": "Leah bears a second son, naming him Simeon (related to 'hearing'), acknowledging that God heard of her unloved status.",
      "Other": "She conceived again, and when she gave birth to a son she said, \"Because the Lord heard that I am not loved, he gave me this one too.\" So she named him Simeon.",
      "Prefer not to say": "She conceived again, and when she gave birth to a son she said, \"Because the Lord heard that I am not loved, he gave me this one too.\" So she named him Simeon."
    },
    "34": {
      "General": "Again she conceived, and when she gave birth to a son she said, \"Now at last my husband will become attached to me, because I have borne him three sons.\" So he was named Levi.",
      "Non-Denominational": "Again she conceived, and when she gave birth to a son she said, \"Now at last my husband will become attached to me, because I have borne him three sons.\" So he was named Levi.",
      "Baptist": "Leah bears a third son. She names him Levi (related to Hebrew 'attach' or 'join'), expressing renewed hope that having three sons will finally cause Jacob to become attached to her.",
      "Catholic": "Leah conceives and bears a third son. This time, her hope shifts more directly to her husband: 'Now this time my husband will be joined (Hebrew: lavah) to me, because I have borne him three sons.' Consequently, she names him Levi (related to lavah, 'joined').",
      "Methodist": "Leah bears a third son, names him Levi ('Attached'), hoping that three sons will finally cause Jacob to become attached to her.",
      "Lutheran": "Leah bears a third son, names him Levi ('Joined'), hoping Jacob will now become attached/joined to her.",
      "Presbyterian": "Leah bears a third son, naming him Levi ('Attached'), hoping this will finally cause Jacob to become attached to her.",
      "Pentecostal": "Leah bears Levi ('Attached'), hoping Jacob will become attached to her now.",
      "Episcopalian/Anglican": "Leah bears a third son, naming him Levi ('Attached'), hoping her husband will now become attached to her.",
      "Orthodox": "Upon bearing a third son, Leah names him Levi (related to 'attach'), expressing the hope that this will finally cause Jacob to become attached to her.",
      "Other": "Again she conceived, and when she gave birth to a son she said, \"Now at last my husband will become attached to me, because I have borne him three sons.\" So he was named Levi.",
      "Prefer not to say": "Again she conceived, and when she gave birth to a son she said, \"Now at last my husband will become attached to me, because I have borne him three sons.\" So he was named Levi."
    },
    "35": {
      "General": "She conceived again, and when she gave birth to a son she said, \"This time I will praise the Lord.\" So she named him Judah. Then she stopped having children.",
      "Non-Denominational": "She conceived again, and when she gave birth to a son she said, \"This time I will praise the Lord.\" So she named him Judah. Then she stopped having children.",
      "Baptist": "Leah bears a fourth son. This time, her focus shifts from her desire for Jacob's love to praising God. She names him Judah (related to Hebrew 'praise') and then temporarily stops conceiving.",
      "Catholic": "Leah conceives and bears a fourth son. With this birth, her focus seems to shift from seeking her husband's affection to direct praise of God: 'This time I will praise (Hebrew: odeh) the Lord.' Therefore, she names him Judah (Yehudah, related to odeh, 'praise'). The narrator notes that after Judah's birth, Leah temporarily ceased bearing children.",
      "Methodist": "Leah bears a fourth son, names him Judah ('Praise'), this time focusing on praising God rather than winning Jacob's love. She then stops bearing children for a time.",
      "Lutheran": "Leah bears a fourth son, names him Judah ('Praise'), saying, 'This time I will praise Yahweh.' Then she stopped bearing.",
      "Presbyterian": "Leah bears a fourth son, naming him Judah ('Praise'), expressing praise to God. She then stops bearing children.",
      "Pentecostal": "Leah bears Judah ('Praise'), praising God. She then stops having children.",
      "Episcopalian/Anglican": "Leah bears a fourth son, naming him Judah ('Praise'), declaring, 'This time I will praise the Lord.' She then stops bearing children.",
      "Orthodox": "Bearing a fourth son, Leah names him Judah (related to 'praise'), declaring her intention to praise God. Following this birth, her childbearing ceases for a time.",
      "Other": "She conceived again, and when she gave birth to a son she said, \"This time I will praise the Lord.\" So she named him Judah. Then she stopped having children.",
      "Prefer not to say": "She conceived again, and when she gave birth to a son she said, \"This time I will praise the Lord.\" So she named him Judah. Then she stopped having children."
    }
  }
} 