{
  "chapterSummary": {
    "General": "Genesis 3 recounts the temptation of Eve by the serpent, the disobedience of Adam and Eve in eating the forbidden fruit (The Fall), their subsequent realization of nakedness and shame, God's confrontation with them and the serpent, and the resulting curses and consequences, including expulsion from the Garden of Eden. This chapter explains the origin of sin, suffering, and broken relationships in the world.",
    "Non-Denominational": "Focuses on the reality of temptation, the nature of sin as disobedience stemming from unbelief and pride, the immediate consequences (shame, fear, broken fellowship), God's justice in judgment (curses), His mercy (promise of redemption, provision of covering), and the separation from God's presence (expulsion).",
    "Baptist": "Emphasizes the historical reality of the Fall. Views the serpent as Satan. Stresses Adam's role as federal head, whose sin brought condemnation upon all humanity (original sin). Highlights the total depravity resulting from the Fall. Sees verse 15 (Protoevangelium) as the first promise of the Gospel (Christ crushing Satan). God's provision of skins points to substitutionary atonement.",
    "Catholic": "Recounts the Fall as a historical event involving human free will disobeying God's command at Satan's instigation. Affirms original sin inherited by all humanity (loss of original holiness and justice). Notes the consequences: darkened intellect, weakened will, concupiscence, suffering, death, broken harmony. Verse 15 (Protoevangelium) is seen as the first announcement of the Redeemer (Christ) and Mary's role.",
    "Methodist": "Focuses on the temptation targeting human desire and reason. Highlights sin as willful disobedience breaking relationship with God. Notes the immediate consequences of guilt, shame, and fear. Stresses God's prevenient grace already at work (seeking Adam, promising redemption in v. 15), alongside judgment. Emphasizes the hope of restoration despite the Fall.",
    "Lutheran": "Views the Fall as humanity's rebellion against God's Word, driven by unbelief fostered by Satan. Stresses the resulting original sin, corrupting human nature and causing spiritual death (separation from God) and physical death. Verse 15 is the Protoevangelium, the first Gospel promise of Christ defeating Satan. God covering them signifies His grace.",
    "Presbyterian": "Interprets the Fall as the historical breaking of the Covenant of Works by Adam, the federal representative. Affirms the doctrine of original sin (guilt and corruption inherited). Highlights the consequences outlined in the curses. Emphasizes God's sovereign grace in the Protoevangelium (v. 15), promising redemption through the Seed of the woman despite human failure.",
    "Pentecostal": "Often views the Fall literally. Emphasizes the serpent as Satan, the deceiver. Stresses the immediate spiritual death (separation from God) and subsequent consequences (shame, fear, curses). Sees verse 15 as the foundational promise of Christ's victory over Satan. Highlights the loss of spiritual authority and the introduction of suffering.",
    "Anglican": "Affirms the Fall as the foundational narrative explaining human sinfulness and separation from God. Views the serpent as a vehicle of evil/Satan. Acknowledges original sin and its consequences. Stresses God's judgment intertwined with mercy, particularly the Protoevangelium (v. 15) as a promise of hope and redemption.",
    "Orthodox": "Views the Fall as a historical tragedy, humanity choosing separation from God (the source of life) through disobedience, influenced by the devil. Emphasizes the consequences: corruption of the image (though not total loss), introduction of mortality ('skins of mortality' in v. 21), and disordered passions. Verse 15 is the Protoevangelium. Focuses on the loss of communion and the beginning of the journey back to God."
  },
  "1": {
    "Non-Denominational": "Introduces the serpent as the most crafty wild animal God had made. It initiates a conversation with the woman (Eve), questioning the accuracy and intent of God's command regarding the trees.",
    "General": "Introduces the serpent as the most crafty wild animal God had made. It initiates a conversation with the woman (Eve), questioning the accuracy and intent of God's command regarding the trees.",
    "Baptist": "Identifies the serpent as the mouthpiece of Satan, subtly twisting God's Word to create doubt.",
    "Catholic": "The serpent (symbolizing Satan/the devil) initiates temptation by questioning God's goodness and truthfulness.",
    "Methodist": "The tempter (serpent/Satan) uses craftiness to engage Eve and challenge God's clear instruction.",
    "Lutheran": "Satan, using the serpent, begins his attack by casting doubt on God's Word.",
    "Presbyterian": "The serpent (representing Satan) initiates the temptation by questioning the clarity and goodness of God's command.",
    "Pentecostal": "Satan, embodied in the serpent, begins his deceptive work by questioning God's command.",
    "Anglican": "The serpent, portrayed as crafty, initiates temptation by subtly misrepresenting God's command.",
    "Orthodox": "The devil, using the form of a serpent, begins the temptation by sowing seeds of doubt about God's command and intentions."
  },
  "2": {
    "Non-Denominational": "Eve accurately restates God's permission to eat fruit from the trees in the garden.",
    "General": "Eve accurately restates God's permission to eat fruit from the trees in the garden.",
    "Baptist": "Eve initially demonstrates knowledge of God's general permission.",
    "Catholic": "Eve correctly recalls the broad permission given by God.",
    "Methodist": "Eve affirms God's generosity in provision.",
    "Lutheran": "Eve correctly states the general permission God gave.",
    "Presbyterian": "Eve accurately recounts the broad permission granted by God.",
    "Pentecostal": "Eve repeats God's generous allowance.",
    "Anglican": "Eve responds by affirming God's general permission regarding the trees.",
    "Orthodox": "Eve initially states God's generous allowance correctly."
  },
  "3": {
    "Non-Denominational": "Eve correctly recalls God's prohibition against eating from the specific tree in the middle of the garden, adding the phrase 'or touch it', and confirms the consequence is death.",
    "General": "Eve correctly recalls God's prohibition against eating from the specific tree in the middle of the garden, adding the phrase 'or touch it', and confirms the consequence is death.",
    "Baptist": "Eve knows the prohibition but slightly alters it ('or touch it'), perhaps indicating a slight wavering or misunderstanding.",
    "Catholic": "Eve recalls the prohibition but adds 'or touch it,' possibly exaggerating the command or revealing the beginning of doubt.",
    "Methodist": "Eve states the prohibition but adds an element ('touch'), suggesting the temptation is beginning to influence her perception.",
    "Lutheran": "Eve adds 'or touch it,' potentially showing the first step away from trusting God's precise Word.",
    "Presbyterian": "Eve recounts the prohibition but adds 'or touch it', possibly indicating a shift in focus or the beginning of legalism/doubt.",
    "Pentecostal": "Eve recalls the command but adds to it, revealing a subtle vulnerability to deception.",
    "Anglican": "Eve states the specific prohibition but adds 'or touch it', slightly modifying God's actual words.",
    "Orthodox": "Eve recalls the command but adds the prohibition against touching, perhaps revealing a distortion entering her thoughts."
  },
  "4": {
    "Non-Denominational": "The serpent directly contradicts God's warning, assuring Eve that they will certainly not die.",
    "General": "The serpent directly contradicts God's warning, assuring Eve that they will certainly not die.",
    "Baptist": "Satan issues a direct lie, denying God's truthfulness and the reality of judgment.",
    "Catholic": "The serpent tells the first lie, directly opposing God's Word and denying the consequence of sin.",
    "Methodist": "The tempter flatly denies God's stated consequence, introducing overt falsehood.",
    "Lutheran": "Satan directly contradicts God's Word, calling God a liar.",
    "Presbyterian": "The serpent directly denies God's Word, contradicting the threatened penalty.",
    "Pentecostal": "Satan's blatant lie, denying the truth of God's warning.",
    "Anglican": "The serpent makes a bold counter-claim, directly contradicting God's warning of death.",
    "Orthodox": "The devil directly lies, denying the consequence God stated and undermining trust in Him."
  },
  "5": {
    "Non-Denominational": "The serpent plants doubt about God's motives, suggesting God knows that eating the fruit will open their eyes, making them like God, knowing good and evil.",
    "General": "The serpent plants doubt about God's motives, suggesting God knows that eating the fruit will open their eyes, making them like God, knowing good and evil.",
    "Baptist": "Satan impugns God's character, suggesting He is withholding something good out of jealousy or fear.",
    "Catholic": "The serpent appeals to pride, suggesting disobedience will lead to divine status ('like God') and knowledge God is withholding.",
    "Methodist": "The temptation shifts to questioning God's goodness and appealing to the desire for forbidden knowledge and status.",
    "Lutheran": "Satan tempts with the promise of becoming like God, appealing to pride and desire for autonomy.",
    "Presbyterian": "The serpent maligns God's character, suggesting He is preventing their advancement out of self-interest.",
    "Pentecostal": "Satan appeals to the desire for godhood and hidden knowledge, questioning God's motives.",
    "Anglican": "The serpent further tempts Eve by questioning God's motives and promising godlike knowledge.",
    "Orthodox": "The devil appeals to the desire for deification through autonomous knowledge, rather than through communion with God."
  },
  "6": {
    "Non-Denominational": "Eve observes the fruit's appeal (good for food, pleasing to the eye, desirable for gaining wisdom), succumbs to the temptation, eats it, and gives some to Adam, who also eats.",
    "General": "Eve observes the fruit's appeal (good for food, pleasing to the eye, desirable for gaining wisdom), succumbs to the temptation, eats it, and gives some to Adam, who also eats.",
    "Baptist": "Eve yields to temptation (lust of flesh, lust of eyes, pride of life), disobeys, and Adam passively joins in her sin.",
    "Catholic": "Eve, deceived, gives in to the threefold temptation (pleasure, beauty, pride), eats, and leads Adam into the same act of disobedience.",
    "Methodist": "Eve rationalizes disobedience based on the fruit's appeal, eats, and Adam, though present, also chooses to disobey.",
    "Lutheran": "Trusting Satan's lie over God's Word, Eve sins, and Adam knowingly joins her transgression.",
    "Presbyterian": "Eve succumbs to the temptation, prioritizing her desires over God's command, and Adam willingly participates in the covenant breaking.",
    "Pentecostal": "Eve is deceived by the fruit's allure and the promise of wisdom; Adam makes a conscious choice to eat.",
    "Anglican": "Eve, seeing the fruit's appeal and believing the serpent's promise, disobeys; Adam, present with her, also eats.",
    "Orthodox": "Eve, deceived by the promise of false knowledge, eats, and Adam, failing to guide or protect, also partakes, signifying humanity's collective fall."
  },
  "7": {
    "Non-Denominational": "Immediately after eating, their eyes are opened to their nakedness, and they experience shame, attempting to cover themselves with fig leaves. This marks the loss of innocence.",
    "General": "Immediately after eating, their eyes are opened to their nakedness, and they experience shame, attempting to cover themselves with fig leaves. This marks the loss of innocence.",
    "Baptist": "The immediate consequence: awareness of sin manifested as shame, leading to futile self-effort (fig leaves).",
    "Catholic": "The opening of eyes signifies awareness of their fallen state and loss of original innocence, resulting in shame and a desire to hide their vulnerability.",
    "Methodist": "Sin immediately brings self-consciousness, shame, and the instinct to cover up their wrongdoing.",
    "Lutheran": "Their eyes are opened not to godhood, but to their sinfulness and shame, leading to works-righteousness (fig leaves).",
    "Presbyterian": "The immediate result of breaking covenant: awareness of guilt, alienation manifested as shame, and inadequate attempts at self-covering.",
    "Pentecostal": "The instant result of sin: lost innocence, newfound shame, and attempts to cover their spiritual exposure.",
    "Anglican": "The immediate consequence: a new, shame-filled awareness of their nakedness and a futile attempt at self-covering.",
    "Orthodox": "Their eyes are opened to their separation from God's grace, resulting in existential nakedness and shame, leading to inadequate self-justification."
  },
  "8": {
    "Non-Denominational": "Adam and Eve hear God walking in the garden and hide from His presence among the trees, indicating fear and broken fellowship resulting from their disobedience.",
    "General": "Adam and Eve hear God walking in the garden and hide from His presence among the trees, indicating fear and broken fellowship resulting from their disobedience.",
    "Baptist": "Sin leads to fear of God and separation from His presence.",
    "Catholic": "Guilt and fear replace intimacy; they hide from God, demonstrating the relational rupture caused by sin.",
    "Methodist": "Fellowship is broken; fear of God replaces trust, leading them to hide.",
    "Lutheran": "Sin destroys the trusting relationship with God, leading to fear and avoidance.",
    "Presbyterian": "Their sin results in alienation from God, manifested in fear and hiding from His presence.",
    "Pentecostal": "Fear and separation from God's presence are immediate results of sin.",
    "Anglican": "The sound of God's presence, previously welcome, now inspires fear, leading them to hide.",
    "Orthodox": "Fear of God enters their hearts due to their broken communion, causing them to hide from the Source of Life."
  },
  "9": {
    "Non-Denominational": "God calls out to Adam, asking 'Where are you?', not because He doesn't know, but to initiate confrontation and invite confession.",
    "General": "God calls out to Adam, asking 'Where are you?', not because He doesn't know, but to initiate confrontation and invite confession.",
    "Baptist": "God takes the initiative to seek out fallen humanity, calling Adam to account.",
    "Catholic": "God graciously seeks out the sinner, His question aiming to elicit self-awareness and confession.",
    "Methodist": "God pursues them despite their sin, His question opening the door for repentance.",
    "Lutheran": "God's question is Law, confronting Adam with his separation and calling him to account.",
    "Presbyterian": "God initiates the covenant lawsuit, calling Adam (the representative) to answer for his actions.",
    "Pentecostal": "God reaches out to fallen man, initiating the process of dealing with sin.",
    "Anglican": "God initiates the encounter, His question prompting Adam to acknowledge his situation.",
    "Orthodox": "God calls to Adam, not in ignorance, but initiating the possibility of repentance and dialogue."
  },
  "10": {
    "Non-Denominational": "Adam responds, admitting he heard God but hid because he was afraid of his nakedness, revealing his new sense of fear and shame before God.",
    "General": "Adam responds, admitting he heard God but hid because he was afraid of his nakedness, revealing his new sense of fear and shame before God.",
    "Baptist": "Adam admits fear and shame but doesn't yet confess the root cause (disobedience).",
    "Catholic": "Adam reveals his state of fear and shame but avoids confessing the act of disobedience itself.",
    "Methodist": "Adam verbalizes his fear stemming from his nakedness/shame, but avoids direct confession.",
    "Lutheran": "Adam acknowledges fear but focuses on the symptom (nakedness) rather than the cause (sin).",
    "Presbyterian": "Adam reveals his fear and shame but fails to take responsibility for his transgression.",
    "Pentecostal": "Adam admits his fear and hiding but not the underlying sin.",
    "Anglican": "Adam explains his hiding resulted from fear due to his nakedness.",
    "Orthodox": "Adam expresses his fear related to his nakedness but doesn't yet confess his disobedience."
  },
  "11": {
    "Non-Denominational": "God directly questions Adam, asking how he knew he was naked and whether he had eaten from the forbidden tree, pointing directly to his disobedience.",
    "General": "God directly questions Adam, asking how he knew he was naked and whether he had eaten from the forbidden tree, pointing directly to his disobedience.",
    "Baptist": "God confronts Adam directly with the evidence of his sin.",
    "Catholic": "God's questions press Adam towards acknowledging the source of his shame: his disobedience.",
    "Methodist": "God guides Adam toward confession by linking his shame to the forbidden fruit.",
    "Lutheran": "God's specific questions aim to elicit confession of the transgression.",
    "Presbyterian": "God directly confronts Adam with his specific act of covenant breaking.",
    "Pentecostal": "God pinpoints the act of disobedience as the source of Adam's condition.",
    "Anglican": "God's pointed questions lead Adam directly to the act of disobedience.",
    "Orthodox": "God leads Adam to the root of his condition by questioning his awareness and linking it to the forbidden tree."
  },
  "12": {
    "Non-Denominational": "Adam deflects blame, pointing to 'the woman you put here with me' as the one who gave him the fruit, implicating both Eve and God.",
    "General": "Adam deflects blame, pointing to 'the woman you put here with me' as the one who gave him the fruit, implicating both Eve and God.",
    "Baptist": "Adam demonstrates fallen nature by blaming Eve and implicitly blaming God.",
    "Catholic": "Adam shifts responsibility, blaming the woman and indirectly God who gave her to him.",
    "Methodist": "Adam refuses personal responsibility, resorting to blame-shifting.",
    "Lutheran": "Instead of confessing, Adam blames Eve and ultimately God.",
    "Presbyterian": "Adam attempts to evade responsibility by blaming Eve and implicitly questioning God's provision.",
    "Pentecostal": "Adam reveals fallen human tendency to blame others instead of taking responsibility.",
    "Anglican": "Adam avoids responsibility by blaming the woman, and implicitly God who provided her.",
    "Orthodox": "Adam shifts blame to the woman and indirectly critiques God, showing broken relationship."
  },
  "13": {
    "Non-Denominational": "God turns to Eve, asking what she has done. Eve, in turn, blames the serpent for deceiving her into eating the fruit.",
    "General": "God turns to Eve, asking what she has done. Eve, in turn, blames the serpent for deceiving her into eating the fruit.",
    "Baptist": "Eve also deflects blame, pointing to the serpent's deception.",
    "Catholic": "Eve, questioned by God, shifts blame to the serpent, admitting deception but not full responsibility.",
    "Methodist": "Eve follows Adam's pattern, blaming the serpent for her actions.",
    "Lutheran": "Eve blames the serpent, minimizing her own culpability.",
    "Presbyterian": "Eve also avoids responsibility, blaming the serpent's deception.",
    "Pentecostal": "Eve points to the serpent's deception as the cause of her action.",
    "Anglican": "Eve, in turn, blames the serpent for deceiving her.",
    "Orthodox": "Eve shifts blame to the serpent, highlighting the element of deception in her fall."
  },
  "14": {
    "Non-Denominational": "God pronounces a curse upon the serpent: it will be cursed above all animals, crawl on its belly, and eat dust, signifying degradation and humiliation.",
    "General": "God pronounces a curse upon the serpent: it will be cursed above all animals, crawl on its belly, and eat dust, signifying degradation and humiliation.",
    "Baptist": "God judges Satan (via the serpent), cursing him and signaling his ultimate defeat.",
    "Catholic": "God curses the serpent (symbol of Satan), decreeing its abasement and ultimate defeat.",
    "Methodist": "God holds the tempter accountable, pronouncing a curse signifying humiliation and defeat.",
    "Lutheran": "God curses Satan, represented by the serpent, condemning him to humiliation.",
    "Presbyterian": "God pronounces judgment upon the serpent (Satan), cursing him and decreeing his degradation.",
    "Pentecostal": "God directs His judgment first towards Satan, cursing his mode of operation and destiny.",
    "Anglican": "God pronounces judgment first on the serpent, cursing it with debasement.",
    "Orthodox": "God curses the serpent (devil), signifying his degradation and separation from the divine."
  },
  "15": {
    "Non-Denominational": "God declares ongoing hostility (enmity) between the serpent and the woman, and between their offspring. It includes a prophecy of ultimate victory: the woman's offspring will crush the serpent's head, though the serpent will strike his heel (often seen as the first gospel promise, Protoevangelium).",
    "General": "God declares ongoing hostility (enmity) between the serpent and the woman, and between their offspring. It includes a prophecy of ultimate victory: the woman's offspring will crush the serpent's head, though the serpent will strike his heel (often seen as the first gospel promise, Protoevangelium).",
    "Baptist": "The Protoevangelium: God promises perpetual conflict between Satan's seed and the woman's seed (believers, culminating in Christ), foretelling Christ's crushing victory over Satan despite His suffering (the cross).",
    "Catholic": "The Protoevangelium: Foretells the enmity between Satan and the Church (woman/Mary), and between Satan's followers and Christ (her Seed). Predicts Christ's ultimate victory over evil, achieved through His suffering.",
    "Methodist": "The first glimmer of hope: God promises conflict but ultimate victory for humanity's offspring (ultimately Christ) over the serpent/evil, providing hope amidst judgment.",
    "Lutheran": "The Protoevangelium: The first preaching of the Gospel, promising Christ (the woman's Seed) who will crush Satan's head (power) through His own suffering (heel strike).",
    "Presbyterian": "The Protoevangelium, the first promise of the Covenant of Grace: God declares war between the serpent and the woman's seed (the elect, culminating in Christ), promising Christ's victory over Satan.",
    "Pentecostal": "The foundational prophecy of spiritual warfare and the ultimate triumph of Jesus Christ (the Seed) over Satan, despite the cost (striking the heel).",
    "Anglican": "The Protoevangelium: God declares ongoing conflict between evil and humanity, but promises ultimate victory for the woman's offspring (interpreted Christologically) over the serpent.",
    "Orthodox": "The Protoevangelium: Foretells the ongoing struggle between humanity and demonic evil, but promises the ultimate victory of the woman's Seed (Christ) over the devil."
  },
  "16": {
    "Non-Denominational": "God describes consequences for the woman: increased pain in childbirth and a disruption in marital harmony, where her desire will be for her husband, and he will rule over her.",
    "General": "God describes consequences for the woman: increased pain in childbirth and a disruption in marital harmony, where her desire will be for her husband, and he will rule over her.",
    "Baptist": "Judgment on Eve introduces pain into childbearing and relational conflict/struggle for dominance within marriage, distorting the original complementarity.",
    "Catholic": "Consequences for the woman include suffering in childbirth (related to life-giving role) and disordered relations within marriage (concupiscence affecting desire and rule).",
    "Methodist": "The consequences affect woman's unique roles: pain in bringing forth life and tension within the marital relationship.",
    "Lutheran": "Sin brings pain into childbirth and disrupts the harmony of marriage, introducing conflict and distorted authority.",
    "Presbyterian": "Judgment includes pain in childbearing and distortion of the marital relationship, introducing sinful struggle related to desire and headship.",
    "Pentecostal": "Consequences include physical pain in childbirth and relational strife within marriage.",
    "Anglican": "Judgment addresses the woman's roles: pain in childbearing and a disruption of the original marital harmony involving desire and authority.",
    "Orthodox": "Consequences affect woman's role in life-giving (pain) and marital relationship (disordered desire and dynamics)."
  },
  "17": {
    "Non-Denominational": "God addresses Adam, cursing the ground because of his disobedience. Work will become toil, involving painful labor to produce food from thorny, thistle-bearing ground.",
    "General": "God addresses Adam, cursing the ground because of his disobedience. Work will become toil, involving painful labor to produce food from thorny, thistle-bearing ground.",
    "Baptist": "Judgment on Adam affects his domain: the ground is cursed, making work (stewardship) difficult and laborious.",
    "Catholic": "Because of Adam's sin, the ground is cursed, introducing hardship, resistance, and toil into human work.",
    "Methodist": "Adam's sin brings a curse upon the creation he was meant to steward, resulting in frustrating toil.",
    "Lutheran": "The ground is cursed due to Adam's sin, making work burdensome and frustrating.",
    "Presbyterian": "Judgment on Adam, the covenant head, includes cursing the ground, making his mandate to work it laborious and painful.",
    "Pentecostal": "The curse on the ground introduces struggle and hardship into man's work and provision.",
    "Anglican": "Judgment on Adam involves cursing the ground, transforming work from joyful stewardship into painful toil.",
    "Orthodox": "The earth itself suffers consequences from Adam's fall, introducing resistance and making labor arduous."
  },
  "18": {
    "Non-Denominational": "Reiterates the curse on the ground: it will produce thorns and thistles, and humanity will have to eat the plants of the field through difficult cultivation.",
    "General": "Reiterates the curse on the ground: it will produce thorns and thistles, and humanity will have to eat the plants of the field through difficult cultivation.",
    "Baptist": "Emphasizes the frustration of work due to the cursed ground.",
    "Catholic": "Highlights the antagonism between humanity and the cursed ground.",
    "Methodist": "Illustrates the difficulty of sustenance due to the cursed earth.",
    "Lutheran": "The curse manifests as thorns and thistles, hindering fruitful labor.",
    "Presbyterian": "Details the effect of the curse: resistance from the ground, requiring difficult labor for food.",
    "Pentecostal": "Shows the frustrating opposition from nature resulting from the curse.",
    "Anglican": "Expands on the cursed ground, producing thorns and thistles, making agriculture difficult.",
    "Orthodox": "Emphasizes the resistance of the fallen creation to human cultivation."
  },
  "19": {
    "Non-Denominational": "Pronounces the ultimate consequence of Adam's sin: mortality. He will return to the dust from which he was taken, emphasizing the toil required for sustenance until death.",
    "General": "Pronounces the ultimate consequence of Adam's sin: mortality. He will return to the dust from which he was taken, emphasizing the toil required for sustenance until death.",
    "Baptist": "Physical death is decreed as the final consequence of sin, alongside ongoing toil.",
    "Catholic": "Pronounces the sentence of physical death ('return to dust') as a consequence of sin, linking toil and mortality.",
    "Methodist": "Links lifelong toil with the ultimate return to dust (physical death) as a result of sin.",
    "Lutheran": "Physical death is the ultimate temporal consequence of sin, preceded by a life of toil.",
    "Presbyterian": "The penalty of physical death ('return to dust') is pronounced as the ultimate temporal outworking of the broken covenant.",
    "Pentecostal": "Declares the sentence of physical death resulting from sin.",
    "Anglican": "Links the toil of work with the ultimate fate of physical death ('to dust you shall return').",
    "Orthodox": "Pronounces the consequence of physical mortality ('earth you are, and to earth you shall return') resulting from separation from God, the source of life."
  },
  "20": {
    "Non-Denominational": "Adam names his wife Eve, meaning 'living,' because she would become the mother of all humanity, signifying hope despite the judgment.",
    "General": "Adam names his wife Eve, meaning 'living,' because she would become the mother of all humanity, signifying hope despite the judgment.",
    "Baptist": "Adam expresses faith in God's promise (implied in v. 15) by naming Eve 'Life-giver'.",
    "Catholic": "Adam names his wife 'Eve' (Life), expressing faith in God's promise of future life and offspring despite the sentence of death.",
    "Methodist": "An act of faith: Adam names Eve focusing on her life-giving role, clinging to hope.",
    "Lutheran": "Adam names Eve 'Life', demonstrating faith in God's promise of offspring (v. 15) even under the sentence of death.",
    "Presbyterian": "Adam's naming of Eve reflects faith in God's promise of the continuation of life and the promised Seed.",
    "Pentecostal": "An act of faith amidst judgment, recognizing Eve's role as the mother of all living.",
    "Anglican": "Adam names his wife Eve ('Life'), an act signifying hope in her future role as the mother of all humanity.",
    "Orthodox": "Adam names his wife Eve ('Life'), signifying faith in God's providence and the continuation of life despite the fall into mortality."
  },
  "21": {
    "Non-Denominational": "God demonstrates mercy and provision by making garments of skin for Adam and Eve to cover their nakedness, replacing their inadequate fig leaves. This involves the first shedding of blood implied in Scripture.",
    "General": "God demonstrates mercy and provision by making garments of skin for Adam and Eve to cover their nakedness, replacing their inadequate fig leaves. This involves the first shedding of blood implied in Scripture.",
    "Baptist": "God provides a more durable covering, implying the sacrifice of animals and foreshadowing atonement through shed blood.",
    "Catholic": "God mercifully provides adequate covering (skins), implying the death of animals and pointing towards future sacrifice needed to cover sin.",
    "Methodist": "God's grace provides a better covering, hinting at the cost of sin (death) and the need for atonement.",
    "Lutheran": "God covers their shame with animal skins (implying death/sacrifice), a picture of His grace covering sin.",
    "Presbyterian": "God provides garments of skin, demonstrating grace and foreshadowing the sacrificial system needed to cover sin.",
    "Pentecostal": "God's merciful provision of covering, implying the necessity of sacrifice (shed blood) for sin.",
    "Anglican": "God provides durable clothing (skins), an act of mercy replacing their inadequate coverings, potentially foreshadowing sacrifice.",
    "Orthodox": "God provides garments of skin (interpreted by some Fathers as mortality itself, or as divine mercy covering shame, implying sacrifice)."
  },
  "22": {
    "Non-Denominational": "God acknowledges that humanity has become like Him in knowing good and evil. He expresses concern that they might also eat from the Tree of Life and live forever in their fallen state.",
    "General": "God acknowledges that humanity has become like Him in knowing good and evil. He expresses concern that they might also eat from the Tree of Life and live forever in their fallen state.",
    "Baptist": "God confirms their altered state (knowing good/evil) and acts to prevent eternal life in sin.",
    "Catholic": "God acknowledges their acquired experiential knowledge of evil and acts mercifully to prevent them from solidifying their fallen state eternally.",
    "Methodist": "God notes their changed state and acts protectively to prevent eternal separation in sin.",
    "Lutheran": "God recognizes their new, disastrous knowledge and prevents access to eternal life in this sinful state.",
    "Presbyterian": "God acknowledges their new capacity for knowing good/evil (experientially) and acts to prevent eternal existence in a state of rebellion.",
    "Pentecostal": "God recognizes their new awareness and prevents them from accessing eternal life while separated from Him.",
    "Anglican": "God acknowledges their new state ('like one of us, knowing good and evil') and prevents access to the Tree of Life to avoid eternal life in sin.",
    "Orthodox": "God acknowledges their experiential knowledge of evil and prevents access to the Tree of Life, which would mean immortalized separation from Him."
  },
  "23": {
    "Non-Denominational": "As a consequence and a protective measure, God banishes Adam and Eve from the Garden of Eden, sending them out to cultivate the ground they came from.",
    "General": "As a consequence and a protective measure, God banishes Adam and Eve from the Garden of Eden, sending them out to cultivate the ground they came from.",
    "Baptist": "Expulsion from God's presence and the ideal environment is a consequence of sin.",
    "Catholic": "God expels them from Paradise, signifying loss of intimacy and original harmony, sending them into the world of toil.",
    "Methodist": "Banishment from the Garden signifies separation from God's immediate presence and entry into a harsher world.",
    "Lutheran": "Expulsion from the Garden signifies separation from God's immediate presence and the loss of paradise.",
    "Presbyterian": "God banishes them from the Garden sanctuary, signifying broken fellowship and the consequences of covenant failure.",
    "Pentecostal": "Sin results in banishment from God's manifest presence and the perfect environment.",
    "Anglican": "God banishes them from the Garden, signifying separation and the beginning of life under the curse.",
    "Orthodox": "Expulsion from Paradise signifies the loss of direct communion with God and entry into a world subject to corruption and toil."
  },
  "24": {
    "Non-Denominational": "God drives the man out and places cherubim (powerful angelic beings) and a flaming sword flashing back and forth to guard the way to the Tree of Life, preventing access.",
    "General": "God drives the man out and places cherubim (powerful angelic beings) and a flaming sword flashing back and forth to guard the way to the Tree of Life, preventing access.",
    "Baptist": "God decisively prevents humanity from re-entering Eden and accessing the Tree of Life in their fallen state.",
    "Catholic": "God blocks access to the Tree of Life, guarded by cherubim and the flaming sword, signifying that fallen humanity cannot attain eternal life by its own efforts.",
    "Methodist": "God secures the boundary, preventing access to the Tree of Life, emphasizing the seriousness of the separation.",
    "Lutheran": "God guards the way to the Tree of Life, preventing eternal life in sin.",
    "Presbyterian": "God bars access to the Tree of Life (sacrament of eternal life), signifying the consequence of breaking the Covenant of Works.",
    "Pentecostal": "God establishes a barrier, preventing access to the Tree of Life in humanity's sinful condition.",
    "Anglican": "God expels humanity and guards the way to the Tree of Life with cherubim and a flaming sword, preventing re-entry.",
    "Orthodox": "God guards the entrance to Paradise and the Tree of Life, indicating that the path back to communion requires divine intervention, not human effort alone."
  }
} 