{
  "_comment": "Interpretations for Genesis Chapter 30",
  "book": "Genesis",
  "chapter": "30",
  "verses": {
    "1": {
      "General": "When Rachel saw that she was not bearing Jacob any children, she became jealous of her sister. So she said to Jacob, \"Give me children, or I'll die!\"",
      "Non-Denominational": "When Rachel saw that she was not bearing Jacob any children, she became jealous of her sister. So she said to Jacob, \"Give me children, or I'll die!\"",
      "Baptist": "Rachel, seeing Leah bearing children while she remains barren, becomes intensely jealous and demands children from Jacob, expressing her desperation dramatically ('Give me children, or I'll die!').",
      "Catholic": "Seeing her sister Leah bearing children while she remained childless, Rachel becomes consumed by envy. In her anguish and desperation, she confronts Jacob, demanding children with a dramatic ultimatum: 'Give me children, or I shall die!' This reflects the cultural importance placed on childbearing.",
      "Methodist": "Rachel becomes jealous of Leah's fertility and desperately demands children from Jacob ('Give me children, or I'll die!').",
      "Lutheran": "Rachel, seeing she bears no children, becomes jealous of Leah and demands children from Jacob, saying she will die otherwise.",
      "Presbyterian": "Rachel, seeing Leah's fertility, becomes jealous and desperately demands children from Jacob.",
      "Pentecostal": "Rachel gets jealous of Leah having children and demands them from Jacob.",
      "Episcopalian/Anglican": "Rachel, envious of Leah's fertility, confronts Jacob, demanding children and expressing extreme desperation.",
      "Orthodox": "Observing Leah's fruitfulness while remaining barren herself, Rachel experiences intense envy and confronts Jacob, demanding children with hyperbolic desperation.",
      "Other": "When Rachel saw that she was not bearing Jacob any children, she became jealous of her sister. So she said to Jacob, \"Give me children, or I'll die!\"",
      "Prefer not to say": "When Rachel saw that she was not bearing Jacob any children, she became jealous of her sister. So she said to Jacob, \"Give me children, or I'll die!\""
    },
    "2": {
      "General": "Jacob became angry with her and said, \"Am I in the place of God, who has kept you from having children?\"",
      "Non-Denominational": "Jacob became angry with her and said, \"Am I in the place of God, who has kept you from having children?\"",
      "Baptist": "Jacob reacts angrily to Rachel's demand, reminding her that fertility is ultimately God's domain, not his ('Am I in the place of God, who has withheld from you the fruit of the womb?').",
      "Catholic": "Jacob reacts with anger to Rachel's unreasonable demand, deflecting the responsibility back to the ultimate source of life: 'Am I in the place of God, who has withheld from you the fruit of the womb?' He points out that childbearing is a divine prerogative.",
      "Methodist": "Jacob responds angrily, pointing out that God, not he, controls fertility ('Am I in the place of God?').",
      "Lutheran": "Jacob gets angry, asking if he is God, since God has withheld children from her.",
      "Presbyterian": "Jacob responds angrily, reminding Rachel that God controls conception, not him.",
      "Pentecostal": "Jacob gets angry, saying he isn't God who controls childbirth.",
      "Episcopalian/Anglican": "Jacob responds angrily, reminding Rachel that fertility is God's prerogative, not his.",
      "Orthodox": "Jacob reacts with anger, retorting that he is not God, who is the one withholding children from her.",
      "Other": "Jacob became angry with her and said, \"Am I in the place of God, who has kept you from having children?\"",
      "Prefer not to say": "Jacob became angry with her and said, \"Am I in the place of God, who has kept you from having children?\""
    },
    "3": {
      "General": "Then she said, \"Here is Bilhah, my servant. Sleep with her so that she can bear children for me and I too can build a family through her.\"",
      "Non-Denominational": "Then she said, \"Here is Bilhah, my servant. Sleep with her so that she can bear children for me and I too can build a family through her.\"",
      "Baptist": "Rachel proposes a solution common in that era: giving her handmaid Bilhah to Jacob as a surrogate, so that children born to Bilhah would be legally considered Rachel's ('bear children for me' or 'on my knees', implying adoption/legal claim).",
      "Catholic": "Rachel proposes a culturally accepted solution: offering her handmaid, Bilhah, to Jacob as a surrogate wife. 'Go in to her, that she may bear upon my knees, and that I too may have children through her.' Children born from this union would be legally considered Rachel's, allowing her to 'build a family' through her servant.",
      "Methodist": "Rachel offers her servant Bilhah to Jacob as a surrogate, so Rachel can build a family through her (children born to Bilhah would be legally Rachel's).",
      "Lutheran": "Rachel suggests Jacob sleep with her servant Bilhah, so Bilhah can bear children for Rachel ('on my knees'), allowing Rachel to build a family through her.",
      "Presbyterian": "Rachel proposes giving her servant Bilhah to Jacob as a surrogate to bear children legally considered Rachel's.",
      "Pentecostal": "Rachel suggests Jacob have children with her servant Bilhah, to build Rachel's family.",
      "Episcopalian/Anglican": "Rachel suggests Jacob have children with her servant Bilhah, according to custom, so that Rachel might build a family through her.",
      "Orthodox": "Rachel proposes the customary practice of giving her handmaid, Bilhah, to Jacob as a concubine, so that any children born would be legally attributed to Rachel.",
      "Other": "Then she said, \"Here is Bilhah, my servant. Sleep with her so that she can bear children for me and I too can build a family through her.\"",
      "Prefer not to say": "Then she said, \"Here is Bilhah, my servant. Sleep with her so that she can bear children for me and I too can build a family through her.\""
    },
    "4": {
      "General": "So she gave him her servant Bilhah as a wife. Jacob slept with her,",
      "Non-Denominational": "So she gave him her servant Bilhah as a wife. Jacob slept with her,",
      "Baptist": "Rachel formally gives Bilhah to Jacob as a wife (or concubine), and Jacob has relations with her.",
      "Catholic": "Rachel formally gives Bilhah to Jacob as a wife (implying a recognized, though secondary, status), and Jacob consummates this arrangement.",
      "Methodist": "Rachel gives Bilhah to Jacob as a wife (concubine), and he sleeps with her.",
      "Lutheran": "Rachel gives Bilhah to Jacob as a wife, and Jacob sleeps with her.",
      "Presbyterian": "Rachel gives Bilhah to Jacob as a wife (concubine), and he sleeps with her.",
      "Pentecostal": "Rachel gives Bilhah to Jacob as a wife; he sleeps with her.",
      "Episcopalian/Anglican": "Rachel gives Bilhah to Jacob as a wife, and he sleeps with her.",
      "Orthodox": "Rachel gives Bilhah to Jacob as a (secondary) wife, and he has relations with her.",
      "Other": "So she gave him her servant Bilhah as a wife. Jacob slept with her,",
      "Prefer not to say": "So she gave him her servant Bilhah as a wife. Jacob slept with her,"
    },
    "5": {
      "General": "and she became pregnant and bore him a son.",
      "Non-Denominational": "and she became pregnant and bore him a son.",
      "Baptist": "Bilhah conceives and gives birth to a son for Jacob.",
      "Catholic": "Bilhah conceives and bears a son to Jacob.",
      "Methodist": "Bilhah conceives and bears Jacob a son.",
      "Lutheran": "Bilhah conceives and bears Jacob a son.",
      "Presbyterian": "Bilhah conceives and bears a son to Jacob.",
      "Pentecostal": "Bilhah gets pregnant and has a son.",
      "Episcopalian/Anglican": "Bilhah conceives and bears Jacob a son.",
      "Orthodox": "Bilhah conceives and gives birth to a son by Jacob.",
      "Other": "and she became pregnant and bore him a son.",
      "Prefer not to say": "and she became pregnant and bore him a son."
    },
    "6": {
      "General": "Then Rachel said, \"God has vindicated me; he has listened to my plea and given me a son.\" Because of this she named him Dan.",
      "Non-Denominational": "Then Rachel said, \"God has vindicated me; he has listened to my plea and given me a son.\" Because of this she named him Dan.",
      "Baptist": "Rachel names the son Dan (related to Hebrew 'judge' or 'vindicate'), seeing the birth as God vindicating her, hearing her prayer, and granting her a son (albeit through her servant).",
      "Catholic": "Rachel interprets the birth as divine intervention on her behalf: 'God has judged me (vindicated me), and has also heard my voice and given me a son.' She names him Dan (related to the Hebrew verb din, 'to judge' or 'vindicate'), signifying her feeling of being justified or avenged in her rivalry with Leah.",
      "Methodist": "Rachel names him Dan ('Judged'/'Vindicated'), believing God has vindicated her and heard her plea.",
      "Lutheran": "Rachel names him Dan ('Judge'), saying God has vindicated/judged her case and heard her voice.",
      "Presbyterian": "Rachel names the son Dan ('Judge'), interpreting the birth as God vindicating her and hearing her plea.",
      "Pentecostal": "Rachel names him Dan ('Judge'), feeling vindicated by God.",
      "Episcopalian/Anglican": "Rachel names him Dan ('Judge'), stating God has vindicated her and heard her plea.",
      "Orthodox": "Rachel names the child Dan (related to 'judge'), interpreting the birth as God's vindication of her cause and an answer to her prayers.",
      "Other": "Then Rachel said, \"God has vindicated me; he has listened to my plea and given me a son.\" Because of this she named him Dan.",
      "Prefer not to say": "Then Rachel said, \"God has vindicated me; he has listened to my plea and given me a son.\" Because of this she named him Dan."
    },
    "7": {
      "General": "Rachel's servant Bilhah conceived again and bore Jacob a second son.",
      "Non-Denominational": "Rachel's servant Bilhah conceived again and bore Jacob a second son.",
      "Baptist": "Bilhah conceives again and bears Jacob a second son.",
      "Catholic": "Bilhah, Rachel's handmaid, conceives again and bears Jacob a second son.",
      "Methodist": "Bilhah conceives again and bears Jacob a second son.",
      "Lutheran": "Bilhah conceives again and bears Jacob a second son.",
      "Presbyterian": "Bilhah bears Jacob a second son.",
      "Pentecostal": "Bilhah has a second son for Jacob.",
      "Episcopalian/Anglican": "Bilhah conceives again and bears Jacob a second son.",
      "Orthodox": "Bilhah bears a second son to Jacob.",
      "Other": "Rachel's servant Bilhah conceived again and bore Jacob a second son.",
      "Prefer not to say": "Rachel's servant Bilhah conceived again and bore Jacob a second son."
    },
    "8": {
      "General": "Then Rachel said, \"I have had a great struggle with my sister, and I have won.\" So she named him Naphtali.",
      "Non-Denominational": "Then Rachel said, \"I have had a great struggle with my sister, and I have won.\" So she named him Naphtali.",
      "Baptist": "Rachel names this son Naphtali (related to Hebrew 'wrestle' or 'struggle'), declaring she has engaged in mighty 'wrestlings' or 'struggles' with her sister Leah and has prevailed (by gaining sons through her servant).",
      "Catholic": "Rachel names the second son born via Bilhah, Naphtali (related to Hebrew pathal, 'to twist, wrestle'). Her explanation reveals the intense rivalry: 'With mighty wrestlings (or wrestlings of God) I have wrestled with my sister, and have prevailed.' She sees these births as victories in her struggle against Leah.",
      "Methodist": "Rachel names him Naphtali ('My Wrestling'), declaring she has wrestled fiercely with her sister and prevailed.",
      "Lutheran": "Rachel names him Naphtali ('Wrestling'), saying she has wrestled mightily with her sister and prevailed.",
      "Presbyterian": "Rachel names this son Naphtali ('Wrestling'), signifying her intense struggle with Leah, in which she feels she has prevailed.",
      "Pentecostal": "Rachel names him Naphtali ('Wrestling'), claiming victory in her struggle with Leah.",
      "Episcopalian/Anglican": "Rachel names him Naphtali ('Wrestling'), declaring she has engaged in a great struggle with her sister and has prevailed.",
      "Orthodox": "Rachel names this son Naphtali (related to 'wrestling'), expressing that she has engaged in significant struggles against her sister and has emerged victorious.",
      "Other": "Then Rachel said, \"I have had a great struggle with my sister, and I have won.\" So she named him Naphtali.",
      "Prefer not to say": "Then Rachel said, \"I have had a great struggle with my sister, and I have won.\" So she named him Naphtali."
    },
    "9": {
      "General": "When Leah saw that she had stopped having children, she gave her servant Zilpah to Jacob as a wife.",
      "Non-Denominational": "When Leah saw that she had stopped having children, she gave her servant Zilpah to Jacob as a wife.",
      "Baptist": "Leah, seeing she herself had stopped bearing children and likely motivated by Rachel's actions, follows suit and gives her handmaid Zilpah to Jacob as a wife/concubine to bear more children for her side of the family.",
      "Catholic": "Seeing that she herself had ceased bearing children, and likely reacting to Rachel's use of Bilhah, Leah adopts the same strategy. She takes her handmaid, Zilpah, and gives her to Jacob as a (secondary) wife, aiming to increase her count of sons.",
      "Methodist": "Leah, seeing she had stopped bearing children and likely competing with Rachel, gives her servant Zilpah to Jacob as a wife.",
      "Lutheran": "Leah, seeing she had stopped bearing, gives her servant Zilpah to Jacob as a wife.",
      "Presbyterian": "Leah, seeing she was no longer bearing children, gives her servant Zilpah to Jacob as a wife, emulating Rachel.",
      "Pentecostal": "Leah, seeing she stopped having children, gives her servant Zilpah to Jacob as a wife.",
      "Episcopalian/Anglican": "Leah, realizing she had stopped bearing children, gives her servant Zilpah to Jacob as a wife, following Rachel's example.",
      "Orthodox": "Observing her own cessation of childbearing, Leah emulates Rachel's tactic by giving her handmaid, Zilpah, to Jacob as a wife.",
      "Other": "When Leah saw that she had stopped having children, she gave her servant Zilpah to Jacob as a wife.",
      "Prefer not to say": "When Leah saw that she had stopped having children, she gave her servant Zilpah to Jacob as a wife."
    },
    "10": {
      "General": "Leah's servant Zilpah bore Jacob a son.",
      "Non-Denominational": "Leah's servant Zilpah bore Jacob a son.",
      "Baptist": "Zilpah bears a son for Jacob.",
      "Catholic": "Zilpah, Leah's handmaid, bears a son to Jacob.",
      "Methodist": "Zilpah bears Jacob a son.",
      "Lutheran": "Zilpah bears Jacob a son.",
      "Presbyterian": "Zilpah bears a son to Jacob.",
      "Pentecostal": "Zilpah has a son for Jacob.",
      "Episcopalian/Anglican": "Zilpah bears Jacob a son.",
      "Orthodox": "Zilpah bears a son to Jacob.",
      "Other": "Leah's servant Zilpah bore Jacob a son.",
      "Prefer not to say": "Leah's servant Zilpah bore Jacob a son."
    },
    "11": {
      "General": "Then Leah said, \"What good fortune!\" So she named him Gad.",
      "Non-Denominational": "Then Leah said, \"What good fortune!\" So she named him Gad.",
      "Baptist": "Leah names this son Gad (meaning 'good fortune' or 'troop'), exclaiming 'Good fortune has come!' or 'A troop is coming!'.",
      "Catholic": "Leah names the son Gad (meaning 'fortune' or 'luck'). Her exclamation is often translated as 'Good fortune!' or 'A troop comes!' (perhaps referring to more sons to follow), reflecting her satisfaction at adding another son to her count.",
      "Methodist": "Leah names him Gad ('Good Fortune' or 'Troop'), exclaiming 'Good fortune!'",
      "Lutheran": "Leah names him Gad ('Fortune'), saying 'Good fortune!' or 'A troop comes!'",
      "Presbyterian": "Leah names the son Gad ('Fortune'), exclaiming 'Good fortune!'",
      "Pentecostal": "Leah names him Gad ('Good Fortune').",
      "Episcopalian/Anglican": "Leah names him Gad ('Good Fortune'), exclaiming 'Good fortune!'",
      "Orthodox": "Leah names the child Gad (meaning 'good fortune'), expressing her satisfaction.",
      "Other": "Then Leah said, \"What good fortune!\" So she named him Gad.",
      "Prefer not to say": "Then Leah said, \"What good fortune!\" So she named him Gad."
    },
    "12": {
      "General": "Leah's servant Zilpah bore Jacob a second son.",
      "Non-Denominational": "Leah's servant Zilpah bore Jacob a second son.",
      "Baptist": "Zilpah bears Jacob a second son.",
      "Catholic": "Zilpah, Leah's handmaid, bears Jacob a second son.",
      "Methodist": "Zilpah bears Jacob a second son.",
      "Lutheran": "Zilpah bears Jacob a second son.",
      "Presbyterian": "Zilpah bears Jacob a second son.",
      "Pentecostal": "Zilpah has a second son for Jacob.",
      "Episcopalian/Anglican": "Zilpah bears Jacob a second son.",
      "Orthodox": "Zilpah bears a second son to Jacob.",
      "Other": "Leah's servant Zilpah bore Jacob a second son.",
      "Prefer not to say": "Leah's servant Zilpah bore Jacob a second son."
    },
    "13": {
      "General": "Then Leah said, \"How happy I am! The women will call me happy.\" So she named him Asher.",
      "Non-Denominational": "Then Leah said, \"How happy I am! The women will call me happy.\" So she named him Asher.",
      "Baptist": "Leah names this son Asher (meaning 'happy' or 'blessed'), declaring her own happiness and predicting that other women will recognize her blessed state.",
      "Catholic": "Leah names this son Asher (from Hebrew osher, 'happiness', 'blessedness'). She expresses her joy: 'Happy am I! For women will call me happy (or blessed).' She anticipates social recognition for her increased number of sons.",
      "Methodist": "Leah names him Asher ('Happy'/'Blessed'), expressing her happiness and expecting others to recognize her fortune.",
      "Lutheran": "Leah names him Asher ('Happy'), saying she is happy and women will call her blessed/happy.",
      "Presbyterian": "Leah names the son Asher ('Happy'), expressing her joy and anticipating recognition from other women.",
      "Pentecostal": "Leah names him Asher ('Happy'), saying she is happy and women will call her happy.",
      "Episcopalian/Anglican": "Leah names him Asher ('Happy'), declaring her happiness and anticipating that other women will call her blessed.",
      "Orthodox": "Leah names this son Asher (related to 'happiness'), expressing her own joy and predicting that other women will acknowledge her blessed state.",
      "Other": "Then Leah said, \"How happy I am! The women will call me happy.\" So she named him Asher.",
      "Prefer not to say": "Then Leah said, \"How happy I am! The women will call me happy.\" So she named him Asher."
    },
    "14": {
      "General": "During wheat harvest, Reuben went out into the fields and found some mandrake plants, which he brought to his mother Leah. Rachel said to Leah, \"Please give me some of your son's mandrakes.\"",
      "Non-Denominational": "During wheat harvest, Reuben went out into the fields and found some mandrake plants, which he brought to his mother Leah. Rachel said to Leah, \"Please give me some of your son's mandrakes.\"",
      "Baptist": "Reuben (Leah's eldest) finds mandrakes (plants believed to aid fertility) and brings them to Leah. Rachel, still desperate for children, asks Leah for some of the mandrakes.",
      "Catholic": "During the wheat harvest, Leah's son Reuben finds mandrakes in the field. Mandrakes were popularly believed to be an aphrodisiac or fertility aid. He brings them to Leah. Rachel, seeing the mandrakes and still longing for children, asks Leah to give her some.",
      "Methodist": "Reuben finds mandrakes (believed to aid fertility) and gives them to Leah. Rachel asks Leah for some.",
      "Lutheran": "Reuben finds mandrakes (thought to aid conception) during wheat harvest and brings them to Leah. Rachel asks Leah for some.",
      "Presbyterian": "Reuben finds mandrakes (believed to promote fertility) and brings them to Leah. Rachel requests some from Leah.",
      "Pentecostal": "Reuben finds mandrakes (thought to help fertility) and gives them to Leah; Rachel asks for some.",
      "Episcopalian/Anglican": "Reuben finds mandrakes (believed to be fertility aids) and brings them to Leah. Rachel asks Leah for some.",
      "Orthodox": "Reuben finds mandrakes, plants associated with fertility, and gives them to Leah. Rachel requests some of these mandrakes from her sister.",
      "Other": "During wheat harvest, Reuben went out into the fields and found some mandrake plants, which he brought to his mother Leah. Rachel said to Leah, \"Please give me some of your son's mandrakes.\"",
      "Prefer not to say": "During wheat harvest, Reuben went out into the fields and found some mandrake plants, which he brought to his mother Leah. Rachel said to Leah, \"Please give me some of your son's mandrakes.\""
    },
    "15": {
      "General": "But she said to her, \"Wasn't it enough that you took away my husband? Will you take my son's mandrakes too?\" \"Very well,\" Rachel said, \"he can sleep with you tonight in return for your son's mandrakes.\"",
      "Non-Denominational": "But she said to her, \"Wasn't it enough that you took away my husband? Will you take my son's mandrakes too?\" \"Very well,\" Rachel said, \"he can sleep with you tonight in return for your son's mandrakes.\"",
      "Baptist": "Leah reacts bitterly, accusing Rachel of having already taken her husband (Jacob's affection/primary attention) and now wanting the mandrakes too. Rachel, prioritizing the potential fertility aid over her night with Jacob, bargains: Jacob can sleep with Leah that night in exchange for the mandrakes.",
      "Catholic": "Leah responds sharply, revealing her underlying bitterness: 'Is it a small matter that you have taken away my husband? Would you take away my son's mandrakes also?' She feels Rachel already possesses Jacob's love and resents her desire for the mandrakes. Rachel, desperate for the mandrakes, makes a deal: she will allow Jacob to sleep with Leah that night in exchange for the mandrakes.",
      "Methodist": "Leah bitterly refuses, accusing Rachel of taking her husband. Rachel bargains, offering Leah Jacob's company for the night in exchange for the mandrakes.",
      "Lutheran": "Leah refuses bitterly, accusing Rachel of taking her husband. Rachel offers Leah Jacob's company that night in exchange for the mandrakes.",
      "Presbyterian": "Leah responds bitterly, accusing Rachel of having taken Jacob's affection. Rachel proposes a trade: the mandrakes for Jacob's company that night.",
      "Pentecostal": "Leah refuses bitterly; Rachel trades her night with Jacob for the mandrakes.",
      "Episcopalian/Anglican": "Leah refuses bitterly, accusing Rachel of taking her husband. Rachel proposes a trade: Jacob's company for the night in exchange for the mandrakes.",
      "Orthodox": "Leah reacts with bitterness, accusing Rachel of usurping Jacob's affection. Rachel then proposes a bargain: Leah may have Jacob for the night in exchange for the mandrakes.",
      "Other": "But she said to her, \"Wasn't it enough that you took away my husband? Will you take my son's mandrakes too?\" \"Very well,\" Rachel said, \"he can sleep with you tonight in return for your son's mandrakes.\"",
      "Prefer not to say": "But she said to her, \"Wasn't it enough that you took away my husband? Will you take my son's mandrakes too?\" \"Very well,\" Rachel said, \"he can sleep with you tonight in return for your son's mandrakes.\""
    },
    "16": {
      "General": "So when Jacob came in from the fields that evening, Leah went out to meet him. \"You must sleep with me,\" she said. \"I have hired you with my son's mandrakes.\" So he slept with her that night.",
      "Non-Denominational": "So when Jacob came in from the fields that evening, Leah went out to meet him. \"You must sleep with me,\" she said. \"I have hired you with my son's mandrakes.\" So he slept with her that night.",
      "Baptist": "Leah proactively meets Jacob upon his return from the field and informs him of the arrangement, stating she has 'hired' him with the mandrakes. Jacob complies and sleeps with Leah.",
      "Catholic": "When Jacob returns from the field in the evening, Leah intercepts him and asserts her claim based on the agreement: 'You must come in to me, for I have hired you with my son's mandrakes.' Jacob complies with the arrangement made between his wives and spends the night with Leah.",
      "Methodist": "Leah intercepts Jacob and informs him she has 'hired' him for the night with the mandrakes. Jacob sleeps with her.",
      "Lutheran": "Leah meets Jacob returning from the field and tells him she has hired him with the mandrakes. Jacob sleeps with her that night.",
      "Presbyterian": "Leah meets Jacob and informs him she has 'hired' him for the night with the mandrakes. Jacob complies.",
      "Pentecostal": "Leah tells Jacob she hired him with mandrakes; he sleeps with her.",
      "Episcopalian/Anglican": "Leah intercepts Jacob upon his return and informs him she has 'hired' him with the mandrakes. He sleeps with her that night.",
      "Orthodox": "Leah meets Jacob upon his return and informs him of the arrangement, stating she has 'hired' him with the mandrakes. Jacob spends the night with her.",
      "Other": "So when Jacob came in from the fields that evening, Leah went out to meet him. \"You must sleep with me,\" she said. \"I have hired you with my son's mandrakes.\" So he slept with her that night.",
      "Prefer not to say": "So when Jacob came in from the fields that evening, Leah went out to meet him. \"You must sleep with me,\" she said. \"I have hired you with my son's mandrakes.\" So he slept with her that night."
    },
    "17": {
      "General": "God listened to Leah, and she became pregnant and bore Jacob a fifth son.",
      "Non-Denominational": "God listened to Leah, and she became pregnant and bore Jacob a fifth son.",
      "Baptist": "God responds to Leah (perhaps her prayer or her situation) and allows her to conceive again, bearing Jacob's fifth son through her.",
      "Catholic": "God 'hearkened to Leah' (implying He heard her prayers or responded to her circumstances resulting from the mandrake deal), and she conceived again, bearing Jacob a fifth son.",
      "Methodist": "God hears Leah (responds to her situation/prayer), and she conceives and bears Jacob a fifth son.",
      "Lutheran": "God listens to Leah, and she conceives and bears Jacob a fifth son.",
      "Presbyterian": "God responds to Leah, and she conceives and bears Jacob's fifth son.",
      "Pentecostal": "God listens to Leah; she has a fifth son.",
      "Episcopalian/Anglican": "God listens to Leah, and she conceives and bears Jacob a fifth son.",
      "Orthodox": "God heeds Leah, enabling her to conceive and bear Jacob a fifth son.",
      "Other": "God listened to Leah, and she became pregnant and bore Jacob a fifth son.",
      "Prefer not to say": "God listened to Leah, and she became pregnant and bore Jacob a fifth son."
    },
    "18": {
      "General": "Then Leah said, \"God has rewarded me for giving my servant to my husband.\" So she named him Issachar.",
      "Non-Denominational": "Then Leah said, \"God has rewarded me for giving my servant to my husband.\" So she named him Issachar.",
      "Baptist": "Leah names this son Issachar (possibly related to Hebrew 'wage' or 'reward'), interpreting his birth as God's reward either for giving her handmaid Zilpah to Jacob or perhaps related to the 'hiring' with mandrakes.",
      "Catholic": "Leah names him Issachar (related to Hebrew sakar, 'wage' or 'reward'). Her explanation links the birth to her previous actions: 'God has given me my wages because I gave my handmaid to my husband.' She sees this son as compensation or reward, possibly connecting it back to the mandrake transaction as well.",
      "Methodist": "Leah names him Issachar ('Reward'/'Wages'), seeing the son as God's reward for giving Zilpah to Jacob (or for the mandrake transaction).",
      "Lutheran": "Leah names him Issachar ('There is reward/wage'), saying God has given her a reward because she gave her servant to her husband.",
      "Presbyterian": "Leah names the son Issachar ('Reward'), seeing his birth as God's reward for giving her servant to Jacob.",
      "Pentecostal": "Leah names him Issachar ('Reward'), seeing him as God's reward.",
      "Episcopalian/Anglican": "Leah names him Issachar ('Reward'), stating God has given her a reward for giving her servant to her husband.",
      "Orthodox": "Leah names him Issachar (related to 'reward'), interpreting the birth as divine compensation for having given her handmaid to Jacob.",
      "Other": "Then Leah said, \"God has rewarded me for giving my servant to my husband.\" So she named him Issachar.",
      "Prefer not to say": "Then Leah said, \"God has rewarded me for giving my servant to my husband.\" So she named him Issachar."
    },
    "19": {
      "General": "Leah conceived again and bore Jacob a sixth son.",
      "Non-Denominational": "Leah conceived again and bore Jacob a sixth son.",
      "Baptist": "Leah conceives yet again and bears Jacob's sixth son through her.",
      "Catholic": "Leah conceives once more and bears Jacob a sixth son.",
      "Methodist": "Leah conceives again and bears Jacob a sixth son.",
      "Lutheran": "Leah conceives again and bears Jacob a sixth son.",
      "Presbyterian": "Leah bears Jacob a sixth son.",
      "Pentecostal": "Leah has a sixth son.",
      "Episcopalian/Anglican": "Leah conceives again and bears Jacob a sixth son.",
      "Orthodox": "Leah bears Jacob a sixth son.",
      "Other": "Leah conceived again and bore Jacob a sixth son.",
      "Prefer not to say": "Leah conceived again and bore Jacob a sixth son."
    },
    "20": {
      "General": "Then Leah said, \"God has presented me with a precious gift. This time my husband will treat me with honor, because I have borne him six sons.\" So she named him Zebulun.",
      "Non-Denominational": "Then Leah said, \"God has presented me with a precious gift. This time my husband will treat me with honor, because I have borne him six sons.\" So she named him Zebulun.",
      "Baptist": "Leah names this son Zebulun (related to Hebrew 'honor' or 'dwell'). She sees him as a 'precious gift' from God and hopes that having six sons will finally lead Jacob to honor her or 'dwell' with her (give her precedence or live with her primarily).",
      "Catholic": "Leah names her sixth son Zebulun (related to Hebrew zabal, 'to exalt, honor' or zabad, 'to endow, gift'). She declares, 'God has endowed me with a good endowment; now my husband will honor me (or dwell with me), because I have borne him six sons.' Her naming reflects both gratitude for God's gift and a persistent hope for honor and acceptance from Jacob.",
      "Methodist": "Leah names him Zebulun ('Honor'/'Dwelling'), seeing him as a gift from God and hoping Jacob will now honor her or dwell with her because she has six sons.",
      "Lutheran": "Leah names him Zebulun ('Honor'/'Dwelling'), saying God has endowed her well and hoping Jacob will now honor/dwell with her.",
      "Presbyterian": "Leah names the son Zebulun ('Honor'/'Dwelling'), seeing him as a divine gift and hoping Jacob will finally honor her.",
      "Pentecostal": "Leah names him Zebulun ('Honor'/'Dwelling'), hoping Jacob will honor her now.",
      "Episcopalian/Anglican": "Leah names him Zebulun ('Honor'/'Dwelling'), stating God has given her a precious gift and hoping Jacob will now honor her.",
      "Orthodox": "Leah names him Zebulun (related to 'honor' or 'dwelling'), perceiving him as a valuable gift from God and expressing hope that Jacob will finally honor her or primarily reside with her.",
      "Other": "Then Leah said, \"God has presented me with a precious gift. This time my husband will treat me with honor, because I have borne him six sons.\" So she named him Zebulun.",
      "Prefer not to say": "Then Leah said, \"God has presented me with a precious gift. This time my husband will treat me with honor, because I have borne him six sons.\" So she named him Zebulun."
    },
    "21": {
      "General": "Some time later she gave birth to a daughter and named her Dinah.",
      "Non-Denominational": "Some time later she gave birth to a daughter and named her Dinah.",
      "Baptist": "Leah subsequently gives birth to a daughter, named Dinah.",
      "Catholic": "Afterwards, Leah gives birth to a daughter and names her Dinah (feminine form related to Dan, 'judged'). No specific reason for the name is given here.",
      "Methodist": "Leah later bears a daughter named Dinah.",
      "Lutheran": "Afterward, Leah bears a daughter and names her Dinah.",
      "Presbyterian": "Leah subsequently bears a daughter named Dinah.",
      "Pentecostal": "Later, Leah has a daughter, Dinah.",
      "Episcopalian/Anglican": "Later, Leah bears a daughter and names her Dinah.",
      "Orthodox": "Subsequently, Leah gives birth to a daughter, whom she names Dinah.",
      "Other": "Some time later she gave birth to a daughter and named her Dinah.",
      "Prefer not to say": "Some time later she gave birth to a daughter and named her Dinah."
    },
    "22": {
      "General": "Then God remembered Rachel; he listened to her and enabled her to conceive.",
      "Non-Denominational": "Then God remembered Rachel; he listened to her and enabled her to conceive.",
      "Baptist": "Finally, God turns His attention to Rachel ('remembered Rachel'), listens to her prayers/situation, and opens her womb, allowing her to conceive.",
      "Catholic": "Then God 'remembered' Rachel (an idiom meaning He turned His attention to her situation with favor), 'listened to her' (heard her prayers), and 'opened her womb,' finally enabling her to conceive her own child.",
      "Methodist": "God remembers Rachel (turns attention to her), listens to her, and opens her womb.",
      "Lutheran": "God remembers Rachel, listens to her, and opens her womb.",
      "Presbyterian": "God remembers Rachel, responds to her prayers, and enables her to conceive.",
      "Pentecostal": "God remembers Rachel, listens, and opens her womb.",
      "Episcopalian/Anglican": "God remembers Rachel, listens to her plea, and enables her to conceive.",
      "Orthodox": "God then turns His attention to Rachel, heeds her prayers, and enables her to conceive.",
      "Other": "Then God remembered Rachel; he listened to her and enabled her to conceive.",
      "Prefer not to say": "Then God remembered Rachel; he listened to her and enabled her to conceive."
    },
    "23": {
      "General": "She became pregnant and gave birth to a son and said, \"God has taken away my disgrace.\"",
      "Non-Denominational": "She became pregnant and gave birth to a son and said, \"God has taken away my disgrace.\"",
      "Baptist": "Rachel conceives and bears a son, declaring that God has removed her 'disgrace' or 'reproach' (the social stigma associated with barrenness in that culture).",
      "Catholic": "Rachel conceives and bears a son. Her immediate reaction is relief and gratitude: 'God has taken away my reproach.' Childlessness was considered a significant social disgrace, and this birth removes that burden from her.",
      "Methodist": "Rachel conceives and bears a son, declaring God has removed her disgrace (of barrenness).",
      "Lutheran": "Rachel conceives, bears a son, and says God has taken away her reproach/disgrace.",
      "Presbyterian": "Rachel bears a son and declares God has removed her disgrace (of childlessness).",
      "Pentecostal": "Rachel has a son, saying God took away her disgrace.",
      "Episcopalian/Anglican": "Rachel conceives and bears a son, declaring God has taken away her disgrace.",
      "Orthodox": "Rachel gives birth to a son and proclaims that God has removed her societal reproach associated with childlessness.",
      "Other": "She became pregnant and gave birth to a son and said, \"God has taken away my disgrace.\"",
      "Prefer not to say": "She became pregnant and gave birth to a son and said, \"God has taken away my disgrace.\""
    },
    "24": {
      "General": "She named him Joseph, and said, \"May the Lord add to me another son.\"",
      "Non-Denominational": "She named him Joseph, and said, \"May the Lord add to me another son.\"",
      "Baptist": "She names him Joseph (related to Hebrew 'take away' and 'add'), reflecting both the removal of her disgrace and her prayer/hope that God will 'add' another son to her.",
      "Catholic": "She names him Joseph ( Yoseph), playing on two Hebrew verbs: asaph ('to take away, gather') because God had 'taken away' her reproach, and yasaph ('to add') expressing her prayer, 'May the Lord add to me another son!'",
      "Methodist": "She names him Joseph (related to 'Take Away' and 'Add'), signifying God taking away her disgrace and praying for another son.",
      "Lutheran": "She names him Joseph (related to 'take away' and 'add'), praying Yahweh will add another son.",
      "Presbyterian": "She names him Joseph (related to 'Take Away' and 'Add'), signifying the removal of disgrace and praying for another son.",
      "Pentecostal": "She names him Joseph ('May He Add'), praying for another son.",
      "Episcopalian/Anglican": "She names him Joseph (related to 'Take Away' and 'Add'), praying the Lord will add another son.",
      "Orthodox": "She names him Joseph (punning on 'take away' and 'add'), signifying the removal of her reproach and expressing a prayer for an additional son.",
      "Other": "She named him Joseph, and said, \"May the Lord add to me another son.\"",
      "Prefer not to say": "She named him Joseph, and said, \"May the Lord add to me another son.\""
    },
    "25": {
      "General": "After Rachel gave birth to Joseph, Jacob said to Laban, \"Send me on my way so I can go back to my own homeland.",
      "Non-Denominational": "After Rachel gave birth to Joseph, Jacob said to Laban, \"Send me on my way so I can go back to my own homeland.",
      "Baptist": "Following Joseph's birth (perhaps seeing it as a sign or completion), Jacob decides it's time to leave Laban and return to Canaan. He asks Laban to release him and his family.",
      "Catholic": "After the birth of Joseph (a significant event, as Joseph becomes a key figure), Jacob feels it is time to return home. He formally requests permission from Laban: 'Send me away, that I may go to my own home and country.'",
      "Methodist": "After Joseph's birth, Jacob asks Laban to let him and his family return to his homeland (Canaan).",
      "Lutheran": "After Joseph's birth, Jacob asks Laban to let him go back to his own place and country.",
      "Presbyterian": "After Joseph is born, Jacob asks Laban for permission to return to his homeland with his family.",
      "Pentecostal": "After Joseph's birth, Jacob asks Laban to let him go home.",
      "Episcopalian/Anglican": "After Joseph's birth, Jacob asks Laban to allow him to return to his own homeland.",
      "Orthodox": "Following the birth of Joseph, Jacob requests Laban's permission to depart and return to his homeland.",
      "Other": "After Rachel gave birth to Joseph, Jacob said to Laban, \"Send me on my way so I can go back to my own homeland.",
      "Prefer not to say": "After Rachel gave birth to Joseph, Jacob said to Laban, \"Send me on my way so I can go back to my own homeland."
    },
    "26": {
      "General": "Give me my wives and children, for whom I have served you, and I will be on my way. You know how much work I've done for you.\"",
      "Non-Denominational": "Give me my wives and children, for whom I have served you, and I will be on my way. You know how much work I've done for you.\"",
      "Baptist": "Jacob specifies he wants his wives and children (for whom he served Laban for 14 years) and reminds Laban of the faithful service he has rendered.",
      "Catholic": "Jacob explicitly requests his wives and children, reminding Laban that he earned them through his service: 'Give me my wives and my children for whom I have served you, and let me go; for you know the service which I have given you.' He asserts he has fulfilled his obligations.",
      "Methodist": "Jacob requests his wives and children (earned through service) and reminds Laban of his hard work.",
      "Lutheran": "Jacob asks for his wives and children, for whom he served Laban, reminding Laban of his service.",
      "Presbyterian": "Jacob asks for his wives and children, earned through service, reminding Laban of his diligence.",
      "Pentecostal": "Jacob asks for his wives and children, reminding Laban of his service.",
      "Episcopalian/Anglican": "Jacob asks for his wives and children, earned through his service, and reminds Laban of his hard work.",
      "Orthodox": "Jacob requests his wives and children, reminding Laban they were acquired through his servitude and emphasizing the quality of his work.",
      "Other": "Give me my wives and children, for whom I have served you, and I will be on my way. You know how much work I've done for you.\"",
      "Prefer not to say": "Give me my wives and children, for whom I have served you, and I will be on my way. You know how much work I've done for you.\""
    },
    "27": {
      "General": "But Laban said to him, \"If I have found favor in your eyes, please stay. I have learned by divination that the Lord has blessed me because of you.\"",
      "Non-Denominational": "But Laban said to him, \"If I have found favor in your eyes, please stay. I have learned by divination that the Lord has blessed me because of you.\"",
      "Baptist": "Laban, reluctant to lose Jacob, appeals to him to stay. He acknowledges, possibly through divination or observation, that his own prosperity is due to God blessing him *because of* Jacob.",
      "Catholic": "Laban is unwilling to let Jacob go. He appeals to Jacob ('If I have found favor in your sight...') and reveals his motive: 'I have learned by divination that the Lord has blessed me because of you.' Laban recognizes Jacob is the source of his prosperity, attributing it to the Lord's blessing on Jacob.",
      "Methodist": "Laban urges Jacob to stay, admitting he has learned (perhaps through divination) that the Lord has blessed him because of Jacob's presence.",
      "Lutheran": "Laban asks Jacob to stay if he has found favor, stating he has learned by divination that Yahweh has blessed him because of Jacob.",
      "Presbyterian": "Laban urges Jacob to stay, acknowledging that he has prospered due to the Lord blessing him on account of Jacob (possibly learned via divination).",
      "Pentecostal": "Laban asks Jacob to stay, saying he learned through divination that God blessed him because of Jacob.",
      "Episcopalian/Anglican": "Laban urges Jacob to stay, acknowledging (possibly through divination) that the Lord has blessed him on Jacob's account.",
      "Orthodox": "Laban requests Jacob remain, admitting he has discerned (possibly through divination) that his prosperity is a result of the Lord's blessing bestowed upon him due to Jacob's presence.",
      "Other": "But Laban said to him, \"If I have found favor in your eyes, please stay. I have learned by divination that the Lord has blessed me because of you.\"",
      "Prefer not to say": "But Laban said to him, \"If I have found favor in your eyes, please stay. I have learned by divination that the Lord has blessed me because of you.\""
    },
    "28": {
      "General": "He added, \"Name your wages, and I will pay them.\"",
      "Non-Denominational": "He added, \"Name your wages, and I will pay them.\"",
      "Baptist": "To entice Jacob to stay, Laban offers to renegotiate his wages, inviting Jacob to name his price.",
      "Catholic": "To persuade Jacob to stay, Laban makes an open-ended offer: 'Name your wages, and I will give it.' He is willing to pay Jacob well to retain his services.",
      "Methodist": "Laban offers to let Jacob name his wages to persuade him to stay.",
      "Lutheran": "Laban tells Jacob to name his wages, and he will pay them.",
      "Presbyterian": "Laban offers Jacob the opportunity to name his wages as an incentive to stay.",
      "Pentecostal": "Laban offers to pay Jacob whatever wages he names.",
      "Episcopalian/Anglican": "Laban invites Jacob to name his wages as an incentive to stay.",
      "Orthodox": "Laban offers Jacob the opportunity to set his own wages as an enticement to remain in his service.",
      "Other": "He added, \"Name your wages, and I will pay them.\"",
      "Prefer not to say": "He added, \"Name your wages, and I will pay them.\""
    },
    "29": {
      "General": "Jacob said to him, \"You know how I have worked for you and how your livestock has fared under my care.",
      "Non-Denominational": "Jacob said to him, \"You know how I have worked for you and how your livestock has fared under my care.",
      "Baptist": "Jacob begins his negotiation by reminding Laban of his faithful and effective service, emphasizing how Laban's flocks prospered under his management.",
      "Catholic": "Jacob prefaces his wage proposal by reminding Laban of his proven track record: 'You yourself know how I have served you, and how your livestock has fared with me.' He emphasizes his value as an employee.",
      "Methodist": "Jacob reminds Laban of his hard work and how the livestock prospered under his care.",
      "Lutheran": "Jacob reminds Laban how he served him and how his livestock fared under Jacob's care.",
      "Presbyterian": "Jacob reminds Laban of his faithful service and the prosperity Laban's flocks experienced under his care.",
      "Pentecostal": "Jacob reminds Laban of his good work and how the livestock prospered.",
      "Episcopalian/Anglican": "Jacob reminds Laban of his dedicated service and how the livestock prospered under his care.",
      "Orthodox": "Jacob reminds Laban of the quality of his service and the resulting prosperity of Laban's livestock.",
      "Other": "Jacob said to him, \"You know how I have worked for you and how your livestock has fared under my care.",
      "Prefer not to say": "Jacob said to him, \"You know how I have worked for you and how your livestock has fared under my care."
    },
    "30": {
      "General": "The little you had before I came has increased greatly, and the Lord has blessed you wherever I have been. But now, when may I do something for my own household?\"",
      "Non-Denominational": "The little you had before I came has increased greatly, and the Lord has blessed you wherever I have been. But now, when may I do something for my own household?\"",
      "Baptist": "Jacob highlights the significant increase in Laban's wealth since his arrival, attributing it to God's blessing following him. He then pivots, stating it's now time for him to build up his *own* household.",
      "Catholic": "Jacob contrasts Laban's initial modest holdings with his current great wealth ('For you had little before I came, and it has increased abundantly'), explicitly linking this prosperity to the Lord's blessing that accompanied Jacob's efforts ('The Lord has blessed you wherever I turned'). Having established Laban's debt to him, Jacob poses the crucial question: 'But now when shall I provide for my own household also?' He needs to build his own wealth.",
      "Methodist": "Jacob emphasizes Laban's wealth greatly increased due to the Lord's blessing on Jacob's work, and asks when he can provide for his own family.",
      "Lutheran": "Jacob points out Laban had little before he came, but it increased greatly, as Yahweh blessed Laban wherever Jacob went. He asks when he can provide for his own household.",
      "Presbyterian": "Jacob contrasts Laban's former poverty with his current wealth, attributing it to God's blessing on Jacob's work, and asserts his need to provide for his own family.",
      "Pentecostal": "Jacob notes Laban's wealth increased because of him, and asks when he can provide for his own family.",
      "Episcopalian/Anglican": "Jacob points out Laban's wealth greatly increased due to the Lord's blessing following Jacob, and asks when he can provide for his own household.",
      "Orthodox": "Jacob highlights the substantial increase in Laban's wealth since his arrival, attributing it to the Lord's blessing accompanying his efforts, and raises the need to provide for his own household.",
      "Other": "The little you had before I came has increased greatly, and the Lord has blessed you wherever I have been. But now, when may I do something for my own household?\"",
      "Prefer not to say": "The little you had before I came has increased greatly, and the Lord has blessed you wherever I have been. But now, when may I do something for my own household?\""
    },
    "31": {
      "General": "\"What shall I pay you?\" Laban asked. \"Don't pay me anything,\" Jacob replied. \"But if you will do this one thing for me, I will go on tending your flocks and watching over them:",
      "Non-Denominational": "\"What shall I pay you?\" Laban asked. \"Don't pay me anything,\" Jacob replied. \"But if you will do this one thing for me, I will go on tending your flocks and watching over them:",
      "Baptist": "Laban repeats his offer for Jacob to name a wage. Jacob surprisingly refuses a direct wage, proposing instead a specific arrangement for building his own flock from Laban's.",
      "Catholic": "Laban presses for a wage: 'What shall I give you?' Jacob declines a conventional salary ('You shall not give me anything') and instead proposes a specific plan that will allow him to build his own flock while still tending Laban's.",
      "Methodist": "Laban asks again about wages. Jacob refuses direct payment, proposing instead a plan to build his own flock from Laban's.",
      "Lutheran": "Laban asks what he should give Jacob. Jacob refuses payment but proposes a plan to tend Laban's flocks.",
      "Presbyterian": "Laban again asks about wages. Jacob declines payment and proposes an alternative arrangement for tending the flocks.",
      "Pentecostal": "Laban asks again; Jacob refuses payment and proposes a deal.",
      "Episcopalian/Anglican": "Laban asks again what wage Jacob wants. Jacob refuses direct payment and proposes a specific arrangement.",
      "Orthodox": "Laban repeats his inquiry about wages. Jacob declines monetary compensation and proposes a specific arrangement for managing the flocks.",
      "Other": "\"What shall I pay you?\" Laban asked. \"Don't pay me anything,\" Jacob replied. \"But if you will do this one thing for me, I will go on tending your flocks and watching over them:",
      "Prefer not to say": "\"What shall I pay you?\" Laban asked. \"Don't pay me anything,\" Jacob replied. \"But if you will do this one thing for me, I will go on tending your flocks and watching over them:"
    },
    "32": {
      "General": "Let me go through all your flocks today and remove from them every speckled or spotted sheep, every dark-colored lamb and every spotted or speckled goat. They will be my wages.",
      "Non-Denominational": "Let me go through all your flocks today and remove from them every speckled or spotted sheep, every dark-colored lamb and every spotted or speckled goat. They will be my wages.",
      "Baptist": "Jacob's proposal: He will remove all currently existing speckled, spotted, and dark-colored sheep and goats from Laban's flocks. *Going forward*, any such unusually colored animals born will belong to Jacob as his wages.",
      "Catholic": "Jacob proposes his terms: he will first go through Laban's entire flock and remove all the sheep and goats that are *currently* speckled, spotted, or black (among sheep). These removed animals remain Laban's. Then, Jacob will continue tending the remaining (presumably solid white/light colored) flock. *Any* speckled, spotted, or black offspring born *in the future* from this separated flock will be Jacob's wages.",
      "Methodist": "Jacob proposes removing all currently speckled/spotted sheep/goats and dark lambs. Going forward, any such animals born in Laban's flocks will be Jacob's wages.",
      "Lutheran": "Jacob proposes removing all speckled/spotted sheep, dark lambs, and spotted/speckled goats from Laban's flock *now*. Any such animals born *later* will be Jacob's wages.",
      "Presbyterian": "Jacob proposes removing all existing speckled, spotted, or dark sheep and goats. Any such animals born subsequently will constitute his wages.",
      "Pentecostal": "Jacob proposes removing all speckled/spotted/dark animals now; any born later will be his wages.",
      "Episcopalian/Anglican": "Jacob proposes removing all currently speckled, spotted, or dark-colored sheep and goats. Any such animals born in the future will be his wages.",
      "Orthodox": "Jacob proposes to first remove all existing speckled, spotted, and dark-colored animals from Laban's flocks. Subsequently, any offspring with these non-standard colorations born within the remaining flock will constitute Jacob's wages.",
      "Other": "Let me go through all your flocks today and remove from them every speckled or spotted sheep, every dark-colored lamb and every spotted or speckled goat. They will be my wages.",
      "Prefer not to say": "Let me go through all your flocks today and remove from them every speckled or spotted sheep, every dark-colored lamb and every spotted or speckled goat. They will be my wages."
    },
    "33": {
      "General": "And my honesty will testify for me in the future, whenever you check on the wages you have paid me. Any goat in my possession that is not speckled or spotted, or any lamb that is not dark-colored, will be considered stolen.\"",
      "Non-Denominational": "And my honesty will testify for me in the future, whenever you check on the wages you have paid me. Any goat in my possession that is not speckled or spotted, or any lamb that is not dark-colored, will be considered stolen.\"",
      "Baptist": "Jacob presents this arrangement as self-policing: Laban can easily check Jacob's integrity. Any solid-colored animal found among Jacob's flock (which should only contain speckled/spotted/dark ones) would prove Jacob had stolen it.",
      "Catholic": "Jacob presents this as a system ensuring his honesty: 'So my righteousness will answer for me later, when you come to look into my wages.' Any goat in Jacob's possession that isn't speckled/spotted, or any sheep that isn't black, will be considered stolen, making it easy for Laban to verify Jacob is only taking his due.",
      "Methodist": "Jacob emphasizes the fairness: Laban can easily check his honesty, as any solid-colored animal among Jacob's flock would be considered stolen.",
      "Lutheran": "Jacob says his honesty will be clear later: any goat not speckled/spotted or lamb not dark among his wages will be counted as stolen.",
      "Presbyterian": "Jacob argues the arrangement guarantees his honesty, as any solid-colored animal found in his flock would clearly be stolen.",
      "Pentecostal": "Jacob says this proves his honesty; any solid-colored animals with him would be stolen.",
      "Episcopalian/Anglican": "Jacob presents this as a test of his honesty: any animal in his possession not meeting the criteria (speckled/spotted/dark) will be considered stolen.",
      "Orthodox": "Jacob asserts this method ensures transparency and his integrity: any animal in his flock lacking the agreed-upon markings would be self-evidently stolen from Laban.",
      "Other": "And my honesty will testify for me in the future, whenever you check on the wages you have paid me. Any goat in my possession that is not speckled or spotted, or any lamb that is not dark-colored, will be considered stolen.\"",
      "Prefer not to say": "And my honesty will testify for me in the future, whenever you check on the wages you have paid me. Any goat in my possession that is not speckled or spotted, or any lamb that is not dark-colored, will be considered stolen.\""
    },
    "34": {
      "General": "\"Agreed,\" said Laban. \"Let it be as you have said.\"",
      "Non-Denominational": "\"Agreed,\" said Laban. \"Let it be as you have said.\"",
      "Baptist": "Laban agrees to Jacob's terms, likely thinking this heavily favors himself since unusually colored animals were rare.",
      "Catholic": "Laban readily agrees ('Good! Let it be as you have said.'), likely believing this arrangement strongly favors him, as unusually colored offspring were considered uncommon.",
      "Methodist": "Laban agrees, likely thinking the deal favors him since such offspring were rare.",
      "Lutheran": "Laban agrees to Jacob's terms.",
      "Presbyterian": "Laban agrees, likely believing the terms favor him.",
      "Pentecostal": "Laban agrees.",
      "Episcopalian/Anglican": "Laban agrees to Jacob's proposal.",
      "Orthodox": "Laban consents to the terms, presumably believing them advantageous to himself due to the rarity of such markings.",
      "Other": "\"Agreed,\" said Laban. \"Let it be as you have said.\"",
      "Prefer not to say": "\"Agreed,\" said Laban. \"Let it be as you have said.\""
    },
    "35": {
      "General": "That same day Laban removed all the male goats that were streaked or spotted, and all the female goats that were speckled or spotted or had any white on them, and all the dark-colored lambs, and he placed them in the care of his sons.",
      "Non-Denominational": "That same day Laban removed all the male goats that were streaked or spotted, and all the female goats that were speckled or spotted or had any white on them, and all the dark-colored lambs, and he placed them in the care of his sons.",
      "Baptist": "Laban, however, immediately acts somewhat deceitfully *within* the agreement. He removes not only the animals Jacob specified but *all* males with any streaks/spots and females with any white, plus the dark lambs, essentially taking away the breeding stock most likely to produce the offspring Jacob was due. He entrusts these removed animals to his own sons.",
      "Catholic": "Laban, however, immediately takes steps to minimize Jacob's potential gain. *That same day*, he removes not just the animals Jacob mentioned, but *all* the male goats that were streaked or spotted, *all* female goats speckled or spotted (or having any white on them), and *all* the black lambs. He gives these potentially productive animals to his own sons to manage, not Jacob.",
      "Methodist": "Laban immediately removes all streaked/spotted/dark animals (potentially more than agreed?) and gives them to his sons, not Jacob, to manage.",
      "Lutheran": "Laban that day removes all the streaked/spotted male goats, speckled/spotted female goats (including those with white), and dark lambs, putting them in his sons' care.",
      "Presbyterian": "Laban immediately removes all the specified animals (streaked/spotted goats, dark lambs) and entrusts them to his sons.",
      "Pentecostal": "Laban removes all those animals that day and gives them to his sons.",
      "Episcopalian/Anglican": "Laban immediately removes all the specified types of animals and puts them under the care of his own sons.",
      "Orthodox": "On that very day, Laban removes all male goats with streaks or spots, all speckled or spotted female goats (including those with white markings), and all dark lambs, placing them under the supervision of his sons.",
      "Other": "That same day Laban removed all the male goats that were streaked or spotted, and all the female goats that were speckled or spotted or had any white on them, and all the dark-colored lambs, and he placed them in the care of his sons.",
      "Prefer not to say": "That same day Laban removed all the male goats that were streaked or spotted, and all the female goats that were speckled or spotted or had any white on them, and all the dark-colored lambs, and he placed them in the care of his sons."
    },
    "36": {
      "General": "Then he put a three-day journey between himself and Jacob, while Jacob continued to tend the rest of Laban's flocks.",
      "Non-Denominational": "Then he put a three-day journey between himself and Jacob, while Jacob continued to tend the rest of Laban's flocks.",
      "Baptist": "Laban further ensures separation by putting a three-day journey distance between the flock managed by his sons (containing the animals likely to produce Jacob's wages) and the main flock managed by Jacob (mostly solid-colored animals).",
      "Catholic": "To further minimize the chances of the flocks intermingling and producing speckled/spotted offspring for Jacob, Laban establishes a significant distance  a three-day journey  between the flock managed by his sons (containing the colored animals) and the flock Jacob was tending (now consisting mainly of solid-colored animals).",
      "Methodist": "Laban separates the two flocks by a three-day journey, ensuring minimal chance for the removed animals to breed with Jacob's portion.",
      "Lutheran": "Laban puts a three-day journey distance between his sons' flock and Jacob's flock (the rest of Laban's animals).",
      "Presbyterian": "Laban separates the flocks managed by his sons and Jacob by a distance of a three-day journey.",
      "Pentecostal": "Laban puts a three-day journey between his sons' flock and Jacob's.",
      "Episcopalian/Anglican": "Laban establishes a distance of a three-day journey between his sons' flocks and the flock Jacob was tending.",
      "Orthodox": "Laban ensures a separation of a three-day journey between the flock managed by his sons and the one tended by Jacob.",
      "Other": "Then he put a three-day journey between himself and Jacob, while Jacob continued to tend the rest of Laban's flocks.",
      "Prefer not to say": "Then he put a three-day journey between himself and Jacob, while Jacob continued to tend the rest of Laban's flocks."
    },
    "37": {
      "General": "Jacob, however, took fresh-cut branches from poplar, almond and plane trees and made white stripes on them by peeling the bark and exposing the white inner wood of the branches.",
      "Non-Denominational": "Jacob, however, took fresh-cut branches from poplar, almond and plane trees and made white stripes on them by peeling the bark and exposing the white inner wood of the branches.",
      "Baptist": "Jacob employs a folk practice or breeding technique based on sympathetic magic or observation: he peels stripes into branches of poplar, almond, and plane trees, exposing the white wood underneath.",
      "Catholic": "Jacob resorts to a folk breeding practice. He takes fresh branches of poplar, almond, and plane trees and peels strips of bark off them, creating white streaks by exposing the lighter wood underneath. This was likely based on a belief that visual stimuli during conception could influence the offspring's appearance (sympathetic magic).",
      "Methodist": "Jacob uses a folk breeding technique: peeling stripes into fresh branches (poplar, almond, plane) to expose the white wood.",
      "Lutheran": "Jacob takes fresh branches (poplar, almond, plane) and peels white stripes in them, exposing the white inner wood.",
      "Presbyterian": "Jacob employs a folk technique, peeling stripes into branches to expose the white wood.",
      "Pentecostal": "Jacob peels stripes into branches.",
      "Episcopalian/Anglican": "Jacob takes fresh branches and peels strips in the bark, exposing the white wood, likely employing a folk breeding belief.",
      "Orthodox": "Jacob utilizes a traditional breeding method, peeling strips from branches of poplar, almond, and plane trees to reveal the white wood beneath.",
      "Other": "Jacob, however, took fresh-cut branches from poplar, almond and plane trees and made white stripes on them by peeling the bark and exposing the white inner wood of the branches.",
      "Prefer not to say": "Jacob, however, took fresh-cut branches from poplar, almond and plane trees and made white stripes on them by peeling the bark and exposing the white inner wood of the branches."
    },
    "38": {
      "General": "Then he placed the peeled branches in all the watering troughs, so that they would be directly in front of the flocks when they came to drink. When the flocks were in heat and came to drink,",
      "Non-Denominational": "Then he placed the peeled branches in all the watering troughs, so that they would be directly in front of the flocks when they came to drink. When the flocks were in heat and came to drink,",
      "Baptist": "He places these striped branches in the watering troughs where the flocks mate when they come to drink, intending for the visual stimulus to influence the offspring.",
      "Catholic": "He strategically places these peeled branches in the watering troughs, directly in front of the flocks when they came to drink and, crucially, when they were in heat and mating.",
      "Methodist": "He places these branches in the watering troughs where the flocks would see them when they came to drink and mate.",
      "Lutheran": "He puts the peeled branches in the watering troughs before the flocks when they came to drink and were in heat.",
      "Presbyterian": "He places the branches in the watering troughs, ensuring the flocks see them when they come to drink and mate.",
      "Pentecostal": "He puts the branches in the troughs where the flocks drink and mate.",
      "Episcopalian/Anglican": "He places the peeled branches in the watering troughs so the flocks would see them when they came to drink, particularly when they were mating.",
      "Orthodox": "Jacob places these branches in the watering troughs, ensuring they were visible to the animals when they came to drink and mate.",
      "Other": "Then he placed the peeled branches in all the watering troughs, so that they would be directly in front of the flocks when they came to drink. When the flocks were in heat and came to drink,",
      "Prefer not to say": "Then he placed the peeled branches in all the watering troughs, so that they would be directly in front of the flocks when they came to drink. When the flocks were in heat and came to drink,"
    },
    "39": {
      "General": "they mated in front of the branches. And they bore young that were streaked or speckled or spotted.",
      "Non-Denominational": "they mated in front of the branches. And they bore young that were streaked or speckled or spotted.",
      "Baptist": "The flocks mate in view of the branches, and (according to the narrative, whether by folk practice efficacy or God's blessing overriding genetics) produce offspring with the desired markings (streaked, speckled, spotted).",
      "Catholic": "The flocks mate while facing the branches, and subsequently give birth to young that are streaked, speckled, or spotted  precisely the types that constitute Jacob's wages. The narrative attributes this outcome to the technique, though later Jacob attributes it to God (Gen 31:9-12).",
      "Methodist": "The flocks mate in front of the branches and produce streaked, speckled, and spotted young (Jacob's wages).",
      "Lutheran": "The flocks mate in front of the branches and bear streaked, speckled, and spotted young.",
      "Presbyterian": "The flocks mate in front of the branches and bear offspring with the desired markings.",
      "Pentecostal": "They mate in front of the branches and have streaked/speckled/spotted young.",
      "Episcopalian/Anglican": "The flocks mate in front of the branches and produce offspring that are streaked, speckled, or spotted.",
      "Orthodox": "The animals mate while viewing the branches and produce offspring exhibiting the streaks, speckles, and spots designated as Jacob's wages.",
      "Other": "they mated in front of the branches. And they bore young that were streaked or speckled or spotted.",
      "Prefer not to say": "they mated in front of the branches. And they bore young that were streaked or speckled or spotted."
    },
    "40": {
      "General": "Jacob set apart the young of the flock by themselves, but made the rest face the streaked and dark-colored animals that belonged to Laban. Thus he created his own flocks by himself and did not put them with Laban's sheep.",
      "Non-Denominational": "Jacob set apart the young of the flock by themselves, but made the rest face the streaked and dark-colored animals that belonged to Laban. Thus he created his own flocks by himself and did not put them with Laban's sheep.",
      "Baptist": "Jacob separates his newly acquired marked animals. He also seems to continue influencing the breeding by making Laban's remaining flock face the streaked/dark animals (perhaps Laban's original ones brought back temporarily, or Jacob's new ones?). He builds his own distinct flocks separate from Laban's.",
      "Catholic": "Jacob separates the newly born, marked lambs and kids that belong to him. He also manipulates the breeding process further by positioning the remaining (solid-colored) ewes of Laban's flock so that they faced the streaked and black sheep (perhaps from his own growing flock, reinforcing the visual stimulus). In this way, he actively built up his own separate flocks.",
      "Methodist": "Jacob separates his marked animals and continues selective breeding, possibly facing Laban's remaining flock towards marked animals to encourage more marked offspring. He builds his own flocks separately.",
      "Lutheran": "Jacob separates the lambs, making the rest of the flock face Laban's streaked/dark animals (or perhaps Jacob's own). He builds his own flocks separately.",
      "Presbyterian": "Jacob separates his animals and arranges the breeding (perhaps facing Laban's flock towards marked animals) to increase his own flock, keeping it distinct.",
      "Pentecostal": "Jacob separates his animals and manages breeding to increase his flock separately.",
      "Episcopalian/Anglican": "Jacob separates his marked animals and seems to arrange the mating further, building his own distinct flocks.",
      "Orthodox": "Jacob isolates the marked offspring belonging to him and continues to manage the breeding process, positioning the remaining flock to face the marked animals, thereby establishing his own separate flocks.",
      "Other": "Jacob set apart the young of the flock by themselves, but made the rest face the streaked and dark-colored animals that belonged to Laban. Thus he created his own flocks by himself and did not put them with Laban's sheep.",
      "Prefer not to say": "Jacob set apart the young of the flock by themselves, but made the rest face the streaked and dark-colored animals that belonged to Laban. Thus he created his own flocks by himself and did not put them with Laban's sheep."
    },
    "41": {
      "General": "Whenever the stronger females were in heat, Jacob would place the branches in the troughs in front of the flock so they would mate near the branches,",
      "Non-Denominational": "Whenever the stronger females were in heat, Jacob would place the branches in the troughs in front of the flock so they would mate near the branches,",
      "Baptist": "Jacob practices selective breeding using his technique: he uses the branches only when the stronger, healthier animals are mating.",
      "Catholic": "Jacob refines his technique by applying it selectively. Whenever the stronger, more robust animals of the flock were in heat, he would place the peeled branches in the troughs to encourage them to mate near the branches (aiming for strong, marked offspring for himself).",
      "Methodist": "Jacob applies his technique selectively, using the branches only when the stronger animals were mating.",
      "Lutheran": "When the stronger females were in heat, Jacob put the branches in the troughs before them so they would mate near the branches.",
      "Presbyterian": "Jacob applies the technique selectively, using the branches when the stronger animals mated.",
      "Pentecostal": "Jacob uses the branches only when the stronger animals mate.",
      "Episcopalian/Anglican": "Jacob practices selective breeding, using the branches only when the stronger animals were mating.",
      "Orthodox": "Jacob employs selective breeding, using the branches primarily when the stronger animals were mating.",
      "Other": "Whenever the stronger females were in heat, Jacob would place the branches in the troughs in front of the flock so they would mate near the branches,",
      "Prefer not to say": "Whenever the stronger females were in heat, Jacob would place the branches in the troughs in front of the flock so they would mate near the branches,"
    },
    "42": {
      "General": "but if the animals were weak, he would not place them there. So the weak animals went to Laban and the strong ones to Jacob.",
      "Non-Denominational": "but if the animals were weak, he would not place them there. So the weak animals went to Laban and the strong ones to Jacob.",
      "Baptist": "He does *not* use the branches when the weaker animals mate. The result is that the weaker offspring (presumably mostly solid-colored) end up belonging to Laban, while the stronger offspring (influenced by the branches to be marked) go to Jacob.",
      "Catholic": "Conversely, when the weaker animals were mating, Jacob would *not* place the branches there. This strategy resulted in the weaker offspring (more likely solid-colored) remaining with Laban, while the stronger offspring (more likely marked due to the technique) became Jacob's property.",
      "Methodist": "He did not use the branches for weaker animals. Consequently, the weaker offspring went to Laban, and the stronger (marked) offspring went to Jacob.",
      "Lutheran": "He did not put the branches there for the weaker animals. So the weaker animals went to Laban, the stronger to Jacob.",
      "Presbyterian": "He avoids using the technique with weaker animals. This results in the weaker offspring belonging to Laban and the stronger ones to Jacob.",
      "Pentecostal": "He doesn't use branches for weaker animals, so Laban gets the weak ones, Jacob the strong.",
      "Episcopalian/Anglican": "He did not use the branches when weaker animals mated, resulting in the weaker animals belonging to Laban and the stronger ones to Jacob.",
      "Orthodox": "He refrained from using the branches when the weaker animals mated. Consequently, the weaker offspring typically remained Laban's, while the stronger ones became Jacob's.",
      "Other": "but if the animals were weak, he would not place them there. So the weak animals went to Laban and the strong ones to Jacob.",
      "Prefer not to say": "but if the animals were weak, he would not place them there. So the weak animals went to Laban and the strong ones to Jacob."
    },
    "43": {
      "General": "In this way the man grew exceedingly prosperous and came to own large flocks, and female and male servants, and camels and donkeys.",
      "Non-Denominational": "In this way the man grew exceedingly prosperous and came to own large flocks, and female and male servants, and camels and donkeys.",
      "Baptist": "Through this strategy (and/or God's blessing), Jacob becomes extremely wealthy, accumulating large flocks of his own, as well as servants and transport animals (camels, donkeys).",
      "Catholic": "As a result of these practices (presented here as the primary cause, though divine blessing is also implied elsewhere), Jacob became exceedingly prosperous. He amassed large flocks of his own, and acquired wealth in the form of male and female servants, camels, and donkeys.",
      "Methodist": "Through these methods, Jacob becomes exceedingly wealthy, owning large flocks, servants, camels, and donkeys.",
      "Lutheran": "Jacob becomes exceedingly prosperous, owning large flocks, servants, camels, and donkeys.",
      "Presbyterian": "As a result, Jacob becomes extremely wealthy, acquiring large flocks, servants, camels, and donkeys.",
      "Pentecostal": "Jacob becomes very wealthy with large flocks, servants, camels, and donkeys.",
      "Episcopalian/Anglican": "Through this strategy, Jacob becomes exceedingly prosperous, acquiring large flocks, servants, camels, and donkeys.",
      "Orthodox": "By these means, Jacob achieves great prosperity, accumulating vast flocks, servants, camels, and donkeys.",
      "Other": "In this way the man grew exceedingly prosperous and came to own large flocks, and female and male servants, and camels and donkeys.",
      "Prefer not to say": "In this way the man grew exceedingly prosperous and came to own large flocks, and female and male servants, and camels and donkeys."
    }
  }
}
