{
  "_comment": "Interpretations for Genesis Chapter 31",
  "book": "Genesis",
  "chapter": "31",
  "verses": {
    "1": {
      "General": "Jacob heard that Laban's sons were saying, \"Jacob has taken everything our father owned and has gained all this wealth from what belonged to our father.\"",
      "Non-Denominational": "Jacob heard that Laban's sons were saying, \"Jacob has taken everything our father owned and has gained all this wealth from what belonged to our father.\"",
      "Baptist": "Jacob overhears Laban's sons grumbling, resentfully accusing Jacob of acquiring his wealth by taking what rightfully belonged to their father, Laban.",
      "Catholic": "Jacob becomes aware of the resentment brewing among Laban's sons. He overhears them saying, 'Jacob has taken all that was our father's, and from what was our father's he has gained all this wealth.' They view Jacob's prosperity not as earned or blessed by God, but as stolen from their inheritance.",
      "Methodist": "Jacob hears Laban's sons complaining that Jacob built his wealth by taking their father's property.",
      "Lutheran": "Jacob hears Laban's sons complaining that Jacob has taken Laban's possessions and built his wealth from Laban's property.",
      "Presbyterian": "Jacob hears Laban's sons complaining that his wealth was gained at the expense of their father.",
      "Pentecostal": "Jacob hears Laban's sons saying Jacob got rich from Laban's property.",
      "Episcopalian/Anglican": "Jacob learns Laban's sons are resentful, accusing him of acquiring his wealth from their father's property.",
      "Orthodox": "Jacob overhears Laban's sons expressing resentment, accusing him of amassing his wealth by misappropriating their father's assets.",
      "Other": "Jacob heard that Laban's sons were saying, \"Jacob has taken everything our father owned and has gained all this wealth from what belonged to our father.\"",
      "Prefer not to say": "Jacob heard that Laban's sons were saying, \"Jacob has taken everything our father owned and has gained all this wealth from what belonged to our father.\""
    },
    "2": {
      "General": "And Jacob noticed that Laban's attitude toward him was not what it had been.",
      "Non-Denominational": "And Jacob noticed that Laban's attitude toward him was not what it had been.",
      "Baptist": "Jacob also perceives a change in Laban himself; Laban's facial expression and demeanor towards Jacob are no longer friendly or favorable as before.",
      "Catholic": "Jacob personally observes a shift in Laban's own disposition towards him. Laban's 'face' (attitude, countenance) was no longer favorable towards Jacob as it had been previously.",
      "Methodist": "Jacob observes that Laban's attitude towards him has also turned unfavorable.",
      "Lutheran": "Jacob sees that Laban's attitude/face towards him is not like it was before.",
      "Presbyterian": "Jacob observes that Laban's attitude towards him has become less favorable.",
      "Pentecostal": "Jacob notices Laban's attitude towards him has changed for the worse.",
      "Episcopalian/Anglican": "Jacob perceives that Laban's attitude towards him is no longer favorable.",
      "Orthodox": "Jacob observes a distinct cooling in Laban's attitude towards him compared to previous times.",
      "Other": "And Jacob noticed that Laban's attitude toward him was not what it had been.",
      "Prefer not to say": "And Jacob noticed that Laban's attitude toward him was not what it had been."
    },
    "3": {
      "General": "The Lord said to Jacob, 'Go back to the land of your fathers and to your relatives, and I will be with you.'",
      "Non-Denominational": "The Lord said to Jacob, 'Go back to the land of your fathers and to your relatives, and I will be with you.'",
      "Baptist": "Amidst this growing tension, God speaks directly to Jacob, commanding him to return to Canaan ('the land of your fathers and to your kindred') and reaffirming the promise of His presence ('I will be with you').",
      "Catholic": "At this opportune moment of rising tension, the Lord directly commands Jacob: 'Return to the land of your fathers and to your kindred, and I will be with you.' This divine instruction confirms Jacob's own inclination and provides the crucial promise of God's continued presence and support for the journey.",
      "Methodist": "God commands Jacob to return to his homeland (Canaan) and relatives, promising His presence ('I will be with you').",
      "Lutheran": "Yahweh tells Jacob to return to the land of his fathers and relatives, promising to be with him.",
      "Presbyterian": "God instructs Jacob to return to his ancestral land, promising His presence.",
      "Pentecostal": "God tells Jacob to go back home, promising to be with him.",
      "Episcopalian/Anglican": "The Lord instructs Jacob to return to the land of his ancestors and relatives, promising His presence.",
      "Orthodox": "The Lord instructs Jacob to return to his ancestral homeland and relatives, assuring him of the divine presence.",
      "Other": "The Lord said to Jacob, 'Go back to the land of your fathers and to your relatives, and I will be with you.'",
      "Prefer not to say": "The Lord said to Jacob, 'Go back to the land of your fathers and to your relatives, and I will be with you.'."
    },
    "4": {
      "General": "So Jacob sent word to Rachel and Leah to come out to the fields where his flocks were.",
      "Non-Denominational": "So Jacob sent word to Rachel and Leah to come out to the fields where his flocks were.",
      "Baptist": "Jacob summons Rachel and Leah to meet him privately in the field among his flocks, away from Laban's household, to discuss his plan.",
      "Catholic": "Acting on God's command and his own assessment of the situation, Jacob summons Rachel and Leah to meet him discreetly in the field where his flocks are located, away from the main household and Laban's immediate influence.",
      "Methodist": "Jacob calls Rachel and Leah to meet him privately in the field with his flocks.",
      "Lutheran": "Jacob sends for Rachel and Leah to meet him in the field with his flock.",
      "Presbyterian": "Jacob summons Rachel and Leah to meet him in the field among his flocks.",
      "Pentecostal": "Jacob calls Rachel and Leah to the field.",
      "Episcopalian/Anglican": "Jacob summons Rachel and Leah to meet him in the field where his flocks are.",
      "Orthodox": "Jacob summons Rachel and Leah for a private consultation in the field where his flocks are pastured.",
      "Other": "So Jacob sent word to Rachel and Leah to come out to the fields where his flocks were.",
      "Prefer not to say": "So Jacob sent word to Rachel and Leah to come out to the fields where his flocks were."
    },
    "5": {
      "General": "He said to them, 'I see that your father's attitude toward me is not what it was before, but the God of my father has been with me.'",
      "Non-Denominational": "He said to them, 'I see that your father's attitude toward me is not what it was before, but the God of my father has been with me.'",
      "Baptist": "Jacob explains the situation to his wives: he observes their father Laban's changed, unfavorable attitude, but contrasts this with the consistent faithfulness of God ('the God of my father') who has been with him.",
      "Catholic": "Jacob explains his reasoning to his wives: 'I see that your father's face is not toward me as it was before.' He acknowledges the breakdown in the relationship with Laban but immediately affirms his reliance on a higher power: 'But the God of my father has been with me.'",
      "Methodist": "Jacob tells them he sees Laban's changed attitude but affirms that his father's God has been with him.",
      "Lutheran": "Jacob explains he sees Laban's negative attitude change, but affirms that the God of his father (Abraham/Isaac) has been with him.",
      "Presbyterian": "Jacob explains Laban's changed attitude but emphasizes that God has remained with him.",
      "Pentecostal": "Jacob explains Laban's changed attitude but says God has been with him.",
      "Episcopalian/Anglican": "Jacob explains to his wives that he perceives Laban's changed attitude, but affirms that the God of his father has been with him.",
      "Orthodox": "Jacob communicates to his wives his observation of Laban's altered demeanor, contrasting it with the steadfast presence of the God of his ancestors.",
      "Other": "He said to them, 'I see that your father's attitude toward me is not what it was before, but the God of my father has been with me.'",
      "Prefer not to say": "He said to them, 'I see that your father's attitude toward me is not what it was before, but the God of my father has been with me.'"
    },
    "6": {
      "General": "You know that I've worked for your father with all my strength,",
      "Non-Denominational": "You know that I've worked for your father with all my strength,",
      "Baptist": "He reminds them of his own diligent and faithful service to Laban over the years, appealing to their personal knowledge of his hard work.",
      "Catholic": "Jacob appeals to their own experience as witnesses: 'You know that I have served your father with all my strength.' He emphasizes his dedication and effort during his long service.",
      "Methodist": "He reminds them they know he has served Laban faithfully and diligently.",
      "Lutheran": "He reminds them they know he has served Laban with all his strength.",
      "Presbyterian": "He reminds them of his diligent service to Laban.",
      "Pentecostal": "He reminds them he worked hard for Laban.",
      "Episcopalian/Anglican": "He reminds them that they know he has served Laban with all his strength.",
      "Orthodox": "He reminds them of his unwavering diligence and effort in serving Laban.",
      "Other": "You know that I've worked for your father with all my strength,",
      "Prefer not to say": "You know that I've worked for your father with all my strength,"
    },
    "7": {
      "General": "yet your father has cheated me by changing my wages ten times. However, God has not allowed him to harm me.",
      "Non-Denominational": "yet your father has cheated me by changing my wages ten times. However, God has not allowed him to harm me.",
      "Baptist": "He accuses Laban of repeatedly cheating him by changing the terms of his wages multiple times ('ten times' signifying repeatedly). Despite Laban's attempts to exploit him, Jacob testifies that God providentially protected him from harm or loss.",
      "Catholic": "He explicitly accuses Laban of deceit and exploitation: 'Yet your father has cheated me and changed my wages ten times.' ('Ten times' likely means repeatedly or many times). However, Jacob credits divine protection for mitigating the damage: 'But God did not permit him to harm me.'",
      "Methodist": "He accuses Laban of cheating him by changing his wages repeatedly ('ten times') but states God protected him from harm.",
      "Lutheran": "He states Laban cheated him, changing his wages ten times (repeatedly), but God did not allow Laban to harm him.",
      "Presbyterian": "He recounts Laban's deceit in changing his wages repeatedly ('ten times'), but emphasizes God's protection prevented Laban from harming him.",
      "Pentecostal": "He says Laban cheated him by changing his wages ten times, but God protected him.",
      "Episcopalian/Anglican": "He accuses Laban of cheating him by changing his wages repeatedly ('ten times'), but asserts God prevented Laban from harming him.",
      "Orthodox": "He recounts Laban's repeated duplicity in altering his wages ('ten times' indicating frequency), while affirming God's providential protection prevented Laban from causing him significant harm.",
      "Other": "yet your father has cheated me by changing my wages ten times. However, God has not allowed him to harm me.",
      "Prefer not to say": "yet your father has cheated me by changing my wages ten times. However, God has not allowed him to harm me."
    },
    "8": {
      "General": "If he said, 'The speckled ones will be your wages,' then all the flocks gave birth to speckled young; and if he said, 'The streaked ones will be your wages,' then all the flocks bore streaked young.",
      "Non-Denominational": "If he said, 'The speckled ones will be your wages,' then all the flocks gave birth to speckled young; and if he said, 'The streaked ones will be your wages,' then all the flocks bore streaked young.",
      "Baptist": "Jacob illustrates God's intervention: whenever Laban tried to change the agreement to his own advantage (e.g., only speckled are Jacob's wages), God caused the flocks to produce precisely those kinds of offspring, frustrating Laban's schemes and blessing Jacob.",
      "Catholic": "Jacob provides specific examples of God's intervention turning Laban's schemes against him. Whenever Laban changed the terms (e.g., 'The speckled shall be your wages'), God providentially caused the flocks to bear offspring matching those new terms, ensuring Jacob still prospered despite Laban's attempts to limit his earnings.",
      "Methodist": "He gives examples of God's intervention: whatever type of animal Laban designated as Jacob's wages, the flocks miraculously produced those specific types, thwarting Laban's attempts to reduce Jacob's share.",
      "Lutheran": "He gives examples: if Laban said speckled would be Jacob's wages, the flocks bore speckled; if streaked, they bore streaked.",
      "Presbyterian": "He illustrates God's providence: whatever Laban designated as Jacob's wage, God ensured the flocks produced accordingly.",
      "Pentecostal": "He explains how God made the flocks produce whatever Laban set as Jacob's wages.",
      "Episcopalian/Anglican": "He illustrates how God intervened: whatever Laban designated as Jacob's wages (speckled or streaked), the flocks bore accordingly.",
      "Orthodox": "Jacob provides examples of divine intervention: regardless of how Laban altered the terms of payment (speckled or streaked), God ensured the flocks produced offspring matching those terms, thereby blessing Jacob.",
      "Other": "If he said, 'The speckled ones will be your wages,' then all the flocks gave birth to speckled young; and if he said, 'The streaked ones will be your wages,' then all the flocks bore streaked young.",
      "Prefer not to say": "If he said, 'The speckled ones will be your wages,' then all the flocks gave birth to speckled young; and if he said, 'The streaked ones will be your wages,' then all the flocks bore streaked young."
    },
    "9": {
      "General": "So God has taken away your father's livestock and has given them to me.",
      "Non-Denominational": "So God has taken away your father's livestock and has given them to me.",
      "Baptist": "Jacob explicitly attributes the transfer of wealth not to his own cunning or Laban's sons' accusations of theft, but to God's sovereign action: God took Laban's livestock and gave it to him.",
      "Catholic": "Jacob explicitly interprets this transfer of wealth as a divine act: 'Thus God has taken away the livestock of your father and given them to me.' He sees it not primarily as the result of his own strategy or Laban's mismanagement, but as God justly reallocating the wealth.",
      "Methodist": "Jacob concludes God Himself took Laban's livestock and gave it to him.",
      "Lutheran": "Jacob states plainly that God took Laban's livestock and gave it to him (Jacob).",
      "Presbyterian": "Jacob explicitly states God transferred the livestock wealth from Laban to him.",
      "Pentecostal": "Jacob says God took Laban's livestock and gave it to him.",
      "Episcopalian/Anglican": "Jacob explicitly attributes the transfer of wealth to God taking Laban's livestock and giving it to him.",
      "Orthodox": "Jacob directly attributes the shift in wealth to divine action, asserting that God appropriated Laban's livestock and bestowed it upon him.",
      "Other": "So God has taken away your father's livestock and has given them to me.",
      "Prefer not to say": "So God has taken away your father's livestock and has given them to me."
    },
    "10": {
      "General": "In breeding season I once had a dream in which I looked up and saw that the male goats mating with the flock were streaked, speckled or spotted.",
      "Non-Denominational": "In breeding season I once had a dream in which I looked up and saw that the male goats mating with the flock were streaked, speckled or spotted.",
      "Baptist": "Jacob recounts a dream he had during breeding season where he saw that the male goats mating were the very types (streaked, speckled, spotted) that produced his wages, revealing divine insight into the process.",
      "Catholic": "Jacob now shares a previously unmentioned dream, revealing the divine insight behind his success. He dreamt during the breeding season and saw that the male goats actively mating were precisely the streaked, speckled, and spotted kind – the ones producing offspring beneficial to him.",
      "Methodist": "Jacob recounts a dream where he saw the male goats mating were the streaked, speckled, and spotted type (revealing God's hand in the process).",
      "Lutheran": "Jacob describes a dream during breeding season where he saw the male goats mating were streaked, speckled, and spotted.",
      "Presbyterian": "Jacob recounts a dream revealing that the successful breeding males were the marked ones.",
      "Pentecostal": "Jacob shares a dream where he saw the marked males mating.",
      "Episcopalian/Anglican": "Jacob recounts a dream during breeding season where he saw that the male goats mating were streaked, speckled, or spotted.",
      "Orthodox": "Jacob relates a dream wherein he observed during mating season that the breeding males were precisely those with the markings designated for his wages.",
      "Other": "In breeding season I once had a dream in which I looked up and saw that the male goats mating with the flock were streaked, speckled or spotted.",
      "Prefer not to say": "In breeding season I once had a dream in which I looked up and saw that the male goats mating with the flock were streaked, speckled or spotted."
    },
    "11": {
      "General": "The angel of God said to me in the dream, 'Jacob.' I answered, 'Here I am.'",
      "Non-Denominational": "The angel of God said to me in the dream, 'Jacob.' I answered, 'Here I am.'",
      "Baptist": "He further explains that the angel of God spoke to him within this dream, calling him by name.",
      "Catholic": "Within the dream, the 'angel of God' addressed Jacob directly, calling his name. Jacob responded, indicating his attentiveness ('Here I am').",
      "Methodist": "The angel of God spoke to him in the dream.",
      "Lutheran": "The angel of God spoke to him in the dream, calling his name.",
      "Presbyterian": "He adds that the angel of God spoke to him in the dream.",
      "Pentecostal": "The angel of God spoke to Jacob in the dream.",
      "Episcopalian/Anglican": "The angel of God addressed him in the dream.",
      "Orthodox": "He clarifies that the Angel of God addressed him within this dream.",
      "Other": "The angel of God said to me in the dream, 'Jacob.' I answered, 'Here I am.'",
      "Prefer not to say": "The angel of God said to me in the dream, 'Jacob.' I answered, 'Here I am.'"
    },
    "12": {
      "General": "And he said, 'Look up and see that all the male goats mating with the flock are streaked, speckled or spotted, for I have seen all that Laban has been doing to you.'",
      "Non-Denominational": "And he said, 'Look up and see that all the male goats mating with the flock are streaked, speckled or spotted, for I have seen all that Laban has been doing to you.'",
      "Baptist": "The angel confirmed the observation in the dream (the marked males were breeding) and explicitly linked God's intervention to Laban's mistreatment: God saw Laban's injustice and was acting on Jacob's behalf.",
      "Catholic": "The angel explicitly directed Jacob's attention to the breeding males ('Lift up your eyes and see, all the goats that leap upon the flock are streaked, speckled, and mottled') and then explained the reason: 'for I have seen all that Laban is doing to you.' This confirms God's awareness of Laban's injustice and His active intervention to counteract it.",
      "Methodist": "The angel pointed out the marked males were mating and stated this was happening because God saw Laban's mistreatment of Jacob.",
      "Lutheran": "The angel told him to see that the mating males were marked, explaining this was because God had seen Laban's mistreatment of Jacob.",
      "Presbyterian": "The angel confirmed the observation and explained it was God's response to Laban's mistreatment of Jacob.",
      "Pentecostal": "The angel confirmed the marked males were mating because God saw how Laban treated Jacob.",
      "Episcopalian/Anglican": "The angel confirmed that the mating males were marked and explained this was because God had seen Laban's unfair treatment of Jacob.",
      "Orthodox": "The Angel confirmed Jacob's observation about the breeding males and explicitly stated this divine orchestration was a response to God's awareness of Laban's unjust treatment of Jacob.",
      "Other": "And he said, 'Look up and see that all the male goats mating with the flock are streaked, speckled or spotted, for I have seen all that Laban has been doing to you.'",
      "Prefer not to say": "And he said, 'Look up and see that all the male goats mating with the flock are streaked, speckled or spotted, for I have seen all that Laban has been doing to you.'"
    },
    "13": {
      "General": "I am the God of Bethel, where you anointed a pillar and where you made a vow to me. Now leave this land at once and go back to your native land.'",
      "Non-Denominational": "I am the God of Bethel, where you anointed a pillar and where you made a vow to me. Now leave this land at once and go back to your native land.'",
      "Baptist": "The angel identifies himself as 'the God of Bethel,' reminding Jacob of his earlier encounter, the consecrated pillar, and the vow made there. This divine voice now commands Jacob to leave Harran immediately and return to Canaan.",
      "Catholic": "Crucially, the divine messenger identifies Himself: 'I am the God of Bethel, where you anointed a pillar and made a vow to me.' This connects the current instruction to Jacob's foundational experience of God's covenant promise at Bethel (Gen 28). The command follows logically: 'Now arise, go out from this land and return to the land of your birth.'",
      "Methodist": "The angel identifies Himself as the God Jacob met at Bethel (recalling the pillar and vow) and commands Jacob to leave immediately and return home.",
      "Lutheran": "The angel identifies himself as the God of Bethel (recalling Jacob's vow there) and commands Jacob to leave Laban's land and return to his native land.",
      "Presbyterian": "The angel identifies Himself as the God of Bethel, recalling Jacob's vow, and commands him to leave Laban's land and return home.",
      "Pentecostal": "The angel identifies himself as the God of Bethel and commands Jacob to go home immediately.",
      "Episcopalian/Anglican": "The angel identifies Himself as the God of Bethel, reminding Jacob of his vow, and commands him to leave at once and return to his native land.",
      "Orthodox": "The divine messenger identifies Himself as the God encountered at Bethel, referencing the anointed pillar and Jacob's vow, and commands Jacob's immediate departure and return to his homeland.",
      "Other": "I am the God of Bethel, where you anointed a pillar and where you made a vow to me. Now leave this land at once and go back to your native land.'",
      "Prefer not to say": "I am the God of Bethel, where you anointed a pillar and where you made a vow to me. Now leave this land at once and go back to your native land.'"
    },
    "14": {
      "General": "Then Rachel and Leah replied, 'Do we still have any share in the inheritance of our father's estate?'",
      "Non-Denominational": "Then Rachel and Leah replied, 'Do we still have any share in the inheritance of our father's estate?'",
      "Baptist": "Rachel and Leah respond to Jacob, beginning with a rhetorical question expressing their alienation from their father's household: they no longer expect any inheritance or portion from Laban.",
      "Catholic": "Rachel and Leah respond jointly and readily agree with Jacob's assessment. They begin by highlighting their own disenfranchisement: 'Is there any portion or inheritance left to us in our father's house?' They feel they have no remaining stake or future there.",
      "Methodist": "Rachel and Leah respond, questioning if they have any inheritance left in Laban's household.",
      "Lutheran": "Rachel and Leah ask rhetorically if they still have any portion or inheritance in Laban's house.",
      "Presbyterian": "Rachel and Leah respond by questioning whether they have any remaining inheritance in Laban's house.",
      "Pentecostal": "Rachel and Leah ask if they have any inheritance left from Laban.",
      "Episcopalian/Anglican": "Rachel and Leah respond, questioning if they still have any share or inheritance in their father's house.",
      "Orthodox": "Rachel and Leah concur with Jacob, rhetorically asking if any portion or inheritance remains for them within their father's estate.",
      "Other": "Then Rachel and Leah replied, 'Do we still have any share in the inheritance of our father's estate?'",
      "Prefer not to say": "Then Rachel and Leah replied, 'Do we still have any share in the inheritance of our father's estate?'"
    },
    "15": {
      "General": "They feel Laban treats them like foreigners, having sold them and used up the money paid for them (referring to Jacob's labor).",
      "Non-Denominational": "They feel Laban treats them like foreigners, having sold them and used up the money paid for them (referring to Jacob's labor).",
      "Baptist": "They feel Laban treats them like foreigners, not daughters. They accuse him of essentially 'selling' them (using Jacob's extensive labor, which served as their bride price) and then consuming that wealth himself instead of setting it aside for them or their dowry, as custom might dictate.",
      "Catholic": "They elaborate on their feeling of alienation: 'Are we not regarded by him as foreigners? For he has sold us, and he has indeed consumed our money (the bride price Jacob paid through labor).' They feel Laban treated them as commodities, benefiting from their marriage price (Jacob's 14 years of service) without providing them the security or dowry expected.",
      "Methodist": "They feel Laban treats them as foreigners, having 'sold' them (benefited from Jacob's service as bride price) and used the proceeds himself.",
      "Lutheran": "They ask if Laban doesn't regard them as foreigners, since he 'sold' them and used up the money (Jacob's labor/bride price).",
      "Presbyterian": "They complain Laban treats them as foreigners, having 'sold' them (through Jacob's service) and consumed the bride price himself.",
      "Pentecostal": "They say Laban treats them like foreigners, having sold them and used the money.",
      "Episcopalian/Anglican": "They ask if Laban does not regard them as foreigners, having 'sold' them and used up the bride price himself.",
      "Orthodox": "They articulate their sense of estrangement, stating Laban treats them as foreigners, having effectively sold them and consumed the bride price (Jacob's labor) himself.",
      "Other": "They feel Laban treats them like foreigners, having sold them and used up the money paid for them (referring to Jacob's labor).",
      "Prefer not to say": "They feel Laban treats them like foreigners, having sold them and used up the money paid for them (referring to Jacob's labor)."
    },
    "16": {
      "General": "Surely all the wealth that God took away from our father belongs to us and our children. So do whatever God has told you.'",
      "Non-Denominational": "Surely all the wealth that God took away from our father belongs to us and our children. So do whatever God has told you.'",
      "Baptist": "Therefore, they view the wealth Jacob gained (which God took from Laban) as rightfully belonging to them and their children, compensating for what Laban withheld. They fully support Jacob following God's command to leave.",
      "Catholic": "Based on Laban's actions, they conclude that the wealth God transferred from Laban to Jacob rightfully belongs to them and their children ('Surely all the wealth which God has taken away from our father belongs to us and to our children'). They see Jacob's gain as their rightful portion. Consequently, they give Jacob their full support: 'Now then, whatever God has said to you, do.'",
      "Methodist": "They conclude the wealth God transferred from Laban to Jacob rightfully belongs to them and their children, and urge Jacob to obey God's command.",
      "Lutheran": "They assert the wealth God took from Laban belongs to them and their children, urging Jacob to do whatever God told him.",
      "Presbyterian": "They assert that the wealth God transferred rightfully belongs to them and their children, and encourage Jacob to obey God.",
      "Pentecostal": "They claim the wealth God took from Laban belongs to them and their children, telling Jacob to obey God.",
      "Episcopalian/Anglican": "They assert that the wealth God transferred from Laban rightfully belongs to them and their children, and urge Jacob to do whatever God has instructed.",
      "Orthodox": "They conclude that the wealth divinely transferred from Laban rightfully belongs to them and their offspring, thereby wholeheartedly endorsing Jacob's decision to follow God's directive.",
      "Other": "Surely all the wealth that God took away from our father belongs to us and our children. So do whatever God has told you.'",
      "Prefer not to say": "Surely all the wealth that God took away from our father belongs to us and our children. So do whatever God has told you.'"
    },
    "17": {
      "General": "Then Jacob put his children and his wives on camels,",
      "Non-Denominational": "Then Jacob put his children and his wives on camels,",
      "Baptist": "Having secured his wives' agreement, Jacob immediately prepares for departure, mounting his family on camels.",
      "Catholic": "With his wives' full support, Jacob promptly begins the departure, placing his children and wives onto camels for the journey.",
      "Methodist": "Jacob immediately prepares to leave, putting his family on camels.",
      "Lutheran": "Jacob prepares to leave, putting his children and wives on camels.",
      "Presbyterian": "Jacob begins the departure, placing his family on camels.",
      "Pentecostal": "Jacob puts his family on camels to leave.",
      "Episcopalian/Anglican": "Jacob puts his children and wives on camels, preparing for departure.",
      "Orthodox": "Jacob commences preparations for departure, mounting his children and wives on camels.",
      "Other": "Then Jacob put his children and his wives on camels,",
      "Prefer not to say": "Then Jacob put his children and his wives on camels,"
    },
    "18": {
      "General": "and he drove all his livestock ahead of him, along with all the goods he had accumulated in Paddan Aram, to go to his father Isaac in the land of Canaan.",
      "Non-Denominational": "and he drove all his livestock ahead of him, along with all the goods he had accumulated in Paddan Aram, to go to his father Isaac in the land of Canaan.",
      "Baptist": "He gathers all his livestock and possessions acquired in Paddan Aram and sets out towards Canaan to return to his father Isaac.",
      "Catholic": "He gathers all his livestock and all the possessions ('goods') he had acquired during his time in Paddan-aram, setting out on the journey towards his father Isaac in the land of Canaan.",
      "Methodist": "He drives his livestock and carries all his possessions acquired in Paddan Aram, heading towards Isaac in Canaan.",
      "Lutheran": "He drives all his livestock and goods acquired in Paddan-aram to go to Isaac his father in Canaan.",
      "Presbyterian": "He gathers his livestock and possessions acquired in Paddan Aram and sets off towards Isaac in Canaan.",
      "Pentecostal": "He gathers his livestock and goods and heads towards Isaac in Canaan.",
      "Episcopalian/Anglican": "He drives his livestock and takes all his accumulated goods, setting out for his father Isaac in Canaan.",
      "Orthodox": "He gathers his livestock and all the possessions acquired in Paddan-aram, embarking on the journey to his father Isaac in the land of Canaan.",
      "Other": "and he drove all his livestock ahead of him, along with all the goods he had accumulated in Paddan Aram, to go to his father Isaac in the land of Canaan.",
      "Prefer not to say": "and he drove all his livestock ahead of him, along with all the goods he had accumulated in Paddan Aram, to go to his father Isaac in the land of Canaan."
    },
    "19": {
      "General": "When Laban had gone to shear his sheep, Rachel stole her father's household gods.",
      "Non-Denominational": "When Laban had gone to shear his sheep, Rachel stole her father's household gods.",
      "Baptist": "Taking advantage of Laban's absence (he was away shearing sheep, a time-consuming task often done at a distance), Rachel secretly steals Laban's 'teraphim' (household idols or gods). Her motives are debated (sentiment, belief in their power, claim to inheritance, spite).",
      "Catholic": "While Laban is preoccupied with sheep shearing (an activity that often took shepherds some distance away), Rachel seizes the opportunity to steal her father's 'household gods' (teraphim). These were likely small idols representing family ancestors or deities, believed to provide protection, guidance, or legitimacy for inheritance claims. Rachel's motives remain ambiguous.",
      "Methodist": "While Laban is away shearing sheep, Rachel steals his household gods (teraphim), possibly for protection, inheritance rights, or out of lingering pagan belief.",
      "Lutheran": "While Laban is away shearing sheep, Rachel stole his household gods (teraphim).",
      "Presbyterian": "Rachel steals Laban's household gods (teraphim) while he is away shearing sheep.",
      "Pentecostal": "While Laban is shearing sheep, Rachel steals his household gods.",
      "Episcopalian/Anglican": "While Laban was away shearing sheep, Rachel stole his household gods (teraphim).",
      "Orthodox": "During Laban's absence for sheep shearing, Rachel steals his household idols (teraphim).",
      "Other": "When Laban had gone to shear his sheep, Rachel stole her father's household gods.",
      "Prefer not to say": "When Laban had gone to shear his sheep, Rachel stole her father's household gods."
    },
    "20": {
      "General": "Moreover, Jacob deceived Laban the Aramean by not telling him he was running away.",
      "Non-Denominational": "Moreover, Jacob deceived Laban the Aramean by not telling him he was running away.",
      "Baptist": "Jacob also acts deceitfully ('stole the heart of Laban' - an idiom for deception) by concealing his departure from Laban.",
      "Catholic": "Jacob, for his part, practices deception ('outwitted' or 'stole the heart of' Laban, an idiom meaning to deceive or keep in the dark) by deliberately not informing Laban of his intention to flee.",
      "Methodist": "Jacob deceives Laban by leaving secretly without informing him.",
      "Lutheran": "Jacob deceives Laban the Aramean by not telling him he was fleeing.",
      "Presbyterian": "Jacob deceives Laban by concealing his departure.",
      "Pentecostal": "Jacob deceives Laban by leaving secretly.",
      "Episcopalian/Anglican": "Jacob deceived Laban by not informing him of his departure.",
      "Orthodox": "Jacob practices deception by concealing his departure from Laban.",
      "Other": "Moreover, Jacob deceived Laban the Aramean by not telling him he was running away.",
      "Prefer not to say": "Moreover, Jacob deceived Laban the Aramean by not telling him he was running away."
    },
    "21": {
      "General": "So he fled with all he had, and crossing the Euphrates River, he headed for the hill country of Gilead.",
      "Non-Denominational": "So he fled with all he had, and crossing the Euphrates River, he headed for the hill country of Gilead.",
      "Baptist": "Jacob flees with all his possessions, crosses the Euphrates River (a major geographical boundary), and travels towards the region of Gilead (east of the Jordan River).",
      "Catholic": "Jacob flees with everything belonging to him. He crosses the Euphrates River (referred to simply as 'the River') and sets his course toward the mountainous region of Gilead, east of the Jordan.",
      "Methodist": "He flees with all his possessions, crosses the Euphrates, and heads towards Gilead.",
      "Lutheran": "Jacob flees with all he has, crosses the Euphrates River, and heads toward the hill country of Gilead.",
      "Presbyterian": "He flees with his possessions, crosses the Euphrates, and heads towards Gilead.",
      "Pentecostal": "He flees with everything, crosses the Euphrates, and heads for Gilead.",
      "Episcopalian/Anglican": "Jacob flees with all his possessions, crosses the Euphrates River, and heads towards the hill country of Gilead.",
      "Orthodox": "Jacob departs covertly with all his belongings, crosses the Euphrates River, and proceeds towards the hill country of Gilead.",
      "Other": "So he fled with all he had, and crossing the Euphrates River, he headed for the hill country of Gilead.",
      "Prefer not to say": "So he fled with all he had, and crossing the Euphrates River, he headed for the hill country of Gilead."
    },
    "22": {
      "General": "On the third day, Laban was told that Jacob had fled.",
      "Non-Denominational": "On the third day, Laban was told that Jacob had fled.",
      "Baptist": "It takes three days for the news of Jacob's departure to reach Laban (likely still away shearing).",
      "Catholic": "News of Jacob's flight reaches Laban three days after the departure.",
      "Methodist": "Laban learns of Jacob's flight three days later.",
      "Lutheran": "Laban is told on the third day that Jacob has fled.",
      "Presbyterian": "Laban is informed of Jacob's departure on the third day.",
      "Pentecostal": "Laban finds out Jacob fled three days later.",
      "Episcopalian/Anglican": "Laban was told on the third day that Jacob had fled.",
      "Orthodox": "Laban receives word of Jacob's departure on the third day.",
      "Other": "On the third day Laban was told that Jacob had fled.",
      "Prefer not to say": "On the third day Laban was told that Jacob had fled."
    },
    "23": {
      "General": "Taking his relatives with him, he pursued Jacob for seven days and caught up with him in the hill country of Gilead.",
      "Non-Denominational": "Taking his relatives with him, he pursued Jacob for seven days and caught up with him in the hill country of Gilead.",
      "Baptist": "Laban immediately gathers his kinsmen and sets off in pursuit. After a seven-day chase, he overtakes Jacob's slower-moving caravan in Gilead.",
      "Catholic": "Laban gathers his kinsmen ('brothers') and mounts a determined pursuit. He travels for seven days and finally overtakes Jacob's party in the hill country of Gilead.",
      "Methodist": "Laban gathers his relatives and pursues Jacob for seven days, catching him in Gilead.",
      "Lutheran": "Laban takes his relatives, pursues Jacob for seven days, and overtakes him in the hill country of Gilead.",
      "Presbyterian": "Laban takes his kinsmen and pursues Jacob for seven days, overtaking him in Gilead.",
      "Pentecostal": "Laban takes relatives, pursues Jacob for seven days, and catches him in Gilead.",
      "Episcopalian/Anglican": "Laban takes his relatives, pursues Jacob for seven days, and catches up with him in the hill country of Gilead.",
      "Orthodox": "Laban assembles his kinsmen and pursues Jacob for seven days, eventually overtaking him in the Gilead region.",
      "Other": "Taking his relatives with him, he pursued Jacob for seven days and caught up with him in the hill country of Gilead.",
      "Prefer not to say": "Taking his relatives with him, he pursued Jacob for seven days and caught up with him in the hill country of Gilead."
    },
    "24": {
      "General": "Then God came to Laban the Aramean in a dream at night and said to him, 'Be careful not to say anything to Jacob, either good or bad.'",
      "Non-Denominational": "Then God came to Laban the Aramean in a dream at night and said to him, 'Be careful not to say anything to Jacob, either good or bad.'",
      "Baptist": "Before Laban can confront Jacob, God intervenes by appearing to Laban in a dream. God warns Laban sternly to be careful and not speak to Jacob in any way that constitutes a threat or attempts to force his return ('speak to Jacob neither good nor bad' - i.e., do not interfere forcefully or judgmentally).",
      "Catholic": "However, before Laban can act on his anger, God intervenes directly, appearing to Laban in a dream during the night. God issues a clear warning: 'Be careful not to say anything to Jacob, either good or bad.' This is a command to refrain from threats, coercion, or any harmful action against Jacob.",
      "Methodist": "God appears to Laban in a dream and warns him not to harm Jacob or interfere with him ('say anything... good or bad').",
      "Lutheran": "God comes to Laban in a dream at night and warns him not to say anything to Jacob, good or bad (i.e., not to interfere or harm him).",
      "Presbyterian": "God appears to Laban in a dream and warns him not to speak harshly or threateningly to Jacob.",
      "Pentecostal": "God warns Laban in a dream not to harm Jacob.",
      "Episcopalian/Anglican": "God intervenes, appearing to Laban in a dream and warning him not to speak to Jacob either good or bad (i.e., not to harm or unduly influence him).",
      "Orthodox": "God appears to Laban in a dream, cautioning him against speaking to Jacob in any manner, whether favorable or unfavorable, implying a warning against coercion or harm.",
      "Other": "Then God came to Laban the Aramean in a dream at night and said to him, 'Be careful not to say anything to Jacob, either good or bad.'",
      "Prefer not to say": "Then God came to Laban the Aramean in a dream at night and said to him, 'Be careful not to say anything to Jacob, either good or bad.'"
    },
    "25": {
      "General": "Laban overtakes Jacob, who had pitched his tent in the hill country; Laban and his relatives camped nearby in Gilead.",
      "Non-Denominational": "Laban overtakes Jacob, who had pitched his tent in the hill country; Laban and his relatives camped nearby in Gilead.",
      "Baptist": "Describes the scene: Jacob has made camp in Gilead when Laban and his kinsmen arrive and camp nearby, setting the stage for the confrontation.",
      "Catholic": "The narrative confirms Laban caught up to Jacob after Jacob had already set up camp in the hill country. Laban and his relatives then pitch their own tents nearby in the same region of Gilead.",
      "Methodist": "Laban catches Jacob after Jacob has already camped in Gilead; Laban and his group camp nearby.",
      "Lutheran": "Laban overtakes Jacob after Jacob has pitched his tent in the hill country; Laban and his relatives camp there as well.",
      "Presbyterian": "Laban overtakes Jacob, who has camped in Gilead. Laban and his kinsmen also camp there.",
      "Pentecostal": "Laban catches Jacob camped in Gilead and camps nearby.",
      "Episcopalian/Anglican": "Laban overtakes Jacob, who had pitched his tent in Gilead; Laban and his relatives also camp there.",
      "Orthodox": "Laban overtakes Jacob, who has already established camp in Gilead; Laban and his kinsmen set up their camp in the vicinity.",
      "Other": "Laban overtakes Jacob, who had pitched his tent in the hill country; Laban and his relatives camped nearby in Gilead.",
      "Prefer not to say": "Laban overtakes Jacob, who had pitched his tent in the hill country; Laban and his relatives camped nearby in Gilead."
    },
    "26": {
      "General": "Then Laban said to Jacob, 'What have you done? You've deceived me, and you've carried off my daughters like captives in war.'",
      "Non-Denominational": "Then Laban said to Jacob, 'What have you done? You've deceived me, and you've carried off my daughters like captives in war.'",
      "Baptist": "Laban confronts Jacob, starting with an accusation: 'What have you done?' He accuses Jacob of deception ('stolen my heart') and of treating his daughters like prisoners of war by taking them away secretly.",
      "Catholic": "Laban initiates the confrontation, tempered perhaps by God's warning but still accusatory: 'What have you done, that you have tricked me and driven away my daughters like captives of the sword?' He accuses Jacob of deception and implies Jacob treated Rachel and Leah disrespectfully, as if they were war booty.",
      "Methodist": "Laban confronts Jacob, accusing him of deception and carrying off his daughters like war captives.",
      "Lutheran": "Laban confronts Jacob, accusing him of deception ('stolen my heart') and carrying off his daughters like captives.",
      "Presbyterian": "Laban confronts Jacob, accusing him of deception and treating his daughters like captives.",
      "Pentecostal": "Laban confronts Jacob, accusing him of deception and taking his daughters like captives.",
      "Episcopalian/Anglican": "Laban confronts Jacob, accusing him of deception and carrying off his daughters like war captives.",
      "Orthodox": "Laban confronts Jacob, accusing him of deceit and of taking his daughters away as if they were captives of war.",
      "Other": "Then Laban said to Jacob, 'What have you done? You've deceived me, and you've carried off my daughters like captives in war.'",
      "Prefer not to say": "Then Laban said to Jacob, 'What have you done? You've deceived me, and you've carried off my daughters like captives in war.'"
    },
    "27": {
      "General": "Why did you run off secretly and deceive me? Why didn't you tell me, so I could send you away with joy and singing to the music of timbrels and harps?",
      "Non-Denominational": "Why did you run off secretly and deceive me? Why didn't you tell me, so I could send you away with joy and singing to the music of timbrels and harps?",
      "Baptist": "Laban questions Jacob's secrecy, claiming (perhaps disingenuously) that if Jacob had told him, he would have given him a proper, festive farewell with music and celebration.",
      "Catholic": "Laban questions the need for secrecy, presenting himself as potentially benevolent: 'Why did you flee secretly and trick me, and did not tell me, so that I might have sent you away with mirth and songs, with tambourine and lyre?' He suggests he would have given Jacob a proper celebratory send-off.",
      "Methodist": "He asks why Jacob left secretly, claiming he would have given him a festive farewell celebration.",
      "Lutheran": "Laban asks why Jacob fled secretly and deceived him, claiming he would have sent him off with joyful celebration (songs, tambourine, lyre).",
      "Presbyterian": "Laban questions the secrecy, claiming he would have provided a celebratory farewell.",
      "Pentecostal": "Laban asks why Jacob left secretly, saying he would have given a party.",
      "Episcopalian/Anglican": "Laban asks why Jacob fled secretly, claiming he would have given him a celebratory farewell with music.",
      "Orthodox": "Laban questions the necessity for secrecy, claiming (perhaps insincerely) that he would have arranged a festive farewell with music had he been informed.",
      "Other": "Why did you run off secretly and deceive me? Why didn't you tell me, so I could send you away with joy and singing to the music of timbrels and harps?",
      "Prefer not to say": "Why did you run off secretly and deceive me? Why didn't you tell me, so I could send you away with joy and singing to the music of timbrels and harps?"
    },
    "28": {
      "General": "You didn't even let me kiss my grandchildren and my daughters goodbye. You have done a foolish thing.",
      "Non-Denominational": "You didn't even let me kiss my grandchildren and my daughters goodbye. You have done a foolish thing.",
      "Baptist": "He further reproaches Jacob for denying him the chance to kiss his daughters and grandchildren goodbye, calling Jacob's secretive actions foolish.",
      "Catholic": "He adds a personal, emotional reproach: 'And why did you not permit me to kiss my sons (grandsons) and my daughters farewell? Now you have done foolishly.' He appeals to familial sentiment, highlighting the denied farewell.",
      "Methodist": "He reproaches Jacob for not allowing him to say goodbye to his daughters and grandchildren, calling his actions foolish.",
      "Lutheran": "He criticizes Jacob for not letting him kiss his grandchildren and daughters goodbye, calling it foolish.",
      "Presbyterian": "He criticizes Jacob for preventing a farewell with his daughters and grandchildren, calling the act foolish.",
      "Pentecostal": "He complains Jacob didn't let him kiss his family goodbye, calling it foolish.",
      "Episcopalian/Anglican": "He reproaches Jacob for not allowing him to kiss his grandchildren and daughters goodbye, calling his actions foolish.",
      "Orthodox": "He reproaches Jacob for depriving him of the opportunity to bid farewell to his daughters and grandchildren with a kiss, deeming Jacob's actions foolish.",
      "Other": "You didn't even let me kiss my grandchildren and my daughters goodbye. You have done a foolish thing.",
      "Prefer not to say": "You didn't even let me kiss my grandchildren and my daughters goodbye. You have done a foolish thing."
    },
    "29": {
      "General": "I have the power to harm you; but last night the God of your father warned me, 'Be careful not to say anything to Jacob, either good or bad.'",
      "Non-Denominational": "I have the power to harm you; but last night the God of your father warned me, 'Be careful not to say anything to Jacob, either good or bad.'",
      "Baptist": "Laban asserts his capability to harm Jacob ('It is in the power of my hand to do you harm') but admits he is constrained by the warning God gave him in the dream the previous night.",
      "Catholic": "Laban makes a veiled threat, asserting his capacity for retaliation: 'It is in my power to do you harm.' However, he immediately reveals the reason for his restraint: 'But the God of your father spoke to me last night, saying, "Be careful not to speak to Jacob either good or bad."' He acknowledges the divine warning prevented him from acting forcefully.",
      "Methodist": "Laban states he has the power to harm Jacob but reveals God warned him in the dream not to interfere.",
      "Lutheran": "Laban claims he has the power to harm Jacob, but admits Jacob's father's God warned him the previous night not to speak good or bad to Jacob.",
      "Presbyterian": "Laban asserts his power to harm Jacob but admits he was warned by God in a dream to refrain.",
      "Pentecostal": "Laban says he could harm Jacob but God warned him not to.",
      "Episcopalian/Anglican": "Laban asserts he has the power to harm Jacob, but reveals that God warned him the previous night not to interfere with Jacob.",
      "Orthodox": "Laban asserts his capability to inflict harm but discloses that the God of Jacob's father warned him in a dream against interfering, whether positively or negatively.",
      "Other": "I have the power to harm you; but last night the God of your father warned me, 'Be careful not to say anything to Jacob, either good or bad.'",
      "Prefer not to say": "I have the power to harm you; but last night the God of your father warned me, 'Be careful not to say anything to Jacob, either good or bad.'"
    },
    "30": {
      "General": "Now you have gone off because you longed to return to your father's household. But why did you steal my gods?'",
      "Non-Denominational": "Now you have gone off because you longed to return to your father's household. But why did you steal my gods?'",
      "Baptist": "Laban concedes Jacob's longing for home as a possible motive for leaving, but then pivots to his main grievance: the theft of his household gods (teraphim).",
      "Catholic": "Laban seems to grudgingly accept Jacob's desire to return home ('And now you have gone away because you longed greatly for your father's house'), but immediately moves to his primary accusation: 'but why did you steal my gods?' The theft of the teraphim is his main concern.",
      "Methodist": "Laban acknowledges Jacob's longing for home but demands to know why Jacob (or someone with him) stole his household gods.",
      "Lutheran": "Laban concedes Jacob left because he longed for home, but then asks why he stole his gods (teraphim).",
      "Presbyterian": "Laban acknowledges Jacob's desire to return home but demands to know why his gods were stolen.",
      "Pentecostal": "Laban accepts Jacob wanted to go home, but asks why he stole his gods.",
      "Episcopalian/Anglican": "Laban concedes Jacob's longing for home but confronts him about the theft of his household gods.",
      "Orthodox": "Laban acknowledges Jacob's yearning for his ancestral home but directly questions the theft of his household gods.",
      "Other": "Now you have gone off because you longed to return to your father's household. But why did you steal my gods?'",
      "Prefer not to say": "Now you have gone off because you longed to return to your father's household. But why did you steal my gods?'"
    },
    "31": {
      "General": "Jacob answered Laban, 'I was afraid, because I thought you would take your daughters away from me by force.'",
      "Non-Denominational": "Jacob answered Laban, 'I was afraid, because I thought you would take your daughters away from me by force.'",
      "Baptist": "Jacob explains his secretive departure: he was afraid Laban would forcibly prevent him from leaving, potentially taking back his daughters (Jacob's wives).",
      "Catholic": "Jacob explains his reason for fleeing secretly: 'Because I was afraid, for I thought that you would take your daughters from me by force.' He feared Laban would prevent his departure, possibly by forcibly keeping Rachel and Leah.",
      "Methodist": "Jacob explains he left secretly because he feared Laban would forcibly take his daughters back.",
      "Lutheran": "Jacob explains he fled secretly because he was afraid Laban would forcibly take his daughters away.",
      "Presbyterian": "Jacob explains his fear that Laban would forcibly prevent him from leaving with his daughters motivated his secret departure.",
      "Pentecostal": "Jacob says he was afraid Laban would take his daughters back by force.",
      "Episcopalian/Anglican": "Jacob explains his secrecy by stating he feared Laban would forcibly take his daughters from him.",
      "Orthodox": "Jacob justifies his clandestine departure by expressing fear that Laban would have forcibly prevented him from leaving with his daughters.",
      "Other": "Jacob answered Laban, 'I was afraid, because I thought you would take your daughters away from me by force.'",
      "Prefer not to say": "Jacob answered Laban, 'I was afraid, because I thought you would take your daughters away from me by force.'"
    },
    "32": {
      "General": "Regarding the idols, Jacob, unaware Rachel took them, confidently declares that anyone found with Laban's gods shall not live, inviting Laban to search and take anything that is his.",
      "Non-Denominational": "Regarding the idols, Jacob, unaware Rachel took them, confidently declares that anyone found with Laban's gods shall not live, inviting Laban to search and take anything that is his.",
      "Baptist": "Regarding the stolen gods, Jacob, unaware Rachel took them, confidently declares that whoever has them deserves death. He invites Laban to search his belongings thoroughly in front of everyone.",
      "Catholic": "Regarding the stolen gods, Jacob, completely unaware of Rachel's culpability, makes a rash and dangerous vow: 'Anyone with whom you find your gods shall not live.' He invites Laban to conduct a thorough search in the presence of their kinsmen: 'In the presence of our kinsmen point out what I have that is yours, and take it.' The narrator explicitly notes Jacob's ignorance of Rachel's theft.",
      "Methodist": "Unaware of Rachel's theft, Jacob rashly declares the thief should die and invites Laban to search his belongings.",
      "Lutheran": "Jacob, unaware Rachel stole them, declares whoever has Laban's gods shall not live and invites Laban to search his possessions.",
      "Presbyterian": "Unaware of Rachel's theft, Jacob declares the thief deserves death and invites Laban to search his possessions.",
      "Pentecostal": "Jacob, not knowing Rachel stole them, says the thief should die and invites Laban to search.",
      "Episcopalian/Anglican": "Jacob, unaware that Rachel had stolen the gods, declares that whoever possesses them shall not live and invites Laban to search his belongings.",
      "Orthodox": "Ignorant of Rachel's actions, Jacob rashly pronounces a death sentence upon whomever is found with the idols and invites Laban to conduct a search.",
      "Other": "Regarding the idols, Jacob, unaware Rachel took them, confidently declares that anyone found with Laban's gods shall not live, inviting Laban to search and take anything that is his.",
      "Prefer not to say": "Regarding the idols, Jacob, unaware Rachel took them, confidently declares that anyone found with Laban's gods shall not live, inviting Laban to search and take anything that is his."
    },
    "33": {
      "General": "Laban searched Jacob's tent, Leah's tent, and the tents of the two female servants, but found nothing.",
      "Non-Denominational": "Laban searched Jacob's tent, Leah's tent, and the tents of the two female servants, but found nothing.",
      "Baptist": "Laban conducts the search, checking Jacob's tent, Leah's tent, and the tents of Bilhah and Zilpah, finding nothing. He then proceeds to Rachel's tent.",
      "Catholic": "Laban proceeds with the search, entering Jacob's tent, then Leah's tent, and then the tents of the two handmaids (Bilhah and Zilpah), but he finds nothing. Finally, having searched Leah's tent, he enters Rachel's tent.",
      "Methodist": "Laban searches Jacob's tent, Leah's tent, and the servants' tents, finding nothing, before entering Rachel's tent.",
      "Lutheran": "Laban searches Jacob's, Leah's, and the two servants' tents, finding nothing. Then he enters Rachel's tent.",
      "Presbyterian": "Laban searches the tents of Jacob, Leah, and the servants, finding nothing, before entering Rachel's tent.",
      "Pentecostal": "Laban searches the tents but finds nothing, then goes to Rachel's tent.",
      "Episcopalian/Anglican": "Laban searches Jacob's, Leah's, and the servants' tents without success, then enters Rachel's tent.",
      "Orthodox": "Laban conducts a search through Jacob's tent, Leah's tent, and the tents of the two handmaids without finding the idols, before proceeding to Rachel's tent.",
      "Other": "Laban searched Jacob's tent, Leah's tent, and the tents of the two female servants, but found nothing.",
      "Prefer not to say": "Laban searched Jacob's tent, Leah's tent, and the tents of the two female servants, but found nothing."
    },
    "34": {
      "General": "Now Rachel had taken the household gods and put them inside her camel's saddle and was sitting on them. Laban searched through everything in the tent but found nothing.",
      "Non-Denominational": "Now Rachel had taken the household gods and put them inside her camel's saddle and was sitting on them. Laban searched through everything in the tent but found nothing.",
      "Baptist": "Rachel had hidden the teraphim in her camel's saddlebag and was sitting on it during the search. Laban searches her tent thoroughly but fails to find the idols due to her deception.",
      "Catholic": "The narrator reveals Rachel's stratagem: she had taken the household gods, placed them inside the camel's saddle cushion/equipment, and was sitting upon them. Laban searches her entire tent but does not find them, likely respecting her seated position or simply not thinking to search there.",
      "Methodist": "Rachel had hidden the gods in her camel saddle and was sitting on it. Laban searches the tent but doesn't find them.",
      "Lutheran": "Rachel had hidden the teraphim in the camel's saddle and was sitting on them. Laban searches the tent but doesn't find them.",
      "Presbyterian": "Rachel had hidden the gods in her camel's saddle and sat on them, preventing Laban from finding them during his search.",
      "Pentecostal": "Rachel hid the gods in her camel saddle and sat on it, so Laban didn't find them.",
      "Episcopalian/Anglican": "Rachel had hidden the household gods in her camel's saddle and was sitting on them. Laban searched the tent but found nothing.",
      "Orthodox": "Rachel had concealed the idols within her camel's saddle and was seated upon it. Laban searches the tent thoroughly but fails to locate them.",
      "Other": "Now Rachel had taken the household gods and put them inside her camel's saddle and was sitting on them. Laban searched through everything in the tent but found nothing.",
      "Prefer not to say": "Now Rachel had taken the household gods and put them inside her camel's saddle and was sitting on them. Laban searched through everything in the tent but found nothing."
    },
    "35": {
      "General": "Rachel said to her father, 'Don't be angry, my lord, that I cannot stand up in your presence; I'm having my period.' So he searched but could not find the household gods.",
      "Non-Denominational": "Rachel said to her father, 'Don't be angry, my lord, that I cannot stand up in your presence; I'm having my period.' So he searched but could not find the household gods.",
      "Baptist": "Rachel uses the excuse of menstruation ('the way of women is upon me') as a reason for not standing up out of respect for her father, thereby preventing him from disturbing her seat (and the hidden idols). Laban accepts this and completes his unsuccessful search.",
      "Catholic": "Rachel further ensures the idols remain hidden by appealing to cultural sensitivity: 'Let not my lord be angry that I cannot rise before you, for the way of women is upon me.' By claiming to be menstruating (considered a state of ritual impurity), she discourages Laban from asking her to move or searching directly under her, effectively using social taboo to conceal her theft. Laban completes his search without finding the teraphim.",
      "Methodist": "Rachel excuses herself from standing (and potentially revealing the gods) by claiming she is menstruating. Laban finishes his search unsuccessfully.",
      "Lutheran": "Rachel asks Laban not to be angry that she cannot stand, claiming menstruation ('the way of women'). Laban searches but does not find the teraphim.",
      "Presbyterian": "Rachel uses the excuse of menstruation to avoid standing and revealing the hidden gods. Laban fails to find them.",
      "Pentecostal": "Rachel claims menstruation to avoid standing up; Laban doesn't find the gods.",
      "Episcopalian/Anglican": "Rachel excuses herself from rising before Laban by claiming menstruation, thus preventing discovery of the hidden idols. Laban's search remains fruitless.",
      "Orthodox": "Rachel excuses herself from rising by claiming menstruation, a culturally accepted reason that prevents Laban from disturbing her position and discovering the idols. The search concludes unsuccessfully.",
      "Other": "Rachel said to her father, 'Don't be angry, my lord, that I cannot stand up in your presence; I'm having my period.' So he searched but could not find the household gods.",
      "Prefer not to say": "Rachel said to her father, 'Don't be angry, my lord, that I cannot stand up in your presence; I'm having my period.' So he searched but could not find the household gods."
    },
    "36": {
      "General": "Jacob became angry and took Laban to task. 'What is my crime?' he asked Laban. 'How have I wronged you that you hunt me down?'",
      "Non-Denominational": "Jacob became angry and took Laban to task. 'What is my crime?' he asked Laban. 'How have I wronged you that you hunt me down?'",
      "Baptist": "Vindicated by the unsuccessful search, Jacob becomes angry and confronts Laban sharply, demanding to know what offense he committed to warrant such hostile pursuit.",
      "Catholic": "Now that the search has failed to substantiate Laban's accusation, Jacob's own anger erupts. He vehemently rebukes Laban: 'What is my offense? What is my sin, that you have hotly pursued me?'",
      "Methodist": "Jacob, now angry after the fruitless search, confronts Laban, demanding to know his crime that warranted such pursuit.",
      "Lutheran": "Jacob becomes angry and confronts Laban, asking what crime he committed that Laban pursued him so hotly.",
      "Presbyterian": "Jacob, angered by the baseless accusation, confronts Laban, demanding to know his supposed crime.",
      "Pentecostal": "Jacob gets angry and confronts Laban, asking what crime he committed.",
      "Episcopalian/Anglican": "Jacob becomes angry and rebukes Laban, demanding to know what wrong he has done to deserve being pursued.",
      "Orthodox": "Infuriated by the unfounded accusation, Jacob confronts Laban sharply, demanding to know what crime justified such aggressive pursuit.",
      "Other": "Jacob became angry and took Laban to task. 'What is my crime?' he asked Laban. 'How have I wronged you that you hunt me down?'",
      "Prefer not to say": "Jacob became angry and took Laban to task. 'What is my crime?' he asked Laban. 'How have I wronged you that you hunt me down?'"
    },
    "37": {
      "General": "Now that you have searched through all my goods, what have you found that belongs to your household? Put it here in front of your relatives and mine, and let them judge between the two of us.'",
      "Non-Denominational": "Now that you have searched through all my goods, what have you found that belongs to your household? Put it here in front of your relatives and mine, and let them judge between the two of us.'",
      "Baptist": "Jacob challenges Laban to produce any stolen item found during the exhaustive search. He demands that any such item be placed before both Laban's and Jacob's relatives (present as witnesses) to judge the matter fairly.",
      "Catholic": "Jacob challenges Laban directly: 'Now that you have felt through all my goods, what have you found of all your household goods?' He demands Laban present any evidence found during the search before their assembled kinsmen ('Set it here before my kinsmen and your kinsmen, that they may decide between us two'), calling for arbitration.",
      "Methodist": "Jacob challenges Laban to show any stolen goods found and suggests letting their relatives judge the dispute.",
      "Lutheran": "Jacob challenges Laban to show what household goods he found after searching, suggesting they put it before their relatives to judge between them.",
      "Presbyterian": "Jacob challenges Laban to present any stolen goods found during the search and proposes letting their relatives arbitrate.",
      "Pentecostal": "Jacob challenges Laban to show any stolen goods and let their relatives judge.",
      "Episcopalian/Anglican": "Jacob challenges Laban to present any of his household goods found during the search and proposes letting their relatives judge between them.",
      "Orthodox": "Jacob challenges Laban to produce any of his possessions found among Jacob's belongings and proposes that their assembled relatives arbitrate the dispute.",
      "Other": "Now that you have searched through all my goods, what have you found that belongs to your household? Put it here in front of your relatives and mine, and let them judge between the two of us.'",
      "Prefer not to say": "Now that you have searched through all my goods, what have you found that belongs to your household? Put it here in front of your relatives and mine, and let them judge between the two of us.'"
    },
    "38": {
      "General": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten rams from your flocks.",
      "Non-Denominational": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten rams from your flocks.",
      "Baptist": "Jacob launches into a defense of his 20 years of service, highlighting his faithful stewardship: Laban's flocks thrived (no miscarriages), and Jacob never took even the rams for his own consumption.",
      "Catholic": "Jacob begins a passionate defense of his conduct over the twenty years he served Laban. He points to the health and productivity of the flocks under his care ('These twenty years I have been with you; your ewes and your female goats have not miscarried') and his own integrity ('and I have not eaten the rams of your flocks').",
      "Methodist": "Jacob begins his defense, stating that in his 20 years of service, Laban's flocks didn't miscarry, and he never consumed Laban's rams.",
      "Lutheran": "Jacob emphasizes his 20 years with Laban, during which Laban's sheep/goats did not miscarry, and Jacob did not eat Laban's rams.",
      "Presbyterian": "Jacob defends his 20 years of service, highlighting the flock's health and his own integrity (never eating Laban's rams).",
      "Pentecostal": "Jacob defends his 20 years of service, noting the flock's health and his honesty.",
      "Episcopalian/Anglican": "Jacob defends his 20 years of service, stating Laban's flocks did not miscarry and he did not eat Laban's rams.",
      "Orthodox": "Jacob commences his defense by highlighting his twenty years of service, emphasizing the fecundity of the flocks under his care and his personal integrity in not consuming Laban's rams.",
      "Other": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten rams from your flocks.",
      "Prefer not to say": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten rams from your flocks."
    },
    "39": {
      "General": "I did not bring you animals torn by wild beasts; I bore the loss myself. And you demanded payment from me for whatever was stolen by day or night.",
      "Non-Denominational": "I did not bring you animals torn by wild beasts; I bore the loss myself. And you demanded payment from me for whatever was stolen by day or night.",
      "Baptist": "He further states he personally absorbed losses from wild animals (instead of bringing the carcasses as proof, as a shepherd might normally do to avoid liability) and that Laban held him responsible for *any* stolen animals, day or night, contrary to typical arrangements.",
      "Catholic": "He continues detailing his exceptional diligence and Laban's harsh terms. He didn't present animals killed by predators to Laban (which might excuse him from liability), but instead 'bore the loss' himself. Furthermore, Laban unjustly demanded restitution from Jacob for animals stolen by others, whether by day or night.",
      "Methodist": "He states he personally covered losses from wild animals and that Laban unfairly demanded payment for any animal stolen day or night.",
      "Lutheran": "He claims he didn't bring Laban animals torn by beasts but bore the loss himself, and Laban demanded restitution for anything stolen day or night.",
      "Presbyterian": "He asserts he personally bore losses from predators and that Laban held him accountable for all thefts, day or night.",
      "Pentecostal": "He says he covered losses from wild animals and Laban made him pay for anything stolen.",
      "Episcopalian/Anglican": "He states he bore the loss of animals killed by wild beasts himself and that Laban demanded restitution for anything stolen, day or night.",
      "Orthodox": "He asserts that he personally absorbed losses from predators rather than presenting evidence to Laban, and that Laban held him accountable for any theft, regardless of circumstance.",
      "Other": "I did not bring you animals torn by wild beasts; I bore the loss myself. And you demanded payment from me for whatever was stolen by day or night.",
      "Prefer not to say": "I did not bring you animals torn by wild beasts; I bore the loss myself. And you demanded payment from me for whatever was stolen by day or night."
    },
    "40": {
      "General": "This was my situation: The heat consumed me in the daytime and the cold at night, and sleep fled from my eyes.",
      "Non-Denominational": "This was my situation: The heat consumed me in the daytime and the cold at night, and sleep fled from my eyes.",
      "Baptist": "He describes the harsh conditions and his constant vigilance: enduring extreme heat by day and cold by night, often losing sleep to protect the flocks.",
      "Catholic": "He vividly describes the hardships he endured: 'By day the heat consumed me, and the cold by night, and my sleep fled from my eyes.' He emphasizes his constant exposure and lack of rest in fulfilling his duties.",
      "Methodist": "He describes his hardship: enduring heat by day, cold by night, and losing sleep due to his vigilance.",
      "Lutheran": "He describes his suffering: consumed by heat in the day and cold at night, losing sleep.",
      "Presbyterian": "He recounts the harsh conditions he endured: extreme heat and cold, and sleepless vigilance.",
      "Pentecostal": "He describes working in harsh heat and cold, without sleep.",
      "Episcopalian/Anglican": "He describes the harsh conditions he endured: heat by day, cold by night, and lack of sleep.",
      "Orthodox": "He depicts the arduous conditions of his service, enduring extreme temperatures day and night and suffering from lack of sleep.",
      "Other": "This was my situation: The heat consumed me in the daytime and the cold at night, and sleep fled from my eyes.",
      "Prefer not to say": "This was my situation: The heat consumed me in the daytime and the cold at night, and sleep fled from my eyes."
    },
    "41": {
      "General": "It was like this for the twenty years I was in your household. I worked for you fourteen years for your two daughters and six years for your flocks, and you changed my wages ten times.",
      "Non-Denominational": "It was like this for the twenty years I was in your household. I worked for you fourteen years for your two daughters and six years for your flocks, and you changed my wages ten times.",
      "Baptist": "Jacob summarizes his 20 years: 14 years of labor for Rachel and Leah, and 6 years for the flocks, during which Laban repeatedly changed his wages.",
      "Catholic": "He summarizes his twenty years of service: fourteen years for Laban's two daughters and six years for the flocks. He reiterates Laban's persistent unfairness: 'and you have changed my wages ten times.'",
      "Methodist": "He summarizes his 20 years: 14 for the daughters, 6 for the flocks, during which Laban changed his wages repeatedly.",
      "Lutheran": "He summarizes: 20 years in Laban's house, 14 serving for the daughters, 6 for the flocks, and Laban changed his wages ten times.",
      "Presbyterian": "He summarizes his 20 years of service (14 for the wives, 6 for the flocks) and reiterates Laban's repeated changes to his wages.",
      "Pentecostal": "He sums up 20 years: 14 for wives, 6 for flocks, and Laban changing wages ten times.",
      "Episcopalian/Anglican": "He summarizes his 20 years of service: 14 years for the two daughters and 6 years for the flocks, emphasizing again that Laban changed his wages ten times.",
      "Orthodox": "He recapitulates his twenty years in Laban's household, detailing fourteen years of service for the two daughters and six years for the flocks, while reiterating Laban's frequent alteration of his wages.",
      "Other": "It was like this for the twenty years I was in your household. I worked for you fourteen years for your two daughters and six years for your flocks, and you changed my wages ten times.",
      "Prefer not to say": "It was like this for the twenty years I was in your household. I worked for you fourteen years for your two daughters and six years for your flocks, and you changed my wages ten times."
    },
    "42": {
      "General": "If the God of my father, the God of Abraham and the Fear of Isaac, had not been with me, you would surely have sent me away empty-handed. But God has seen my hardship and the toil of my hands, and last night he rebuked you.'",
      "Non-Denominational": "If the God of my father, the God of Abraham and the Fear of Isaac, had not been with me, you would surely have sent me away empty-handed. But God has seen my hardship and the toil of my hands, and last night he rebuked you.'",
      "Baptist": "Jacob credits his survival and success solely to God's presence ('the God of my father, the God of Abraham, and the Fear of Isaac'). Without God, he believes Laban would have exploited him completely. He asserts God saw his suffering and hard work, and intervened by rebuking Laban the previous night.",
      "Catholic": "Jacob attributes his escape from utter exploitation solely to divine protection: 'If the God of my father, the God of Abraham and the Fear of Isaac, had not been on my side, surely now you would have sent me away empty-handed.' He emphasizes God's awareness ('God saw my affliction and the labor of my hands') and His direct intervention ('and rebuked you last night'). 'Fear of Isaac' is a unique title for God, perhaps emphasizing awe or reverence.",
      "Methodist": "Jacob attributes his escape from being sent away empty-handed solely to God's presence ('God of my father, God of Abraham, Fear of Isaac'). He states God saw his hardship and labor, and rebuked Laban the night before.",
      "Lutheran": "Jacob declares that if God (God of Abraham, Fear of Isaac) had not been with him, Laban would have sent him away empty-handed. He asserts God saw his affliction/labor and rebuked Laban the previous night.",
      "Presbyterian": "Jacob credits God ('God of Abraham', 'Fear of Isaac') for preventing Laban from sending him away empty-handed, stating God saw his hardship and rebuked Laban.",
      "Pentecostal": "Jacob credits God (using ancestral titles) for his success, saying God saw his hardship and rebuked Laban.",
      "Episcopalian/Anglican": "Jacob asserts that only the presence of God ('God of my father, God of Abraham, Fear of Isaac') prevented Laban from sending him away empty-handed. He declares God saw his hardship and toil and therefore rebuked Laban the previous night.",
      "Orthodox": "Jacob attributes his avoidance of complete ruin solely to the intervention of the God of his ancestors ('God of Abraham', 'Fear of Isaac'), asserting that God observed his suffering and labor, and consequently rebuked Laban the previous night.",
      "Other": "If the God of my father, the God of Abraham and the Fear of Isaac, had not been with me, you would surely have sent me away empty-handed. But God has seen my hardship and the toil of my hands, and last night he rebuked you.'",
      "Prefer not to say": "If the God of my father, the God of Abraham and the Fear of Isaac, had not been with me, you would surely have sent me away empty-handed. But God has seen my hardship and the toil of my hands, and last night he rebuked you.'"
    },
    "43": {
      "General": "Laban responded Jacob, 'The women are my daughters, the children are my children, and the flocks are my flocks. All you see is mine. Yet what can I do today about these daughters of mine, or about the children they have borne?'",
      "Non-Denominational": "Laban responded Jacob, 'The women are my daughters, the children are my children, and the flocks are my flocks. All you see is mine. Yet what can I do today about these daughters of mine, or about the children they have borne?'",
      "Baptist": "Laban responds, not by addressing Jacob's defense, but by reasserting his claim over everything: the daughters, the grandchildren, the flocks – 'All that you see is mine.' However, acknowledging God's warning (implicitly) and the reality of the situation, he concedes helplessness: 'Yet what can I do...?'.",
      "Catholic": "Laban deflects Jacob's accusations by making a sweeping claim of ownership: 'The daughters are my daughters, the children are my children, the flocks are my flocks. All that you see is mine.' Despite this assertion of patriarchal right, he immediately acknowledges his inability to act against them due to God's intervention: 'But what can I do this day for these my daughters or for their children whom they have borne?'",
      "Methodist": "Laban avoids Jacob's points and broadly claims ownership of the daughters, grandchildren, and flocks, but then concedes impotence ('What can I do?') due to God's warning.",
      "Lutheran": "Laban responds by claiming ownership of the daughters, children, and flocks ('All you see is mine'), but then asks rhetorically what he can do about them now (implicitly acknowledging God's restraint).",
      "Presbyterian": "Laban sidesteps the accusations, asserting ownership over the family and flocks, but concedes his inability to act against them.",
      "Pentecostal": "Laban claims everything is his, but asks what he can do now.",
      "Episcopalian/Anglican": "Laban responds by claiming ownership over the daughters, children, and flocks, but concedes helplessness regarding them.",
      "Orthodox": "Laban sidesteps Jacob's defense by broadly asserting ownership over the daughters, grandchildren, and flocks, yet simultaneously acknowledges his inability to act against them.",
      "Other": "Laban responded Jacob, 'The women are my daughters, the children are my children, and the flocks are my flocks. All you see is mine. Yet what can I do today about these daughters of mine, or about the children they have borne?'",
      "Prefer not to say": "Laban responded Jacob, 'The women are my daughters, the children are my children, and the flocks are my flocks. All you see is mine. Yet what can I do today about these daughters of mine, or about the children they have borne?'"
    },
    "44": {
      "General": "Come now, let's make a covenant, you and I, and let it serve as a witness.'",
      "Non-Denominational": "Come now, let's make a covenant, you and I, and let it serve as a witness.'",
      "Baptist": "Recognizing the impasse and likely desiring some face-saving resolution and boundary, Laban proposes making a formal covenant or treaty between himself and Jacob, which will serve as a binding witness to their agreement.",
      "Catholic": "Having acknowledged his inability to force Jacob's return or reclaim the flocks, Laban shifts tactics and proposes a resolution: 'Come now, let us make a covenant, you and I; and let it be a witness between you and me.' He seeks a formal treaty to establish boundaries and future relations.",
      "Methodist": "Laban proposes making a covenant (treaty) between them to serve as a witness and define their separation.",
      "Lutheran": "Laban proposes they make a covenant (treaty) to serve as a witness between them.",
      "Presbyterian": "Laban proposes making a covenant (treaty) to serve as a witness between them.",
      "Pentecostal": "Laban proposes they make a covenant.",
      "Episcopalian/Anglican": "Laban proposes making a covenant between them to serve as a witness.",
      "Orthodox": "Laban proposes the establishment of a covenant between them to serve as a formal witness to their agreement.",
      "Other": "Come now, let's make a covenant, you and I, and let it serve as a witness.'",
      "Prefer not to say": "Come now, let's make a covenant, you and I, and let it serve as a witness.'"
    },
    "45": {
      "General": "So Jacob took a stone and set it up as a pillar.",
      "Non-Denominational": "So Jacob took a stone and set it up as a pillar.",
      "Baptist": "Jacob agrees and initiates the covenant ceremony by taking a large stone and setting it upright as a pillar, a common practice for marking significant events or agreements.",
      "Catholic": "Jacob agrees to the proposal and takes the initiative in the ritual. He selects a stone and sets it up as a monumental pillar (matzevah), a traditional way to commemorate a significant event or agreement.",
      "Methodist": "Jacob agrees and sets up a stone as a pillar to mark the covenant.",
      "Lutheran": "Jacob takes a stone and sets it up as a pillar.",
      "Presbyterian": "Jacob takes a stone and sets it up as a pillar.",
      "Pentecostal": "Jacob sets up a stone pillar.",
      "Episcopalian/Anglican": "Jacob takes a stone and sets it up as a pillar.",
      "Orthodox": "Jacob takes a stone and erects it as a pillar to commemorate the agreement.",
      "Other": "So Jacob took a stone and set it up as a pillar.",
      "Prefer not to say": "So Jacob took a stone and set it up as a pillar."
    },
    "46": {
      "General": "He instructed his relatives to gather stones, which they piled into a heap. They then ate a meal there by the heap.",
      "Non-Denominational": "He instructed his relatives to gather stones, which they piled into a heap. They then ate a meal there by the heap.",
      "Baptist": "Jacob instructs his relatives to gather more stones, which they pile into a heap or cairn. They then share a covenant meal together beside the heap of stones.",
      "Catholic": "Jacob then instructs his kinsmen ('brothers') to gather stones. They collect stones and make a heap (gal). As part of the covenant ceremony, they share a meal together there beside the stone heap, signifying fellowship and agreement.",
      "Methodist": "Jacob tells his relatives to gather stones into a heap, and they share a covenant meal beside it.",
      "Lutheran": "Jacob instructs his relatives to gather stones; they make a heap and eat a meal there by the heap.",
      "Presbyterian": "Jacob instructs his relatives to gather stones into a heap, beside which they share a covenant meal.",
      "Pentecostal": "Jacob tells his relatives to make a heap of stones; they eat there.",
      "Episcopalian/Anglican": "Jacob instructs his relatives to gather stones into a heap, and they eat a meal together there.",
      "Orthodox": "Jacob directs his kinsmen to gather stones, forming a heap, beside which they partake in a covenantal meal.",
      "Other": "He instructed his relatives to gather stones, which they piled into a heap. They then ate a meal there by the heap.",
      "Prefer not to say": "He instructed his relatives to gather stones, which they piled into a heap. They then ate a meal there by the heap."
    },
    "47": {
      "General": "Laban called it Jegar Sahadutha, and Jacob called it Galeed.",
      "Non-Denominational": "Laban called it Jegar Sahadutha, and Jacob called it Galeed.",
      "Baptist": "Laban names the heap in Aramaic (Jegar-sahadutha) and Jacob names it in Hebrew (Galeed). Both names mean 'Heap of Witness', reflecting the purpose of the stone pile.",
      "Catholic": "Laban gives the heap an Aramaic name, Jegar-sahadutha, while Jacob gives it the equivalent Hebrew name, Galeed. Both names mean 'Heap of Witness,' signifying the pile of stones serves as a testimony to the covenant made there.",
      "Methodist": "Laban names the heap Jegar Sahadutha (Aramaic for 'Heap of Witness'), and Jacob names it Galeed (Hebrew for 'Heap of Witness').",
      "Lutheran": "Laban calls the heap Jegar-sahadutha (Aramaic: 'Heap of Witness'); Jacob calls it Galeed (Hebrew: 'Heap of Witness').",
      "Presbyterian": "Laban and Jacob give the heap equivalent names in Aramaic (Jegar-sahadutha) and Hebrew (Galeed), both meaning 'Heap of Witness'.",
      "Pentecostal": "Laban calls it Jegar Sahadutha; Jacob calls it Galeed (both mean 'Heap of Witness').",
      "Episcopalian/Anglican": "Laban names the heap Jegar Sahadutha (Aramaic) and Jacob names it Galeed (Hebrew), both meaning 'Heap of Witness'.",
      "Orthodox": "Laban designates the heap 'Jegar-sahadutha' (Aramaic), while Jacob calls it 'Galeed' (Hebrew); both names signify 'Heap of Witness'.",
      "Other": "Laban called it Jegar Sahadutha, and Jacob called it Galeed.",
      "Prefer not to say": "Laban called it Jegar Sahadutha, and Jacob called it Galeed."
    },
    "48": {
      "General": "Laban declared the heap is a witness between them that day.",
      "Non-Denominational": "Laban declared the heap is a witness between them that day.",
      "Baptist": "Laban explicitly states the function of the heap: it serves as a perpetual witness to the agreement established between them that day. The verse confirms this is the origin of the name Galeed.",
      "Catholic": "Laban formally declares the significance of the stone pile: 'This heap is a witness between you and me today.' The narrator adds that this declaration is the reason the place was called Galeed.",
      "Methodist": "Laban declares the heap is a witness between them, explaining the name Galeed.",
      "Lutheran": "Laban declares the heap is a witness between them today, hence the name Galeed.",
      "Presbyterian": "Laban affirms the heap serves as a witness between them, hence the name Galeed.",
      "Pentecostal": "Laban says the heap is a witness between them.",
      "Episcopalian/Anglican": "Laban declares the heap is a witness between them, explaining the name Galeed.",
      "Orthodox": "Laban formally states that the heap serves as a witness between them, explaining the origin of the name Galeed.",
      "Other": "Laban declared the heap is a witness between them that day.",
      "Prefer not to say": "Laban declared the heap is a witness between them that day."
    },
    "49": {
      "General": "It was also called Mizpah, because he said, 'May the Lord keep watch between you and me when we are away from each other.'",
      "Non-Denominational": "It was also called Mizpah, because he said, 'May the Lord keep watch between you and me when we are away from each other.'",
      "Baptist": "The place/heap is also given another name, Mizpah (meaning 'Watchpost'). Laban invokes God as the divine Watchman to oversee their adherence to the covenant when they are separated and cannot watch each other.",
      "Catholic": "The site receives another name, Mizpah (meaning 'Watchpost'). Laban explains this name with an invocation: 'The Lord watch between you and me, when we are out of one another's sight.' This calls upon God to act as the overseer of the covenant, ensuring compliance even when they are physically separated.",
      "Methodist": "It's also named Mizpah ('Watchpost'), as Laban invokes God to watch over them and the covenant when they are apart.",
      "Lutheran": "It is also called Mizpah ('Watchpost'), because Laban says, 'May Yahweh watch between you and me when we are hidden from each other.'",
      "Presbyterian": "The site is also called Mizpah ('Watchpost'), reflecting Laban's invocation for God to watch over their compliance when separated.",
      "Pentecostal": "It's also called Mizpah ('Watchpost'), invoking God to watch over them.",
      "Episcopalian/Anglican": "It is also called Mizpah ('Watchpost'), with Laban invoking the Lord to watch between them when they are apart.",
      "Orthodox": "The location is also named Mizpah ('Watchpost'), accompanied by Laban's invocation for the Lord to maintain watch over both parties when they are separated.",
      "Other": "It was also called Mizpah, because he said, 'May the Lord keep watch between you and me when we are away from each other.'",
      "Prefer not to say": "It was also called Mizpah, because he said, 'May the Lord keep watch between you and me when we are away from each other.'"
    },
    "50": {
      "General": "Laban warned Jacob: if Jacob mistreats Laban's daughters or takes other wives, even though no one is with us, remember that God is a witness between you and me.'",
      "Non-Denominational": "Laban warned Jacob: if Jacob mistreats Laban's daughters or takes other wives, even though no one is with us, remember that God is a witness between you and me.'",
      "Baptist": "Laban specifies terms of the covenant related to Jacob's treatment of Leah and Rachel: Jacob must not mistreat them or take additional wives beyond them. Laban reminds Jacob that even with no human witnesses, God Himself witnesses this agreement.",
      "Catholic": "Laban stipulates specific conditions under God's watch: 'If you oppress my daughters, or if you take wives besides my daughters, although no man is with us, see, God is witness between you and me.' He seeks to ensure the well-being of his daughters and limit Jacob's future marriages, invoking God as the ultimate enforcer.",
      "Methodist": "Laban stipulates Jacob must not mistreat his daughters or take other wives, reminding him God is witness even when no humans are present.",
      "Lutheran": "Laban warns Jacob not to mistreat his daughters or take other wives, reminding him God is witness even if no person is there.",
      "Presbyterian": "Laban stipulates that Jacob must not mistreat his daughters or take additional wives, invoking God as the witness.",
      "Pentecostal": "Laban warns Jacob not to mistreat his daughters or take other wives, reminding him God is witness.",
      "Episcopalian/Anglican": "Laban stipulates that Jacob must not mistreat his daughters or take other wives besides them, reminding him that God is witness even when no person is present.",
      "Orthodox": "Laban stipulates conditions under divine watch: Jacob must not mistreat Laban's daughters nor take additional wives, reminding him that God serves as witness even in the absence of human observers.",
      "Other": "Laban warned Jacob: if Jacob mistreats Laban's daughters or takes other wives, even though no one is with us, remember that God is a witness between you and me.'",
      "Prefer not to say": "Laban warned Jacob: if Jacob mistreats Laban's daughters or takes other wives, even though no one is with us, remember that God is a witness between you and me.'"
    },
    "51": {
      "General": "Laban pointed to the heap and the pillar as witnesses of their agreement.",
      "Non-Denominational": "Laban pointed to the heap and the pillar as witnesses of their agreement.",
      "Baptist": "Laban points again to the physical markers – the heap and the pillar – emphasizing their role as tangible witnesses to the covenant boundary.",
      "Catholic": "Laban reiterates the significance of the physical markers: 'See this heap and the pillar, which I have set between you and me.' (Note: Jacob set the pillar, Laban claims partial credit or simply refers to it being established between them).",
      "Methodist": "Laban points to the heap and pillar as the established boundary markers between them.",
      "Lutheran": "Laban points to the heap and pillar he has set up between them.",
      "Presbyterian": "Laban points again to the heap and pillar as witnesses to their agreement.",
      "Pentecostal": "Laban points to the heap and pillar.",
      "Episcopalian/Anglican": "Laban points to the heap and pillar as the established markers between them.",
      "Orthodox": "Laban gestures towards the heap and the pillar as the physical markers established between them.",
      "Other": "Laban pointed to the heap and the pillar as witnesses of their agreement.",
      "Prefer not to say": "Laban pointed to the heap and the pillar as witnesses of their agreement."
    },
    "52": {
      "General": "He stated the terms: the heap and pillar are boundaries neither will cross to harm the other.",
      "Non-Denominational": "He stated the terms: the heap and pillar are boundaries neither will cross to harm the other.",
      "Baptist": "He defines the boundary explicitly: neither party is to cross the heap/pillar to inflict harm on the other. It marks a non-aggression pact and territorial boundary.",
      "Catholic": "He clarifies the primary function of these markers as a boundary: 'This heap is a witness, and the pillar is a witness, that I will not pass over this heap to you, and you will not pass over this heap and this pillar to me, for harm.' It establishes a clear line neither party should cross with hostile intent.",
      "Methodist": "He states the heap and pillar witness that neither will pass them to harm the other, establishing a boundary.",
      "Lutheran": "He declares the heap and pillar are witnesses that he will not pass them to harm Jacob, and Jacob will not pass them to harm him.",
      "Presbyterian": "He defines the heap and pillar as boundary markers, signifying a non-aggression pact between them.",
      "Pentecostal": "He says the heap and pillar mark a boundary neither should cross to harm the other.",
      "Episcopalian/Anglican": "He declares the heap and pillar are witnesses that neither party will pass beyond them to harm the other.",
      "Orthodox": "He explicitly defines the heap and pillar as boundary markers, testifying to a mutual agreement not to cross this line with harmful intent towards the other party.",
      "Other": "He stated the terms: the heap and pillar are boundaries neither will cross to harm the other.",
      "Prefer not to say": "He stated the terms: the heap and pillar are boundaries neither will cross to harm the other."
    },
    "53": {
      "General": "Laban invoked the God of Abraham and the God of Nahor, the God of their father, judge between them. Jacob took an oath in the name of the Fear of his father Isaac.",
      "Non-Denominational": "Laban invoked the God of Abraham and the God of Nahor, the God of their father, judge between them. Jacob took an oath in the name of the Fear of his father Isaac.",
      "Baptist": "Laban invokes the God of their common ancestors to judge. Jacob swears his oath specifically by the 'Fear of his father Isaac'.",
      "Catholic": "Laban invokes the deity of their shared ancestry to enforce the pact: 'The God of Abraham and the God of Nahor, the God of their father, judge between us.' This phrasing might reflect Laban's potentially less monotheistic understanding. Jacob, in turn, swears his oath specifically by the 'Fear of his father Isaac,' likely referring to the one true God worshipped by Isaac, thus affirming his distinct covenantal faith.",
      "Methodist": "Laban invokes the God of their ancestors to judge. Jacob swears his oath specifically by the 'Fear of his father Isaac'.",
      "Lutheran": "Laban invokes the God of Abraham and the God of Nahor (their father's God) to judge between them. Jacob swears by the Fear of his father Isaac.",
      "Presbyterian": "Laban invokes their ancestral God(s) to judge. Jacob swears by the 'Fear of his father Isaac', emphasizing his specific covenant relationship.",
      "Pentecostal": "Laban invokes the God of Abraham and Nahor to judge. Jacob swears by the Fear of Isaac.",
      "Episcopalian/Anglican": "Laban invokes the God of Abraham and Nahor to judge between them. Jacob swears the oath by the 'Fear of his father Isaac'.",
      "Orthodox": "Laban invokes the God of their common ancestors to arbitrate between them. Jacob takes his oath specifically in the name of the 'Fear of his father Isaac', possibly distinguishing his monotheistic commitment.",
      "Other": "Laban invoked the God of Abraham and the God of Nahor, the God of their father, judge between them. Jacob took an oath in the name of the 'Fear of his father Isaac.'",
      "Prefer not to say": "Laban invoked the God of Abraham and the God of Nahor, the God of their father, judge between them. Jacob took an oath in the name of the 'Fear of his father Isaac.'"
    },
    "54": {
      "General": "Jacob offered a sacrifice there in the hill country and invited his relatives to eat the meal. They ate and spent the night there.",
      "Non-Denominational": "Jacob offered a sacrifice there in the hill country and invited his relatives to eat the meal. They ate and spent the night there.",
      "Baptist": "Jacob seals the covenant by offering a sacrifice and hosting a communal meal for all the relatives present (both his and Laban's). They spend the night there together.",
      "Catholic": "Jacob further solemnizes the covenant by offering a sacrifice on the mountain and inviting his kinsmen (likely including Laban's party now) to share in the sacrificial meal. Eating together reinforces the treaty. They then spend the night there at the covenant site.",
      "Methodist": "Jacob offers a sacrifice and invites all relatives to the covenant meal; they spend the night there.",
      "Lutheran": "Jacob offers a sacrifice on the mountain and invites his relatives to the meal. They eat and spend the night there.",
      "Presbyterian": "Jacob offers a sacrifice and invites the relatives to a covenant meal, after which they spend the night.",
      "Pentecostal": "Jacob offers a sacrifice and invites relatives to eat; they spend the night.",
      "Episcopalian/Anglican": "Jacob offers a sacrifice and invites his relatives to the covenant meal. They eat and spend the night there.",
      "Orthodox": "Jacob offers a sacrifice in the hill country and invites his relatives to partake in a meal, solidifying the covenant. They remain there overnight.",
      "Other": "Jacob offered a sacrifice there in the hill country and invited his relatives to eat the meal. They ate and spent the night there.",
      "Prefer not to say": "Jacob offered a sacrifice there in the hill country and invited his relatives to eat the meal. They ate and spent the night there."
    },
    "55": {
      "General": "Early the next morning Laban kissed his grandchildren and his daughters and blessed them. Then he left and returned home.",
      "Non-Denominational": "Early the next morning Laban kissed his grandchildren and his daughters and blessed them. Then he left and returned home.",
      "Baptist": "The next morning, Laban takes his leave. He gives the farewell denied earlier, kissing his daughters and grandchildren and blessing them, before departing back to Harran.",
      "Catholic": "Early the next morning, the farewell takes place. Laban kisses his grandchildren and his daughters, blesses them, and then departs to return to his own place (Harran). The conflict is resolved, and the separation finalized.",
      "Methodist": "The following morning, Laban bids farewell to his daughters and grandchildren with kisses and blessings, then returns home.",
      "Lutheran": "Early the next morning, Laban bids farewell to his grandchildren and daughters with kisses and blessings, then leaves to return home.",
      "Presbyterian": "The following morning, Laban bids farewell to his daughters and grandchildren with kisses and blessings, then returns home.",
      "Pentecostal": "The next morning, Laban kisses his family goodbye, blesses them, and goes home.",
      "Episcopalian/Anglican": "Early the next morning, Laban bids farewell to his grandchildren and daughters with kisses and blessings, then departs for home.",
      "Orthodox": "The following morning, Laban bids farewell to his daughters and grandchildren with kisses and blessings, then departs for his home.",
      "Other": "Early the next morning Laban kissed his grandchildren and his daughters and blessed them. Then he left and returned home.",
      "Prefer not to say": "Early the next morning Laban kissed his grandchildren and his daughters and blessed them. Then he left and returned home."
    }
  }
} 