{
  "_comment": "Interpretations for Genesis Chapter 32",
  "book": "Genesis",
  "chapter": "32",
  "verses": {
  "1": {
      "General": "Jacob also went on his way, and the angels of God met him.",
      "Non-Denominational": "Jacob also went on his way, and the angels of God met him.",
      "Baptist": "As Jacob continues his journey after parting from Laban, he has an encounter with angels of God, signifying divine protection and perhaps foreshadowing future events.",
      "Catholic": "As Jacob resumes his journey towards Canaan after Laban's departure, he encounters 'the angels of God.' This encounter serves as a reassurance of divine presence and protection as he approaches a potentially dangerous meeting with Esau.",
      "Methodist": "Jacob continues his journey and is met by angels of God, indicating divine protection.",
      "Lutheran": "Jacob continues his journey, and angels of God meet him.",
      "Presbyterian": "Jacob continues his journey and encounters angels of God, signifying divine protection.",
      "Pentecostal": "Jacob continues his journey and angels meet him.",
      "Episcopalian/Anglican": "Jacob continues his journey and is met by angels of God.",
      "Orthodox": "As Jacob proceeds on his way, he encounters angels of God, a sign of divine escort and protection.",
      "Other": "Jacob also went on his way, and the angels of God met him.",
      "Prefer not to say": "Jacob also went on his way, and the angels of God met him."
  },
  "2": {
      "General": "When Jacob saw them, he said, \"This is the camp of God!\" So he named that place Mahanaim.",
      "Non-Denominational": "When Jacob saw them, he said, \"This is the camp of God!\" So he named that place Mahanaim.",
      "Baptist": "Recognizing the divine nature of the encounter, Jacob declares it to be 'God's camp' or 'host'. He names the location Mahanaim (meaning 'two camps' or 'two hosts'), possibly referring to his own camp alongside God's angelic camp.",
      "Catholic": "Upon seeing the angels, Jacob recognizes their significance, exclaiming, 'This is God's camp!' He names the place Mahanaim (meaning 'two camps' or 'double camp'), perhaps signifying the presence of both his own camp and the heavenly host, or two divisions of angels.",
      "Methodist": "Jacob recognizes this as 'God's camp' and names the place Mahanaim ('Two Camps'), perhaps referring to his camp and God's.",
      "Lutheran": "Jacob recognizes it as God's camp and names the place Mahanaim ('Two Camps').",
      "Presbyterian": "Jacob recognizes the site as 'God's camp' and names it Mahanaim ('Two Camps').",
      "Pentecostal": "Jacob calls it God's camp and names the place Mahanaim ('Two Camps').",
      "Episcopalian/Anglican": "Jacob recognizes this as God's camp and names the place Mahanaim ('Two Camps').",
      "Orthodox": "Recognizing the divine presence, Jacob calls the place 'God's camp' and names it Mahanaim ('Two Camps'), likely signifying the joining of his camp with the angelic host.",
      "Other": "When Jacob saw them, he said, \"This is the camp of God!\" So he named that place Mahanaim.",
      "Prefer not to say": "When Jacob saw them, he said, \"This is the camp of God!\" So he named that place Mahanaim."
  },
  "3": {
      "General": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom.",
      "Non-Denominational": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom.",
      "Baptist": "Approaching the territory where Esau lives (Seir/Edom), Jacob takes the initiative to send messengers ahead, seeking reconciliation and gauging Esau's disposition after 20 years.",
      "Catholic": "As Jacob nears the area where Esau settled, the land of Seir in the region of Edom, he proactively sends messengers ahead. This is a diplomatic move to inform Esau of his return and to assess Esau's attitude towards him after their long estrangement.",
      "Methodist": "Jacob sends messengers ahead to Esau in Seir (Edom) to announce his return and gauge Esau's reaction.",
      "Lutheran": "Jacob sends messengers ahead to his brother Esau in the land of Seir, the country of Edom.",
      "Presbyterian": "Jacob sends messengers ahead to Esau in Seir (Edom) to announce his return.",
      "Pentecostal": "Jacob sends messengers ahead to Esau in Edom.",
      "Episcopalian/Anglican": "Jacob sends messengers ahead to his brother Esau in the land of Seir (Edom).",
      "Orthodox": "Jacob dispatches messengers in advance to his brother Esau, who resides in the land of Seir, the territory of Edom.",
      "Other": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom.",
      "Prefer not to say": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom."
  },
  "4": {
      "General": "He instructed them: \"This is what you are to say to my lord Esau: ‘Your servant Jacob says, I have been staying with Laban and have remained there till now.",
      "Non-Denominational": "He instructed them: \"This is what you are to say to my lord Esau: ‘Your servant Jacob says, I have been staying with Laban and have remained there till now.",
      "Baptist": "Jacob carefully instructs his messengers with a specific, humble message for Esau, referring to Esau as 'my lord' and himself as 'your servant', indicating deference. He summarizes his 20-year sojourn with Laban.",
      "Catholic": "Jacob gives his messengers precise instructions for addressing Esau. The message is designed to be conciliatory and respectful: 'Thus you shall say to my lord Esau: Thus says your servant Jacob, \"I have sojourned with Laban and stayed until now.\"' He uses deferential language ('my lord,' 'your servant') and briefly accounts for his long absence.",
      "Methodist": "He instructs the messengers to address Esau respectfully ('my lord', 'your servant Jacob') and explain he has been living with Laban until now.",
      "Lutheran": "He instructs the messengers to deliver a humble message to 'my lord Esau' from 'your servant Jacob,' stating he stayed with Laban until now.",
      "Presbyterian": "He instructs the messengers on the deferential message to deliver to Esau ('my lord', 'your servant Jacob'), explaining his long stay with Laban.",
      "Pentecostal": "He tells messengers to give Esau a humble message, calling Esau 'lord' and himself 'servant'.",
      "Episcopalian/Anglican": "He instructs the messengers to address Esau deferentially ('my lord Esau', 'your servant Jacob') and report his long stay with Laban.",
      "Orthodox": "Jacob provides specific, deferential instructions for the messengers' address to Esau ('my lord Esau', 'your servant Jacob'), explaining his protracted stay with Laban.",
      "Other": "He instructed them: \"This is what you are to say to my lord Esau: ‘Your servant Jacob says, I have been staying with Laban and have remained there till now.",
      "Prefer not to say": "He instructed them: \"This is what you are to say to my lord Esau: ‘Your servant Jacob says, I have been staying with Laban and have remained there till now."
  },
  "5": {
      "General": "I have cattle and donkeys, sheep and goats, male and female servants. Now I am sending this message to my lord, that I may find favor in your eyes.’ \"",
      "Non-Denominational": "I have cattle and donkeys, sheep and goats, male and female servants. Now I am sending this message to my lord, that I may find favor in your eyes.’ \"",
      "Baptist": "Jacob mentions his accumulated wealth (livestock, servants), perhaps to show he doesn't need anything from Esau but seeks only peaceful coexistence ('that I may find favor in your sight').",
      "Catholic": "Jacob further informs Esau of his acquired wealth ('I have oxen, donkeys, flocks, male and female servants'), possibly demonstrating self-sufficiency and that he isn't returning to claim Esau's inheritance. He concludes the message with a plea for acceptance: 'and I have sent to tell my lord, in order that I may find favor in your sight.'",
      "Methodist": "He mentions his possessions (livestock, servants) and states his purpose is to seek Esau's favor.",
      "Lutheran": "Jacob mentions his acquired livestock and servants, stating he sent the message to find favor in Esau's sight.",
      "Presbyterian": "He mentions his acquired wealth and expresses his hope to find favor in Esau's eyes.",
      "Pentecostal": "He mentions his wealth and hopes Esau will receive him favorably.",
      "Episcopalian/Anglican": "He mentions his acquired possessions and expresses his hope to find favor in Esau's sight.",
      "Orthodox": "Jacob informs Esau of his acquired wealth and concludes by expressing his hope for a favorable reception.",
      "Other": "I have cattle and donkeys, sheep and goats, male and female servants. Now I am sending this message to my lord, that I may find favor in your eyes.’ \"",
      "Prefer not to say": "I have cattle and donkeys, sheep and goats, male and female servants. Now I am sending this message to my lord, that I may find favor in your eyes.’ \""
  },
  "6": {
      "General": "When the messengers returned to Jacob, they said, \"We went to your brother Esau, and now he is coming to meet you, and four hundred men are with him.\"",
      "Non-Denominational": "When the messengers returned to Jacob, they said, \"We went to your brother Esau, and now he is coming to meet you, and four hundred men are with him.\"",
      "Baptist": "The messengers return with alarming news: Esau is coming to meet Jacob, accompanied by a formidable force of 400 men. Esau's intentions are unclear, but the large company suggests potential hostility.",
      "Catholic": "The messengers return to Jacob with potentially ominous news: 'We came to your brother Esau, and he is coming to meet you, and there are four hundred men with him.' The large number of men accompanying Esau raises Jacob's fears, as it could signify hostile intent.",
      "Methodist": "The messengers return with unsettling news: Esau is coming to meet Jacob with 400 men, suggesting possible hostility.",
      "Lutheran": "The messengers return, reporting they met Esau, who is coming to meet Jacob with 400 men.",
      "Presbyterian": "The messengers return reporting that Esau is approaching with 400 men, causing Jacob alarm.",
      "Pentecostal": "Messengers return: Esau is coming with 400 men.",
      "Episcopalian/Anglican": "The messengers return and report that Esau is coming to meet Jacob, accompanied by 400 men.",
      "Orthodox": "The messengers return with the report that Esau is approaching with a company of 400 men, news which understandably alarms Jacob.",
      "Other": "When the messengers returned to Jacob, they said, \"We went to your brother Esau, and now he is coming to meet you, and four hundred men are with him.\"",
      "Prefer not to say": "When the messengers returned to Jacob, they said, \"We went to your brother Esau, and now he is coming to meet you, and four hundred men are with him.\""
  },
  "7": {
      "General": "In great fear and distress Jacob divided the people who were with him into two groups, and the flocks and herds and camels as well.",
      "Non-Denominational": "In great fear and distress Jacob divided the people who were with him into two groups, and the flocks and herds and camels as well.",
      "Baptist": "Terrified by the news, Jacob reacts with practical strategy: he divides his entire company (people and livestock) into two separate groups or camps.",
      "Catholic": "Jacob reacts with intense fear and distress ('was greatly afraid and distressed'). He immediately implements a pragmatic strategy for damage control, dividing his people, flocks, herds, and camels into two separate companies.",
      "Methodist": "Jacob becomes greatly afraid and distressed, and divides his people and possessions into two groups.",
      "Lutheran": "Jacob is greatly afraid and distressed; he divides his people, flocks, herds, and camels into two camps.",
      "Presbyterian": "Jacob, filled with fear, divides his company and livestock into two groups.",
      "Pentecostal": "Jacob is terrified and divides his company into two groups.",
      "Episcopalian/Anglican": "Jacob, in great fear and distress, divides his people and livestock into two companies.",
      "Orthodox": "Overcome with fear and anxiety, Jacob divides his entire encampment, including people and livestock, into two separate groups.",
      "Other": "In great fear and distress Jacob divided the people who were with him into two groups, and the flocks and herds and camels as well.",
      "Prefer not to say": "In great fear and distress Jacob divided the people who were with him into two groups, and the flocks and herds and camels as well."
  },
  "8": {
      "General": "He thought, \"If Esau comes and attacks one group, the group that is left may escape.\"",
      "Non-Denominational": "He thought, \"If Esau comes and attacks one group, the group that is left may escape.\"",
      "Baptist": "His reasoning is tactical: if Esau attacks one camp, the other might have a chance to escape, thus preserving at least part of his family and possessions.",
      "Catholic": "His rationale for this division is purely tactical: 'If Esau comes to the one company and attacks it, then the company which is left will escape.' He hopes to minimize potential losses by ensuring at least one group might survive an attack.",
      "Methodist": "His strategy is that if Esau attacks one group, the other might escape.",
      "Lutheran": "His reasoning: if Esau attacks one camp, the other camp might escape.",
      "Presbyterian": "His strategy is that if one group is attacked, the other might survive.",
      "Pentecostal": "His plan: if Esau attacks one group, the other can escape.",
      "Episcopalian/Anglican": "His thinking is that if Esau attacks one company, the other may be able to escape.",
      "Orthodox": "His strategy is based on the premise that if Esau attacks one group, the other might have the opportunity to escape.",
      "Other": "He thought, \"If Esau comes and attacks one group, the group that is left may escape.\"",
      "Prefer not to say": "He thought, \"If Esau comes and attacks one group, the group that is left may escape.\""
  },
  "9": {
      "General": "Then Jacob prayed, \"O God of my father Abraham, God of my father Isaac, Lord, you who said to me, ‘Go back to your country and your relatives, and I will make you prosper,’",
      "Non-Denominational": "Then Jacob prayed, \"O God of my father Abraham, God of my father Isaac, Lord, you who said to me, ‘Go back to your country and your relatives, and I will make you prosper,’",
      "Baptist": "Having made practical preparations, Jacob turns to prayer. He addresses God using covenantal titles ('God of my father Abraham, God of my father Isaac') and reminds God of His own command for Jacob to return and His promise to prosper him.",
      "Catholic": "After implementing his strategy, Jacob turns to prayer, appealing directly to God based on their covenant relationship. He addresses God by invoking his ancestors ('O God of my father Abraham and God of my father Isaac') and specifically reminds God of His recent command and promise: 'O Lord who said to me, \"Return to your country and to your kindred, and I will do you good.\"'",
      "Methodist": "Jacob prays, addressing God by his covenant relationship with Abraham and Isaac, and reminding God of His command to return and promise of prosperity.",
      "Lutheran": "Jacob prays to the God of Abraham and Isaac, reminding Yahweh of His command to return home and His promise to do him good.",
      "Presbyterian": "Jacob prays, invoking the covenant God of Abraham and Isaac, and reminding God of His command to return and promise of blessing.",
      "Pentecostal": "Jacob prays, reminding God of His promise and command to return.",
      "Episcopalian/Anglican": "Jacob prays, addressing the God of Abraham and Isaac, and reminding the Lord of His command to return and His promise to prosper him.",
      "Orthodox": "Jacob resorts to prayer, invoking the God of his fathers Abraham and Isaac, and reminding God of the divine command to return and the associated promise of prosperity.",
      "Other": "Then Jacob prayed, \"O God of my father Abraham, God of my father Isaac, Lord, you who said to me, ‘Go back to your country and your relatives, and I will make you prosper,’",
      "Prefer not to say": "Then Jacob prayed, \"O God of my father Abraham, God of my father Isaac, Lord, you who said to me, ‘Go back to your country and your relatives, and I will make you prosper,’"
  },
  "10": {
      "General": "I am unworthy of all the kindness and faithfulness you have shown your servant. I had only my staff when I crossed this Jordan, but now I have become two camps.",
      "Non-Denominational": "I am unworthy of all the kindness and faithfulness you have shown your servant. I had only my staff when I crossed this Jordan, but now I have become two camps.",
      "Baptist": "He humbly acknowledges his unworthiness in light of God's abundant kindness (hesed - loyal love) and faithfulness (emet - truth, reliability). He contrasts his impoverished state when he first fled (only his staff) with his current great prosperity (two camps).",
      "Catholic": "Jacob confesses his unworthiness before God's grace: 'I am not worthy of the least of all the steadfast love (hesed) and all the faithfulness (emet) that you have shown to your servant.' He contrasts his past poverty ('with only my staff I crossed this Jordan') with his present abundance ('and now I have become two companies'), acknowledging God as the source of his prosperity.",
      "Methodist": "He confesses his unworthiness of God's kindness and faithfulness, contrasting his initial poverty (only a staff) with his current wealth (two camps).",
      "Lutheran": "He confesses his unworthiness of God's steadfast love (hesed) and faithfulness, recalling he crossed the Jordan with only his staff but now has two camps.",
      "Presbyterian": "He humbly acknowledges his unworthiness of God's steadfast love and faithfulness, contrasting his past poverty with his current prosperity.",
      "Pentecostal": "He confesses unworthiness, remembering he started with nothing but now has much.",
      "Episcopalian/Anglican": "He confesses his unworthiness of God's kindness and faithfulness, contrasting his initial poverty with his current state of having two companies.",
      "Orthodox": "Jacob humbly acknowledges his unworthiness in view of God's abundant loving-kindness and faithfulness, contrasting his initial destitution upon crossing the Jordan with his current substantial encampment.",
      "Other": "I am unworthy of all the kindness and faithfulness you have shown your servant. I had only my staff when I crossed this Jordan, but now I have become two camps.",
      "Prefer not to say": "I am unworthy of all the kindness and faithfulness you have shown your servant. I had only my staff when I crossed this Jordan, but now I have become two camps."
  },
  "11": {
      "General": "Save me, I pray, from the hand of my brother Esau, for I am afraid he will come and attack me, and also the mothers with their children.",
      "Non-Denominational": "Save me, I pray, from the hand of my brother Esau, for I am afraid he will come and attack me, and also the mothers with their children.",
      "Baptist": "He explicitly pleads for deliverance from Esau's potential wrath, expressing his fear that Esau will attack indiscriminately, harming not only him but also the vulnerable women and children.",
      "Catholic": "Jacob makes his specific plea: 'Please deliver me from the hand of my brother, from the hand of Esau.' He articulates his fear plainly: 'for I fear him, that he may come and attack me, the mothers with the children.' His concern extends beyond himself to the safety of his entire family.",
      "Methodist": "He pleads for deliverance from Esau, expressing fear of an indiscriminate attack on him and the women and children.",
      "Lutheran": "He pleads for deliverance from Esau, expressing fear Esau will attack him and the mothers with the children.",
      "Presbyterian": "He pleads for deliverance from Esau, fearing an attack on himself and his family, including the women and children.",
      "Pentecostal": "He asks God to save him from Esau, fearing an attack on everyone.",
      "Episcopalian/Anglican": "He prays for deliverance from Esau, expressing fear that Esau will attack him, as well as the mothers and children.",
      "Orthodox": "He explicitly petitions for deliverance from Esau, voicing his fear of an indiscriminate attack that would endanger the women and children as well.",
      "Other": "Save me, I pray, from the hand of my brother Esau, for I am afraid he will come and attack me, and also the mothers with their children.",
      "Prefer not to say": "Save me, I pray, from the hand of my brother Esau, for I am afraid he will come and attack me, and also the mothers with their children."
  },
  "12": {
      "General": "But you have said, ‘I will surely make you prosper and will make your descendants like the sand of the sea, which cannot be counted.’ \"",
      "Non-Denominational": "But you have said, ‘I will surely make you prosper and will make your descendants like the sand of the sea, which cannot be counted.’ \"",
      "Baptist": "Jacob concludes his prayer by holding God to His earlier promises: the promise of prosperity and the Abrahamic covenant promise of innumerable descendants, implying that Esau destroying him would contradict God's own declared purposes.",
      "Catholic": "Jacob concludes his prayer by reminding God of His own covenant promises: 'But you said, \"I will surely do you good, and make your offspring as the sand of the sea, which cannot be numbered for multitude.\"' He appeals to God's faithfulness and the divine plan, implicitly arguing that Esau destroying him would thwart God's stated intentions.",
      "Methodist": "He concludes by reminding God of His promise to prosper him and give him innumerable descendants like the sand of the sea.",
      "Lutheran": "He reminds God of His promise to do him good and make his descendants innumerable like the sand of the sea.",
      "Presbyterian": "He concludes by appealing to God's promise of prosperity and innumerable descendants.",
      "Pentecostal": "He reminds God of His promise to bless him with many descendants.",
      "Episcopalian/Anglican": "He concludes by reminding God of His promise to prosper him and make his descendants like the uncountable sand of the sea.",
      "Orthodox": "Jacob concludes his prayer by appealing to God's prior promise of prosperity and the multiplication of his descendants to be as numerous as the sand of the sea.",
      "Other": "But you have said, ‘I will surely make you prosper and will make your descendants like the sand of the sea, which cannot be counted.’ \"",
      "Prefer not to say": "But you have said, ‘I will surely make you prosper and will make your descendants like the sand of the sea, which cannot be counted.’ \""
  },
  "13": {
      "General": "He spent the night there, and from what he had with him he selected a gift for his brother Esau:",
      "Non-Denominational": "He spent the night there, and from what he had with him he selected a gift for his brother Esau:",
      "Baptist": "After praying, Jacob spends the night there and prepares a substantial gift from his possessions to send ahead to Esau, hoping to appease his brother's potential anger.",
      "Catholic": "Jacob spends the night there. Combining prayer with action, he selects a significant gift (minchah - offering, tribute, gift) from his accumulated wealth to send ahead to Esau as a gesture of appeasement.",
      "Methodist": "Jacob prepares a large gift from his possessions to send ahead to Esau, hoping to appease him.",
      "Lutheran": "Jacob spends the night there and selects a gift from his possessions for Esau.",
      "Presbyterian": "Jacob selects a substantial gift from his possessions to send ahead to Esau as appeasement.",
      "Pentecostal": "Jacob prepares a gift for Esau from his possessions.",
      "Episcopalian/Anglican": "Jacob spends the night there and selects a gift from his possessions for Esau.",
      "Orthodox": "Jacob remains there overnight and selects a substantial present from his belongings to send ahead to Esau as a conciliatory gesture.",
      "Other": "He spent the night there, and from what he had with him he selected a gift for his brother Esau:",
      "Prefer not to say": "He spent the night there, and from what he had with him he selected a gift for his brother Esau:"
  },
  "14": {
      "General": "two hundred female goats and twenty male goats, two hundred ewes and twenty rams,",
      "Non-Denominational": "two hundred female goats and twenty male goats, two hundred ewes and twenty rams,",
      "Baptist": "Lists the first part of the generous gift: 200 female goats, 20 male goats, 200 ewes, and 20 rams.",
      "Catholic": "Details the first part of the extravagant gift: 200 female goats, 20 male goats, 200 ewes, and 20 rams.",
      "Methodist": "Details the gift: 200 female goats, 20 male goats, 200 ewes, 20 rams.",
      "Lutheran": "Lists the gift: 200 female goats, 20 male goats, 200 ewes, 20 rams.",
      "Presbyterian": "Details the gift: 200 female goats and 20 males, 200 ewes and 20 rams.",
      "Pentecostal": "Lists the gift: goats and sheep.",
      "Episcopalian/Anglican": "Lists the first part of the gift: 200 female goats, 20 male goats, 200 ewes, 20 rams.",
      "Orthodox": "Specifies the first components of the gift: two hundred female goats and twenty male goats, two hundred ewes and twenty rams.",
      "Other": "two hundred female goats and twenty male goats, two hundred ewes and twenty rams,",
      "Prefer not to say": "two hundred female goats and twenty male goats, two hundred ewes and twenty rams,"
  },
  "15": {
      "General": "thirty female camels with their young, forty cows and ten bulls, and twenty female donkeys and ten male donkeys.",
      "Non-Denominational": "thirty female camels with their young, forty cows and ten bulls, and twenty female donkeys and ten male donkeys.",
      "Baptist": "Lists the remainder of the gift: 30 nursing camels with their young, 40 cows, 10 bulls, 20 female donkeys, and 10 male donkeys – a total of over 550 animals.",
      "Catholic": "Lists the rest of the gift: 30 milking camels with their colts, 40 cows, 10 bulls, 20 female donkeys, and 10 male donkeys. This constitutes a very large and valuable gift, demonstrating Jacob's wealth and his desire to placate Esau.",
      "Methodist": "Lists more of the gift: 30 nursing camels, 40 cows, 10 bulls, 20 female donkeys, 10 male donkeys.",
      "Lutheran": "Lists more: 30 milking camels with colts, 40 cows, 10 bulls, 20 female donkeys, 10 male donkeys.",
      "Presbyterian": "Details more of the gift: 30 camels with young, 40 cows and 10 bulls, 20 female donkeys and 10 males.",
      "Pentecostal": "Lists more: camels, cows, donkeys.",
      "Episcopalian/Anglican": "Lists the remainder of the gift: 30 milking camels with their young, 40 cows, 10 bulls, 20 female donkeys, 10 male donkeys.",
      "Orthodox": "Specifies the remaining components: thirty nursing camels with their young, forty cows and ten bulls, twenty female donkeys and ten male donkeys.",
      "Other": "thirty female camels with their young, forty cows and ten bulls, and twenty female donkeys and ten male donkeys.",
      "Prefer not to say": "thirty female camels with their young, forty cows and ten bulls, and twenty female donkeys and ten male donkeys."
  },
  "16": {
      "General": "He put them in the care of his servants, each drive by itself, and said to his servants, \"Go on ahead of me, and keep some space between the drives.\"",
      "Non-Denominational": "He put them in the care of his servants, each drive by itself, and said to his servants, \"Go on ahead of me, and keep some space between the drives.\"",
      "Baptist": "Jacob divides this massive gift into separate groups or drives, entrusting each to his servants. He instructs them to go ahead of him sequentially, leaving space between each group, likely to maximize the impact on Esau as wave after wave of gifts arrived.",
      "Catholic": "Jacob entrusts these animals to his servants, dividing the gift into several separate droves. He instructs the servants to go ahead of him, maintaining a space between each drove. This staggered approach is likely intended to impress Esau with the sheer scale of the gift as multiple waves arrive.",
      "Methodist": "He entrusts the animals to servants, dividing them into separate groups (drives), instructing them to go ahead with space between each group to impress Esau.",
      "Lutheran": "He gives the animals to his servants, separating them into drives, telling the servants to go ahead and keep space between the drives.",
      "Presbyterian": "He divides the gift into separate drives, instructing his servants to proceed ahead with space between each group.",
      "Pentecostal": "He divides the gift into groups and tells servants to go ahead with space between.",
      "Episcopalian/Anglican": "He puts the animals in the care of servants, divided into separate droves, instructing them to go ahead with space between each drove.",
      "Orthodox": "Jacob entrusts the animals to his servants, arranging them in separate droves, and instructs the servants to proceed in advance, maintaining distance between each drove.",
      "Other": "He put them in the care of his servants, each drive by itself, and said to his servants, \"Go on ahead of me, and keep some space between the drives.\"",
      "Prefer not to say": "He put them in the care of his servants, each drive by itself, and said to his servants, \"Go on ahead of me, and keep some space between the drives.\""
  },
  "17": {
      "General": "He instructed the one in the lead: \"When my brother Esau meets you and asks, ‘Who do you belong to, and where are you going, and who owns all these animals in front of you?’",
      "Non-Denominational": "He instructed the one in the lead: \"When my brother Esau meets you and asks, ‘Who do you belong to, and where are you going, and who owns all these animals in front of you?’",
      "Baptist": "Jacob gives specific instructions to the servant leading the first group on how to respond when Esau inevitably questions them.",
      "Catholic": "He gives specific instructions to the servant leading the first drove regarding the expected encounter with Esau and the questions Esau is likely to ask ('To whom do you belong? Where are you going? Whose are these ahead of you?').",
      "Methodist": "He instructs the lead servant how to answer Esau's anticipated questions.",
      "Lutheran": "He instructs the first servant what to say when Esau asks who he belongs to, where he is going, and who owns the animals.",
      "Presbyterian": "He coaches the lead servant on how to respond to Esau's likely questions.",
      "Pentecostal": "He tells the first servant what to say when Esau asks questions.",
      "Episcopalian/Anglican": "He instructs the servant in charge of the first drove how to respond to Esau's likely questions.",
      "Orthodox": "He provides detailed instructions to the servant leading the first drove concerning the anticipated encounter with Esau and his probable inquiries.",
      "Other": "He instructed the one in the lead: \"When my brother Esau meets you and asks, ‘Who do you belong to, and where are you going, and who owns all these animals in front of you?’",
      "Prefer not to say": "He instructed the one in the lead: \"When my brother Esau meets you and asks, ‘Who do you belong to, and where are you going, and who owns all these animals in front of you?’"
  },
  "18": {
      "General": "then you are to say, ‘They belong to your servant Jacob. They are a gift sent to my lord Esau, and he is coming behind us.’ \"",
      "Non-Denominational": "then you are to say, ‘They belong to your servant Jacob. They are a gift sent to my lord Esau, and he is coming behind us.’ \"",
      "Baptist": "The prescribed answer emphasizes humility ('your servant Jacob', 'my lord Esau'), identifies the animals as a gift to Esau, and mentions Jacob himself is following behind.",
      "Catholic": "The servant is instructed to reply: 'They belong to your servant Jacob; they are a present sent to my lord Esau; and moreover, he is behind us.' The response reinforces Jacob's deferential posture, explicitly identifies the animals as a gift, and informs Esau of Jacob's own imminent arrival.",
      "Methodist": "The answer should identify the animals as a gift from 'your servant Jacob' to 'my lord Esau', and mention Jacob is following.",
      "Lutheran": "The servant should say the animals belong to 'your servant Jacob,' are a gift for 'my lord Esau,' and Jacob is following.",
      "Presbyterian": "The servant is to identify the animals as a gift from Jacob ('your servant') to Esau ('my lord') and state that Jacob is following.",
      "Pentecostal": "The answer: they are a gift from Jacob to Esau, and Jacob is coming behind.",
      "Episcopalian/Anglican": "The servant is to reply that they belong to 'your servant Jacob' and are a gift sent to 'my lord Esau', adding that Jacob himself is following.",
      "Orthodox": "The instructed response emphasizes Jacob's subservience ('your servant Jacob') and Esau's lordship ('my lord Esau'), identifies the animals as a gift, and informs Esau that Jacob is following.",
      "Other": "then you are to say, ‘They belong to your servant Jacob. They are a gift sent to my lord Esau, and he is coming behind us.’ \"",
      "Prefer not to say": "then you are to say, ‘They belong to your servant Jacob. They are a gift sent to my lord Esau, and he is coming behind us.’ \""
  },
  "19": {
      "General": "He also instructed the second, the third and all the others who followed the drives: \"You are to say the same thing to Esau when you meet him.",
      "Non-Denominational": "He also instructed the second, the third and all the others who followed the drives: \"You are to say the same thing to Esau when you meet him.",
      "Baptist": "Jacob gives the same instructions to the servants leading all the subsequent drives of animals, ensuring a consistent message is delivered with each wave of gifts.",
      "Catholic": "Jacob gives identical instructions to the servants in charge of the second, third, and all subsequent droves, ensuring Esau receives the same deferential message repeatedly as each part of the gift arrives.",
      "Methodist": "He gives the same instructions to the servants of all the other drives.",
      "Lutheran": "He gives the same instructions to the second, third, and all subsequent drives.",
      "Presbyterian": "He gives the same instructions to the servants leading the subsequent drives.",
      "Pentecostal": "He tells all the other servants to say the same thing.",
      "Episcopalian/Anglican": "He gives the same instructions to the servants in charge of the second, third, and all the subsequent droves.",
      "Orthodox": "Jacob repeats these instructions for the servants managing the second, third, and all subsequent droves of animals.",
      "Other": "He also instructed the second, the third and all the others who followed the drives: \"You are to say the same thing to Esau when you meet him.",
      "Prefer not to say": "He also instructed the second, the third and all the others who followed the drives: \"You are to say the same thing to Esau when you meet him."
  },
  "20": {
      "General": "And be sure to say, ‘Your servant Jacob is coming behind us.’ \" For he thought, \"I will pacify him with these gifts that are going ahead of me; later, when I see him, perhaps he will receive me.\"",
      "Non-Denominational": "And be sure to say, ‘Your servant Jacob is coming behind us.’ \" For he thought, \"I will pacify him with these gifts that are going ahead of me; later, when I see him, perhaps he will receive me.\"",
      "Baptist": "He emphasizes they must mention he is following. Jacob's explicit strategy is revealed: he hopes the successive waves of gifts will appease Esau ('pacify him' or 'cover his face') so that Esau might receive him favorably when they finally meet face-to-face.",
      "Catholic": "He specifically reiterates the need to mention his own approach: 'And you shall say, \"Moreover, your servant Jacob is behind us.\"' The narrator then explicitly states Jacob's rationale: 'For he thought, \"I may appease him (literally 'cover his face') with the present that goes ahead of me, and afterwards I shall see his face; perhaps he will accept me.\"' He hopes the gifts will soften Esau before their personal encounter.",
      "Methodist": "He reiterates they must say Jacob is coming behind. His stated plan is to appease Esau with the gifts before meeting him, hoping for acceptance.",
      "Lutheran": "He emphasizes they must say Jacob is following. Jacob's thought process: 'I will appease him (cover his face) with the gift going ahead; afterwards I will see his face; perhaps he will accept me.'",
      "Presbyterian": "He stresses the importance of mentioning he is following, hoping the gifts will appease Esau before their meeting.",
      "Pentecostal": "He tells them to be sure to say he is following, hoping the gifts will appease Esau.",
      "Episcopalian/Anglican": "He emphasizes the need to mention that Jacob is following, stating his intention to appease Esau with the gifts before meeting him, hoping for acceptance.",
      "Orthodox": "He stresses the importance of mentioning his own approach. Jacob's strategy is explicit: to appease Esau with the preceding gifts in the hope of being favorably received upon their meeting.",
      "Other": "And be sure to say, ‘Your servant Jacob is coming behind us.’ \" For he thought, \"I will pacify him with these gifts that are going ahead of me; later, when I see him, perhaps he will receive me.\"",
      "Prefer not to say": "And be sure to say, ‘Your servant Jacob is coming behind us.’ \" For he thought, \"I will pacify him with these gifts that are going ahead of me; later, when I see him, perhaps he will receive me.\""
  },
  "21": {
      "General": "So Jacob's gifts went on ahead of him, but he himself spent the night in the camp.",
      "Non-Denominational": "So Jacob's gifts went on ahead of him, but he himself spent the night in the camp.",
      "Baptist": "The gifts are sent ahead as planned, while Jacob remains behind and spends the night in his camp.",
      "Catholic": "The gifts proceed ahead of Jacob according to his plan, while Jacob himself remains and spends that night in the camp.",
      "Methodist": "The gifts go ahead, while Jacob stays the night in the camp.",
      "Lutheran": "The gift goes on ahead, while Jacob spends the night in the camp.",
      "Presbyterian": "The gifts proceed ahead while Jacob remains in the camp overnight.",
      "Pentecostal": "The gifts go ahead; Jacob stays the night.",
      "Episcopalian/Anglican": "The gifts go on ahead, while Jacob spends the night in the camp.",
      "Orthodox": "The gifts are sent ahead as planned, while Jacob himself remains overnight in the camp.",
      "Other": "So Jacob's gifts went on ahead of him, but he himself spent the night in the camp.",
      "Prefer not to say": "So Jacob's gifts went on ahead of him, but he himself spent the night in the camp."
  },
  "22": {
      "General": "That night Jacob got up and took his two wives, his two female servants and his eleven sons and crossed the ford of the Jabbok.",
      "Non-Denominational": "That night Jacob got up and took his two wives, his two female servants and his eleven sons and crossed the ford of the Jabbok.",
      "Baptist": "During that same night, Jacob moves his family (two wives, two handmaids, eleven sons) across the Jabbok River, a tributary of the Jordan, perhaps seeking a more defensible position or preparing for solitude.",
      "Catholic": "Later that same night, Jacob arises and takes his immediate family – his two wives (Leah, Rachel), his two handmaids (Zilpah, Bilhah), and his eleven sons – across the Jabbok river ford. This tributary flows into the Jordan.",
      "Methodist": "During the night, Jacob takes his two wives, two servants, and eleven sons across the ford of the Jabbok river.",
      "Lutheran": "During the night, Jacob takes his wives, servants, and eleven sons across the ford of the Jabbok.",
      "Presbyterian": "During the night, Jacob takes his family (wives, servants, eleven sons) across the Jabbok ford.",
      "Pentecostal": "That night, Jacob takes his family across the Jabbok ford.",
      "Episcopalian/Anglican": "During the night, Jacob takes his two wives, two female servants, and eleven sons across the Jabbok ford.",
      "Orthodox": "During the night, Jacob relocates his two wives, two handmaids, and eleven sons across the ford of the Jabbok River.",
      "Other": "That night Jacob got up and took his two wives, his two female servants and his eleven sons and crossed the ford of the Jabbok.",
      "Prefer not to say": "That night Jacob got up and took his two wives, his two female servants and his eleven sons and crossed the ford of the Jabbok."
  },
  "23": {
      "General": "After he had sent them across the stream, he sent over all his possessions.",
      "Non-Denominational": "After he had sent them across the stream, he sent over all his possessions.",
      "Baptist": "Having moved his family across, Jacob then sends all his remaining possessions over the Jabbok as well.",
      "Catholic": "After ensuring his family is safely across the stream, Jacob sends over all his remaining possessions as well.",
      "Methodist": "He then sends all his possessions across the stream.",
      "Lutheran": "After sending them across, he sends over all his possessions.",
      "Presbyterian": "He sends his possessions across after his family.",
      "Pentecostal": "He sends his possessions across after his family.",
      "Episcopalian/Anglican": "After sending his family across, he sends over all his possessions.",
      "Orthodox": "Following the transfer of his family, Jacob sends all his possessions across the stream.",
      "Other": "After he had sent them across the stream, he sent over all his possessions.",
      "Prefer not to say": "After he had sent them across the stream, he sent over all his possessions."
  },
  "24": {
      "General": "So Jacob was left alone, and a man wrestled with him till daybreak.",
      "Non-Denominational": "So Jacob was left alone, and a man wrestled with him till daybreak.",
      "Baptist": "Jacob remains behind, isolated and alone. In this vulnerable state, a mysterious 'man' appears and engages Jacob in a physical wrestling match that lasts the entire night until dawn.",
      "Catholic": "Jacob intentionally remains behind, alone. In this solitude, a mysterious 'man' (whose identity is intentionally ambiguous initially) engages him in a wrestling match that continues throughout the night until the break of dawn.",
      "Methodist": "Jacob remains alone, and a mysterious man wrestles with him all night until daybreak.",
      "Lutheran": "Jacob is left alone, and a man wrestles with him until daybreak.",
      "Presbyterian": "Jacob remains alone, and a 'man' wrestles with him throughout the night.",
      "Pentecostal": "Jacob is left alone; a man wrestles with him all night.",
      "Episcopalian/Anglican": "Jacob is left alone, and a man wrestles with him until daybreak.",
      "Orthodox": "Jacob remains alone, whereupon a 'man' engages him in a wrestling contest that persists until dawn.",
      "Other": "So Jacob was left alone, and a man wrestled with him till daybreak.",
      "Prefer not to say": "So Jacob was left alone, and a man wrestled with him till daybreak."
  },
  "25": {
      "General": "When the man saw that he could not overpower him, he touched the socket of Jacob's hip so that his hip was wrenched as he wrestled with the man.",
      "Non-Denominational": "When the man saw that he could not overpower him, he touched the socket of Jacob's hip so that his hip was wrenched as he wrestled with the man.",
      "Baptist": "Seeing he cannot defeat Jacob through sheer strength, the man supernaturally dislocates Jacob's hip joint with a mere touch, inflicting a permanent injury.",
      "Catholic": "When the mysterious assailant sees that he cannot prevail against Jacob by conventional means (highlighting Jacob's tenacity), he touches the socket of Jacob's hip, instantly dislocating it. This demonstrates the assailant's supernatural power and leaves Jacob with a lasting physical mark.",
      "Methodist": "Seeing he cannot overpower Jacob, the man touches Jacob's hip socket, dislocating it, demonstrating supernatural power.",
      "Lutheran": "When the man sees he cannot prevail, he touches Jacob's hip socket, dislocating it.",
      "Presbyterian": "Unable to overpower Jacob, the man dislocates Jacob's hip with a touch.",
      "Pentecostal": "The man sees he can't win, so he touches Jacob's hip and dislocates it.",
      "Episcopalian/Anglican": "When the man realizes he cannot overpower Jacob, he touches Jacob's hip socket, wrenching it.",
      "Orthodox": "Observing his inability to overpower Jacob, the 'man' touches Jacob's hip socket, causing it to become dislocated.",
      "Other": "When the man saw that he could not overpower him, he touched the socket of Jacob's hip so that his hip was wrenched as he wrestled with the man.",
      "Prefer not to say": "When the man saw that he could not overpower him, he touched the socket of Jacob's hip so that his hip was wrenched as he wrestled with the man."
  },
  "26": {
      "General": "Then the man said, \"Let me go, for it is daybreak.\" But Jacob replied, \"I will not let you go unless you bless me.\"",
      "Non-Denominational": "Then the man said, \"Let me go, for it is daybreak.\" But Jacob replied, \"I will not let you go unless you bless me.\"",
      "Baptist": "As dawn approaches, the man asks Jacob to release him. Jacob, likely realizing the divine nature of his opponent, refuses to let go until he receives a blessing, demonstrating persistent faith even while injured.",
      "Catholic": "As day breaks, the man says, 'Let me go, for the day has broken.' Jacob, however, injured but tenacious and likely recognizing the divine nature of his opponent, refuses: 'I will not let you go unless you bless me.' He desperately clings to this figure, seeking a blessing.",
      "Methodist": "The man asks to be released at daybreak, but Jacob, realizing his opponent's identity, refuses to let go without receiving a blessing.",
      "Lutheran": "The man asks Jacob to let him go as day breaks. Jacob refuses unless the man blesses him.",
      "Presbyterian": "The man asks to be let go at daybreak, but Jacob refuses, demanding a blessing first.",
      "Pentecostal": "The man asks to leave; Jacob refuses without a blessing.",
      "Episcopalian/Anglican": "The man asks to be let go at daybreak, but Jacob refuses, demanding a blessing.",
      "Orthodox": "At dawn, the 'man' requests release, but Jacob, discerning his divine nature, refuses to let go without receiving a blessing.",
      "Other": "Then the man said, \"Let me go, for it is daybreak.\" But Jacob replied, \"I will not let you go unless you bless me.\"",
      "Prefer not to say": "Then the man said, \"Let me go, for it is daybreak.\" But Jacob replied, \"I will not let you go unless you bless me.\""
  },
  "27": {
      "General": "The man asked him, \"What is your name?\" \"Jacob,\" he answered.",
      "Non-Denominational": "The man asked him, \"What is your name?\" \"Jacob,\" he answered.",
      "Baptist": "The man asks Jacob his name. Jacob identifies himself by his old name, 'Jacob,' which means 'supplanter' or 'heel-grabber,' acknowledging his past identity.",
      "Catholic": "The assailant asks Jacob for his name. Jacob replies with his birth name, 'Jacob,' which carried connotations of deception and supplanting ('heel-grabber'). This forces Jacob to confront his past character.",
      "Methodist": "The man asks Jacob's name; Jacob identifies himself.",
      "Lutheran": "The man asks Jacob his name; Jacob replies, 'Jacob.'",
      "Presbyterian": "The man asks Jacob his name, and he responds 'Jacob'.",
      "Pentecostal": "The man asks Jacob's name; he says 'Jacob.'",
      "Episcopalian/Anglican": "The man asks Jacob his name, and he answers, 'Jacob.'",
      "Orthodox": "The 'man' inquires Jacob's name, and Jacob identifies himself.",
      "Other": "The man asked him, \"What is your name?\" \"Jacob,\" he answered.",
      "Prefer not to say": "The man asked him, \"What is your name?\" \"Jacob,\" he answered."
  },
  "28": {
      "General": "Then the man said, \"Your name will no longer be Jacob, but Israel, because you have struggled with God and with humans and have overcome.\"",
      "Non-Denominational": "Then the man said, \"Your name will no longer be Jacob, but Israel, because you have struggled with God and with humans and have overcome.\"",
      "Baptist": "The man bestows a new name, Israel (meaning 'he struggles with God' or 'God strives'). This new identity signifies Jacob's transformation through his persistent struggle with both God and humans (like Esau, Laban) and his prevailing through faith.",
      "Catholic": "The divine figure then bestows a new name and identity upon Jacob: 'Your name shall no longer be called Jacob, but Israel.' The reason given is profound: 'for you have striven with God and with men, and have prevailed.' The name Israel (Yisra'el) is interpreted here as 'he strives with God' or 'God strives.' It signifies a transformation from deceiver to one who engages directly and persistently with God and overcomes.",
      "Methodist": "The man gives Jacob a new name, Israel ('He struggles with God'), signifying his persistent struggle with God and humans, and his having prevailed (through faith/tenacity).",
      "Lutheran": "The man declares Jacob's name will now be Israel ('Struggles with God' or 'God strives'), because he has struggled/striven with God and humans and prevailed.",
      "Presbyterian": "The man renames Jacob 'Israel' ('He struggles with God'), acknowledging his persistent struggle with God and humans, and his ultimate prevailing.",
      "Pentecostal": "The man renames him Israel ('Struggles with God'), because he struggled with God and men and won.",
      "Episcopalian/Anglican": "The man renames Jacob 'Israel' ('He struggles with God'), stating he has struggled with God and with humans and has prevailed.",
      "Orthodox": "The divine figure bestows upon Jacob the new name Israel (interpreted as 'He who strives with God' or 'God strives'), explaining that Jacob has successfully contended with both divine and human opponents.",
      "Other": "Then the man said, \"Your name will no longer be Jacob, but Israel, because you have struggled with God and with humans and have overcome.\"",
      "Prefer not to say": "Then the man said, \"Your name will no longer be Jacob, but Israel, because you have struggled with God and with humans and have overcome.\""
  },
  "29": {
      "General": "Jacob said, \"Please tell me your name.\" But he replied, \"Why do you ask my name?\" Then he blessed him there.",
      "Non-Denominational": "Jacob said, \"Please tell me your name.\" But he replied, \"Why do you ask my name?\" Then he blessed him there.",
      "Baptist": "Jacob asks for the man's name, seeking to understand fully who he wrestled with. The figure deflects the question ('Why is it that you ask my name?'), emphasizing the experience itself over knowing the name, but then grants Jacob's request and blesses him there.",
      "Catholic": "Jacob, seeking confirmation of his opponent's identity, asks, 'Please tell me your name.' The figure mysteriously deflects the question ('Why is it that you ask my name?'), perhaps indicating his identity is beyond full human comprehension or that the encounter itself is paramount. Nevertheless, He grants Jacob's primary request and bestows a blessing upon him there.",
      "Methodist": "Jacob asks for the man's name, but the man deflects the question before blessing Jacob as requested.",
      "Lutheran": "Jacob asks the man's name. The man deflects ('Why do you ask my name?') and then blesses Jacob there.",
      "Presbyterian": "Jacob asks the man's name, but the question is deflected. The man then blesses Jacob.",
      "Pentecostal": "Jacob asks the man's name; the man avoids answering but blesses him.",
      "Episcopalian/Anglican": "Jacob asks for the man's name, but the man deflects the question before blessing Jacob.",
      "Orthodox": "Jacob requests the name of his divine opponent, but the figure deflects the inquiry while proceeding to bestow the requested blessing upon Jacob.",
      "Other": "Jacob said, \"Please tell me your name.\" But he replied, \"Why do you ask my name?\" Then he blessed him there.",
      "Prefer not to say": "Jacob said, \"Please tell me your name.\" But he replied, \"Why do you ask my name?\" Then he blessed him there."
  },
  "30": {
      "General": "So Jacob called the place Peniel, saying, \"It is because I saw God face to face, and yet my life was spared.\"",
      "Non-Denominational": "So Jacob called the place Peniel, saying, \"It is because I saw God face to face, and yet my life was spared.\"",
      "Baptist": "Jacob names the location Peniel (or Penuel, meaning 'Face of God'), explicitly stating his realization: he has seen God directly ('face to face') and miraculously survived the encounter, which was typically thought to be fatal.",
      "Catholic": "Jacob names the place of the encounter Peniel (or Penuel, meaning 'Face of God'). He explains the name with awe and wonder: 'For I have seen God face to face, and yet my life has been delivered.' He recognizes the extraordinary nature of having directly encountered God and survived.",
      "Methodist": "Jacob names the place Peniel ('Face of God'), recognizing he saw God face to face and survived.",
      "Lutheran": "Jacob names the place Peniel ('Face of God'), because he saw God face to face and survived.",
      "Presbyterian": "Jacob names the place Peniel ('Face of God'), acknowledging he had seen God face to face and survived.",
      "Pentecostal": "Jacob names the place Peniel ('Face of God'), because he saw God and lived.",
      "Episcopalian/Anglican": "Jacob names the place Peniel ('Face of God'), stating he had seen God face to face and yet his life was spared.",
      "Orthodox": "Jacob names the site Peniel ('Face of God'), explaining that he had seen God directly and yet survived the typically fatal encounter.",
      "Other": "So Jacob called the place Peniel, saying, \"It is because I saw God face to face, and yet my life was spared.\"",
      "Prefer not to say": "So Jacob called the place Peniel, saying, \"It is because I saw God face to face, and yet my life was spared.\""
  },
  "31": {
      "General": "The sun rose above him as he passed Peniel, and he was limping because of his hip.",
      "Non-Denominational": "The sun rose above him as he passed Peniel, and he was limping because of his hip.",
      "Baptist": "As Jacob leaves Peniel at sunrise, he is physically marked by the encounter, limping due to his injured hip – a permanent reminder of his struggle and transformation.",
      "Catholic": "As the sun rises, Jacob continues his journey past Penuel, but he is now limping because of the injury to his hip sustained during the struggle. This limp serves as a permanent physical reminder of his transformative encounter with God.",
      "Methodist": "As Jacob leaves Peniel at sunrise, he limps due to his hip injury, a lasting mark of the encounter.",
      "Lutheran": "The sun rises as Jacob passes Penuel, limping because of his hip.",
      "Presbyterian": "Jacob leaves Peniel at sunrise, limping due to his injured hip, a physical reminder of the encounter.",
      "Pentecostal": "Jacob leaves Peniel at sunrise, limping.",
      "Episcopalian/Anglican": "As Jacob passes Peniel at sunrise, he is limping because of his hip injury.",
      "Orthodox": "The sun rises as Jacob departs from Peniel, noticeably limping due to the injury sustained in his hip during the divine struggle.",
      "Other": "The sun rose above him as he passed Peniel, and he was limping because of his hip.",
      "Prefer not to say": "The sun rose above him as he passed Peniel, and he was limping because of his hip."
  },
  "32": {
      "General": "Therefore to this day the Israelites do not eat the tendon attached to the socket of the hip, because the socket of Jacob's hip was touched near the tendon.",
      "Non-Denominational": "Therefore to this day the Israelites do not eat the tendon attached to the socket of the hip, because the socket of Jacob's hip was touched near the tendon.",
      "Baptist": "Provides an etiological explanation for a later Israelite dietary custom: the avoidance of eating the sciatic nerve/tendon reflects a commemoration of Jacob's injury during his pivotal struggle.",
      "Catholic": "The narrator provides an etiological note, explaining the origin of a specific dietary custom observed by the Israelites: 'Therefore to this day the people of Israel do not eat the sinew of the thigh that is on the hip socket, because he touched the socket of Jacob's hip on the sinew of the thigh.' This practice commemorates Jacob's wrestling match and injury.",
      "Methodist": "Explains an Israelite dietary custom (not eating the hip tendon/sciatic nerve) originated from this event, commemorating Jacob's injury.",
      "Lutheran": "Explains why the Israelites to this day do not eat the thigh muscle/tendon on the hip socket: because Jacob's hip socket was touched there.",
      "Presbyterian": "Explains the origin of the Israelite custom of not eating the hip tendon, commemorating Jacob's injury.",
      "Pentecostal": "Explains why Israelites don't eat the hip tendon: because of Jacob's injury.",
      "Episcopalian/Anglican": "Explains the origin of the Israelite custom of abstaining from eating the tendon of the hip socket, commemorating Jacob's injury.",
      "Orthodox": "This verse provides an etiology for the Israelite custom of abstaining from eating the sinew of the hip, linking it directly to the injury Jacob sustained when the divine figure touched his hip socket.",
      "Other": "Therefore to this day the Israelites do not eat the tendon attached to the socket of the hip, because the socket of Jacob's hip was touched near the tendon.",
      "Prefer not to say": "Therefore to this day the Israelites do not eat the tendon attached to the socket of the hip, because the socket of Jacob's hip was touched near the tendon."
    }
  }
} 