{
  "_comment": "Interpretations for Genesis Chapter 33",
  "book": "Genesis",
  "chapter": "33",
  "verses": {
  "1": {
      "General": "Jacob looked up and there was Esau, coming with his four hundred men; so he divided the children among Leah, Rachel and the two female servants.",
      "Non-Denominational": "Jacob looked up and there was Esau, coming with his four hundred men; so he divided the children among Leah, Rachel and the two female servants.",
      "Baptist": "Jacob sees Esau approaching with his large company of 400 men. In a final act of cautious preparation, he arranges his children with their respective mothers (Leah, Rachel, and the handmaids).",
      "Catholic": "Lifting his eyes, Jacob sees Esau approaching with the previously reported 400 men. As a final precautionary measure, he divides the children among Leah, Rachel, and the two handmaids (Bilhah and Zilpah).",
      "Methodist": "Jacob sees Esau coming with 400 men and arranges his children with Leah, Rachel, and the two servants.",
      "Lutheran": "Jacob sees Esau coming with 400 men and divides the children among Leah, Rachel, and the two servants.",
      "Presbyterian": "Jacob sees Esau approaching with 400 men and arranges his children among their mothers.",
      "Pentecostal": "Jacob sees Esau coming with 400 men and arranges his children.",
      "Episcopalian/Anglican": "Jacob sees Esau approaching with 400 men and divides the children among Leah, Rachel, and the two female servants.",
      "Orthodox": "Jacob observes Esau approaching with his contingent of 400 men and strategically divides the children among Leah, Rachel, and the two handmaids.",
      "Other": "Jacob looked up and there was Esau, coming with his four hundred men; so he divided the children among Leah, Rachel and the two female servants.",
      "Prefer not to say": "Jacob looked up and there was Esau, coming with his four hundred men; so he divided the children among Leah, Rachel and the two female servants."
  },
  "2": {
      "General": "He put the female servants and their children in front, Leah and her children next, and Rachel and Joseph in the rear.",
      "Non-Denominational": "He put the female servants and their children in front, Leah and her children next, and Rachel and Joseph in the rear.",
      "Baptist": "He arranges them strategically, placing the handmaids and their children first (most expendable in his fear?), followed by Leah and her children, and finally Rachel and Joseph (his most beloved wife and son) in the safest position at the rear.",
      "Catholic": "He arranges the family procession with deliberate order, placing the handmaids and their children at the front, followed by Leah and her children, and positioning Rachel and Joseph last. This arrangement likely reflects Jacob's hierarchy of affection and places those most precious to him (Rachel and Joseph) in the position perceived as safest.",
      "Methodist": "He arranges them in order of perceived importance/affection: servants and children first, then Leah and children, then Rachel and Joseph last (safest position).",
      "Lutheran": "He positions the servants and their children first, Leah and her children next, and Rachel and Joseph last.",
      "Presbyterian": "He orders the procession based on affection/perceived safety: servants first, then Leah, then Rachel and Joseph last.",
      "Pentecostal": "He arranges them: servants first, Leah next, Rachel and Joseph last.",
      "Episcopalian/Anglican": "He positions the female servants and their children first, Leah and her children next, and Rachel and Joseph last.",
      "Orthodox": "He arranges the procession strategically, placing the handmaids and their children foremost, followed by Leah and her children, with Rachel and Joseph positioned in the rearmost, presumably safest, location.",
      "Other": "He put the female servants and their children in front, Leah and her children next, and Rachel and Joseph in the rear.",
      "Prefer not to say": "He put the female servants and their children in front, Leah and her children next, and Rachel and Joseph in the rear."
  },
  "3": {
      "General": "He himself went on ahead and bowed down to the ground seven times as he approached his brother.",
      "Non-Denominational": "He himself went on ahead and bowed down to the ground seven times as he approached his brother.",
      "Baptist": "Jacob himself takes the lead, demonstrating extreme humility and submission by bowing down to the ground seven times as he approaches Esau – a gesture of profound respect or obeisance.",
      "Catholic": "Jacob himself goes ahead of his family. As he approaches Esau, he performs an act of profound deference, bowing down to the ground seven times. This gesture signifies deep respect and submission, acknowledging Esau's position as the elder brother he wronged.",
      "Methodist": "Jacob goes ahead of everyone and bows to the ground seven times in a gesture of deep humility and respect towards Esau.",
      "Lutheran": "Jacob goes ahead and bows to the ground seven times as he approaches Esau.",
      "Presbyterian": "Jacob goes ahead and bows down seven times before Esau in a display of submission.",
      "Pentecostal": "Jacob goes first and bows seven times.",
      "Episcopalian/Anglican": "Jacob goes on ahead and bows to the ground seven times as he approaches Esau.",
      "Orthodox": "Jacob proceeds ahead of his family and performs seven prostrations on the ground as he approaches Esau, signifying profound deference.",
      "Other": "He himself went on ahead and bowed down to the ground seven times as he approached his brother.",
      "Prefer not to say": "He himself went on ahead and bowed down to the ground seven times as he approached his brother."
  },
  "4": {
      "General": "But Esau ran to meet Jacob and embraced him; he threw his arms around his neck and kissed him. And they wept.",
      "Non-Denominational": "But Esau ran to meet Jacob and embraced him; he threw his arms around his neck and kissed him. And they wept.",
      "Baptist": "Contrary to Jacob's fears, Esau's reaction is one of immediate forgiveness and affection. Esau runs to Jacob, embraces him warmly, kisses him, and both brothers weep together in a moment of emotional reconciliation.",
      "Catholic": "Esau's response completely subverts Jacob's fears. Instead of hostility, Esau runs to meet Jacob, embraces him affectionately, falls on his neck, and kisses him. The long-standing bitterness dissolves as both brothers weep together in a powerful display of reconciliation.",
      "Methodist": "Esau reacts with unexpected warmth and forgiveness: he runs to Jacob, embraces him, kisses him, and they both weep.",
      "Lutheran": "Esau runs to meet Jacob, embraces him, falls on his neck, kisses him, and they both weep.",
      "Presbyterian": "Esau runs to meet Jacob, embraces him, kisses him, and they weep together in reconciliation.",
      "Pentecostal": "Esau runs, embraces Jacob, kisses him, and they weep.",
      "Episcopalian/Anglican": "Esau runs to meet Jacob, embraces him, throws his arms around his neck, kisses him, and they weep together.",
      "Orthodox": "Dispelling Jacob's fears, Esau runs to meet him, embraces him, falls upon his neck, kisses him, and both brothers weep in an emotional reunion.",
      "Other": "But Esau ran to meet Jacob and embraced him; he threw his arms around his neck and kissed him. And they wept.",
      "Prefer not to say": "But Esau ran to meet Jacob and embraced him; he threw his arms around his neck and kissed him. And they wept."
  },
  "5": {
      "General": "Then Esau looked up and saw the women and children. \"Who are these with you?\" he asked. Jacob answered, \"They are the children God has graciously given your servant.\"",
      "Non-Denominational": "Then Esau looked up and saw the women and children. \"Who are these with you?\" he asked. Jacob answered, \"They are the children God has graciously given your servant.\"",
      "Baptist": "Esau notices Jacob's family and inquires about them. Jacob introduces them, attributing his children to God's graciousness while maintaining his deferential stance ('your servant').",
      "Catholic": "Esau then notices the women and children accompanying Jacob and asks, 'Who are these with you?' Jacob replies, attributing his family to divine blessing while continuing his respectful address: 'The children whom God has graciously given your servant.'",
      "Methodist": "Esau asks about the women and children. Jacob introduces them as children God has graciously given him ('your servant').",
      "Lutheran": "Esau sees the women and children and asks who they are. Jacob replies they are the children God has graciously given 'your servant.'",
      "Presbyterian": "Esau inquires about the women and children. Jacob identifies them as children God has graciously given him.",
      "Pentecostal": "Esau asks about the family; Jacob says they are children God gave him.",
      "Episcopalian/Anglican": "Esau sees the women and children and asks who they are. Jacob replies they are the children God has graciously given him.",
      "Orthodox": "Esau inquires about the women and children with Jacob. Jacob identifies them as the children bestowed upon him by God's grace, maintaining his deferential posture.",
      "Other": "Then Esau looked up and saw the women and children. \"Who are these with you?\" he asked. Jacob answered, \"They are the children God has graciously given your servant.\"",
      "Prefer not to say": "Then Esau looked up and saw the women and children. \"Who are these with you?\" he asked. Jacob answered, \"They are the children God has graciously given your servant.\""
  },
  "6": {
      "General": "Then the female servants and their children approached and bowed down.",
      "Non-Denominational": "Then the female servants and their children approached and bowed down.",
      "Baptist": "Following Jacob's earlier arrangement and example, the handmaids (Bilhah and Zilpah) and their children come forward first and bow down before Esau in respect.",
      "Catholic": "Following the predetermined order, the handmaids and their children come forward first and bow down before Esau as a sign of respect.",
      "Methodist": "The female servants and their children come forward first and bow down to Esau.",
      "Lutheran": "The servants and their children come near and bow down.",
      "Presbyterian": "The servants and their children approach first and bow down.",
      "Pentecostal": "The servants and their children approach and bow.",
      "Episcopalian/Anglican": "The female servants and their children approach and bow down.",
      "Orthodox": "The handmaids and their children approach first and bow down in deference to Esau.",
      "Other": "Then the female servants and their children approached and bowed down.",
      "Prefer not to say": "Then the female servants and their children approached and bowed down."
  },
  "7": {
      "General": "Next, Leah and her children came and bowed down. Last of all came Joseph and Rachel, and they too bowed down.",
      "Non-Denominational": "Next, Leah and her children came and bowed down. Last of all came Joseph and Rachel, and they too bowed down.",
      "Baptist": "Leah and her children follow, also bowing down. Finally, Joseph and Rachel approach and perform the same gesture of respect.",
      "Catholic": "Leah and her children then come forward and bow down. Finally, Joseph and Rachel approach together and bow down before Esau.",
      "Methodist": "Leah and her children approach and bow, followed lastly by Joseph and Rachel who also bow.",
      "Lutheran": "Leah and her children come near and bow down. Lastly, Joseph and Rachel come near and bow down.",
      "Presbyterian": "Leah and her children follow, bowing down, and finally Joseph and Rachel approach and bow.",
      "Pentecostal": "Leah and her children bow, then Joseph and Rachel bow.",
      "Episcopalian/Anglican": "Leah and her children approach and bow down, followed by Joseph and Rachel, who also bow down.",
      "Orthodox": "Subsequently, Leah and her children approach and bow down, followed finally by Joseph and Rachel, who also perform the gesture of obeisance.",
      "Other": "Next, Leah and her children came and bowed down. Last of all came Joseph and Rachel, and they too bowed down.",
      "Prefer not to say": "Next, Leah and her children came and bowed down. Last of all came Joseph and Rachel, and they too bowed down."
  },
  "8": {
      "General": "Esau asked, \"What's the meaning of all these flocks and herds I met?\" \"To find favor in your eyes, my lord,\" he said.",
      "Non-Denominational": "Esau asked, \"What's the meaning of all these flocks and herds I met?\" \"To find favor in your eyes, my lord,\" he said.",
      "Baptist": "Esau inquires about the purpose of the large droves of animals he encountered on his way. Jacob reiterates that they were a gift intended to gain Esau's favor and goodwill.",
      "Catholic": "Esau then asks about the purpose of the successive droves of animals he encountered: 'What do you mean by all this company which I met?' Jacob replies that the extensive gift was intended solely 'to find favor in the sight of my lord.'",
      "Methodist": "Esau asks about the meaning of the herds Jacob sent ahead. Jacob explains they were a gift to find favor with Esau.",
      "Lutheran": "Esau asks about the meaning of all the droves he met. Jacob explains it was to find favor in Esau's ('my lord's') sight.",
      "Presbyterian": "Esau asks about the purpose of the herds sent ahead. Jacob explains they were a gift intended to find favor.",
      "Pentecostal": "Esau asks about the gifts; Jacob says they were to find favor.",
      "Episcopalian/Anglican": "Esau asks about the purpose of the droves of animals he met. Jacob explains they were a gift to find favor in Esau's sight.",
      "Orthodox": "Esau inquires about the significance of the large droves of animals he encountered. Jacob clarifies they were a gift intended to secure Esau's favor.",
      "Other": "Esau asked, \"What's the meaning of all these flocks and herds I met?\" \"To find favor in your eyes, my lord,\" he said.",
      "Prefer not to say": "Esau asked, \"What's the meaning of all these flocks and herds I met?\" \"To find favor in your eyes, my lord,\" he said."
  },
  "9": {
      "General": "But Esau said, \"I already have plenty, my brother. Keep what you have for yourself.\"",
      "Non-Denominational": "But Esau said, \"I already have plenty, my brother. Keep what you have for yourself.\"",
      "Baptist": "Esau graciously declines the gift, stating he is already prosperous ('I have enough, my brother') and tells Jacob to keep his possessions.",
      "Catholic": "Esau initially refuses the gift, indicating his own prosperity and perhaps the sincerity of his forgiveness: 'I have enough, my brother; keep what you have for yourself.'",
      "Methodist": "Esau initially refuses the gift, saying he has enough and Jacob should keep it.",
      "Lutheran": "Esau declines, saying he has enough and Jacob should keep what he has.",
      "Presbyterian": "Esau declines the gift, stating he has enough and Jacob should keep his possessions.",
      "Pentecostal": "Esau refuses the gift, saying he has enough.",
      "Episcopalian/Anglican": "Esau initially refuses the gift, stating he has plenty and Jacob should keep what is his.",
      "Orthodox": "Esau graciously declines the gift, assuring Jacob that he possesses sufficient wealth and urging Jacob to retain his own property.",
      "Other": "But Esau said, \"I already have plenty, my brother. Keep what you have for yourself.\"",
      "Prefer not to say": "But Esau said, \"I already have plenty, my brother. Keep what you have for yourself.\""
  },
  "10": {
      "General": "\"No, please!\" said Jacob. \"If I have found favor in your eyes, accept this gift from me. For to see your face is like seeing the face of God, now that you have received me favorably.",
      "Non-Denominational": "\"No, please!\" said Jacob. \"If I have found favor in your eyes, accept this gift from me. For to see your face is like seeing the face of God, now that you have received me favorably.",
      "Baptist": "Jacob insists Esau accept the gift as a token of reconciliation and goodwill. He uses a powerful, perhaps hyperbolic, expression, comparing seeing Esau's accepting face to seeing the face of God, signifying the immense relief and blessing of this reconciliation.",
      "Catholic": "Jacob strongly urges Esau to accept the gift, framing it as a necessary sign of Esau's genuine acceptance and favor ('If I have found favor in your sight, then accept my present from my hand'). He uses a striking comparison: 'for truly to see your face is like seeing the face of God, with such favor have you received me.' This expresses Jacob's profound relief and gratitude for Esau's gracious reception, likening it to a divine blessing.",
      "Methodist": "Jacob insists, saying accepting the gift signifies Esau's favor. He compares seeing Esau's favorable face to seeing God's face, expressing immense relief.",
      "Lutheran": "Jacob insists Esau accept the gift if Jacob has found favor. He says seeing Esau's face is like seeing God's face, given Esau's favorable reception.",
      "Presbyterian": "Jacob insists Esau accept the gift as a sign of favor, comparing the sight of Esau's accepting face to seeing the face of God.",
      "Pentecostal": "Jacob insists Esau take the gift, comparing Esau's face to God's face.",
      "Episcopalian/Anglican": "Jacob insists, asking Esau to accept the gift as a sign of favor, comparing seeing Esau's face favorably to seeing the face of God.",
      "Orthodox": "Jacob implores Esau to accept the gift as a tangible sign of his favor, employing the powerful metaphor that seeing Esau's accepting countenance is akin to seeing the face of God.",
      "Other": "\"No, please!\" said Jacob. \"If I have found favor in your eyes, accept this gift from me. For to see your face is like seeing the face of God, now that you have received me favorably.",
      "Prefer not to say": "\"No, please!\" said Jacob. \"If I have found favor in your eyes, accept this gift from me. For to see your face is like seeing the face of God, now that you have received me favorably."
  },
  "11": {
      "General": "Please accept the present that was brought to you, for God has been gracious to me and I have all I need.\" And because Jacob insisted, Esau accepted it.",
      "Non-Denominational": "Please accept the present that was brought to you, for God has been gracious to me and I have all I need.\" And because Jacob insisted, Esau accepted it.",
      "Baptist": "Jacob again urges acceptance, attributing his ability to give the gift to God's grace and stating he has enough ('all I need'). Due to Jacob's persistence, Esau finally accepts the gift.",
      "Catholic": "Jacob again presses Esau to accept the 'blessing' (berakah - often used for 'gift' in this context) that was brought to him, reiterating that God's grace has provided him with abundance ('God has dealt graciously with me, and I have enough'). Jacob's insistence prevails, and Esau accepts the gift.",
      "Methodist": "Jacob urges Esau again, calling the gift a 'blessing' and crediting God's grace for his abundance. Esau accepts due to Jacob's insistence.",
      "Lutheran": "Jacob urges Esau to accept the gift/blessing brought to him, stating God has been gracious and he (Jacob) has enough. Jacob insists, and Esau accepts.",
      "Presbyterian": "Jacob urges Esau to accept the gift ('blessing'), crediting God's grace for his own abundance. Esau eventually accepts due to Jacob's insistence.",
      "Pentecostal": "Jacob urges Esau again; Esau accepts because Jacob insisted.",
      "Episcopalian/Anglican": "Jacob urges Esau to accept the gift ('blessing'), attributing his own abundance to God's grace. Esau accepts due to Jacob's insistence.",
      "Orthodox": "Jacob reiterates his plea for Esau to accept the present ('blessing'), attributing his ability to give generously to God's grace. Yielding to Jacob's persistence, Esau accepts the gift.",
      "Other": "Please accept the present that was brought to you, for God has been gracious to me and I have all I need.\" And because Jacob insisted, Esau accepted it.",
      "Prefer not to say": "Please accept the present that was brought to you, for God has been gracious to me and I have all I need.\" And because Jacob insisted, Esau accepted it."
  },
  "12": {
      "General": "Then Esau said, \"Let us be on our way; I'll accompany you.\"",
      "Non-Denominational": "Then Esau said, \"Let us be on our way; I'll accompany you.\"",
      "Baptist": "Having reconciled, Esau suggests they travel on together, offering to accompany Jacob.",
      "Catholic": "With the reconciliation seemingly complete, Esau proposes they continue their journeys together: 'Let us journey on our way, and I will go ahead of you (or alongside you).'",
      "Methodist": "Esau suggests they travel onward together.",
      "Lutheran": "Esau suggests they set out and travel together.",
      "Presbyterian": "Esau proposes they travel onward together.",
      "Pentecostal": "Esau suggests they travel together.",
      "Episcopalian/Anglican": "Esau proposes they continue their journey together.",
      "Orthodox": "Esau proposes that they proceed on their journey together.",
      "Other": "Then Esau said, \"Let us be on our way; I'll accompany you.\"",
      "Prefer not to say": "Then Esau said, \"Let us be on our way; I'll accompany you.\""
  },
  "13": {
      "General": "But Jacob said to him, \"My lord knows that the children are tender and that I must care for the ewes and cows that are nursing their young. If they are driven hard just one day, all the animals will die.",
      "Non-Denominational": "But Jacob said to him, \"My lord knows that the children are tender and that I must care for the ewes and cows that are nursing their young. If they are driven hard just one day, all the animals will die.",
      "Baptist": "Jacob politely declines Esau's offer, citing the need to travel slowly due to the young children and nursing animals in his caravan, which cannot keep pace with Esau's likely faster group.",
      "Catholic": "Jacob tactfully declines Esau's offer. He explains that his large company includes young children ('tender') and nursing flocks and herds that require careful, slow travel ('If they are driven hard for one day, all the flocks will die'). He implies he cannot match Esau's pace.",
      "Methodist": "Jacob politely declines, explaining his need to travel slowly due to the young children and nursing animals.",
      "Lutheran": "Jacob declines, explaining to 'my lord' that the children are young/delicate, and the nursing flocks/herds need care; driving them hard would kill them.",
      "Presbyterian": "Jacob politely declines, citing the need for a slower pace due to young children and nursing livestock.",
      "Pentecostal": "Jacob declines, saying he must travel slowly for the children and animals.",
      "Episcopalian/Anglican": "Jacob politely declines, explaining he must travel slowly because the children are young and the flocks and herds are nursing.",
      "Orthodox": "Jacob tactfully declines Esau's proposal, explaining the necessity of traveling slowly to accommodate the young children and nursing livestock in his caravan.",
      "Other": "But Jacob said to him, \"My lord knows that the children are tender and that I must care for the ewes and cows that are nursing their young. If they are driven hard just one day, all the animals will die.",
      "Prefer not to say": "But Jacob said to him, \"My lord knows that the children are tender and that I must care for the ewes and cows that are nursing their young. If they are driven hard just one day, all the animals will die."
  },
  "14": {
      "General": "So let my lord go on ahead of his servant, while I move along slowly at the pace of the flocks and herds before me and the pace of the children, until I come to my lord in Seir.\"",
      "Non-Denominational": "So let my lord go on ahead of his servant, while I move along slowly at the pace of the flocks and herds before me and the pace of the children, until I come to my lord in Seir.\"",
      "Baptist": "Jacob suggests Esau proceed ahead while he follows at the slower pace dictated by his children and livestock. He states his intention (perhaps not entirely truthfully) to eventually meet Esau in Seir.",
      "Catholic": "Jacob proposes an alternative: 'Let my lord pass on ahead of his servant, and I will lead on slowly, at the pace of the livestock that are ahead of me and at the pace of the children, until I come to my lord in Seir.' He suggests a separate, slower journey, giving the impression he will eventually rendezvous with Esau in Seir (though he ultimately goes elsewhere).",
      "Methodist": "Jacob suggests Esau go ahead while he follows slowly, stating (perhaps deceptively) he will eventually come to Esau in Seir.",
      "Lutheran": "Jacob suggests Esau go ahead while he travels slowly at the pace of the livestock and children, until he reaches Esau in Seir.",
      "Presbyterian": "Jacob suggests Esau proceed ahead while he follows slowly, indicating (perhaps disingenuously) he will meet him in Seir.",
      "Pentecostal": "Jacob suggests Esau go ahead, and he will follow slowly to Seir.",
      "Episcopalian/Anglican": "Jacob proposes that Esau go on ahead while he travels slowly at the pace of the children and livestock, until he reaches Esau in Seir.",
      "Orthodox": "Jacob proposes that Esau proceed ahead while he travels at a slower pace appropriate for his children and livestock, stating an intention to eventually join Esau in Seir.",
      "Other": "So let my lord go on ahead of his servant, while I move along slowly at the pace of the flocks and herds before me and the pace of the children, until I come to my lord in Seir.\"",
      "Prefer not to say": "So let my lord go on ahead of his servant, while I move along slowly at the pace of the flocks and herds before me and the pace of the children, until I come to my lord in Seir.\""
  },
  "15": {
      "General": "Esau said, \"Then let me leave some of my men with you.\" \"But why do that?\" Jacob asked. \"Just let me find favor in the eyes of my lord.\"",
      "Non-Denominational": "Esau said, \"Then let me leave some of my men with you.\" \"But why do that?\" Jacob asked. \"Just let me find favor in the eyes of my lord.\"",
      "Baptist": "Esau offers to leave some of his men as an escort or guard for Jacob. Jacob politely refuses this offer as well, indicating he doesn't need the help and simply desires Esau's continued goodwill ('Let me find favor in the sight of my lord').",
      "Catholic": "Esau then offers to leave some of his men with Jacob, perhaps as an escort or guard. Jacob again politely declines ('Why should I find favor in the sight of my lord?', a polite demurral meaning 'There is no need'). He implies that Esau's favorable reception is sufficient and he requires no further assistance.",
      "Methodist": "Esau offers to leave some men with Jacob, but Jacob politely declines, saying Esau's favor is enough.",
      "Lutheran": "Esau offers to leave some of his men with Jacob. Jacob politely declines ('Why...? Let me find favor in the sight of my lord').",
      "Presbyterian": "Esau offers some of his men as an escort, but Jacob politely declines, stating Esau's favor is sufficient.",
      "Pentecostal": "Esau offers some men; Jacob politely refuses.",
      "Episcopalian/Anglican": "Esau offers to leave some of his men with Jacob, but Jacob politely declines, indicating Esau's favor is sufficient.",
      "Orthodox": "Esau offers to assign some of his men to accompany Jacob, but Jacob politely refuses the assistance, suggesting that Esau's goodwill alone is sufficient.",
      "Other": "Esau said, \"Then let me leave some of my men with you.\" \"But why do that?\" Jacob asked. \"Just let me find favor in the eyes of my lord.\"",
      "Prefer not to say": "Esau said, \"Then let me leave some of my men with you.\" \"But why do that?\" Jacob asked. \"Just let me find favor in the eyes of my lord.\""
  },
  "16": {
      "General": "So that day Esau started on his way back to Seir.",
      "Non-Denominational": "So that day Esau started on his way back to Seir.",
      "Baptist": "Esau accepts Jacob's decision and departs that same day, returning towards his home in Seir.",
      "Catholic": "Accepting Jacob's wishes, Esau departs that day and begins his journey back to Seir.",
      "Methodist": "Esau departs that day, heading back towards Seir.",
      "Lutheran": "Esau returns toward Seir that day.",
      "Presbyterian": "Esau departs that day to return to Seir.",
      "Pentecostal": "Esau leaves that day for Seir.",
      "Episcopalian/Anglican": "Esau departs that day to return to Seir.",
      "Orthodox": "Esau departs on the same day, returning towards his home in Seir.",
      "Other": "So that day Esau started on his way back to Seir.",
      "Prefer not to say": "So that day Esau started on his way back to Seir."
  },
  "17": {
      "General": "Jacob, however, went to Succoth, where he built a place for himself and made shelters for his livestock. That is why the place is called Succoth.",
      "Non-Denominational": "Jacob, however, went to Succoth, where he built a place for himself and made shelters for his livestock. That is why the place is called Succoth.",
      "Baptist": "Instead of following Esau to Seir, Jacob travels in a different direction to Succoth (east of the Jordan, north of the Jabbok). There he settles temporarily, building a house for himself and booths (sukkot) or shelters for his livestock, giving the place its name.",
      "Catholic": "Jacob, however, does not proceed towards Seir as he implied he might. Instead, he travels to Succoth (likely east of the Jordan). There, he builds a house for himself and makes booths (sukkot) for his livestock, indicating a more settled, albeit perhaps temporary, stay. This act of building shelters gives the place its name, Succoth ('Booths').",
      "Methodist": "Jacob goes to Succoth (not Seir), builds a house, and makes shelters (booths/sukkot) for his livestock, hence the name Succoth.",
      "Lutheran": "Jacob travels to Succoth, builds a house for himself, and makes shelters (sukkot) for his livestock, which is why the place is called Succoth.",
      "Presbyterian": "Jacob travels instead to Succoth, where he builds a house and shelters ('booths') for his livestock, naming the place Succoth.",
      "Pentecostal": "Jacob goes to Succoth, builds shelters (booths) for himself and livestock, naming the place Succoth.",
      "Episcopalian/Anglican": "Jacob travels to Succoth, building a house for himself and shelters (booths) for his livestock, hence the name Succoth.",
      "Orthodox": "Jacob, contrary to his stated intention to Esau, proceeds to Succoth, where he constructs dwellings for himself and shelters (booths) for his livestock, thereby giving the location its name.",
      "Other": "Jacob, however, went to Succoth, where he built a place for himself and made shelters for his livestock. That is why the place is called Succoth.",
      "Prefer not to say": "Jacob, however, went to Succoth, where he built a place for himself and made shelters for his livestock. That is why the place is called Succoth."
  },
  "18": {
      "General": "After Jacob came from Paddan Aram, he arrived safely at the city of Shechem in Canaan and camped within sight of the city.",
      "Non-Denominational": "After Jacob came from Paddan Aram, he arrived safely at the city of Shechem in Canaan and camped within sight of the city.",
      "Baptist": "Jacob eventually crosses the Jordan River and arrives safely back in Canaan, specifically at the city of Shechem. He sets up camp near the city.",
      "Catholic": "Having journeyed from Paddan-aram (implicitly crossing the Jordan after Succoth), Jacob arrives safely ('in peace') in the land of Canaan, specifically at the city of Shechem. He pitches his camp in the area facing the city.",
      "Methodist": "Jacob finally arrives safely back in Canaan, near the city of Shechem, and camps there.",
      "Lutheran": "Jacob comes safely from Paddan-aram to the city of Shechem in Canaan and camps before the city.",
      "Presbyterian": "Jacob arrives safely in Canaan from Paddan Aram, reaching the city of Shechem and camping nearby.",
      "Pentecostal": "Jacob arrives safely at Shechem in Canaan and camps near the city.",
      "Episcopalian/Anglican": "Jacob arrives safely from Paddan-aram at the city of Shechem in Canaan and camps near the city.",
      "Orthodox": "Jacob arrives safely from Paddan-aram, reaching the city of Shechem within the land of Canaan, and establishes his camp in proximity to the city.",
      "Other": "After Jacob came from Paddan Aram, he arrived safely at the city of Shechem in Canaan and camped within sight of the city.",
      "Prefer not to say": "After Jacob came from Paddan Aram, he arrived safely at the city of Shechem in Canaan and camped within sight of the city."
  },
  "19": {
      "General": "For a hundred pieces of silver, he bought from the sons of Hamor, the father of Shechem, the plot of ground where he pitched his tent.",
      "Non-Denominational": "For a hundred pieces of silver, he bought from the sons of Hamor, the father of Shechem, the plot of ground where he pitched his tent.",
      "Baptist": "Jacob purchases the piece of land where he has camped from the local Canaanite family, the sons of Hamor (father of the city's namesake, Shechem), for a hundred pieces of silver (kesitah - a unit of uncertain value). This echoes Abraham's purchase at Machpelah.",
      "Catholic": "Jacob purchases the specific parcel of land where he had pitched his tent. He buys it from the sons of Hamor, the father of Shechem (the local Canaanite chieftain or city founder), for one hundred pieces of money (qesitah, an archaic monetary unit). This act establishes a legal claim to a piece of the Promised Land, similar to Abraham's purchase of Machpelah.",
      "Methodist": "Jacob buys the plot of land where he camped from the sons of Hamor (Shechem's father) for 100 pieces of silver (kesitah), establishing a foothold.",
      "Lutheran": "He buys the plot of ground where he pitched his tent from the sons of Hamor, Shechem's father, for 100 pieces of silver (qesitah).",
      "Presbyterian": "Jacob purchases the land where he camped from the sons of Hamor (father of Shechem) for 100 pieces of silver.",
      "Pentecostal": "He buys the land where he camped from the sons of Hamor for 100 silver pieces.",
      "Episcopalian/Anglican": "Jacob buys the plot of ground where he pitched his tent from the sons of Hamor, father of Shechem, for 100 pieces of silver.",
      "Orthodox": "Jacob purchases the parcel of land where he had established his camp from the sons of Hamor, the father of Shechem, for one hundred pieces of silver (qesitah), thus acquiring property in Canaan.",
      "Other": "For a hundred pieces of silver, he bought from the sons of Hamor, the father of Shechem, the plot of ground where he pitched his tent.",
      "Prefer not to say": "For a hundred pieces of silver, he bought from the sons of Hamor, the father of Shechem, the plot of ground where he pitched his tent."
  },
  "20": {
      "General": "There he set up an altar and called it El Elohe Israel.",
      "Non-Denominational": "There he set up an altar and called it El Elohe Israel.",
      "Baptist": "On the land he purchased, Jacob erects an altar for worship and names it El-Elohe-Israel, meaning 'God, the God of Israel,' acknowledging God's faithfulness and claiming his new identity (Israel) in relation to God within the Promised Land.",
      "Catholic": "On this purchased land, Jacob erects an altar, signifying it as a place of worship dedicated to God. He names the altar El-Elohe-Israel, meaning 'God, the God of Israel.' This act claims the land for the worship of the true God and publicly identifies Jacob by his new name, Israel, linking his identity to the God he serves.",
      "Methodist": "Jacob builds an altar on his land and names it El Elohe Israel ('God, the God of Israel'), acknowledging God's sovereignty and his new identity.",
      "Lutheran": "Jacob erects an altar there and calls it El-Elohe-Israel ('God, the God of Israel').",
      "Presbyterian": "Jacob builds an altar on the purchased land, naming it El-Elohe-Israel ('God, the God of Israel'), dedicating it to God.",
      "Pentecostal": "He builds an altar and calls it El Elohe Israel ('God, the God of Israel').",
      "Episcopalian/Anglican": "Jacob sets up an altar there and names it El-Elohe-Israel ('God, the God of Israel').",
      "Orthodox": "Jacob erects an altar on the land he purchased, naming it El-Elohe-Israel ('God, the God of Israel'), thereby consecrating the site to the worship of God under his new covenant name.",
      "Other": "There he set up an altar and called it El Elohe Israel.",
      "Prefer not to say": "There he set up an altar and called it El Elohe Israel."
    }
  }
} 