{
  "_comment": "Interpretations for Genesis Chapter 34",
  "book": "Genesis",
  "chapter": "34",
  "verses": {
    "1": {
      "General": "Now Dinah, the daughter Leah had borne to Jacob, went out to visit the women of the land.",
      "Non-Denominational": "Now Dinah, the daughter Leah had borne to Jacob, went out to visit the women of the land.",
      "Baptist": "Dinah, Jacob's daughter by Leah, goes out from the family camp to socialize with the local Canaanite women of Shechem.",
      "Catholic": "Dinah, the daughter whom Leah bore to Jacob, goes out to visit the women native to the region of Shechem.",
      "Methodist": "Dinah, daughter of Jacob and Leah, goes out to visit the local women near Shechem.",
      "Lutheran": "Dinah, the daughter of Leah and Jacob, goes out to see the daughters of the land.",
      "Presbyterian": "Dinah, Jacob's daughter through Leah, goes out to visit the women of the region.",
      "Pentecostal": "Dinah, daughter of Jacob and Leah, visits the local women.",
      "Episcopalian/Anglican": "Dinah, the daughter of Jacob and Leah, goes out to visit the women of the land.",
      "Orthodox": "Dinah, the daughter born to Jacob by Leah, ventures out to become acquainted with the women of the region.",
      "Other": "Now Dinah, the daughter Leah had borne to Jacob, went out to visit the women of the land.",
      "Prefer not to say": "Now Dinah, the daughter Leah had borne to Jacob, went out to visit the women of the land."
    },
    "2": {
      "General": "When Shechem son of Hamor the Hivite, the ruler of that area, saw her, he took her and violated her.",
      "Non-Denominational": "When Shechem son of Hamor the Hivite, the ruler of that area, saw her, he took her and violated her.",
      "Baptist": "Shechem, the son of Hamor the Hivite (the local ruler), sees Dinah, seizes her, lies with her, and violates (humbles) her. This act is presented as forceful and non-consensual.",
      "Catholic": "Shechem, the son of Hamor the Hivite, who was the chief of the land, sees Dinah. He seizes her, lies with her, and violates her (the Hebrew implies humiliation and force).",
      "Methodist": "Shechem, son of the local ruler Hamor (a Hivite), sees Dinah, takes her, and sexually violates her.",
      "Lutheran": "Shechem, son of Hamor the Hivite, the prince of the land, sees her, seizes her, lies with her, and humiliates/violates her.",
      "Presbyterian": "Shechem, son of the local ruler Hamor, sees Dinah, seizes her, and violates her.",
      "Pentecostal": "Shechem, son of the ruler Hamor, sees her, takes her, and violates her.",
      "Episcopalian/Anglican": "Shechem, son of Hamor the Hivite, the ruler of the area, sees her, takes her, and violates her.",
      "Orthodox": "Shechem, the son of Hamor the Hivite, the local prince, observes Dinah, seizes her, lies with her, and defiles her.",
      "Other": "When Shechem son of Hamor the Hivite, the ruler of that area, saw her, he took her and violated her.",
      "Prefer not to say": "When Shechem son of Hamor the Hivite, the ruler of that area, saw her, he took her and violated her."
    },
    "3": {
      "General": "His heart was drawn to Dinah daughter of Jacob; he loved the young woman and spoke tenderly to her.",
      "Non-Denominational": "His heart was drawn to Dinah daughter of Jacob; he loved the young woman and spoke tenderly to her.",
      "Baptist": "Despite the violent act, Shechem develops feelings for Dinah. His soul ('nephesh') clings to her, he loves her, and speaks kindly or reassuringly to her heart.",
      "Catholic": "After the violation, Shechem's soul becomes attached (or clings) to Dinah. He is said to 'love' the young woman and speaks consolingly ('to her heart') to her.",
      "Methodist": "After the assault, Shechem becomes attached to Dinah, loves her, and tries to speak kindly to her.",
      "Lutheran": "His soul clings to Dinah; he loves the young woman and speaks tenderly to her.",
      "Presbyterian": "Shechem becomes attached to Dinah, loves her, and speaks kindly to her after the assault.",
      "Pentecostal": "Shechem becomes attached to Dinah, loves her, and speaks kindly.",
      "Episcopalian/Anglican": "Shechem becomes strongly attached to Dinah, loves her, and speaks tenderly to her.",
      "Orthodox": "Following the assault, Shechem develops an attachment to Dinah; he loves the young woman and speaks consolingly to her.",
      "Other": "His heart was drawn to Dinah daughter of Jacob; he loved the young woman and spoke tenderly to her.",
      "Prefer not to say": "His heart was drawn to Dinah daughter of Jacob; he loved the young woman and spoke tenderly to her."
    },
    "4": {
      "General": "And Shechem said to his father Hamor, \"Get me this girl as my wife.\"",
      "Non-Denominational": "And Shechem said to his father Hamor, \"Get me this girl as my wife.\"",
      "Baptist": "Shechem expresses his desire to marry Dinah and asks his father, Hamor, to arrange the marriage for him.",
      "Catholic": "Shechem instructs his father Hamor to formally acquire Dinah as his wife, seeking to legitimize the situation through marriage according to custom.",
      "Methodist": "Shechem asks his father Hamor to arrange for him to marry Dinah.",
      "Lutheran": "Shechem tells his father Hamor to get Dinah for him as a wife.",
      "Presbyterian": "Shechem asks his father Hamor to arrange for Dinah to become his wife.",
      "Pentecostal": "Shechem asks his father to get Dinah for his wife.",
      "Episcopalian/Anglican": "Shechem asks his father Hamor to get Dinah for him as a wife.",
      "Orthodox": "Shechem requests his father Hamor to secure Dinah for him as a wife.",
      "Other": "And Shechem said to his father Hamor, \"Get me this girl as my wife.\"",
      "Prefer not to say": "And Shechem said to his father Hamor, \"Get me this girl as my wife.\""
    },
    "5": {
      "General": "When Jacob heard that his daughter Dinah had been defiled, his sons were in the fields with his livestock; so he kept quiet about it until they came home.",
      "Non-Denominational": "When Jacob heard that his daughter Dinah had been defiled, his sons were in the fields with his livestock; so he kept quiet about it until they came home.",
      "Baptist": "Jacob learns that Dinah has been defiled (rendered unclean, disgraced). However, with his sons away tending livestock, Jacob waits silently, holding back any reaction until they return.",
      "Catholic": "Jacob hears that Shechem has defiled his daughter Dinah. Since his sons are away with the livestock in the field, Jacob remains silent, awaiting their return before taking any action.",
      "Methodist": "Jacob hears Dinah has been defiled but keeps quiet until his sons return from the fields.",
      "Lutheran": "Jacob hears that Shechem defiled his daughter Dinah. Since his sons were with the livestock in the field, Jacob holds his peace until they return.",
      "Presbyterian": "Jacob learns that Dinah has been defiled but waits for his sons to return from the fields before acting.",
      "Pentecostal": "Jacob hears Dinah was defiled but waits for his sons.",
      "Episcopalian/Anglican": "Jacob hears that Dinah has been defiled. His sons are in the fields, so he remains silent until they return.",
      "Orthodox": "Jacob learns of Dinah's defilement. As his sons are currently occupied with the livestock in the fields, Jacob refrains from immediate action, awaiting their return.",
      "Other": "When Jacob heard that his daughter Dinah had been defiled, his sons were in the fields with his livestock; so he kept quiet about it until they came home.",
      "Prefer not to say": "When Jacob heard that his daughter Dinah had been defiled, his sons were in the fields with his livestock; so he kept quiet about it until they came home."
    },
    "6": {
      "General": "Then Shechem's father Hamor went out to talk with Jacob.",
      "Non-Denominational": "Then Shechem's father Hamor went out to talk with Jacob.",
      "Baptist": "Meanwhile, Hamor, Shechem's father, goes to speak with Jacob, presumably to begin negotiations for Dinah's marriage to his son.",
      "Catholic": "Hamor, Shechem's father, takes the initiative and goes out to speak with Jacob, intending to negotiate the marriage proposal.",
      "Methodist": "Hamor, Shechem's father, goes to speak with Jacob about the situation.",
      "Lutheran": "Hamor, the father of Shechem, goes out to Jacob to speak with him.",
      "Presbyterian": "Hamor goes to speak with Jacob, likely to propose marriage between Shechem and Dinah.",
      "Pentecostal": "Hamor goes to talk with Jacob.",
      "Episcopalian/Anglican": "Hamor, Shechem's father, goes out to speak with Jacob.",
      "Orthodox": "Hamor, Shechem's father, approaches Jacob to discuss the matter.",
      "Other": "Then Shechem's father Hamor went out to talk with Jacob.",
      "Prefer not to say": "Then Shechem's father Hamor went out to talk with Jacob."
    },
    "7": {
      "General": "Now Jacob's sons had come in from the fields as soon as they heard what had happened. They were shocked and furious, because Shechem had done an outrageous thing in Israel by lying with Jacob's daughter—a thing that should not be done.",
      "Non-Denominational": "Now Jacob's sons had come in from the fields as soon as they heard what had happened. They were shocked and furious, because Shechem had done an outrageous thing in Israel by lying with Jacob's daughter—a thing that should not be done.",
      "Baptist": "Jacob's sons return from the field and hear the news. They are deeply distressed (grieved) and very angry because Shechem committed a disgraceful act ('nebalah') in Israel (referring to Jacob's family as the nascent covenant community) by violating Jacob's daughter – an act considered utterly unacceptable.",
      "Catholic": "Jacob's sons return from the field upon hearing the news. They are deeply grieved and enraged because Shechem has committed a disgraceful act ('nebalah') against Israel (Jacob's family) by lying with Jacob's daughter—an action considered utterly improper and offensive.",
      "Methodist": "Jacob's sons return, hear the news, and are deeply grieved and very angry. Shechem's act is described as a disgraceful thing ('nebalah') in/against Israel (Jacob's family) that should not happen.",
      "Lutheran": "Jacob's sons come in from the field when they hear about it. They are grieved and very angry because Shechem had done a disgraceful thing ('nebalah') in Israel by lying with Jacob's daughter, a thing that ought not be done.",
      "Presbyterian": "Jacob's sons return from the fields, learn what happened, and are filled with grief and anger. Shechem's act is deemed a disgraceful outrage against Jacob's family ('Israel').",
      "Pentecostal": "Jacob's sons return, hear the news, and are grieved and angry because Shechem did a disgraceful thing.",
      "Episcopalian/Anglican": "Jacob's sons return from the fields upon hearing the news. They are deeply distressed and furious because Shechem had committed a disgraceful act in Israel by violating Jacob's daughter, something that should not be done.",
      "Orthodox": "Upon returning from the fields and learning of the incident, Jacob's sons are profoundly grieved and intensely angered. Shechem's actions constitute a grave offense ('nebalah') against the honor of Jacob's household ('Israel'), an utterly unacceptable transgression.",
      "Other": "Now Jacob's sons had come in from the fields as soon as they heard what had happened. They were shocked and furious, because Shechem had done an outrageous thing in Israel by lying with Jacob's daughter—a thing that should not be done.",
      "Prefer not to say": "Now Jacob's sons had come in from the fields as soon as they heard what had happened. They were shocked and furious, because Shechem had done an outrageous thing in Israel by lying with Jacob's daughter—a thing that should not be done."
    },
    "8": {
      "General": "But Hamor said to them, \"My son Shechem has his heart set on your daughter. Please give her to him as his wife.",
      "Non-Denominational": "But Hamor said to them, \"My son Shechem has his heart set on your daughter. Please give her to him as his wife.",
      "Baptist": "Hamor addresses Jacob and his sons, stating that his son Shechem deeply desires ('his soul longs for') Dinah and formally requests her hand in marriage for Shechem.",
      "Catholic": "Hamor addresses Jacob and his sons, conveying Shechem's strong desire for Dinah: 'The soul of my son Shechem longs for your daughter; please give her to him to be his wife.'",
      "Methodist": "Hamor speaks to Jacob and his sons, stating Shechem's strong desire for Dinah and asking for her hand in marriage.",
      "Lutheran": "Hamor says to them that his son Shechem's soul longs for their daughter (sister) and asks them to give her to him in marriage.",
      "Presbyterian": "Hamor tells Jacob and his sons that Shechem is deeply attached to Dinah and asks for her to be given to him in marriage.",
      "Pentecostal": "Hamor tells them Shechem loves Dinah and asks for her marriage.",
      "Episcopalian/Anglican": "Hamor tells them that his son Shechem is strongly attracted to Dinah and requests that they give her to him as a wife.",
      "Orthodox": "Hamor communicates to Jacob and his sons that Shechem is deeply attached to Dinah and formally requests her for marriage.",
      "Other": "But Hamor said to them, \"My son Shechem has his heart set on your daughter. Please give her to him as his wife.",
      "Prefer not to say": "But Hamor said to them, \"My son Shechem has his heart set on your daughter. Please give her to him as his wife."
    },
    "9": {
      "General": "Intermarry with us; give us your daughters and take our daughters for yourselves.",
      "Non-Denominational": "Intermarry with us; give us your daughters and take our daughters for yourselves.",
      "Baptist": "Hamor proposes a broader alliance through intermarriage: Jacob's family should give their daughters to the Shechemites, and take Shechemite daughters for themselves.",
      "Catholic": "Hamor proposes a general policy of intermarriage between their two peoples: 'Make marriages with us; give your daughters to us, and take our daughters for yourselves.'",
      "Methodist": "Hamor proposes general intermarriage between their peoples.",
      "Lutheran": "He proposes intermarriage: 'Give your daughters to us, and take our daughters for yourselves.'",
      "Presbyterian": "Hamor suggests establishing kinship ties through intermarriage between the two groups.",
      "Pentecostal": "Hamor proposes intermarriage between their peoples.",
      "Episcopalian/Anglican": "Hamor proposes intermarriage between their peoples, suggesting they exchange daughters.",
      "Orthodox": "Hamor further suggests establishing formal ties through widespread intermarriage between the two communities.",
      "Other": "Intermarry with us; give us your daughters and take our daughters for yourselves.",
      "Prefer not to say": "Intermarry with us; give us your daughters and take our daughters for yourselves."
    },
    "10": {
      "General": "You can settle among us; the land is open to you. Live in it, trade in it, and acquire property in it.\"",
      "Non-Denominational": "You can settle among us; the land is open to you. Live in it, trade in it, and acquire property in it.\"",
      "Baptist": "He offers Jacob's family the right to dwell in their land, assuring them it is open to them for settlement, trade, and property acquisition.",
      "Catholic": "He extends an invitation for Jacob's family to settle permanently among them: 'You shall dwell with us; and the land shall be open before you; dwell and trade in it, and get property in it.'",
      "Methodist": "He invites Jacob's family to settle, trade, and acquire property in their land.",
      "Lutheran": "He invites them to dwell with them, offering the land for settlement, trade, and property acquisition.",
      "Presbyterian": "He invites Jacob's family to live among them, offering freedom to settle, trade, and own property.",
      "Pentecostal": "He invites them to live, trade, and own property in their land.",
      "Episcopalian/Anglican": "Hamor invites Jacob's family to settle among them, offering them freedom to live, trade, and acquire property in the land.",
      "Orthodox": "Hamor invites Jacob's family to reside among them, granting them permission to live, conduct trade, and acquire property within their territory.",
      "Other": "You can settle among us; the land is open to you. Live in it, trade in it, and acquire property in it.\"",
      "Prefer not to say": "You can settle among us; the land is open to you. Live in it, trade in it, and acquire property in it.\""
    },
    "11": {
      "General": "Then Shechem said to Dinah's father and brothers, \"Let me find favor in your eyes, and I will give you whatever you ask.",
      "Non-Denominational": "Then Shechem said to Dinah's father and brothers, \"Let me find favor in your eyes, and I will give you whatever you ask.",
      "Baptist": "Shechem himself speaks directly to Jacob (Dinah's father) and her brothers, pleading for their acceptance ('Let me find favor') and promising to pay any bride price they demand.",
      "Catholic": "Shechem then addresses Dinah's father (Jacob) and her brothers directly, pleading for their acceptance ('Let me find favor in your eyes') and offering to meet any demand they make for a bride price: 'and whatever you say to me I will give.'",
      "Methodist": "Shechem also pleads with Jacob and his sons, asking for favor and offering to pay whatever bride price they name.",
      "Lutheran": "Shechem speaks to Dinah's father and brothers, asking to find favor and promising to give whatever they ask.",
      "Presbyterian": "Shechem pleads with Jacob and Dinah's brothers for acceptance, offering to pay any bride price they require.",
      "Pentecostal": "Shechem pleads with Jacob and brothers, offering any bride price.",
      "Episcopalian/Anglican": "Shechem appeals to Dinah's father and brothers, asking for their favor and offering to pay whatever they demand.",
      "Orthodox": "Shechem personally addresses Jacob and Dinah's brothers, appealing for their acceptance and pledging to pay whatever bride price they stipulate.",
      "Other": "Then Shechem said to Dinah's father and brothers, \"Let me find favor in your eyes, and I will give you whatever you ask.",
      "Prefer not to say": "Then Shechem said to Dinah's father and brothers, \"Let me find favor in your eyes, and I will give you whatever you ask."
    },
    "12": {
      "General": "Make the bride-price and the gift as large as you like, and I'll pay whatever you ask me. Only give me the young woman as my wife.\"",
      "Non-Denominational": "Make the bride-price and the gift as large as you like, and I'll pay whatever you ask me. Only give me the young woman as my wife.\"",
      "Baptist": "He emphasizes his willingness to pay an extremely high bride price ('mohar') and gift, whatever amount they set, if only they will give him Dinah as his wife.",
      "Catholic": "He reiterates his offer, urging them to demand a very large bride price ('mohar') and gift; he promises to pay whatever they ask, solely requesting Dinah be given to him as his wife.",
      "Methodist": "He stresses he will pay any amount, however large, for the bride price and gift, if they will just give him Dinah as his wife.",
      "Lutheran": "He tells them to ask for a large bride price and gift, and he will pay it, if only they give him the young woman for a wife.",
      "Presbyterian": "He insists he will pay any bride price and gift, no matter how large, if they agree to the marriage.",
      "Pentecostal": "He insists he will pay any price for Dinah.",
      "Episcopalian/Anglican": "Shechem urges them to set the bride-price and gift as high as they wish, promising to pay it, asking only for Dinah as his wife.",
      "Orthodox": "He insists they can demand an exorbitant bride price and gift, which he will readily pay, provided they consent to give Dinah to him in marriage.",
      "Other": "Make the bride-price and the gift as large as you like, and I'll pay whatever you ask me. Only give me the young woman as my wife.\"",
      "Prefer not to say": "Make the bride-price and the gift as large as you like, and I'll pay whatever you ask me. Only give me the young woman as my wife.\""
    },
    "13": {
      "General": "Because their sister Dinah had been defiled, Jacob's sons replied deceitfully as they spoke to Shechem and his father Hamor.",
      "Non-Denominational": "Because their sister Dinah had been defiled, Jacob's sons replied deceitfully as they spoke to Shechem and his father Hamor.",
      "Baptist": "Jacob's sons respond to Shechem and Hamor deceitfully. Their motive is the defilement of their sister Dinah.",
      "Catholic": "Jacob's sons respond deceitfully to Shechem and his father Hamor, their words motivated by the fact that Shechem had defiled their sister Dinah.",
      "Methodist": "Jacob's sons answer Shechem and Hamor deceitfully, because Shechem had defiled their sister Dinah.",
      "Lutheran": "Jacob's sons answer Shechem and Hamor deceitfully because he had defiled their sister Dinah.",
      "Presbyterian": "Motivated by Dinah's defilement, Jacob's sons respond deceitfully to Shechem and Hamor.",
      "Pentecostal": "Jacob's sons reply deceitfully because Dinah was defiled.",
      "Episcopalian/Anglican": "Because Shechem had defiled their sister Dinah, Jacob's sons answer Shechem and Hamor deceitfully.",
      "Orthodox": "In response, Jacob's sons address Shechem and Hamor with deceit, their actions prompted by the defilement of their sister Dinah.",
      "Other": "Because their sister Dinah had been defiled, Jacob's sons replied deceitfully as they spoke to Shechem and his father Hamor.",
      "Prefer not to say": "Because their sister Dinah had been defiled, Jacob's sons replied deceitfully as they spoke to Shechem and his father Hamor."
    },
    "14": {
      "General": "They said to them, \"We can't do such a thing; we can't give our sister to a man who is not circumcised. That would be a disgrace to us.",
      "Non-Denominational": "They said to them, \"We can't do such a thing; we can't give our sister to a man who is not circumcised. That would be a disgrace to us.",
      "Baptist": "They claim they cannot give Dinah to an uncircumcised man, stating that such a union would be a reproach or disgrace to them (using circumcision as the pretext for their deception).",
      "Catholic": "They state their objection: 'We cannot do this thing, to give our sister to one who is uncircumcised, for that would be a disgrace to us.' They use the requirement of circumcision, a sign of the covenant unique to Abraham's descendants, as the basis for their refusal and their subsequent deceptive condition.",
      "Methodist": "They claim they cannot give their sister to an uncircumcised man, as it would be a disgrace to them.",
      "Lutheran": "They state they cannot give their sister to an uncircumcised man, as that would be a reproach to them.",
      "Presbyterian": "They state that they cannot give their sister to an uncircumcised man, as this would bring disgrace upon them.",
      "Pentecostal": "They say they can't give Dinah to an uncircumcised man; it's a disgrace.",
      "Episcopalian/Anglican": "They tell them they cannot give their sister to an uncircumcised man, as that would be a disgrace to them.",
      "Orthodox": "They declare that they cannot permit their sister to marry an uncircumcised man, asserting that such a union would be a dishonor to them.",
      "Other": "They said to them, \"We can't do such a thing; we can't give our sister to a man who is not circumcised. That would be a disgrace to us.",
      "Prefer not to say": "They said to them, \"We can't do such a thing; we can't give our sister to a man who is not circumcised. That would be a disgrace to us."
    },
    "15": {
      "General": "We will give our consent to you on one condition only: that you become like us by circumcising all your males.",
      "Non-Denominational": "We will give our consent to you on one condition only: that you become like us by circumcising all your males.",
      "Baptist": "They propose a condition for agreement: the Shechemites must become like them, specifically by having every male among them circumcised.",
      "Catholic": "They propose a condition for consenting: 'Only on this condition will we agree with you: that you will become as we are and every male among you be circumcised.'",
      "Methodist": "They agree only on the condition that all Shechemite males get circumcised.",
      "Lutheran": "They will consent only on the condition that the Shechemites become like them, with every male circumcised.",
      "Presbyterian": "They agree to the marriage and intermarriage proposal only if all the Shechemite males are circumcised.",
      "Pentecostal": "They agree only if all Shechemite males are circumcised.",
      "Episcopalian/Anglican": "They state they will consent only if the Shechemites become like them by circumcising all their males.",
      "Orthodox": "They stipulate their agreement hinges on one condition: that all males among the Shechemites undergo circumcision, thereby becoming ritually similar to them.",
      "Other": "We will give our consent to you on one condition only: that you become like us by circumcising all your males.",
      "Prefer not to say": "We will give our consent to you on one condition only: that you become like us by circumcising all your males."
    },
    "16": {
      "General": "Then we will give you our daughters and take your daughters for ourselves. We will settle among you and become one people.",
      "Non-Denominational": "Then we will give you our daughters and take your daughters for ourselves. We will settle among you and become one people.",
      "Baptist": "If this condition is met, they promise to proceed with the proposed intermarriage, settle among the Shechemites, and merge into one people.",
      "Catholic": "If the Shechemites fulfill this condition, Jacob's sons promise to engage in the proposed intermarriage ('give our daughters to you, and we will take your daughters to ourselves'), settle among them, and effectively merge into a single people.",
      "Methodist": "If they agree, Jacob's sons promise intermarriage, settlement, and becoming one people.",
      "Lutheran": "If circumcised, then they will give their daughters and take the Shechemites' daughters, dwell with them, and become one people.",
      "Presbyterian": "If the condition is met, they agree to intermarry, live together, and become one people.",
      "Pentecostal": "If they agree, they will intermarry and become one people.",
      "Episcopalian/Anglican": "If this condition is met, they will give their daughters, take Shechemite daughters, settle among them, and become one people.",
      "Orthodox": "Upon fulfillment of this condition, they pledge to proceed with intermarriage, cohabitation, and the unification of their communities.",
      "Other": "Then we will give you our daughters and take your daughters for ourselves. We will settle among you and become one people.",
      "Prefer not to say": "Then we will give you our daughters and take your daughters for ourselves. We will settle among you and become one people."
    },
    "17": {
      "General": "But if you will not agree to be circumcised, we'll take our sister and go.\"",
      "Non-Denominational": "But if you will not agree to be circumcised, we'll take our sister and go.\"",
      "Baptist": "They add a threat: if the Shechemites refuse circumcision, Jacob's family will take Dinah back and leave.",
      "Catholic": "They conclude with an ultimatum: 'But if you will not listen to us and be circumcised, then we will take our daughter [referring to Dinah as Jacob's daughter, hence their sister] and be gone.'",
      "Methodist": "If they refuse circumcision, Jacob's family will take Dinah and leave.",
      "Lutheran": "If the Shechemites refuse circumcision, they will take their daughter/sister and leave.",
      "Presbyterian": "If the Shechemites refuse circumcision, they will take Dinah and depart.",
      "Pentecostal": "If they refuse, they will take Dinah and leave.",
      "Episcopalian/Anglican": "If the Shechemites refuse to be circumcised, they will take Dinah and leave.",
      "Orthodox": "They warn that refusal to undergo circumcision will result in them retrieving Dinah and departing.",
      "Other": "But if you will not agree to be circumcised, we'll take our sister and go.\"",
      "Prefer not to say": "But if you will not agree to be circumcised, we'll take our sister and go.\""
    },
    "18": {
      "General": "Their proposal seemed good to Hamor and his son Shechem.",
      "Non-Denominational": "Their proposal seemed good to Hamor and his son Shechem.",
      "Baptist": "Hamor and Shechem find the terms agreeable.",
      "Catholic": "The proposal presented by Jacob's sons pleases Hamor and Shechem.",
      "Methodist": "Hamor and Shechem find these terms acceptable.",
      "Lutheran": "Their words please Hamor and Shechem.",
      "Presbyterian": "Hamor and Shechem agree to the proposal.",
      "Pentecostal": "Hamor and Shechem like the proposal.",
      "Episcopalian/Anglican": "The proposal seems reasonable to Hamor and Shechem.",
      "Orthodox": "Hamor and Shechem find the proposal agreeable.",
      "Other": "Their proposal seemed good to Hamor and his son Shechem.",
      "Prefer not to say": "Their proposal seemed good to Hamor and his son Shechem."
    },
    "19": {
      "General": "The young man, who was the most honored of all his father's family, lost no time in doing what they said, because he was delighted with Jacob's daughter.",
      "Non-Denominational": "The young man, who was the most honored of all his father's family, lost no time in doing what they said, because he was delighted with Jacob's daughter.",
      "Baptist": "Shechem, described as the most respected man in his father's household, readily agrees and wastes no time in fulfilling the condition, motivated by his delight in Dinah.",
      "Catholic": "Shechem, noted as being the most honored member of his father's house, does not delay in acting upon the agreement, driven by his strong desire ('delighted in') for Dinah.",
      "Methodist": "Shechem, being the most honored in his family and delighted with Dinah, does not delay in fulfilling the condition.",
      "Lutheran": "The young man (Shechem), most honored of his father's house, does not delay, because he delights in Jacob's daughter.",
      "Presbyterian": "Shechem, highly respected in his family and eager because of his desire for Dinah, quickly agrees to the condition.",
      "Pentecostal": "Shechem agrees quickly because he desired Dinah.",
      "Episcopalian/Anglican": "Shechem, the most honored in his father's house, does not hesitate to do as requested because he is delighted with Dinah.",
      "Orthodox": "Shechem, esteemed within his family and motivated by his affection for Dinah, promptly agrees to the condition without delay.",
      "Other": "The young man, who was the most honored of all his father's family, lost no time in doing what they said, because he was delighted with Jacob's daughter.",
      "Prefer not to say": "The young man, who was the most honored of all his father's family, lost no time in doing what they said, because he was delighted with Jacob's daughter."
    },
    "20": {
      "General": "So Hamor and his son Shechem went to the gate of their city to speak to the men of their city.",
      "Non-Denominational": "So Hamor and his son Shechem went to the gate of their city to speak to the men of their city.",
      "Baptist": "Hamor and Shechem go to the city gate, the public meeting place, to persuade the other men of their city to accept the agreement.",
      "Catholic": "Hamor and Shechem go to the gate of their city, the customary place for public assembly and civic decisions, to address the men of their city.",
      "Methodist": "Hamor and Shechem go to the city gate to address the men of their city.",
      "Lutheran": "Hamor and Shechem go to the city gate and speak to the men of their city.",
      "Presbyterian": "Hamor and Shechem go to the city gate to present the proposal to the men of their city.",
      "Pentecostal": "Hamor and Shechem go to the city gate to talk to the men.",
      "Episcopalian/Anglican": "Hamor and Shechem go to the city gate to speak to the men of their city.",
      "Orthodox": "Hamor and Shechem proceed to the city gate, the traditional venue for public discourse, to consult with the men of their city.",
      "Other": "So Hamor and his son Shechem went to the gate of their city to speak to the men of their city.",
      "Prefer not to say": "So Hamor and his son Shechem went to the gate of their city to speak to the men of their city."
    },
    "21": {
      "General": "\"These men are friendly toward us,\" they said. \"Let them live in our land and trade in it; the land has plenty of room for them. We can marry their daughters and they can marry ours.",
      "Non-Denominational": "\"These men are friendly toward us,\" they said. \"Let them live in our land and trade in it; the land has plenty of room for them. We can marry their daughters and they can marry ours.",
      "Baptist": "They present Jacob's family ('these men') as peaceable and propose allowing them to dwell and trade in the land, highlighting its ample size. They reiterate the benefit of intermarriage.",
      "Catholic": "They advocate for the agreement, describing Jacob's family ('these men') as peaceable ('shalem' - at peace) towards them. They propose allowing them to dwell and trade in the land, noting its large size, and restate the proposal for mutual intermarriage.",
      "Methodist": "They portray Jacob's family as peaceable and argue for letting them live and trade, noting the land is spacious and promoting the idea of intermarriage.",
      "Lutheran": "They tell the men that Jacob's family is peaceable, suggest letting them dwell and trade in the spacious land, and propose mutual intermarriage.",
      "Presbyterian": "They persuade the men by describing Jacob's family as peaceful, emphasizing the benefits of allowing them to live and trade in their spacious land and the potential for intermarriage.",
      "Pentecostal": "They say Jacob's family is peaceful, suggest letting them live and trade, and propose intermarriage.",
      "Episcopalian/Anglican": "They describe Jacob's family as friendly, suggesting they be allowed to live and trade in the land, which has ample room, and proposing intermarriage.",
      "Orthodox": "They characterize Jacob's family as peaceful, recommend allowing them to reside and trade in their ample land, and reiterate the proposal for intermarriage.",
      "Other": "\"These men are friendly toward us,\" they said. \"Let them live in our land and trade in it; the land has plenty of room for them. We can marry their daughters and they can marry ours.",
      "Prefer not to say": "\"These men are friendly toward us,\" they said. \"Let them live in our land and trade in it; the land has plenty of room for them. We can marry their daughters and they can marry ours."
    },
    "22": {
      "General": "But the men will consent to live with us as one people only on the condition that our males be circumcised, as they themselves are.",
      "Non-Denominational": "But the men will consent to live with us as one people only on the condition that our males be circumcised, as they themselves are.",
      "Baptist": "They reveal the condition: Jacob's family will only agree to dwell with them and become one people if all Shechemite males are circumcised, just as they are.",
      "Catholic": "They explain the condition set by Jacob's sons: agreement to dwell together as one people is contingent upon all their males being circumcised, mirroring the practice of Jacob's family.",
      "Methodist": "They explain the condition: Jacob's family will only agree if all Shechemite males are circumcised like them.",
      "Lutheran": "They explain the condition: Jacob's family will only consent to dwell and be one people if every male among the Shechemites is circumcised, just as they are.",
      "Presbyterian": "They reveal the condition: all Shechemite males must be circumcised for Jacob's family to agree to live among them as one people.",
      "Pentecostal": "They explain the condition is that all their males must be circumcised.",
      "Episcopalian/Anglican": "They reveal the condition: Jacob's family will only agree to live among them as one people if all Shechemite males are circumcised, as they are.",
      "Orthodox": "They disclose the prerequisite: the consent of Jacob's family to cohabitate as one people is conditional upon the circumcision of all Shechemite males.",
      "Other": "But the men will consent to live with us as one people only on the condition that our males be circumcised, as they themselves are.",
      "Prefer not to say": "But the men will consent to live with us as one people only on the condition that our males be circumcised, as they themselves are."
    },
    "23": {
      "General": "Won't their livestock, their property and all their other animals become ours? So let us give our consent to them, and they will settle among us.\"",
      "Non-Denominational": "Won't their livestock, their property and all their other animals become ours? So let us give our consent to them, and they will settle among us.\"",
      "Baptist": "Hamor and Shechem add a materialistic incentive: by agreeing and integrating Jacob's family, the Shechemites stand to eventually acquire their substantial wealth (livestock, property, animals). They urge consent based on this potential gain.",
      "Catholic": "Hamor and Shechem appeal to the self-interest of the city's men, arguing that by agreeing to the condition and allowing Jacob's family to settle, their considerable wealth ('livestock', 'property', 'animals') will eventually become the Shechemites'. They urge agreement on this pragmatic basis.",
      "Methodist": "They appeal to the men's self-interest, arguing that agreeing will eventually lead to acquiring Jacob's family's wealth (livestock, property).",
      "Lutheran": "They argue that agreeing will result in the Shechemites acquiring Jacob's family's livestock, property, and animals. They urge consent to facilitate settlement.",
      "Presbyterian": "They appeal to the men's greed, suggesting that by agreeing, the Shechemites will eventually gain control of Jacob's family's wealth.",
      "Pentecostal": "They argue the Shechemites will gain their wealth if they agree.",
      "Episcopalian/Anglican": "They add a material incentive: won't Jacob's family's livestock, property, and animals become theirs? They urge consent so Jacob's family will settle.",
      "Orthodox": "Hamor and Shechem present a materialistic argument, suggesting that assimilation will ultimately lead to the Shechemites acquiring the wealth (livestock, property, etc.) of Jacob's family, urging consent based on this prospect.",
      "Other": "Won't their livestock, their property and all their other animals become ours? So let us give our consent to them, and they will settle among us.\"",
      "Prefer not to say": "Won't their livestock, their property and all their other animals become ours? So let us give our consent to them, and they will settle among us.\""
    },
    "24": {
      "General": "All the men who went out of the city gate agreed with Hamor and his son Shechem, and every male in the city was circumcised.",
      "Non-Denominational": "All the men who went out of the city gate agreed with Hamor and his son Shechem, and every male in the city was circumcised.",
      "Baptist": "Persuaded by Hamor and Shechem (perhaps especially by the prospect of wealth), all the men eligible for public assembly ('all who went out of the gate of his city') agree, and every male in the city undergoes circumcision.",
      "Catholic": "Convinced by Hamor and Shechem's arguments (likely the economic incentive), all the men who participate in civic life ('all who went out of the gate of his city') agree to the terms. Consequently, every male in the city is circumcised.",
      "Methodist": "All the men present at the city gate agree with Hamor and Shechem, and every male in the city is circumcised.",
      "Lutheran": "All who went out of the city gate listen to Hamor and Shechem, and every male is circumcised.",
      "Presbyterian": "The men of the city agree with Hamor and Shechem, and all males in the city are circumcised.",
      "Pentecostal": "All the men agree, and every male is circumcised.",
      "Episcopalian/Anglican": "All the men at the city gate agree with Hamor and Shechem, and every male in the city is circumcised.",
      "Orthodox": "The men of the city assent to the proposal of Hamor and Shechem, and consequently, every male within the city undergoes circumcision.",
      "Other": "All the men who went out of the city gate agreed with Hamor and his son Shechem, and every male in the city was circumcised.",
      "Prefer not to say": "All the men who went out of the city gate agreed with Hamor and his son Shechem, and every male in the city was circumcised."
    },
    "25": {
      "General": "Three days later, while all of them were still in pain, two of Jacob's sons, Simeon and Levi, Dinah's brothers, took their swords and attacked the unsuspecting city, killing every male.",
      "Non-Denominational": "Three days later, while all of them were still in pain, two of Jacob's sons, Simeon and Levi, Dinah's brothers, took their swords and attacked the unsuspecting city, killing every male.",
      "Baptist": "On the third day after the circumcision, when the men were typically in the most pain and vulnerable, two of Jacob's sons, Simeon and Levi (Dinah's full brothers by Leah), take their swords, enter the city which felt secure ('boldly'), and massacre every male resident.",
      "Catholic": "On the third day following the circumcision, when the men were most likely suffering significant pain and were incapacitated, two of Jacob's sons, Simeon and Levi (Dinah's full brothers), each take their sword, enter the city unchallenged ('confidently' or 'unsuspecting'), and kill every male.",
      "Methodist": "On the third day, when the men were recovering and in pain, Simeon and Levi (Dinah's full brothers) take swords, attack the unsuspecting city, and kill all the males.",
      "Lutheran": "On the third day, when the men are sore, two of Jacob's sons, Simeon and Levi, Dinah's brothers, take their swords, come against the city while it feels secure, and kill every male.",
      "Presbyterian": "Three days later, while the Shechemite men are recovering and vulnerable from the circumcision, Simeon and Levi (Dinah's brothers) take swords, attack the city, and kill every male.",
      "Pentecostal": "Three days later, while the men were in pain, Simeon and Levi attack the city and kill all males.",
      "Episcopalian/Anglican": "Three days later, while the Shechemite men were still in pain, Simeon and Levi, Dinah's brothers, take their swords, attack the unsuspecting city, and kill every male.",
      "Orthodox": "On the third day, while the men of Shechem are incapacitated due to the circumcision, two of Jacob's sons, Simeon and Levi (Dinah's full brothers), arm themselves, infiltrate the unsuspecting city, and slaughter all the males.",
      "Other": "Three days later, while all of them were still in pain, two of Jacob's sons, Simeon and Levi, Dinah's brothers, took their swords and attacked the unsuspecting city, killing every male.",
      "Prefer not to say": "Three days later, while all of them were still in pain, two of Jacob's sons, Simeon and Levi, Dinah's brothers, took their swords and attacked the unsuspecting city, killing every male."
    },
    "26": {
      "General": "They put Hamor and his son Shechem to the sword and took Dinah from Shechem's house and left.",
      "Non-Denominational": "They put Hamor and his son Shechem to the sword and took Dinah from Shechem's house and left.",
      "Baptist": "Specifically, they kill Hamor and his son Shechem with the sword, retrieve Dinah from Shechem's house where she was presumably staying, and depart.",
      "Catholic": "They execute Hamor and his son Shechem with the sword. They then take Dinah from Shechem's house and leave.",
      "Methodist": "They kill Hamor and Shechem, take Dinah from Shechem's house, and leave.",
      "Lutheran": "They kill Hamor and his son Shechem with the sword, take Dinah out of Shechem's house, and leave.",
      "Presbyterian": "They kill Hamor and Shechem, rescue Dinah from Shechem's house, and leave.",
      "Pentecostal": "They kill Hamor and Shechem and take Dinah.",
      "Episcopalian/Anglican": "They kill Hamor and Shechem with the sword, take Dinah from Shechem's house, and leave.",
      "Orthodox": "They execute both Hamor and Shechem by the sword, retrieve Dinah from Shechem's residence, and depart.",
      "Other": "They put Hamor and his son Shechem to the sword and took Dinah from Shechem's house and left.",
      "Prefer not to say": "They put Hamor and his son Shechem to the sword and took Dinah from Shechem's house and left."
    },
    "27": {
      "General": "The sons of Jacob came upon the dead bodies and looted the city where their sister had been defiled.",
      "Non-Denominational": "The sons of Jacob came upon the dead bodies and looted the city where their sister had been defiled.",
      "Baptist": "The other sons of Jacob arrive after the massacre, find the slain bodies, and proceed to plunder the city, justifying it because their sister had been defiled there.",
      "Catholic": "The (other) sons of Jacob come upon the slain and plunder the city, the place where their sister had been defiled.",
      "Methodist": "The other sons of Jacob come upon the slain and plunder the city because their sister had been defiled there.",
      "Lutheran": "The sons of Jacob come upon the slain and plunder the city, because they had defiled their sister.",
      "Presbyterian": "The other sons of Jacob arrive, find the dead, and plunder the city in retaliation for Dinah's defilement.",
      "Pentecostal": "The other sons of Jacob plunder the city.",
      "Episcopalian/Anglican": "The other sons of Jacob come upon the slain and loot the city where their sister had been defiled.",
      "Orthodox": "Following the slaughter, the (other) sons of Jacob enter the city, encounter the dead, and proceed to plunder it, citing the defilement of their sister as justification.",
      "Other": "The sons of Jacob came upon the dead bodies and looted the city where their sister had been defiled.",
      "Prefer not to say": "The sons of Jacob came upon the dead bodies and looted the city where their sister had been defiled."
    },
    "28": {
      "General": "They seized their flocks and herds and donkeys and everything else of theirs in the city and out in the fields.",
      "Non-Denominational": "They seized their flocks and herds and donkeys and everything else of theirs in the city and out in the fields.",
      "Baptist": "The plunder includes the Shechemites' flocks, herds, donkeys, and all other possessions, both within the city and in the surrounding fields.",
      "Catholic": "Their plundering is extensive, encompassing flocks, herds, donkeys, and all possessions found both within the city and in the adjacent fields.",
      "Methodist": "They take the Shechemites' flocks, herds, donkeys, and everything else in the city and fields.",
      "Lutheran": "They seize their flocks, herds, donkeys, and whatever is in the city and field.",
      "Presbyterian": "They seize all the livestock (flocks, herds, donkeys) and possessions of the Shechemites, both in the city and the fields.",
      "Pentecostal": "They take all their animals and possessions.",
      "Episcopalian/Anglican": "They seize their flocks, herds, donkeys, and all their possessions in the city and the fields.",
      "Orthodox": "The spoils include their flocks, herds, donkeys, and all other property located both within the city and in the surrounding countryside.",
      "Other": "They seized their flocks and herds and donkeys and everything else of theirs in the city and out in the fields.",
      "Prefer not to say": "They seized their flocks and herds and donkeys and everything else of theirs in the city and out in the fields."
    },
    "29": {
      "General": "They carried off all their wealth and all their women and children, taking as plunder everything in the houses.",
      "Non-Denominational": "They carried off all their wealth and all their women and children, taking as plunder everything in the houses.",
      "Baptist": "They carry off all the wealth, capture the women and children, and take everything found within the houses as plunder.",
      "Catholic": "They capture all the wealth of the city, take the women and children captive, and seize everything found within the houses as spoils.",
      "Methodist": "They carry off all wealth, capture the women and children, and plunder everything in the houses.",
      "Lutheran": "They capture all their wealth, their little ones, and their wives, and plunder everything in the houses.",
      "Presbyterian": "They take all the wealth, capture the women and children, and loot everything from the houses.",
      "Pentecostal": "They capture the wealth, women, and children.",
      "Episcopalian/Anglican": "They carry off all their wealth, capture their women and children, and take as plunder everything in the houses.",
      "Orthodox": "They seize all the accumulated wealth, capture the women and children, and loot all possessions found within the houses.",
      "Other": "They carried off all their wealth and all their women and children, taking as plunder everything in the houses.",
      "Prefer not to say": "They carried off all their wealth and all their women and children, taking as plunder everything in the houses."
    },
    "30": {
      "General": "Then Jacob said to Simeon and Levi, \"You have brought trouble on me by making me obnoxious to the Canaanites and Perizzites, the people living in this land. We are few in number, and if they join forces against me and attack me, I and my household will be destroyed.\"",
      "Non-Denominational": "Then Jacob said to Simeon and Levi, \"You have brought trouble on me by making me obnoxious to the Canaanites and Perizzites, the people living in this land. We are few in number, and if they join forces against me and attack me, I and my household will be destroyed.\"",
      "Baptist": "Jacob rebukes Simeon and Levi for their actions, accusing them of bringing trouble ('achar' - stirring up trouble, making odious) upon him. He fears their actions have made him hated by the neighboring Canaanites and Perizzites. Being few in number, he worries they will unite against him, leading to the destruction of his entire household.",
      "Catholic": "Jacob confronts Simeon and Levi, reprimanding them: 'You have brought trouble on me by making me odious (stinking) to the inhabitants of the land, the Canaanites and the Perizzites.' He expresses fear that because his family is small ('few in number'), the local inhabitants will unite against them in retaliation, resulting in the annihilation of him and his household.",
      "Methodist": "Jacob rebukes Simeon and Levi, saying they have brought trouble by making him stink (odious) to the local inhabitants (Canaanites, Perizzites). He fears retaliation due to their small numbers, leading to destruction.",
      "Lutheran": "Jacob tells Simeon and Levi they have brought trouble on him by making him stink among the inhabitants of the land (Canaanites, Perizzites). Since they are few, he fears the inhabitants will gather and attack, destroying him and his household.",
      "Presbyterian": "Jacob rebukes Simeon and Levi, fearing their violent actions have endangered the entire family by making them odious to the neighboring Canaanites and Perizzites, who might unite and destroy them due to their small numbers.",
      "Pentecostal": "Jacob rebukes Simeon and Levi, saying they caused trouble and made him hated, fearing destruction due to their small numbers.",
      "Episcopalian/Anglican": "Jacob confronts Simeon and Levi, telling them they have brought trouble on him by making him offensive to the Canaanites and Perizzites. He fears that since they are few, these peoples will unite against him and destroy his household.",
      "Orthodox": "Jacob reprimands Simeon and Levi, stating they have caused immense trouble by making his family abhorrent to the local inhabitants (Canaanites and Perizzites). He expresses concern that their small numbers make them vulnerable to a retaliatory attack that could annihilate his entire household.",
      "Other": "Then Jacob said to Simeon and Levi, \"You have brought trouble on me by making me obnoxious to the Canaanites and Perizzites, the people living in this land. We are few in number, and if they join forces against me and attack me, I and my household will be destroyed.\"",
      "Prefer not to say": "Then Jacob said to Simeon and Levi, \"You have brought trouble on me by making me obnoxious to the Canaanites and Perizzites, the people living in this land. We are few in number, and if they join forces against me and attack me, I and my household will be destroyed.\""
    },
    "31": {
      "General": "But they replied, \"Should he have treated our sister like a prostitute?\"",
      "Non-Denominational": "But they replied, \"Should he have treated our sister like a prostitute?\"",
      "Baptist": "Simeon and Levi defend their actions with a rhetorical question, arguing that Shechem should not have treated their sister as if she were a prostitute, implying the severity of the offense justified their extreme reaction.",
      "Catholic": "Simeon and Levi retort defensively with a rhetorical question: 'Should he treat our sister like a harlot?' They justify their violent retribution by emphasizing the dishonor done to Dinah, equating Shechem's actions (violation followed by a marriage proposal attempting to legitimize it) with treating her as a common prostitute.",
      "Methodist": "Simeon and Levi justify their actions with a rhetorical question: Should Shechem have treated their sister like a prostitute?",
      "Lutheran": "They reply, 'Should he treat our sister like a prostitute?'",
      "Presbyterian": "Simeon and Levi defend their actions, asking rhetorically if Shechem should have been allowed to treat their sister like a prostitute.",
      "Pentecostal": "They reply, defending their actions by asking if Dinah should be treated like a prostitute.",
      "Episcopalian/Anglican": "Simeon and Levi retort, 'Should he treat our sister like a prostitute?'",
      "Orthodox": "Simeon and Levi justify their actions with a rhetorical question, asking if it was acceptable for Shechem to treat their sister as a prostitute.",
      "Other": "But they replied, \"Should he have treated our sister like a prostitute?\"",
      "Prefer not to say": "But they replied, \"Should he have treated our sister like a prostitute?\""
    }
  }
} 