{
  "_comment": "Interpretations for Genesis Chapter 35",
  "book": "Genesis",
  "chapter": "35",
  "verses": {
  "1": {
      "General": "Then God said to Jacob, \"Go up to Bethel and settle there, and build an altar there to God, who appeared to you when you were fleeing from your brother Esau.\"",
      "Non-Denominational": "Then God said to Jacob, \"Go up to Bethel and settle there, and build an altar there to God, who appeared to you when you were fleeing from your brother Esau.\"",
      "Baptist": "Following the traumatic events at Shechem, God commands Jacob to relocate to Bethel. He is instructed to dwell there and build an altar to the God who appeared to him years earlier when he fled from Esau (recalling the vow Jacob made at Bethel in Genesis 28).",
      "Catholic": "God directs Jacob to move from the vicinity of Shechem and ascend to Bethel. There, he is to settle and erect an altar dedicated to God, specifically recalling the divine appearance to Jacob at that location when he was fleeing from his brother Esau (cf. Genesis 28:10-22).",
      "Methodist": "God commands Jacob to leave Shechem, go up to Bethel, settle there, and build an altar. This recalls God's earlier appearance to Jacob at Bethel when he fled from Esau.",
      "Lutheran": "God tells Jacob to arise, go up to Bethel, dwell there, and make an altar to the God who appeared to him when he fled from Esau.",
      "Presbyterian": "God instructs Jacob to move to Bethel, settle there, and build an altar, reminding him of God's previous appearance at that place during his flight from Esau.",
      "Pentecostal": "God tells Jacob to go to Bethel, live there, and build an altar to God who appeared to him when fleeing Esau.",
      "Episcopalian/Anglican": "God commands Jacob to go up to Bethel, settle there, and build an altar to the God who appeared to him during his flight from Esau.",
      "Orthodox": "God instructs Jacob to proceed to Bethel, establish residence there, and construct an altar to the God who manifested Himself to Jacob during his flight from Esau.",
      "Other": "Then God said to Jacob, \"Go up to Bethel and settle there, and build an altar there to God, who appeared to you when you were fleeing from your brother Esau.\"",
      "Prefer not to say": "Then God said to Jacob, \"Go up to Bethel and settle there, and build an altar there to God, who appeared to you when you were fleeing from your brother Esau.\""
  },
  "2": {
      "General": "So Jacob said to his household and to all who were with him, \"Get rid of the foreign gods you have with you, and purify yourselves and change your clothes.",
      "Non-Denominational": "So Jacob said to his household and to all who were with him, \"Get rid of the foreign gods you have with you, and purify yourselves and change your clothes.",
      "Baptist": "In preparation for this move and encounter with God at Bethel, Jacob instructs his entire household (including servants and potentially captives from Shechem) to put away any foreign gods (idols) they possess, purify themselves ritually, and change their garments.",
      "Catholic": "Responding to God's command, Jacob instructs his household and all accompanying him to prepare for worship at Bethel. This preparation involves three steps: removing all foreign gods (idols, possibly including Laban's teraphim stolen by Rachel and items plundered from Shechem), undergoing ritual purification, and changing their clothes.",
      "Methodist": "Jacob commands his household and companions to prepare for Bethel by putting away foreign gods, purifying themselves, and changing clothes.",
      "Lutheran": "Jacob tells his household and all with him to put away foreign gods, purify themselves, and change their garments.",
      "Presbyterian": "Jacob instructs his household to prepare for the journey to Bethel by removing foreign idols, purifying themselves, and changing their clothes.",
      "Pentecostal": "Jacob tells his household to get rid of foreign gods, purify themselves, and change clothes.",
      "Episcopalian/Anglican": "Jacob instructs his household and all with him to get rid of their foreign gods, purify themselves, and change their clothes in preparation.",
      "Orthodox": "Jacob directs his household and all associated members to eliminate any foreign deities (idols) in their possession, undergo ritual purification, and change their attire in preparation for approaching Bethel.",
      "Other": "So Jacob said to his household and to all who were with him, \"Get rid of the foreign gods you have with you, and purify yourselves and change your clothes.",
      "Prefer not to say": "So Jacob said to his household and to all who were with him, \"Get rid of the foreign gods you have with you, and purify yourselves and change your clothes."
  },
  "3": {
      "General": "Then come, let us go up to Bethel, where I will build an altar to God, who answered me in the day of my distress and who has been with me wherever I have gone.\"",
      "Non-Denominational": "Then come, let us go up to Bethel, where I will build an altar to God, who answered me in the day of my distress and who has been with me wherever I have gone.\"",
      "Baptist": "He announces their destination, Bethel, and his intention to build an altar there, acknowledging God's faithfulness in answering him during his past distress and being with him throughout his journeys.",
      "Catholic": "Jacob declares their intention to go up to Bethel to build an altar. He explicitly acknowledges God's past faithfulness: God answered him during his time of distress (likely referring to his flight from Esau and perhaps other trials) and has consistently been with him throughout his journey.",
      "Methodist": "Jacob declares their plan to go to Bethel to build an altar, acknowledging God who answered him in distress and has been with him.",
      "Lutheran": "He calls them to arise and go to Bethel to make an altar to God, who answered him in his distress and has been with him on his journey.",
      "Presbyterian": "Jacob reaffirms their purpose: to go to Bethel and build an altar to God, acknowledging His help during past troubles and His constant presence.",
      "Pentecostal": "Jacob says they will go to Bethel to build an altar to God who answered him in distress and was with him.",
      "Episcopalian/Anglican": "Jacob calls them to go up to Bethel to build an altar to God, acknowledging His help in times of distress and His presence throughout Jacob's journey.",
      "Orthodox": "Jacob confirms their objective is to ascend to Bethel and erect an altar to God, recognizing God's responsiveness during his past adversity and His constant companionship throughout his travels.",
      "Other": "Then come, let us go up to Bethel, where I will build an altar to God, who answered me in the day of my distress and who has been with me wherever I have gone.\"",
      "Prefer not to say": "Then come, let us go up to Bethel, where I will build an altar to God, who answered me in the day of my distress and who has been with me wherever I have gone.\""
  },
  "4": {
      "General": "So they gave Jacob all the foreign gods they had and the rings in their ears, and Jacob buried them under the oak at Shechem.",
      "Non-Denominational": "So they gave Jacob all the foreign gods they had and the rings in their ears, and Jacob buried them under the oak at Shechem.",
      "Baptist": "The household obeys, giving Jacob all their foreign gods and the earrings they wore (earrings were sometimes associated with pagan amulets or worship). Jacob takes these items and buries them under a significant oak tree near Shechem, disposing of them definitively.",
      "Catholic": "The members of Jacob's household comply, handing over all their foreign gods and their earrings (which may have had pagan or superstitious significance). Jacob takes these objects and buries them under the terebinth (oak) tree near Shechem, signifying a decisive break from idolatry.",
      "Methodist": "They obey, giving Jacob their foreign gods and earrings (possibly pagan amulets). Jacob buries these items under the oak tree near Shechem.",
      "Lutheran": "They give Jacob all the foreign gods and the rings in their ears. Jacob hides them under the terebinth tree near Shechem.",
      "Presbyterian": "The household complies, giving Jacob their idols and earrings (potentially linked to pagan practices). Jacob buries them under the oak tree at Shechem.",
      "Pentecostal": "They give Jacob the foreign gods and earrings; Jacob buries them under an oak near Shechem.",
      "Episcopalian/Anglican": "The household gives Jacob their foreign gods and earrings (possibly associated with paganism). Jacob buries them under the oak tree at Shechem.",
      "Orthodox": "His household complies, surrendering all foreign deities and their earrings (potentially associated with idolatrous practices). Jacob buries these items beneath the terebinth tree near Shechem.",
      "Other": "So they gave Jacob all the foreign gods they had and the rings in their ears, and Jacob buried them under the oak at Shechem.",
      "Prefer not to say": "So they gave Jacob all the foreign gods they had and the rings in their ears, and Jacob buried them under the oak at Shechem."
  },
  "5": {
      "General": "Then they set out, and the terror of God fell on the towns all around them so that no one pursued them.",
      "Non-Denominational": "Then they set out, and the terror of God fell on the towns all around them so that no one pursued them.",
      "Baptist": "As Jacob's family journeys towards Bethel, a supernatural dread ('terror of God') falls upon the surrounding Canaanite cities. This divine intervention prevents the local inhabitants from pursuing Jacob's family in retaliation for the massacre at Shechem.",
      "Catholic": "As Jacob and his company journey onward, a 'terror of God' (a divinely induced fear or panic) overcomes the surrounding cities. This supernatural dread prevents the neighboring peoples from pursuing Jacob's family, despite the provocation of the Shechem massacre.",
      "Methodist": "As they travel, a 'terror of God' falls on the surrounding towns, preventing pursuit or retaliation for the events at Shechem.",
      "Lutheran": "As they journey, a terror from God falls upon the cities around them, so that they do not pursue the sons of Jacob.",
      "Presbyterian": "During their journey, a divinely inspired fear ('terror of God') prevents the neighboring towns from pursuing Jacob's family in revenge.",
      "Pentecostal": "As they travel, a terror from God stops the nearby cities from pursuing them.",
      "Episcopalian/Anglican": "As they set out, a 'terror of God' falls upon the surrounding towns, preventing anyone from pursuing Jacob's family.",
      "Orthodox": "During their journey, a divinely instilled dread ('terror of God') grips the neighboring cities, deterring them from pursuing Jacob's party.",
      "Other": "Then they set out, and the terror of God fell on the towns all around them so that no one pursued them.",
      "Prefer not to say": "Then they set out, and the terror of God fell on the towns all around them so that no one pursued them."
  },
  "6": {
      "General": "Jacob and all the people with him came to Luz (that is, Bethel) in the land of Canaan.",
      "Non-Denominational": "Jacob and all the people with him came to Luz (that is, Bethel) in the land of Canaan.",
      "Baptist": "Jacob and his entire company arrive safely at Luz, which the text explicitly identifies with Bethel, located in the land of Canaan.",
      "Catholic": "Jacob and his entire entourage arrive at Luz in the land of Canaan, which the narrator clarifies is the place also known as Bethel.",
      "Methodist": "Jacob and his company arrive at Luz in Canaan, identified as Bethel.",
      "Lutheran": "Jacob and all the people with him come to Luz (that is, Bethel) in the land of Canaan.",
      "Presbyterian": "Jacob and his group arrive safely at Luz (Bethel) in Canaan.",
      "Pentecostal": "Jacob and his people arrive at Luz (Bethel) in Canaan.",
      "Episcopalian/Anglican": "Jacob and all the people with him arrive at Luz (identified as Bethel) in the land of Canaan.",
      "Orthodox": "Jacob and his companions reach Luz, identified as Bethel, within the land of Canaan.",
      "Other": "Jacob and all the people with him came to Luz (that is, Bethel) in the land of Canaan.",
      "Prefer not to say": "Jacob and all the people with him came to Luz (that is, Bethel) in the land of Canaan."
  },
  "7": {
      "General": "There he built an altar, and he called the place El Bethel, because it was there that God revealed himself to him when he was fleeing from his brother.",
      "Non-Denominational": "There he built an altar, and he called the place El Bethel, because it was there that God revealed himself to him when he was fleeing from his brother.",
      "Baptist": "At Bethel, Jacob fulfills God's command by building an altar. He names the site El-Bethel ('God of Bethel'), commemorating the place where God had revealed Himself to him during his flight from Esau.",
      "Catholic": "At Bethel, Jacob builds the commanded altar and names the site El-Bethel ('The God of the House of God'). The name memorializes the fact that God had revealed Himself to Jacob at this very location during his earlier flight from Esau.",
      "Methodist": "Jacob builds an altar at Bethel and calls the place El Bethel ('God of Bethel'), remembering God's revelation there when he fled Esau.",
      "Lutheran": "He builds an altar there and calls the place El-Bethel ('God of Bethel'), because there God had revealed himself to him when he fled from his brother.",
      "Presbyterian": "Jacob builds an altar at Bethel and names the place El-Bethel ('God of Bethel') in remembrance of God's revelation to him there years before.",
      "Pentecostal": "Jacob builds an altar and calls the place El Bethel because God revealed Himself there.",
      "Episcopalian/Anglican": "Jacob builds an altar at Bethel and names the place El-Bethel ('God of Bethel'), because God had revealed Himself to him there when fleeing Esau.",
      "Orthodox": "There, Jacob constructs an altar and designates the location El-Bethel ('God of the House of God'), commemorating the divine self-revelation he experienced at that site during his flight from Esau.",
      "Other": "There he built an altar, and he called the place El Bethel, because it was there that God revealed himself to him when he was fleeing from his brother.",
      "Prefer not to say": "There he built an altar, and he called the place El Bethel, because it was there that God revealed himself to him when he was fleeing from his brother."
  },
  "8": {
      "General": "Now Deborah, Rebekah's nurse, died and was buried under the oak outside Bethel. So it was named Allon Bakuth.",
      "Non-Denominational": "Now Deborah, Rebekah's nurse, died and was buried under the oak outside Bethel. So it was named Allon Bakuth.",
      "Baptist": "An incidental note records the death of Deborah, who had been Rebekah's nurse and likely joined Jacob's household later. She dies at Bethel and is buried beneath an oak tree, which is subsequently named Allon-bacuth ('Oak of Weeping'), indicating the sorrow felt at her passing.",
      "Catholic": "The narrative briefly mentions the death of Deborah, Rebekah's nurse (who apparently joined Jacob's household at some point, perhaps when he left Laban). She dies and is buried below Bethel under an oak tree. This tree is consequently named Allon-bacuth, meaning 'Oak of Weeping,' signifying the mourning associated with her death.",
      "Methodist": "A brief note mentions the death and burial of Deborah, Rebekah's nurse, under an oak near Bethel. The place is named Allon Bakuth ('Oak of Weeping').",
      "Lutheran": "Deborah, Rebekah's nurse, dies and is buried below Bethel under the oak; its name is called Allon-bacuth ('Oak of Weeping').",
      "Presbyterian": "The text notes the death of Deborah, Rebekah's nurse, who is buried under an oak near Bethel, named Allon-bacuth ('Oak of Weeping') in her memory.",
      "Pentecostal": "Deborah, Rebekah's nurse, dies and is buried under an oak near Bethel called Allon Bakuth ('Oak of Weeping').",
      "Episcopalian/Anglican": "Deborah, Rebekah's nurse, dies and is buried under the oak below Bethel, which is named Allon-bacuth ('Oak of Weeping').",
      "Orthodox": "A parenthetical note records the death of Deborah, Rebekah's nurse. She is buried beneath an oak tree near Bethel, which subsequently becomes known as Allon-bacuth ('Oak of Weeping').",
      "Other": "Now Deborah, Rebekah's nurse, died and was buried under the oak outside Bethel. So it was named Allon Bakuth.",
      "Prefer not to say": "Now Deborah, Rebekah's nurse, died and was buried under the oak outside Bethel. So it was named Allon Bakuth."
  },
  "9": {
      "General": "After Jacob returned from Paddan Aram, God appeared to him again and blessed him.",
      "Non-Denominational": "After Jacob returned from Paddan Aram, God appeared to him again and blessed him.",
      "Baptist": "God appears to Jacob once more at Bethel after his return from Paddan-aram (Mesopotamia) and bestows a blessing upon him.",
      "Catholic": "God appears again to Jacob at Bethel, following his return from Paddan-aram, and blesses him.",
      "Methodist": "God appears again to Jacob at Bethel after his return from Paddan Aram and blesses him.",
      "Lutheran": "God appears to Jacob again, when he comes from Paddan-aram, and blesses him.",
      "Presbyterian": "God appears again to Jacob at Bethel upon his return from Paddan Aram and blesses him.",
      "Pentecostal": "God appears again to Jacob after he returns from Paddan Aram and blesses him.",
      "Episcopalian/Anglican": "God appears to Jacob again after his return from Paddan-aram and blesses him.",
      "Orthodox": "Following Jacob's return from Paddan-aram, God appears to him once more at Bethel and confers His blessing.",
      "Other": "After Jacob returned from Paddan Aram, God appeared to him again and blessed him.",
      "Prefer not to say": "After Jacob returned from Paddan Aram, God appeared to him again and blessed him."
  },
  "10": {
      "General": "God said to him, \"Your name is Jacob, but you will no longer be called Jacob; your name will be Israel.\" So he named him Israel.",
      "Non-Denominational": "God said to him, \"Your name is Jacob, but you will no longer be called Jacob; your name will be Israel.\" So he named him Israel.",
      "Baptist": "God formally reaffirms the name change previously given at Peniel (Genesis 32:28). He states that Jacob's name will no longer be Jacob, but Israel. The text explicitly confirms, 'So he named him Israel.'",
      "Catholic": "God formally confirms the name change bestowed earlier at Peniel (Genesis 32:28): 'Your name is Jacob; no longer shall your name be called Jacob, but Israel shall be your name.' The narrator adds emphasis: 'So he called his name Israel.'",
      "Methodist": "God reaffirms Jacob's name change: no longer Jacob, but Israel. The text confirms the naming.",
      "Lutheran": "God says his name is Jacob, but he shall no longer be called Jacob, but Israel. So God calls his name Israel.",
      "Presbyterian": "God confirms the change of Jacob's name to Israel, stating it will be his name going forward.",
      "Pentecostal": "God confirms Jacob's name change to Israel.",
      "Episcopalian/Anglican": "God reaffirms the name change: 'Your name is Jacob, but you will no longer be called Jacob; your name will be Israel.' Thus, he named him Israel.",
      "Orthodox": "God formally ratifies the name change previously conferred at Peniel, declaring that Jacob shall henceforth be known as Israel.",
      "Other": "God said to him, \"Your name is Jacob, but you will no longer be called Jacob; your name will be Israel.\" So he named him Israel.",
      "Prefer not to say": "God said to him, \"Your name is Jacob, but you will no longer be called Jacob; your name will be Israel.\" So he named him Israel."
  },
  "11": {
      "General": "And God said to him, \"I am God Almighty; be fruitful and increase in number. A nation and a community of nations will come from you, and kings will be among your descendants.",
      "Non-Denominational": "And God said to him, \"I am God Almighty; be fruitful and increase in number. A nation and a community of nations will come from you, and kings will be among your descendants.",
      "Baptist": "God identifies Himself as 'God Almighty' (El Shaddai) and reiterates the covenant promise given to Abraham and Isaac: Jacob is commanded to be fruitful and multiply. God promises that a nation, and even a company (or assembly) of nations, will descend from him, and kings will come from his line.",
      "Catholic": "Identifying Himself as 'God Almighty' (El Shaddai), God repeats the core patriarchal blessing: 'Be fruitful and multiply.' He then expands the promise, stating that 'a nation and a company of nations shall come from you, and kings shall issue from your loins.' This confirms the covenant promises extending through Jacob.",
      "Methodist": "God reveals Himself as God Almighty (El Shaddai) and repeats the blessing: be fruitful, multiply, a nation and community of nations will come from you, and kings will be among your descendants.",
      "Lutheran": "God identifies himself as God Almighty (El Shaddai) and commands Jacob to be fruitful and multiply. He promises a nation and a company of nations from him, and kings from his descendants.",
      "Presbyterian": "God, identifying Himself as God Almighty (El Shaddai), renews the covenant promise: Jacob will be fruitful, fathering a nation, a community of nations, and kings.",
      "Pentecostal": "God identifies as God Almighty, tells Jacob to be fruitful and multiply, promising a nation, community of nations, and kings from him.",
      "Episcopalian/Anglican": "God identifies Himself as God Almighty (El Shaddai) and blesses Jacob: 'Be fruitful and increase in number. A nation and a community of nations will come from you, and kings will come from your body.'",
      "Orthodox": "God identifies Himself as El Shaddai (God Almighty) and reiterates the covenantal blessing: Jacob is to be fruitful and multiply, giving rise to a nation, a congregation of nations, and future kings.",
      "Other": "And God said to him, \"I am God Almighty; be fruitful and increase in number. A nation and a community of nations will come from you, and kings will be among your descendants.",
      "Prefer not to say": "And God said to him, \"I am God Almighty; be fruitful and increase in number. A nation and a community of nations will come from you, and kings will be among your descendants."
  },
  "12": {
      "General": "The land I gave to Abraham and Isaac I also give to you, and I will give this land to your descendants after you.\"",
      "Non-Denominational": "The land I gave to Abraham and Isaac I also give to you, and I will give this land to your descendants after you.\"",
      "Baptist": "God explicitly confirms the land promise, stating that the land given to Abraham and Isaac is now formally given to Jacob (Israel) and will be passed on to his descendants after him.",
      "Catholic": "God reaffirms the land promise integral to the covenant: 'The land that I gave to Abraham and Isaac I will give to you, and I will give the land to your offspring after you.'",
      "Methodist": "God confirms the land promise: the land given to Abraham and Isaac is given to Jacob and his descendants.",
      "Lutheran": "God promises to give Jacob the land previously given to Abraham and Isaac, and also to his offspring after him.",
      "Presbyterian": "God reaffirms the promise of the land, stating He gives to Jacob the land promised to Abraham and Isaac, and will give it to his descendants.",
      "Pentecostal": "God promises Jacob and his descendants the land given to Abraham and Isaac.",
      "Episcopalian/Anglican": "God confirms the land promise: 'The land I gave to Abraham and Isaac I also give to you, and to your descendants after you I will give the land.'",
      "Orthodox": "God explicitly reaffirms the promise concerning the land, bestowing upon Jacob and his descendants the territory previously promised to Abraham and Isaac.",
      "Other": "The land I gave to Abraham and Isaac I also give to you, and I will give this land to your descendants after you.\"",
      "Prefer not to say": "The land I gave to Abraham and Isaac I also give to you, and I will give this land to your descendants after you.\""
  },
  "13": {
      "General": "Then God went up from him at the place where he had spoken with him.",
      "Non-Denominational": "Then God went up from him at the place where he had spoken with him.",
      "Baptist": "After delivering these promises and blessings, God ascends, departing from Jacob at the location of their encounter.",
      "Catholic": "Following this reaffirmation of the covenant, God ascends from Jacob's presence at the place where He had spoken with him.",
      "Methodist": "God ascends from Jacob's presence after speaking with him.",
      "Lutheran": "God goes up from Jacob in the place where he had spoken with him.",
      "Presbyterian": "God departs from Jacob after speaking with him at Bethel.",
      "Pentecostal": "God departs from Jacob.",
      "Episcopalian/Anglican": "God then ascends from Jacob's presence at the place where He spoke with him.",
      "Orthodox": "Having concluded His discourse, God ascends from the location where He interacted with Jacob.",
      "Other": "Then God went up from him at the place where he had spoken with him.",
      "Prefer not to say": "Then God went up from him at the place where he had spoken with him."
  },
  "14": {
      "General": "Jacob set up a stone pillar at the place where God had spoken with him, and he poured out a drink offering on it; he also poured oil on it.",
      "Non-Denominational": "Jacob set up a stone pillar at the place where God had spoken with him, and he poured out a drink offering on it; he also poured oil on it.",
      "Baptist": "In response to this divine encounter, Jacob erects a stone pillar (matzevah) at the site. He consecrates it by pouring a drink offering (libation) and anointing it with oil, marking it as a sacred spot.",
      "Catholic": "Jacob commemorates this theophany by setting up a stone pillar (matzevah) at the exact spot where God spoke with him. He consecrates the pillar by pouring a drink offering (libation) upon it and anointing it with oil, dedicating it as a sacred memorial.",
      "Methodist": "Jacob sets up a stone pillar where God spoke to him, consecrating it with a drink offering and oil.",
      "Lutheran": "Jacob sets up a pillar of stone in the place where God had spoken with him. He pours a drink offering and oil on it.",
      "Presbyterian": "Jacob erects a stone pillar at the site of God's appearance, consecrating it with a drink offering and oil.",
      "Pentecostal": "Jacob sets up a stone pillar, pours a drink offering and oil on it.",
      "Episcopalian/Anglican": "Jacob sets up a stone pillar at the site, pouring a drink offering and oil on it to consecrate it.",
      "Orthodox": "Jacob erects a stone pillar at the site of the divine encounter and consecrates it by pouring out a libation (drink offering) and anointing it with oil.",
      "Other": "Jacob set up a stone pillar at the place where God had spoken with him, and he poured out a drink offering on it; he also poured oil on it.",
      "Prefer not to say": "Jacob set up a stone pillar at the place where God had spoken with him, and he poured out a drink offering on it; he also poured oil on it."
  },
  "15": {
      "General": "Jacob called the place where God had spoken with him Bethel.",
      "Non-Denominational": "Jacob called the place where God had spoken with him Bethel.",
      "Baptist": "Jacob formally names (or re-names) the place Bethel ('House of God'), solidifying its significance as the location of his divine encounter.",
      "Catholic": "Jacob gives the name Bethel ('House of God') to the place where God had spoken with him, reaffirming the name he gave it originally (Genesis 28:19) and marking its renewed sanctity.",
      "Methodist": "Jacob names the place where God spoke to him Bethel ('House of God').",
      "Lutheran": "Jacob calls the name of the place where God had spoken with him Bethel.",
      "Presbyterian": "Jacob names the site Bethel ('House of God') in commemoration of God speaking to him there.",
      "Pentecostal": "Jacob calls the place Bethel.",
      "Episcopalian/Anglican": "Jacob names the place where God spoke with him Bethel.",
      "Orthodox": "Jacob formally designates the location of this divine communication as Bethel ('House of God').",
      "Other": "Jacob called the place where God had spoken with him Bethel.",
      "Prefer not to say": "Jacob called the place where God had spoken with him Bethel."
  },
  "16": {
      "General": "Then they moved on from Bethel. While they were still some distance from Ephrath, Rachel began to give birth and had great difficulty.",
      "Non-Denominational": "Then they moved on from Bethel. While they were still some distance from Ephrath, Rachel began to give birth and had great difficulty.",
      "Baptist": "Jacob's family resumes their journey southward from Bethel. When they are still some way from Ephrath (later identified with Bethlehem), Rachel goes into labor, and it is a very difficult birth.",
      "Catholic": "The family departs from Bethel. While traveling and still some distance from Ephrath (identified later as Bethlehem), Rachel enters into labor, experiencing severe difficulty.",
      "Methodist": "They journey on from Bethel. While still some distance from Ephrath (Bethlehem), Rachel goes into difficult labor.",
      "Lutheran": "They journey from Bethel. When still some distance from Ephrath, Rachel goes into labor, and it is hard for her.",
      "Presbyterian": "The family travels south from Bethel. Nearing Ephrath (Bethlehem), Rachel goes into difficult labor.",
      "Pentecostal": "They travel from Bethel. Near Ephrath, Rachel has a difficult labor.",
      "Episcopalian/Anglican": "They journey on from Bethel. While some distance from Ephrath, Rachel goes into difficult labor.",
      "Orthodox": "Departing from Bethel, as they approach Ephrath, Rachel commences labor, which proves exceedingly difficult.",
      "Other": "Then they moved on from Bethel. While they were still some distance from Ephrath, Rachel began to give birth and had great difficulty.",
      "Prefer not to say": "Then they moved on from Bethel. While they were still some distance from Ephrath, Rachel began to give birth and had great difficulty."
  },
  "17": {
      "General": "And as she was having great difficulty in childbirth, the midwife said to her, \"Don't despair, for you have another son.\"",
      "Non-Denominational": "And as she was having great difficulty in childbirth, the midwife said to her, \"Don't despair, for you have another son.\"",
      "Baptist": "During the height of her difficult labor, the midwife tries to encourage Rachel by telling her not to be afraid, because she is giving birth to another son (fulfilling Rachel's earlier desire, Genesis 30:24).",
      "Catholic": "Amidst the hardest part of her labor, the midwife attempts to encourage Rachel, saying, 'Do not fear, for you have another son now.' This news, though meant kindly, comes as Rachel is struggling for life.",
      "Methodist": "During the difficult labor, the midwife encourages Rachel, telling her she has another son.",
      "Lutheran": "When her labor is hardest, the midwife tells Rachel not to fear, for she has another son.",
      "Presbyterian": "In the midst of the difficult birth, the midwife encourages Rachel, announcing she has another son.",
      "Pentecostal": "The midwife tells Rachel she has another son.",
      "Episcopalian/Anglican": "During her difficult labor, the midwife encourages Rachel, telling her she has another son.",
      "Orthodox": "During the intense difficulty of childbirth, the midwife attempts to reassure Rachel, informing her that she is bearing another son.",
      "Other": "And as she was having great difficulty in childbirth, the midwife said to her, \"Don't despair, for you have another son.\"",
      "Prefer not to say": "And as she was having great difficulty in childbirth, the midwife said to her, \"Don't despair, for you have another son.\""
  },
  "18": {
      "General": "As she breathed her last—for she was dying—she named her son Ben-Oni. But his father named him Benjamin.",
      "Non-Denominational": "As she breathed her last—for she was dying—she named her son Ben-Oni. But his father named him Benjamin.",
      "Baptist": "As Rachel is dying, with her last breath ('as her soul was departing'), she names the newborn son Ben-oni, meaning 'Son of my sorrow.' However, Jacob (his father) overrides this name and calls him Benjamin, meaning 'Son of the right hand' (often implying strength, favor, or fortune).",
      "Catholic": "As Rachel's life ebbs away ('as her soul was departing'), she names her son Ben-oni, meaning 'Son of my sorrow' or 'Son of my distress.' Jacob, however, renames him Benjamin, meaning 'Son of the right hand,' a name signifying strength, good fortune, or perhaps 'Son of the south' (relative to their location).",
      "Methodist": "As Rachel dies, she names the son Ben-Oni ('Son of my sorrow'). Jacob renames him Benjamin ('Son of the right hand').",
      "Lutheran": "As her soul departs (for she is dying), Rachel calls his name Ben-oni ('Son of my sorrow'). But his father calls him Benjamin ('Son of the right hand').",
      "Presbyterian": "With her dying breath, Rachel names her son Ben-oni ('Son of my sorrow'). Jacob changes the name to Benjamin ('Son of the right hand').",
      "Pentecostal": "As Rachel dies, she names him Ben-Oni; Jacob names him Benjamin.",
      "Episcopalian/Anglican": "As Rachel is dying, she names her son Ben-Oni ('son of my sorrow'), but Jacob names him Benjamin ('son of the right hand').",
      "Orthodox": "In her final moments, Rachel names the child Ben-oni ('Son of my affliction'). Jacob, however, designates him Benjamin ('Son of the right hand' or 'Son of the South').",
      "Other": "As she breathed her last—for she was dying—she named her son Ben-Oni. But his father named him Benjamin.",
      "Prefer not to say": "As she breathed her last—for she was dying—she named her son Ben-Oni. But his father named him Benjamin."
  },
  "19": {
      "General": "So Rachel died and was buried on the way to Ephrath (that is, Bethlehem).",
      "Non-Denominational": "So Rachel died and was buried on the way to Ephrath (that is, Bethlehem).",
      "Baptist": "Rachel dies and is buried there on the roadside, on the way to Ephrath, which the text again identifies as Bethlehem.",
      "Catholic": "Rachel dies and is buried along the road leading to Ephrath (explicitly identified here as Bethlehem).",
      "Methodist": "Rachel dies and is buried on the way to Ephrath (Bethlehem).",
      "Lutheran": "Rachel dies and is buried on the way to Ephrath (that is, Bethlehem).",
      "Presbyterian": "Rachel dies and is buried beside the road to Ephrath (Bethlehem).",
      "Pentecostal": "Rachel dies and is buried on the way to Ephrath (Bethlehem).",
      "Episcopalian/Anglican": "Rachel dies and is buried on the way to Ephrath (identified as Bethlehem).",
      "Orthodox": "Rachel succumbs and is buried along the route to Ephrath, identified as Bethlehem.",
      "Other": "So Rachel died and was buried on the way to Ephrath (that is, Bethlehem).",
      "Prefer not to say": "So Rachel died and was buried on the way to Ephrath (that is, Bethlehem)."
  },
  "20": {
      "General": "Over her tomb Jacob set up a pillar, and to this day that pillar marks Rachel's tomb.",
      "Non-Denominational": "Over her tomb Jacob set up a pillar, and to this day that pillar marks Rachel's tomb.",
      "Baptist": "Jacob erects a pillar over Rachel's grave as a monument. The narrator notes that this pillar still marked her tomb at the time the text was written.",
      "Catholic": "Jacob sets up a pillar over Rachel's tomb to mark the site. The narrator adds that this pillar, marking Rachel's tomb, exists 'to this day' (i.e., at the time of writing).",
      "Methodist": "Jacob sets up a pillar over Rachel's tomb, which marks the spot 'to this day' (time of writing).",
      "Lutheran": "Jacob sets up a pillar over her tomb; it is the pillar of Rachel's tomb, which is there to this day.",
      "Presbyterian": "Jacob erects a pillar over Rachel's grave, which remained as a marker at the time of the writing.",
      "Pentecostal": "Jacob sets up a pillar over her tomb, which exists 'to this day'.",
      "Episcopalian/Anglican": "Jacob erects a pillar over her tomb, which marks the site 'to this day.'",
      "Orthodox": "Jacob erects a pillar upon her grave, and this monument, marking Rachel's tomb, endures to the time of the narrative's composition.",
      "Other": "Over her tomb Jacob set up a pillar, and to this day that pillar marks Rachel's tomb.",
      "Prefer not to say": "Over her tomb Jacob set up a pillar, and to this day that pillar marks Rachel's tomb."
  },
  "21": {
      "General": "Israel moved on again and pitched his tent beyond Migdal Eder.",
      "Non-Denominational": "Israel moved on again and pitched his tent beyond Migdal Eder.",
      "Baptist": "Jacob (referred to here as Israel) continues his journey southward and pitches his tent beyond Migdal-eder ('Tower of the Flock'), a location likely near Bethlehem.",
      "Catholic": "Israel (Jacob) journeys onward and pitches his tent beyond Migdal-eder ('Tower of the Flock'), a location traditionally associated with the area near Bethlehem.",
      "Methodist": "Israel (Jacob) moves on and camps beyond Migdal Eder ('Tower of the Flock').",
      "Lutheran": "Israel journeys on and pitches his tent beyond the tower of Eder.",
      "Presbyterian": "Jacob (Israel) continues traveling and camps beyond Migdal-eder ('Tower of the Flock').",
      "Pentecostal": "Israel (Jacob) moves on and camps beyond Migdal Eder.",
      "Episcopalian/Anglican": "Israel (Jacob) journeys on and pitches his tent beyond Migdal-eder ('tower of the flock').",
      "Orthodox": "Israel (Jacob) continues his journey and sets up camp beyond Migdal-eder ('Tower of the Flock').",
      "Other": "Israel moved on again and pitched his tent beyond Migdal Eder.",
      "Prefer not to say": "Israel moved on again and pitched his tent beyond Migdal Eder."
  },
  "22": {
      "General": "While Israel was living in that region, Reuben went in and slept with his father's concubine Bilhah, and Israel heard of it. Jacob had twelve sons:",
      "Non-Denominational": "While Israel was living in that region, Reuben went in and slept with his father's concubine Bilhah, and Israel heard of it. Jacob had twelve sons:",
      "Baptist": "During their stay in that area, Reuben, Jacob's eldest son (by Leah), commits incest by sleeping with Bilhah, his father's concubine (and Rachel's handmaid). The text explicitly states that Israel (Jacob) heard about this transgression. The verse ends abruptly, marking a pause before listing Jacob's twelve sons.",
      "Catholic": "While Israel is dwelling in that region, a scandalous event occurs: Reuben, Jacob's firstborn son, lies with Bilhah, his father's concubine (Rachel's maidservant). The text pointedly notes, 'And Israel heard of it.' The verse breaks off here in the Hebrew text, followed by the list of Jacob's twelve sons, suggesting the gravity and shame of Reuben's act.",
      "Methodist": "While living there, Reuben (Jacob's firstborn) sleeps with Bilhah (Jacob's concubine, Rachel's servant). Israel (Jacob) hears about it. The text pauses before listing the twelve sons.",
      "Lutheran": "While Israel dwells in that land, Reuben goes and lies with Bilhah, his father's concubine. And Israel hears of it. Now the sons of Jacob were twelve.",
      "Presbyterian": "While camped there, Reuben, Jacob's eldest, sleeps with Bilhah, his father's concubine. Jacob learns of this act. The narrative then lists Jacob's twelve sons.",
      "Pentecostal": "While there, Reuben sleeps with Bilhah, Jacob's concubine. Jacob hears about it. List of 12 sons follows.",
      "Episcopalian/Anglican": "While Israel is living in that region, Reuben lies with Bilhah, his father's concubine. Israel hears of it. The narrative pauses, then lists Jacob's twelve sons.",
      "Orthodox": "During Israel's residence in that area, Reuben, his firstborn, engages in sexual relations with Bilhah, his father's concubine. Israel learns of this transgression. (The text pauses significantly before listing the sons).",
      "Other": "While Israel was living in that region, Reuben went in and slept with his father's concubine Bilhah, and Israel heard of it. Jacob had twelve sons:",
      "Prefer not to say": "While Israel was living in that region, Reuben went in and slept with his father's concubine Bilhah, and Israel heard of it. Jacob had twelve sons:"
  },
  "23": {
      "General": "The sons of Leah: Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar and Zebulun.",
      "Non-Denominational": "The sons of Leah: Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar and Zebulun.",
      "Baptist": "The list begins with the six sons born to Jacob through his wife Leah: Reuben (noted as the firstborn), Simeon, Levi, Judah, Issachar, and Zebulun.",
      "Catholic": "The list of Jacob's twelve sons begins with those born to Leah: Reuben (explicitly mentioned as Jacob's firstborn), Simeon, Levi, Judah, Issachar, and Zebulun.",
      "Methodist": "Lists the six sons of Leah: Reuben (firstborn), Simeon, Levi, Judah, Issachar, Zebulun.",
      "Lutheran": "Lists the sons of Leah: Reuben (Jacob's firstborn), Simeon, Levi, Judah, Issachar, Zebulun.",
      "Presbyterian": "Lists Leah's six sons: Reuben (the firstborn), Simeon, Levi, Judah, Issachar, and Zebulun.",
      "Pentecostal": "Leah's sons: Reuben, Simeon, Levi, Judah, Issachar, Zebulun.",
      "Episcopalian/Anglican": "Lists the six sons of Leah: Reuben (Jacob's firstborn), Simeon, Levi, Judah, Issachar, and Zebulun.",
      "Orthodox": "The enumeration of Jacob's sons commences with the six born to Leah: Reuben (designated as the firstborn), Simeon, Levi, Judah, Issachar, and Zebulun.",
      "Other": "The sons of Leah: Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar and Zebulun.",
      "Prefer not to say": "The sons of Leah: Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar and Zebulun."
  },
  "24": {
      "General": "The sons of Rachel: Joseph and Benjamin.",
      "Non-Denominational": "The sons of Rachel: Joseph and Benjamin.",
      "Baptist": "Next lists the two sons born to Jacob through his beloved wife Rachel: Joseph and Benjamin.",
      "Catholic": "Lists the two sons born to Rachel: Joseph and Benjamin.",
      "Methodist": "Lists the two sons of Rachel: Joseph and Benjamin.",
      "Lutheran": "Lists the sons of Rachel: Joseph and Benjamin.",
      "Presbyterian": "Lists Rachel's two sons: Joseph and Benjamin.",
      "Pentecostal": "Rachel's sons: Joseph, Benjamin.",
      "Episcopalian/Anglican": "Lists the two sons of Rachel: Joseph and Benjamin.",
      "Orthodox": "Lists the two sons born to Rachel: Joseph and Benjamin.",
      "Other": "The sons of Rachel: Joseph and Benjamin.",
      "Prefer not to say": "The sons of Rachel: Joseph and Benjamin."
  },
  "25": {
      "General": "The sons of Rachel's servant Bilhah: Dan and Naphtali.",
      "Non-Denominational": "The sons of Rachel's servant Bilhah: Dan and Naphtali.",
      "Baptist": "Lists the two sons born through Rachel's handmaid Bilhah: Dan and Naphtali.",
      "Catholic": "Lists the two sons born to Bilhah, Rachel's maidservant: Dan and Naphtali.",
      "Methodist": "Lists the two sons of Rachel's servant Bilhah: Dan and Naphtali.",
      "Lutheran": "Lists the sons of Bilhah, Rachel's servant: Dan and Naphtali.",
      "Presbyterian": "Lists the two sons of Bilhah (Rachel's servant): Dan and Naphtali.",
      "Pentecostal": "Bilhah's sons: Dan, Naphtali.",
      "Episcopalian/Anglican": "Lists the two sons of Bilhah, Rachel's servant: Dan and Naphtali.",
      "Orthodox": "Lists the two sons born to Bilhah, Rachel's handmaid: Dan and Naphtali.",
      "Other": "The sons of Rachel's servant Bilhah: Dan and Naphtali.",
      "Prefer not to say": "The sons of Rachel's servant Bilhah: Dan and Naphtali."
  },
  "26": {
      "General": "The sons of Leah's servant Zilpah: Gad and Asher. These were the sons of Jacob, who were born to him in Paddan Aram.",
      "Non-Denominational": "The sons of Leah's servant Zilpah: Gad and Asher. These were the sons of Jacob, who were born to him in Paddan Aram.",
      "Baptist": "Lists the two sons born through Leah's handmaid Zilpah: Gad and Asher. The verse concludes by summarizing that these are the sons born to Jacob in Paddan-aram (though Benjamin was actually born in Canaan, the list likely refers to the family group formed primarily in Paddan-aram).",
      "Catholic": "Lists the two sons born to Zilpah, Leah's maidservant: Gad and Asher. The summary statement 'These were the sons of Jacob who were born to him in Paddan-aram' primarily refers to the sons born during Jacob's time there, though Benjamin was born later in Canaan.",
      "Methodist": "Lists the two sons of Leah's servant Zilpah: Gad and Asher. Summarizes these are the sons born to Jacob in Paddan Aram (except Benjamin).",
      "Lutheran": "Lists the sons of Zilpah, Leah's servant: Gad and Asher. States these are the sons of Jacob born to him in Paddan-aram (technically excluding Benjamin).",
      "Presbyterian": "Lists the two sons of Zilpah (Leah's servant): Gad and Asher. Summarizes that these sons (except Benjamin) were born in Paddan Aram.",
      "Pentecostal": "Zilpah's sons: Gad, Asher. These sons were born in Paddan Aram (except Benjamin).",
      "Episcopalian/Anglican": "Lists the two sons of Zilpah, Leah's servant: Gad and Asher. These are summarized as the sons born to Jacob in Paddan-aram (with the exception of Benjamin).",
      "Orthodox": "Lists the two sons born to Zilpah, Leah's handmaid: Gad and Asher. The concluding statement identifies these as the sons born to Jacob in Paddan-aram (although Benjamin's birth occurred later in Canaan).",
      "Other": "The sons of Leah's servant Zilpah: Gad and Asher. These were the sons of Jacob, who were born to him in Paddan Aram.",
      "Prefer not to say": "The sons of Leah's servant Zilpah: Gad and Asher. These were the sons of Jacob, who were born to him in Paddan Aram."
  },
  "27": {
      "General": "Jacob came home to his father Isaac in Mamre, near Kiriath Arba (that is, Hebron), where Abraham and Isaac had stayed.",
      "Non-Denominational": "Jacob came home to his father Isaac in Mamre, near Kiriath Arba (that is, Hebron), where Abraham and Isaac had stayed.",
      "Baptist": "Jacob finally reaches the end of his long journey, returning to his aged father Isaac at Mamre, near Kiriath-arba (identified as Hebron). This location holds patriarchal significance as the place where both Abraham and Isaac had previously resided.",
      "Catholic": "Jacob finally arrives at the home of his father Isaac, located at Mamre, near Kiriath-arba (which is identified as Hebron). This location is noted as the place where both Abraham and Isaac had lived as sojourners.",
      "Methodist": "Jacob returns home to his father Isaac at Mamre, near Kiriath Arba (Hebron), the place where Abraham and Isaac had lived.",
      "Lutheran": "Jacob comes to his father Isaac at Mamre, or Kiriath-arba (that is, Hebron), where Abraham and Isaac had sojourned.",
      "Presbyterian": "Jacob finally returns to his father Isaac at Mamre, near Kiriath Arba (Hebron), a place significant to Abraham and Isaac.",
      "Pentecostal": "Jacob returns to his father Isaac at Mamre (Hebron), where Abraham and Isaac had lived.",
      "Episcopalian/Anglican": "Jacob comes to his father Isaac at Mamre, near Kiriath-arba (identified as Hebron), where Abraham and Isaac had resided.",
      "Orthodox": "Jacob arrives at the residence of his father Isaac in Mamre, adjacent to Kiriath-arba (identified as Hebron), a site previously inhabited by both Abraham and Isaac.",
      "Other": "Jacob came home to his father Isaac in Mamre, near Kiriath Arba (that is, Hebron), where Abraham and Isaac had stayed.",
      "Prefer not to say": "Jacob came home to his father Isaac in Mamre, near Kiriath Arba (that is, Hebron), where Abraham and Isaac had stayed."
  },
  "28": {
      "General": "Isaac lived a hundred and eighty years.",
      "Non-Denominational": "Isaac lived a hundred and eighty years.",
      "Baptist": "The text records the total lifespan of Isaac: 180 years.",
      "Catholic": "The lifespan of Isaac is stated: one hundred and eighty years.",
      "Methodist": "Isaac lived to be 180 years old.",
      "Lutheran": "The days of Isaac were 180 years.",
      "Presbyterian": "Isaac reaches the age of 180.",
      "Pentecostal": "Isaac lived 180 years.",
      "Episcopalian/Anglican": "Isaac lived to be 180 years old.",
      "Orthodox": "Isaac's total lifespan was one hundred and eighty years.",
      "Other": "Isaac lived a hundred and eighty years.",
      "Prefer not to say": "Isaac lived a hundred and eighty years."
  },
  "29": {
      "General": "Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him.",
      "Non-Denominational": "Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him.",
      "Baptist": "Isaac dies ('breathed his last'), fulfilling a long life ('old and full of years'), and is 'gathered to his people' (a common expression for death and joining ancestors). Significantly, both of his sons, Esau and Jacob, come together to bury him, indicating a final reconciliation or shared duty at their father's death.",
      "Catholic": "Isaac breathes his last, dies, and is 'gathered to his people' (a euphemism for death signifying joining deceased ancestors), having lived a long life ('old and full of days'). Notably, his two sons, Esau and Jacob, reunite to perform the burial rites for their father.",
      "Methodist": "Isaac dies, old and full of years, and is gathered to his people. His sons, Esau and Jacob, bury him together.",
      "Lutheran": "Isaac breathes his last, dies, and is gathered to his people, old and full of days. His sons Esau and Jacob bury him.",
      "Presbyterian": "Isaac dies at a ripe old age and is 'gathered to his people.' His sons, Esau and Jacob, come together to bury him.",
      "Pentecostal": "Isaac dies old. Esau and Jacob bury him together.",
      "Episcopalian/Anglican": "Isaac dies, old and full of years, and is gathered to his people. His sons Esau and Jacob bury him.",
      "Orthodox": "Isaac expires, concluding a long life ('old and full of years'), and is 'gathered to his people.' His sons, Esau and Jacob, jointly undertake his burial.",
      "Other": "Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him.",
      "Prefer not to say": "Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him."
    }
  }
} 