{
  "_comment": "Interpretations for Genesis Chapter 37",
  "book": "Genesis",
  "chapter": "37",
  "verses": {
  "1": {
      "General": "Jacob lived in the land where his father had stayed, the land of Canaan.",
      "Non-Denominational": "Jacob lived in the land where his father had stayed, the land of Canaan.",
      "Baptist": "The narrative returns to Jacob, who is now settled in Canaan, the land where his father Isaac (and Abraham) had lived as sojourners.",
      "Catholic": "Jacob settles and dwells in the land of Canaan, the land where his father Isaac had resided as an alien or sojourner.",
      "Methodist": "Jacob settles in Canaan, the land where his father had lived.",
      "Lutheran": "Jacob dwells in the land of his father's sojournings, the land of Canaan.",
      "Presbyterian": "Jacob resides in the land of Canaan, where his father Isaac had lived.",
      "Pentecostal": "Jacob lives in Canaan, where his father stayed.",
      "Episcopalian/Anglican": "Jacob settles in the land of Canaan, where his father had sojourned.",
      "Orthodox": "Jacob takes up residence in the land of Canaan, the region where his father had previously sojourned.",
      "Other": "Jacob lived in the land where his father had stayed, the land of Canaan.",
      "Prefer not to say": "Jacob lived in the land where his father had stayed, the land of Canaan."
  },
  "2": {
      "General": "This is the account of Jacob's family line. Joseph, a young man of seventeen, was tending the flocks with his brothers, the sons of Bilhah and the sons of Zilpah, his father's wives, and he brought their father a bad report about them.",
      "Non-Denominational": "This is the account of Jacob's family line. Joseph, a young man of seventeen, was tending the flocks with his brothers, the sons of Bilhah and the sons of Zilpah, his father's wives, and he brought their father a bad report about them.",
      "Baptist": "Introduces the 'toledot' (account/generations) of Jacob, immediately focusing on Joseph. At seventeen, Joseph is working with his brothers (specifically, the sons of the handmaids Bilhah and Zilpah) tending flocks. He reports negatively on their conduct to their father Jacob.",
      "Catholic": "This verse introduces the 'generations' (toledot) of Jacob, shifting the narrative focus primarily to his son Joseph. Joseph, at seventeen years old, is involved in shepherding alongside his brothers, particularly the sons of Bilhah and Zilpah (his father's secondary wives). The text notes that Joseph brought a bad report about these brothers to their father.",
      "Methodist": "Introduces the story (toledot) of Jacob's family, focusing on Joseph. At 17, Joseph tends flocks with his brothers (sons of Bilhah and Zilpah) and brings a negative report about them to Jacob.",
      "Lutheran": "These are the generations of Jacob. Joseph, 17 years old, is shepherding the flock with his brothers, the sons of Bilhah and Zilpah, his father's wives. Joseph brings a bad report of them to their father.",
      "Presbyterian": "Introduces the account (generations) of Jacob, focusing on Joseph. At 17, Joseph shepherds with his brothers (sons of the handmaids) and reports their misconduct to Jacob.",
      "Pentecostal": "Introduces Jacob's family story, focusing on 17-year-old Joseph. He tends flocks with brothers (sons of Bilhah/Zilpah) and gives Jacob a bad report.",
      "Episcopalian/Anglican": "Introduces the account of Jacob's family, focusing on Joseph. At seventeen, Joseph tends flocks with his brothers (sons of Bilhah and Zilpah) and brings a bad report about them to Jacob.",
      "Orthodox": "This section begins the 'toledot' (generations/history) of Jacob, centering on Joseph. At seventeen, Joseph assists his brothers, the sons of Bilhah and Zilpah, in tending the flocks and conveys unfavorable reports about them to his father.",
      "Other": "This is the account of Jacob's family line. Joseph, a young man of seventeen, was tending the flocks with his brothers, the sons of Bilhah and the sons of Zilpah, his father's wives, and he brought their father a bad report about them.",
      "Prefer not to say": "This is the account of Jacob's family line. Joseph, a young man of seventeen, was tending the flocks with his brothers, the sons of Bilhah and the sons of Zilpah, his father's wives, and he brought their father a bad report about them."
  },
  "3": {
      "General": "Now Israel loved Joseph more than any of his other sons, because he had been born to him in his old age; and he made an ornate robe for him.",
      "Non-Denominational": "Now Israel loved Joseph more than any of his other sons, because he had been born to him in his old age; and he made an ornate robe for him.",
      "Baptist": "Highlights Jacob's (Israel's) preferential love for Joseph over his other sons, attributed to Joseph being a son born in Jacob's old age. As a sign of this favor, Jacob makes Joseph a special robe, often translated as 'coat of many colors' or a long-sleeved, ornamented tunic, likely signifying status or exemption from manual labor.",
      "Catholic": "The text explicitly states Jacob's (Israel's) favoritism: he loved Joseph more than all his other sons because Joseph was the son of his old age. This favoritism was demonstrated by Jacob making him a special tunic, described as long-sleeved or richly ornamented (ketonet passim), potentially indicating authority or privilege.",
      "Methodist": "Israel (Jacob) loved Joseph more than his other sons because he was born in his old age. He shows this favoritism by giving Joseph a special robe (ornate, long-sleeved, 'coat of many colors').",
      "Lutheran": "Israel loves Joseph more than all his children because he is the son of his old age. He makes him a robe of many colors (or long-sleeved tunic).",
      "Presbyterian": "Jacob (Israel) shows clear favoritism towards Joseph, loving him more because he was born in his old age, and gives him a special ornamented robe.",
      "Pentecostal": "Jacob loved Joseph most because he was born in old age, making him an ornate robe.",
      "Episcopalian/Anglican": "Jacob (Israel) loved Joseph more than his other sons due to his birth in Jacob's old age, and demonstrated this by making him an ornamented robe.",
      "Orthodox": "Jacob (Israel) displayed overt favoritism towards Joseph, loving him more than his other sons as the child of his later years. This preference was manifested by gifting Joseph a distinctive, ornamented tunic (ketonet passim).",
      "Other": "Now Israel loved Joseph more than any of his other sons, because he had been born to him in his old age; and he made an ornate robe for him.",
      "Prefer not to say": "Now Israel loved Joseph more than any of his other sons, because he had been born to him in his old age; and he made an ornate robe for him."
  },
  "4": {
      "General": "When his brothers saw that their father loved him more than any of them, they hated him and could not speak a kind word to him.",
      "Non-Denominational": "When his brothers saw that their father loved him more than any of them, they hated him and could not speak a kind word to him.",
      "Baptist": "Joseph's brothers observe their father's blatant favoritism. This preferential treatment breeds hatred in them towards Joseph, to the point where they cannot even speak peaceably or kindly to him.",
      "Catholic": "Observing their father's clear preference for Joseph, his brothers react with hatred. Their resentment is so profound that they are unable to engage in peaceful or civil conversation ('speak peaceably') with him.",
      "Methodist": "Seeing their father's favoritism, Joseph's brothers hate him and are unable to speak kindly to him.",
      "Lutheran": "His brothers see their father loves him more than them, so they hate him and cannot speak peaceably to him.",
      "Presbyterian": "The brothers, seeing Jacob's favoritism, develop a deep hatred for Joseph and refuse to speak kindly to him.",
      "Pentecostal": "The brothers see the favoritism, hate Joseph, and can't speak kindly to him.",
      "Episcopalian/Anglican": "When Joseph's brothers see their father's favoritism, they hate Joseph and cannot speak peaceably to him.",
      "Orthodox": "Witnessing their father's partiality, Joseph's brothers conceive a deep animosity towards him, rendering them incapable of interacting with him amicably.",
      "Other": "When his brothers saw that their father loved him more than any of them, they hated him and could not speak a kind word to him.",
      "Prefer not to say": "When his brothers saw that their father loved him more than any of them, they hated him and could not speak a kind word to him."
  },
  "5": {
      "General": "Joseph had a dream, and when he told it to his brothers, they hated him all the more.",
      "Non-Denominational": "Joseph had a dream, and when he told it to his brothers, they hated him all the more.",
      "Baptist": "Joseph has a dream and recounts it to his brothers. Sharing this dream further intensifies their hatred for him.",
      "Catholic": "Joseph has a dream and subsequently relates it to his brothers. This act further fuels their already existing hatred for him.",
      "Methodist": "Joseph has a dream and tells it to his brothers, which makes them hate him even more.",
      "Lutheran": "Joseph dreams a dream and tells it to his brothers; they hate him even more.",
      "Presbyterian": "Joseph recounts a dream to his brothers, which only increases their hatred towards him.",
      "Pentecostal": "Joseph has a dream, tells his brothers, and they hate him more.",
      "Episcopalian/Anglican": "Joseph has a dream and tells it to his brothers, increasing their hatred for him.",
      "Orthodox": "Joseph experiences a dream and narrates it to his brothers, an act that further exacerbates their animosity towards him.",
      "Other": "Joseph had a dream, and when he told it to his brothers, they hated him all the more.",
      "Prefer not to say": "Joseph had a dream, and when he told it to his brothers, they hated him all the more."
  },
  "6": {
      "General": "He said to them, \"Listen to this dream I had:",
      "Non-Denominational": "He said to them, \"Listen to this dream I had:",
      "Baptist": "Joseph prefaces the telling of his dream, asking his brothers to listen.",
      "Catholic": "Joseph begins to narrate his dream, asking for his brothers' attention: 'Hear this dream that I have dreamed.'",
      "Methodist": "Joseph asks his brothers to listen to his dream.",
      "Lutheran": "He asks them to hear the dream he dreamed.",
      "Presbyterian": "Joseph begins telling his dream.",
      "Pentecostal": "Joseph tells them to listen to his dream.",
      "Episcopalian/Anglican": "Joseph asks his brothers to listen to the dream he had.",
      "Orthodox": "Joseph invites his brothers to hear the content of his dream.",
      "Other": "He said to them, \"Listen to this dream I had:",
      "Prefer not to say": "He said to them, \"Listen to this dream I had:"
  },
  "7": {
      "General": "We were binding sheaves of grain out in the field when suddenly my sheaf rose and stood upright, while your sheaves gathered around mine and bowed down to it.\"",
      "Non-Denominational": "We were binding sheaves of grain out in the field when suddenly my sheaf rose and stood upright, while your sheaves gathered around mine and bowed down to it.\"",
      "Baptist": "Describes the first dream: Joseph and his brothers are binding sheaves in a field. Joseph's sheaf stands upright, while his brothers' sheaves gather around and bow down to his sheaf, symbolizing submission and Joseph's future authority over them.",
      "Catholic": "He recounts the dream's imagery: they were binding sheaves in the field; Joseph's sheaf arose and stood erect, while the brothers' sheaves gathered around and prostrated themselves before Joseph's sheaf. The symbolism clearly implies Joseph's future preeminence and his brothers' subservience.",
      "Methodist": "The dream: They were binding sheaves. Joseph's sheaf stood upright, and his brothers' sheaves bowed down to it.",
      "Lutheran": "Describes the dream: They were binding sheaves in the field. Joseph's sheaf arose and stood upright, while his brothers' sheaves gathered around and bowed down to his.",
      "Presbyterian": "Joseph describes his dream: his sheaf of grain stood upright while his brothers' sheaves bowed down to it.",
      "Pentecostal": "The dream: his sheaf stood up, brothers' sheaves bowed to it.",
      "Episcopalian/Anglican": "Recounts the first dream: while binding sheaves, Joseph's sheaf stood upright, and his brothers' sheaves bowed down to it.",
      "Orthodox": "Joseph narrates the dream: while binding sheaves, his sheaf arose and stood upright, whereas his brothers' sheaves encircled and bowed down to his.",
      "Other": "We were binding sheaves of grain out in the field when suddenly my sheaf rose and stood upright, while your sheaves gathered around mine and bowed down to it.\"",
      "Prefer not to say": "We were binding sheaves of grain out in the field when suddenly my sheaf rose and stood upright, while your sheaves gathered around mine and bowed down to it.\""
  },
  "8": {
      "General": "His brothers said to him, \"Do you intend to reign over us? Will you actually rule us?\" And they hated him all the more because of his dream and what he had said.",
      "Non-Denominational": "His brothers said to him, \"Do you intend to reign over us? Will you actually rule us?\" And they hated him all the more because of his dream and what he had said.",
      "Baptist": "The brothers immediately grasp the dream's implication of Joseph's future rule over them. They respond with sarcastic and resentful questions: 'Will you indeed reign over us? Or will you indeed rule us?' Their hatred intensifies further due to the dream itself and Joseph's telling of it.",
      "Catholic": "The brothers immediately interpret the dream's meaning and react with hostility and sarcasm: 'Are you indeed to reign over us? Or are you indeed to rule over us?' Their hatred for Joseph escalates, fueled both by the content of the dream and by his audacity in relating it.",
      "Methodist": "The brothers understand the dream's implication: Joseph ruling over them. They respond sarcastically ('Will you reign over us?') and hate him even more for the dream and his words.",
      "Lutheran": "His brothers ask if he will indeed reign or rule over them. They hate him even more for his dreams and words.",
      "Presbyterian": "The brothers interpret the dream as Joseph asserting future dominance over them and respond with hostility, increasing their hatred.",
      "Pentecostal": "Brothers understand the dream means Joseph will rule them. They hate him more for the dream and words.",
      "Episcopalian/Anglican": "His brothers react with scorn, understanding the implication: 'Do you intend to reign over us?' Their hatred grows because of his dream and his words.",
      "Orthodox": "His brothers perceive the implication of Joseph's future authority and react with sarcastic resentment: 'Will you indeed reign over us? Will you indeed have dominion over us?' This incident further intensifies their animosity, provoked by both the dream and its narration.",
      "Other": "His brothers said to him, \"Do you intend to reign over us? Will you actually rule us?\" And they hated him all the more because of his dream and what he had said.",
      "Prefer not to say": "His brothers said to him, \"Do you intend to reign over us? Will you actually rule us?\" And they hated him all the more because of his dream and what he had said."
  },
  "9": {
      "General": "Then he had another dream, and he told it to his brothers. \"Listen,\" he said, \"I had another dream, and this time the sun and moon and eleven stars were bowing down to me.\"",
      "Non-Denominational": "Then he had another dream, and he told it to his brothers. \"Listen,\" he said, \"I had another dream, and this time the sun and moon and eleven stars were bowing down to me.\"",
      "Baptist": "Joseph has a second dream and, seemingly undeterred or naive, also tells this one to his brothers. In this dream, the sun, moon, and eleven stars bow down to him, representing his entire family (father, mother, brothers) acknowledging his supremacy.",
      "Catholic": "Joseph then has another dream, which he also relates, this time not only to his brothers but implicitly within hearing of his father (as seen in v. 10). He describes the sun, moon, and eleven stars bowing down to him. This symbolism extends the previous dream, suggesting the submission of his father (sun), mother (moon - likely Leah or perhaps representing the deceased Rachel symbolically), and his eleven brothers (stars).",
      "Methodist": "Joseph has a second dream and tells it to his brothers (and father, v.10): the sun, moon, and eleven stars bowed down to him.",
      "Lutheran": "He dreams another dream and tells it to his brothers: the sun, the moon, and eleven stars were bowing down to him.",
      "Presbyterian": "Joseph relates a second dream where the sun, moon, and eleven stars (representing his parents and brothers) bow down to him.",
      "Pentecostal": "Joseph has another dream, tells brothers: sun, moon, 11 stars bowed to him.",
      "Episcopalian/Anglican": "Joseph has a second dream and tells it to his brothers: the sun, moon, and eleven stars were bowing down to him.",
      "Orthodox": "Joseph experiences a second dream and recounts it as well: the sun, moon, and eleven stars were performing obeisance to him, symbolizing the submission of his entire family.",
      "Other": "Then he had another dream, and he told it to his brothers. \"Listen,\" he said, \"I had another dream, and this time the sun and moon and eleven stars were bowing down to me.\"",
      "Prefer not to say": "Then he had another dream, and he told it to his brothers. \"Listen,\" he said, \"I had another dream, and this time the sun and moon and eleven stars were bowing down to me.\""
  },
  "10": {
      "General": "When he told his father as well as his brothers, his father rebuked him and said, \"What is this dream you had? Will your mother and I and your brothers actually come and bow down to the ground before you?\"",
      "Non-Denominational": "When he told his father as well as his brothers, his father rebuked him and said, \"What is this dream you had? Will your mother and I and your brothers actually come and bow down to the ground before you?\"",
      "Baptist": "Joseph tells this second dream to his father Jacob as well. Jacob rebukes Joseph for the dream's apparent arrogance, questioning its meaning: 'Will I and your mother and your brothers indeed come to bow ourselves to the ground before you?' Even Jacob recognizes the implication of authority.",
      "Catholic": "Joseph relates this dream to his father in the presence of his brothers. Jacob rebukes him, questioning the dream's propriety and meaning: 'What is this dream that you have dreamed? Shall I and your mother and your brothers indeed come to bow ourselves to the ground before you?' Jacob clearly understands the implications of the symbolism.",
      "Methodist": "Joseph tells this dream to his father too. Jacob rebukes him, questioning if he, Joseph's mother, and brothers will actually bow down to him.",
      "Lutheran": "He tells it to his father and brothers. His father rebukes him, asking what the dream means and if he, his mother, and brothers will bow down to him.",
      "Presbyterian": "When Joseph tells this dream to his father, Jacob rebukes him, questioning the implication that his parents and brothers would bow down to him.",
      "Pentecostal": "Joseph tells his father too. Jacob rebukes him, asking if the family will bow to him.",
      "Episcopalian/Anglican": "Joseph tells this dream to his father and brothers. His father rebukes him, questioning the meaning and implication that the family would bow down to Joseph.",
      "Orthodox": "When Joseph relates this dream to his father and brothers, Jacob reprimands him, questioning the dream's significance: 'Will I and your mother and your brothers indeed come and bow down to the earth before you?'",
      "Other": "When he told his father as well as his brothers, his father rebuked him and said, \"What is this dream you had? Will your mother and I and your brothers actually come and bow down to the ground before you?\"",
      "Prefer not to say": "When he told his father as well as his brothers, his father rebuked him and said, \"What is this dream you had? Will your mother and I and your brothers actually come and bow down to the ground before you?\""
  },
  "11": {
      "General": "His brothers were jealous of him, but his father kept the matter in mind.",
      "Non-Denominational": "His brothers were jealous of him, but his father kept the matter in mind.",
      "Baptist": "The brothers' reaction to the second dream is intensified jealousy. Jacob, despite his rebuke, ponders the dreams, perhaps sensing their potential significance ('kept the saying in mind').",
      "Catholic": "The brothers' response is jealousy. Jacob, however, though he rebuked Joseph, 'kept the matter (or saying) in mind,' suggesting he reflected on the dreams and considered their possible divine origin or future fulfillment.",
      "Methodist": "His brothers become jealous. Jacob, however, keeps the dreams in mind (ponders them).",
      "Lutheran": "His brothers are jealous of him, but his father keeps the saying in mind.",
      "Presbyterian": "The brothers become increasingly jealous, while Jacob reflects on the meaning of the dreams.",
      "Pentecostal": "Brothers were jealous; Jacob kept the matter in mind.",
      "Episcopalian/Anglican": "Joseph's brothers are jealous, but Jacob considers the meaning of the dreams.",
      "Orthodox": "Joseph's brothers react with jealousy, while his father, Jacob, reflects upon the matter, contemplating the potential significance of the dreams.",
      "Other": "His brothers were jealous of him, but his father kept the matter in mind.",
      "Prefer not to say": "His brothers were jealous of him, but his father kept the matter in mind."
  },
  "12": {
      "General": "Now his brothers had gone to graze their father's flocks near Shechem,",
      "Non-Denominational": "Now his brothers had gone to graze their father's flocks near Shechem,",
      "Baptist": "Sets the scene for the next event: Joseph's brothers have traveled north to graze Jacob's flocks near Shechem (the site of the earlier conflict in chapter 34).",
      "Catholic": "The narrative shifts location: Joseph's brothers go to pasture their father's flocks near Shechem.",
      "Methodist": "Joseph's brothers go to graze flocks near Shechem.",
      "Lutheran": "His brothers go to pasture their father's flock near Shechem.",
      "Presbyterian": "Joseph's brothers travel to Shechem to graze the family flocks.",
      "Pentecostal": "Brothers go to Shechem to graze flocks.",
      "Episcopalian/Anglican": "Joseph's brothers go to graze their father's flocks near Shechem.",
      "Orthodox": "Joseph's brothers depart to pasture their father's flocks in the vicinity of Shechem.",
      "Other": "Now his brothers had gone to graze their father's flocks near Shechem,",
      "Prefer not to say": "Now his brothers had gone to graze their father's flocks near Shechem,"
  },
  "13": {
      "General": "and Israel said to Joseph, \"As you know, your brothers are grazing the flocks near Shechem. Come, I am going to send you to them.\" \"Very well,\" he replied.",
      "Non-Denominational": "and Israel said to Joseph, \"As you know, your brothers are grazing the flocks near Shechem. Come, I am going to send you to them.\" \"Very well,\" he replied.",
      "Baptist": "Jacob (Israel) summons Joseph and instructs him to go check on the welfare of his brothers and the flocks near Shechem. Joseph readily agrees to go.",
      "Catholic": "Jacob (Israel) instructs Joseph, 'Are not your brothers pasturing the flock at Shechem? Come, I will send you to them.' Joseph responds obediently, 'Here I am.'",
      "Methodist": "Israel (Jacob) tells Joseph his brothers are near Shechem and sends Joseph to check on them. Joseph agrees.",
      "Lutheran": "Israel tells Joseph his brothers are pasturing the flock at Shechem and says he will send Joseph to them. Joseph agrees ('Here I am').",
      "Presbyterian": "Jacob sends Joseph to check on his brothers who are grazing flocks near Shechem. Joseph agrees.",
      "Pentecostal": "Jacob tells Joseph to go check on his brothers near Shechem. Joseph agrees.",
      "Episcopalian/Anglican": "Jacob (Israel) tells Joseph that his brothers are grazing flocks near Shechem and sends Joseph to them. Joseph agrees.",
      "Orthodox": "Jacob (Israel) informs Joseph of his brothers' location near Shechem and dispatches him to inquire about their well-being. Joseph consents.",
      "Other": "and Israel said to Joseph, \"As you know, your brothers are grazing the flocks near Shechem. Come, I am going to send you to them.\" \"Very well,\" he replied.",
      "Prefer not to say": "and Israel said to Joseph, \"As you know, your brothers are grazing the flocks near Shechem. Come, I am going to send you to them.\" \"Very well,\" he replied."
  },
  "14": {
      "General": "So he said to him, \"Go and see if all is well with your brothers and with the flocks, and bring word back to me.\" Then he sent him off from the Valley of Hebron.",
      "Non-Denominational": "So he said to him, \"Go and see if all is well with your brothers and with the flocks, and bring word back to me.\" Then he sent him off from the Valley of Hebron.",
      "Baptist": "Jacob specifies Joseph's task: check on the well-being ('shalom') of his brothers and the flocks, and report back. Jacob sends Joseph on his way from their current location in the Valley of Hebron.",
      "Catholic": "Jacob gives Joseph his specific instructions: 'Go now, see if it is well (shalom) with your brothers and with the flock, and bring me word again.' Jacob then sends Joseph from the Valley of Hebron.",
      "Methodist": "Jacob instructs Joseph: check if the brothers and flocks are well ('shalom') and report back. He sends him from the Valley of Hebron.",
      "Lutheran": "Jacob tells Joseph to see if it is well with his brothers and the flock and bring word back. He sends him from the Valley of Hebron.",
      "Presbyterian": "Jacob instructs Joseph to check on the welfare ('shalom') of his brothers and the flocks and return with a report. He departs from Hebron.",
      "Pentecostal": "Jacob tells Joseph to check if brothers/flocks are well and report back. Sends him from Hebron valley.",
      "Episcopalian/Anglican": "Jacob instructs Joseph to check on the well-being ('shalom') of his brothers and the flocks and report back. He sends him from the Valley of Hebron.",
      "Orthodox": "Jacob tasks Joseph with ascertaining the well-being ('shalom') of his brothers and the flocks, and reporting back. Joseph departs from the Valley of Hebron.",
      "Other": "So he said to him, \"Go and see if all is well with your brothers and with the flocks, and bring word back to me.\" Then he sent him off from the Valley of Hebron.",
      "Prefer not to say": "So he said to him, \"Go and see if all is well with your brothers and with the flocks, and bring word back to me.\" Then he sent him off from the Valley of Hebron."
  },
  "15": {
      "General": "When Joseph arrived at Shechem, a man found him wandering around in the fields and asked him, \"What are you looking for?\"",
      "Non-Denominational": "When Joseph arrived at Shechem, a man found him wandering around in the fields and asked him, \"What are you looking for?\"",
      "Baptist": "Joseph reaches the area of Shechem but cannot find his brothers. A man encounters him wandering in the fields and asks what he is seeking.",
      "Catholic": "Upon arriving near Shechem, Joseph is found wandering in the open country by an unidentified man, who inquires about his purpose: 'What are you seeking?'",
      "Methodist": "Joseph arrives near Shechem but can't find his brothers. A man finds him wandering and asks what he's looking for.",
      "Lutheran": "He comes to Shechem, and a man finds him wandering in the fields and asks what he seeks.",
      "Presbyterian": "Reaching Shechem, Joseph cannot find his brothers. A man finds him wandering and asks his purpose.",
      "Pentecostal": "Joseph reaches Shechem, wanders, is asked by a man what he seeks.",
      "Episcopalian/Anglican": "Joseph reaches Shechem but is found wandering in the fields by a man who asks what he is looking for.",
      "Orthodox": "Arriving in the vicinity of Shechem, Joseph is discovered wandering aimlessly by a man who inquires about his objective.",
      "Other": "When Joseph arrived at Shechem, a man found him wandering around in the fields and asked him, \"What are you looking for?\"",
      "Prefer not to say": "When Joseph arrived at Shechem, a man found him wandering around in the fields and asked him, \"What are you looking for?\""
  },
  "16": {
      "General": "He replied, \"I'm looking for my brothers. Can you tell me where they are grazing their flocks?\"",
      "Non-Denominational": "He replied, \"I'm looking for my brothers. Can you tell me where they are grazing their flocks?\"",
      "Baptist": "Joseph explains he is looking for his brothers and asks the man if he knows where they are pasturing their flocks.",
      "Catholic": "Joseph replies that he is searching for his brothers and asks the man for information regarding their location: 'Tell me, please, where they are pasturing the flock.'",
      "Methodist": "Joseph says he seeks his brothers and asks where they are grazing flocks.",
      "Lutheran": "Joseph says he seeks his brothers and asks where they are pasturing.",
      "Presbyterian": "Joseph explains he is seeking his brothers and asks for their location.",
      "Pentecostal": "Joseph says he seeks his brothers, asks where they are grazing.",
      "Episcopalian/Anglican": "Joseph replies he is looking for his brothers and asks where they are grazing their flocks.",
      "Orthodox": "Joseph states he is searching for his brothers and requests information about their current location for pasturing.",
      "Other": "He replied, \"I'm looking for my brothers. Can you tell me where they are grazing their flocks?\"",
      "Prefer not to say": "He replied, \"I'm looking for my brothers. Can you tell me where they are grazing their flocks?\""
  },
  "17": {
      "General": "\"They have moved on from here,\" the man answered. \"I heard them say, 'Let's go to Dothan.'\" So Joseph went after his brothers and found them near Dothan.",
      "Non-Denominational": "\"They have moved on from here,\" the man answered. \"I heard them say, 'Let's go to Dothan.'\" So Joseph went after his brothers and found them near Dothan.",
      "Baptist": "The man informs Joseph that his brothers have left Shechem and moved on. He overheard them saying they were going to Dothan (further north). Joseph follows this lead and finds his brothers near Dothan.",
      "Catholic": "The man informs Joseph that his brothers have departed from Shechem, adding that he overheard them planning to go to Dothan. Acting on this information, Joseph continues his search and locates his brothers near Dothan.",
      "Methodist": "The man says they moved on; he heard them say they were going to Dothan. Joseph follows and finds them near Dothan.",
      "Lutheran": "The man says they moved on from there; he heard them say they were going to Dothan. Joseph goes after his brothers and finds them at Dothan.",
      "Presbyterian": "The man directs Joseph towards Dothan, saying he overheard the brothers heading there. Joseph follows and finds them near Dothan.",
      "Pentecostal": "Man says they went to Dothan. Joseph follows and finds them there.",
      "Episcopalian/Anglican": "The man tells Joseph his brothers have moved on towards Dothan. Joseph follows and finds them near Dothan.",
      "Orthodox": "The man reports that the brothers have departed, having overheard their intention to proceed to Dothan. Joseph pursues this direction and locates them near Dothan.",
      "Other": "\"They have moved on from here,\" the man answered. \"I heard them say, 'Let's go to Dothan.'\" So Joseph went after his brothers and found them near Dothan.",
      "Prefer not to say": "\"They have moved on from here,\" the man answered. \"I heard them say, 'Let's go to Dothan.'\" So Joseph went after his brothers and found them near Dothan."
  },
  "18": {
      "General": "But they saw him in the distance, and before he reached them, they plotted to kill him.",
      "Non-Denominational": "But they saw him in the distance, and before he reached them, they plotted to kill him.",
      "Baptist": "Joseph's brothers see him approaching from a distance. Before he even reaches them, their hatred boils over, and they conspire together to murder him.",
      "Catholic": "The brothers spot Joseph approaching from afar. Even before he arrives, they conspire ('plot') amongst themselves to kill him.",
      "Methodist": "They see Joseph coming from afar and plot to kill him before he arrives.",
      "Lutheran": "They see him from afar, and before he comes near, they conspire against him to kill him.",
      "Presbyterian": "Seeing Joseph approaching in the distance, the brothers immediately conspire to kill him before he reaches them.",
      "Pentecostal": "They see Joseph coming, plot to kill him before he arrives.",
      "Episcopalian/Anglican": "The brothers see Joseph in the distance and conspire to kill him before he reaches them.",
      "Orthodox": "Spotting Joseph approaching from a distance, his brothers conspire to murder him before his arrival.",
      "Other": "But they saw him in the distance, and before he reached them, they plotted to kill him.",
      "Prefer not to say": "But they saw him in the distance, and before he reached them, they plotted to kill him."
  },
  "19": {
      "General": "\"Here comes that dreamer!\" they said to each other.",
      "Non-Denominational": "\"Here comes that dreamer!\" they said to each other.",
      "Baptist": "Their contempt is evident as they refer to Joseph sarcastically as 'this dreamer' or 'master of dreams.'",
      "Catholic": "Their conspiracy begins with a mocking reference to Joseph: 'Here comes this dreamer!' (literally, 'master of dreams').",
      "Methodist": "They mockingly refer to him as 'that dreamer.'",
      "Lutheran": "They call him 'this dreamer.'",
      "Presbyterian": "They refer to Joseph scornfully as 'that dreamer.'",
      "Pentecostal": "They call him 'that dreamer!'",
      "Episcopalian/Anglican": "They mockingly refer to Joseph as 'that dreamer.'",
      "Orthodox": "They refer to Joseph with derision as 'this master of dreams.'",
      "Other": "\"Here comes that dreamer!\" they said to each other.",
      "Prefer not to say": "\"Here comes that dreamer!\" they said to each other."
  },
  "20": {
      "General": "\"Come now, let's kill him and throw him into one of these cisterns and say that a ferocious animal devoured him. Then we'll see what comes of his dreams.\"",
      "Non-Denominational": "\"Come now, let's kill him and throw him into one of these cisterns and say that a ferocious animal devoured him. Then we'll see what comes of his dreams.\"",
      "Baptist": "They hatch a plan: kill Joseph, dispose of his body in a dry cistern (pit), and concoct a story for their father that a wild beast killed him. They add a cynical comment, 'Then we will see what will become of his dreams!', revealing their desire to thwart the future predicted in his dreams.",
      "Catholic": "They devise a plan: murder Joseph, throw his body into one of the nearby cisterns (pits, often dry), and then lie to their father, claiming a wild animal killed him. Their concluding remark, 'Then we shall see what will become of his dreams,' expresses their malicious intent to nullify the future foretold in his dreams.",
      "Methodist": "They plot: kill him, throw him in a cistern, lie to Jacob (say a wild animal killed him), and cynically remark, 'Then we'll see what comes of his dreams.'",
      "Lutheran": "They plan to kill him, throw him into a pit, say a fierce animal devoured him, and then see what becomes of his dreams.",
      "Presbyterian": "They plan to kill Joseph, throw him in a cistern, and lie to Jacob, claiming a wild animal killed him, cynically challenging the fulfillment of his dreams.",
      "Pentecostal": "Plan: kill him, throw him in cistern, lie about wild animal, see what happens to his dreams.",
      "Episcopalian/Anglican": "They plot to kill Joseph, throw him into a cistern, and claim a wild animal killed him, adding cynically, 'Then we'll see what becomes of his dreams.'",
      "Orthodox": "They formulate a plan: kill Joseph, cast his body into a cistern, and fabricate a story for their father about a fatal wild animal attack, thereby intending to disprove his dreams.",
      "Other": "\"Come now, let's kill him and throw him into one of these cisterns and say that a ferocious animal devoured him. Then we'll see what comes of his dreams.\"",
      "Prefer not to say": "\"Come now, let's kill him and throw him into one of these cisterns and say that a ferocious animal devoured him. Then we'll see what comes of his dreams.\""
  },
  "21": {
      "General": "When Reuben heard this, he tried to rescue him from their hands. \"Let's not take his life,\" he said.",
      "Non-Denominational": "When Reuben heard this, he tried to rescue him from their hands. \"Let's not take his life,\" he said.",
      "Baptist": "Reuben, the eldest brother, overhears the plot and intervenes, attempting to save Joseph. He counsels against outright murder ('Let us not strike him fatally').",
      "Catholic": "Reuben, the firstborn, hears their murderous plot and seeks to deliver Joseph from their violence. He objects to killing him directly: 'Let us not take his life.'",
      "Methodist": "Reuben, the eldest, overhears and tries to rescue Joseph, arguing against killing him.",
      "Lutheran": "Reuben hears and delivers him from their hands, saying, 'Let us not take his life.'",
      "Presbyterian": "Reuben, the eldest, overhears the plot and attempts to save Joseph by arguing against killing him.",
      "Pentecostal": "Reuben hears, tries to rescue Joseph, says not to kill him.",
      "Episcopalian/Anglican": "Reuben overhears the plot and attempts to rescue Joseph, urging them not to kill him.",
      "Orthodox": "Reuben, the eldest brother, overhears the conspiracy and attempts to intervene to save Joseph, urging them against bloodshed.",
      "Other": "When Reuben heard this, he tried to rescue him from their hands. \"Let's not take his life,\" he said.",
      "Prefer not to say": "When Reuben heard this, he tried to rescue him from their hands. \"Let's not take his life,\" he said."
  },
  "22": {
      "General": "\"Don't shed any blood. Throw him into this cistern here in the wilderness, but don't lay a hand on him.\" Reuben said this to rescue him from them and take him back to his father.",
      "Non-Denominational": "\"Don't shed any blood. Throw him into this cistern here in the wilderness, but don't lay a hand on him.\" Reuben said this to rescue him from them and take him back to his father.",
      "Baptist": "Reuben proposes an alternative: avoid shedding blood directly by throwing Joseph into a nearby cistern in the wilderness instead of physically harming him. The narrator reveals Reuben's hidden motive: he planned to rescue Joseph from the pit later and return him safely to Jacob.",
      "Catholic": "Reuben proposes a compromise: 'Shed no blood; cast him into this cistern here in the wilderness, but do not lay a hand upon him.' The narrator clarifies Reuben's ulterior motive: he intended to rescue Joseph from the cistern later and restore him to their father.",
      "Methodist": "Reuben suggests throwing Joseph into a cistern instead ('shed no blood') without harming him directly. His hidden motive is to rescue Joseph later and return him to Jacob.",
      "Lutheran": "Reuben tells them not to shed blood, but to throw him into the pit in the wilderness without laying a hand on him. Reuben intended to rescue him and restore him to his father.",
      "Presbyterian": "Reuben suggests throwing Joseph into a cistern to avoid direct bloodshed, secretly planning to rescue him later and return him to Jacob.",
      "Pentecostal": "Reuben suggests throwing him in cistern, no bloodshed. Secret plan: rescue later, return to Jacob.",
      "Episcopalian/Anglican": "Reuben suggests throwing Joseph into a cistern in the wilderness to avoid bloodshed, intending to rescue him later and return him to Jacob.",
      "Orthodox": "Reuben suggests casting Joseph into a wilderness cistern to avoid direct violence, secretly intending to rescue him later and return him to their father.",
      "Other": "\"Don't shed any blood. Throw him into this cistern here in the wilderness, but don't lay a hand on him.\" Reuben said this to rescue him from them and take him back to his father.",
      "Prefer not to say": "\"Don't shed any blood. Throw him into this cistern here in the wilderness, but don't lay a hand on him.\" Reuben said this to rescue him from them and take him back to his father."
  },
  "23": {
      "General": "So when Joseph came to his brothers, they stripped him of his robe—the ornate robe he was wearing—",
      "Non-Denominational": "So when Joseph came to his brothers, they stripped him of his robe—the ornate robe he was wearing—",
      "Baptist": "When Joseph arrives, his brothers immediately act on their hatred. They seize him and strip off his special robe, the symbol of their father's favoritism that fueled their resentment.",
      "Catholic": "Upon Joseph's arrival, his brothers seize him and strip him of his tunic, specifically mentioning the ornamented robe that Jacob had made for him—the very symbol of the favoritism that provoked their hatred.",
      "Methodist": "When Joseph arrives, they strip him of his special robe.",
      "Lutheran": "When Joseph comes to his brothers, they strip him of his robe, the robe of many colors.",
      "Presbyterian": "When Joseph reaches his brothers, they seize him and strip off his ornamented robe.",
      "Pentecostal": "Joseph arrives, they strip off his special robe.",
      "Episcopalian/Anglican": "When Joseph reaches his brothers, they strip him of his ornamented robe.",
      "Orthodox": "Upon Joseph's arrival, his brothers seize him and forcibly remove his distinctive tunic, the emblem of their father's preference.",
      "Other": "So when Joseph came to his brothers, they stripped him of his robe—the ornate robe he was wearing—",
      "Prefer not to say": "So when Joseph came to his brothers, they stripped him of his robe—the ornate robe he was wearing—"
  },
  "24": {
      "General": "and they took him and threw him into the cistern. The cistern was empty; there was no water in it.",
      "Non-Denominational": "and they took him and threw him into the cistern. The cistern was empty; there was no water in it.",
      "Baptist": "Following Reuben's suggestion (though motivated by malice, not rescue), they throw Joseph into the cistern. The text notes the cistern was empty, containing no water, meaning Joseph wouldn't drown but would be trapped.",
      "Catholic": "They then take Joseph and cast him into the cistern. The narrator emphasizes that the cistern was empty, devoid of water, implying he would not drown but would be left vulnerable.",
      "Methodist": "They throw Joseph into the cistern, which is empty (no water).",
      "Lutheran": "They take him and throw him into the pit. The pit was empty; there was no water in it.",
      "Presbyterian": "They throw Joseph into the cistern, noting it was empty and dry.",
      "Pentecostal": "They throw him in the empty cistern (no water).",
      "Episcopalian/Anglican": "They take Joseph and throw him into the cistern, which is noted as being empty and waterless.",
      "Orthodox": "They then cast Joseph into the cistern, explicitly noting it was empty and contained no water.",
      "Other": "and they took him and threw him into the cistern. The cistern was empty; there was no water in it.",
      "Prefer not to say": "and they took him and threw him into the cistern. The cistern was empty; there was no water in it."
  },
  "25": {
      "General": "As they sat down to eat their meal, they looked up and saw a caravan of Ishmaelites coming from Gilead. Their camels were loaded with spices, balm and myrrh, and they were on their way to take them down to Egypt.",
      "Non-Denominational": "As they sat down to eat their meal, they looked up and saw a caravan of Ishmaelites coming from Gilead. Their camels were loaded with spices, balm and myrrh, and they were on their way to take them down to Egypt.",
      "Baptist": "Callously, the brothers sit down to eat after disposing of Joseph. While eating, they spot a caravan of Ishmaelites (descendants of Abraham through Hagar) approaching from Gilead, carrying valuable goods (spices, balm, myrrh) destined for Egypt.",
      "Catholic": "Having thrown Joseph into the cistern, the brothers casually sit down to eat. Looking up, they see a caravan of Ishmaelites traveling from Gilead towards Egypt, their camels laden with spices, balm, and myrrh—valuable commodities for trade.",
      "Methodist": "The brothers sit down to eat. They see a caravan of Ishmaelites from Gilead heading to Egypt, carrying spices, balm, and myrrh.",
      "Lutheran": "They sit down to eat. They see a caravan of Ishmaelites coming from Gilead, with camels bearing gum, balm, and myrrh, on their way to Egypt.",
      "Presbyterian": "While the brothers are eating, they see a caravan of Ishmaelites from Gilead traveling towards Egypt with valuable cargo (spices, balm, myrrh).",
      "Pentecostal": "Brothers sit to eat, see Ishmaelite caravan from Gilead going to Egypt with spices/balm/myrrh.",
      "Episcopalian/Anglican": "While the brothers sit down to eat, they see a caravan of Ishmaelites from Gilead traveling to Egypt with camels carrying spices, balm, and myrrh.",
      "Orthodox": "As the brothers sit down for a meal, they observe a caravan of Ishmaelites approaching from Gilead en route to Egypt, transporting valuable goods like spices, balm, and myrrh.",
      "Other": "As they sat down to eat their meal, they looked up and saw a caravan of Ishmaelites coming from Gilead. Their camels were loaded with spices, balm and myrrh, and they were on their way to take them down to Egypt.",
      "Prefer not to say": "As they sat down to eat their meal, they looked up and saw a caravan of Ishmaelites coming from Gilead. Their camels were loaded with spices, balm and myrrh, and they were on their way to take them down to Egypt."
  },
  "26": {
      "General": "Judah said to his brothers, \"What will we gain if we kill our brother and cover up his blood?",
      "Non-Denominational": "Judah said to his brothers, \"What will we gain if we kill our brother and cover up his blood?",
      "Baptist": "Seeing the caravan sparks an idea in Judah. He questions the benefit of killing Joseph and concealing the murder, suggesting a different, perhaps less violent but equally cruel, course of action.",
      "Catholic": "Judah addresses his brothers, pragmatically questioning the profit or advantage ('What profit is it?') in killing Joseph and concealing the evidence ('cover up his blood').",
      "Methodist": "Judah proposes a different plan, asking what profit there is in killing Joseph and covering it up.",
      "Lutheran": "Judah asks his brothers what profit there is in killing their brother and concealing his blood.",
      "Presbyterian": "Judah intervenes, questioning the benefit of murdering Joseph and hiding the crime.",
      "Pentecostal": "Judah asks what they gain by killing Joseph and hiding it.",
      "Episcopalian/Anglican": "Judah suggests a different course, asking his brothers what profit there is in killing Joseph and concealing his death.",
      "Orthodox": "Judah addresses his brothers, questioning the utility of murdering Joseph and concealing the act.",
      "Other": "Judah said to his brothers, \"What will we gain if we kill our brother and cover up his blood?",
      "Prefer not to say": "Judah said to his brothers, \"What will we gain if we kill our brother and cover up his blood?"
  },
  "27": {
      "General": "Come, let's sell him to the Ishmaelites and not lay our hands on him; after all, he is our brother, our own flesh and blood.\" His brothers agreed.",
      "Non-Denominational": "Come, let's sell him to the Ishmaelites and not lay our hands on him; after all, he is our brother, our own flesh and blood.\" His brothers agreed.",
      "Baptist": "Judah proposes selling Joseph to the passing Ishmaelites instead. He appeals to their (minimal) sense of kinship ('he is our brother, our own flesh') as a reason not to kill him directly. The other brothers agree to this plan.",
      "Catholic": "Judah proposes selling Joseph to the Ishmaelites, arguing they should not physically harm him ('let not our hand be upon him') because he is, after all, their brother and relative ('our own flesh'). His brothers consent to this alternative plan.",
      "Methodist": "Judah suggests selling Joseph to the Ishmaelites instead, appealing to kinship ('he is our brother') to avoid direct violence. The brothers agree.",
      "Lutheran": "Judah suggests selling him to the Ishmaelites rather than laying hands on him, reasoning he is their brother, their own flesh. His brothers listen to him.",
      "Presbyterian": "Judah proposes selling Joseph to the Ishmaelites, arguing against harming their own brother. The brothers agree to this plan.",
      "Pentecostal": "Judah suggests selling him to Ishmaelites, not harming him (he's their brother). Brothers agree.",
      "Episcopalian/Anglican": "Judah proposes selling Joseph to the Ishmaelites, reasoning they shouldn't harm their own brother. His brothers agree.",
      "Orthodox": "Judah proposes selling Joseph to the Ishmaelites as an alternative to direct violence, appealing to their fraternal bond ('he is our brother, our own flesh'). His brothers concur.",
      "Other": "Come, let's sell him to the Ishmaelites and not lay our hands on him; after all, he is our brother, our own flesh and blood.\" His brothers agreed.",
      "Prefer not to say": "Come, let's sell him to the Ishmaelites and not lay our hands on him; after all, he is our brother, our own flesh and blood.\" His brothers agreed."
  },
  "28": {
      "General": "So when the Midianite merchants came by, his brothers pulled Joseph up out of the cistern and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt.",
      "Non-Denominational": "So when the Midianite merchants came by, his brothers pulled Joseph up out of the cistern and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt.",
      "Baptist": "As Midianite traders (closely related/associated with Ishmaelites in some texts) pass by, the brothers pull Joseph out of the cistern. They sell him to the Ishmaelites for twenty shekels of silver (a common price for a slave). The Ishmaelites then take Joseph down to Egypt.",
      "Catholic": "When Midianite traders pass by (the terms Midianite and Ishmaelite seem used interchangeably here or refer to associated groups in the caravan), the brothers lift Joseph out of the cistern. They sell him for twenty pieces of silver to the Ishmaelites, who subsequently take him to Egypt.",
      "Methodist": "Midianite merchants pass (used interchangeably with Ishmaelites). The brothers pull Joseph from the cistern and sell him for 20 shekels of silver to the Ishmaelites, who take him to Egypt.",
      "Lutheran": "Midianite traders pass by. They pull Joseph out of the pit and sell him for twenty shekels of silver to the Ishmaelites, who take Joseph to Egypt.",
      "Presbyterian": "When Midianite traders (associated with the Ishmaelites) pass, the brothers pull Joseph from the cistern and sell him to the Ishmaelites for twenty shekels of silver. They take him to Egypt.",
      "Pentecostal": "Midianite traders pass. Brothers pull Joseph out, sell him for 20 silver shekels to Ishmaelites, who take him to Egypt.",
      "Episcopalian/Anglican": "As Midianite merchants pass by, the brothers pull Joseph out of the cistern and sell him for twenty shekels of silver to the Ishmaelites, who take him to Egypt.",
      "Orthodox": "When Midianite merchants (possibly part of the larger Ishmaelite caravan) pass, the brothers extract Joseph from the cistern and sell him to the Ishmaelites for twenty shekels of silver. The merchants then transport Joseph to Egypt.",
      "Other": "So when the Midianite merchants came by, his brothers pulled Joseph up out of the cistern and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt.",
      "Prefer not to say": "So when the Midianite merchants came by, his brothers pulled Joseph up out of the cistern and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
  },
  "29": {
      "General": "When Reuben returned to the cistern and saw that Joseph was not there, he tore his clothes.",
      "Non-Denominational": "When Reuben returned to the cistern and saw that Joseph was not there, he tore his clothes.",
      "Baptist": "Reuben, apparently absent during the sale (perhaps having gone off intending to rescue Joseph later), returns to the cistern. Finding Joseph gone, he expresses extreme grief and distress by tearing his clothes, a traditional sign of mourning or anguish.",
      "Catholic": "Reuben, who seems to have been absent when Joseph was sold, returns to the cistern. Discovering Joseph missing, he tears his garments, a conventional expression of profound grief or distress.",
      "Methodist": "Reuben returns to the cistern (apparently absent during the sale) and finds Joseph gone. He tears his clothes in distress.",
      "Lutheran": "Reuben returns to the pit, sees Joseph is not there, and tears his clothes.",
      "Presbyterian": "Reuben, who was apparently absent during the sale, returns to the cistern. Finding it empty, he tears his clothes in anguish.",
      "Pentecostal": "Reuben returns, finds Joseph gone, tears clothes.",
      "Episcopalian/Anglican": "When Reuben returns to the cistern and finds Joseph missing, he tears his clothes in distress.",
      "Orthodox": "Reuben, evidently absent during the transaction, returns to the cistern. Upon finding Joseph gone, he rends his garments as a sign of deep mourning.",
      "Other": "When Reuben returned to the cistern and saw that Joseph was not there, he tore his clothes.",
      "Prefer not to say": "When Reuben returned to the cistern and saw that Joseph was not there, he tore his clothes."
  },
  "30": {
      "General": "He went back to his brothers and said, \"The boy isn't there! Where can I turn now?\"",
      "Non-Denominational": "He went back to his brothers and said, \"The boy isn't there! Where can I turn now?\"",
      "Baptist": "Reuben goes back to his brothers, distraught, exclaiming that the boy (Joseph) is gone and expressing his own despair and perhaps fear of facing their father: 'Where can I go?'",
      "Catholic": "He returns to his brothers in anguish, crying out, 'The boy is gone! And I, where shall I go?' His words convey both shock at Joseph's disappearance and personal despair, possibly reflecting his responsibility as the eldest.",
      "Methodist": "Reuben returns to his brothers, distressed, saying Joseph is gone and expressing despair ('Where can I go?').",
      "Lutheran": "He returns to his brothers and says, 'The boy is gone, and I, where shall I go?'",
      "Presbyterian": "Reuben returns to his brothers in distress, lamenting Joseph's disappearance and his own predicament.",
      "Pentecostal": "Reuben returns to brothers, distressed: 'The boy is gone! What do I do?'",
      "Episcopalian/Anglican": "Reuben goes back to his brothers, distraught, asking what he should do now that Joseph is gone.",
      "Orthodox": "Returning to his brothers, Reuben expresses his dismay: 'The child is missing! And I, where can I turn?'",
      "Other": "He went back to his brothers and said, \"The boy isn't there! Where can I turn now?\"",
      "Prefer not to say": "He went back to his brothers and said, \"The boy isn't there! Where can I turn now?\""
  },
  "31": {
      "General": "Then they got Joseph's robe, slaughtered a goat and dipped the robe in the blood.",
      "Non-Denominational": "Then they got Joseph's robe, slaughtered a goat and dipped the robe in the blood.",
      "Baptist": "The brothers proceed with their plan to deceive Jacob. They take Joseph's special robe, kill a male goat, and dip the robe in its blood.",
      "Catholic": "The brothers carry out their deceptive plan. They take Joseph's tunic, slaughter a male goat, and dip the tunic in the goat's blood.",
      "Methodist": "They take Joseph's robe, slaughter a goat, and dip the robe in its blood.",
      "Lutheran": "They take Joseph's robe, slaughter a male goat, and dip the robe in the blood.",
      "Presbyterian": "The brothers take Joseph's robe, kill a goat, and smear the robe with its blood.",
      "Pentecostal": "They take Joseph's robe, kill a goat, dip robe in blood.",
      "Episcopalian/Anglican": "The brothers take Joseph's robe, kill a goat, and dip the robe in the blood.",
      "Orthodox": "The brothers retrieve Joseph's tunic, slaughter a goat, and immerse the garment in its blood.",
      "Other": "Then they got Joseph's robe, slaughtered a goat and dipped the robe in the blood.",
      "Prefer not to say": "Then they got Joseph's robe, slaughtered a goat and dipped the robe in the blood."
  },
  "32": {
      "General": "They took the ornate robe back to their father and said, \"We found this. Examine it to see whether it is your son's robe.\"",
      "Non-Denominational": "They took the ornate robe back to their father and said, \"We found this. Examine it to see whether it is your son's robe.\"",
      "Baptist": "They bring the blood-stained robe back to their father Jacob, feigning ignorance: 'We found this. Please examine it; is this your son's robe or not?'",
      "Catholic": "They bring the ornamented tunic, now bloodied, to their father Jacob and present it with feigned innocence: 'We found this. Please identify whether it is your son's tunic or not.'",
      "Methodist": "They take the bloodied robe to Jacob, pretending they found it and asking him to identify it.",
      "Lutheran": "They send the robe of many colors to their father, saying, 'This we have found. Please identify whether it is your son's robe or not.'",
      "Presbyterian": "They present the bloodied robe to Jacob, pretending to have found it and asking him to identify it.",
      "Pentecostal": "They take robe to Jacob, pretend they found it, ask him to identify it.",
      "Episcopalian/Anglican": "They bring the blood-stained robe to Jacob, claiming to have found it and asking him to identify if it is Joseph's.",
      "Orthodox": "They present the blood-soaked tunic to their father, Jacob, disingenuously claiming to have found it and requesting him to identify if it belongs to his son.",
      "Other": "They took the ornate robe back to their father and said, \"We found this. Examine it to see whether it is your son's robe.\"",
      "Prefer not to say": "They took the ornate robe back to their father and said, \"We found this. Examine it to see whether it is your son's robe.\""
  },
  "33": {
      "General": "He recognized it and said, \"It is my son's robe! Some ferocious animal has devoured him. Joseph has surely been torn to pieces.\"",
      "Non-Denominational": "He recognized it and said, \"It is my son's robe! Some ferocious animal has devoured him. Joseph has surely been torn to pieces.\"",
      "Baptist": "Jacob immediately recognizes the robe and jumps to the conclusion his sons intended: a wild animal attacked and killed Joseph. His grief-stricken words confirm his belief: 'Joseph has surely been torn to pieces!'",
      "Catholic": "Jacob recognizes the tunic instantly and accepts the fabricated story, concluding in anguish: 'It is my son's tunic! A fierce animal has devoured him; Joseph is without doubt torn to pieces!'",
      "Methodist": "Jacob recognizes the robe and concludes a wild animal killed Joseph, crying out that Joseph has been torn to pieces.",
      "Lutheran": "He identifies it and says, 'It is my son's robe. A fierce animal has devoured him. Joseph is without doubt torn to pieces.'",
      "Presbyterian": "Jacob recognizes the robe and assumes the worst, believing Joseph was killed by a wild animal.",
      "Pentecostal": "Jacob recognizes it, concludes wild animal killed Joseph.",
      "Episcopalian/Anglican": "Jacob recognizes the robe and concludes in anguish that a wild animal has killed Joseph.",
      "Orthodox": "Jacob identifies the garment and immediately assumes the fabricated scenario: 'It is my son's tunic! A savage beast has devoured him; Joseph has surely been torn apart!'",
      "Other": "He recognized it and said, \"It is my son's robe! Some ferocious animal has devoured him. Joseph has surely been torn to pieces.\"",
      "Prefer not to say": "He recognized it and said, \"It is my son's robe! Some ferocious animal has devoured him. Joseph has surely been torn to pieces.\""
  },
  "34": {
      "General": "Then Jacob tore his clothes, put on sackcloth and mourned for his son many days.",
      "Non-Denominational": "Then Jacob tore his clothes, put on sackcloth and mourned for his son many days.",
      "Baptist": "In deep mourning, Jacob performs traditional rites of grief: tearing his clothes and putting on sackcloth (rough cloth worn as a sign of mourning or repentance). He mourns for Joseph for an extended period ('many days').",
      "Catholic": "Overcome with grief, Jacob tears his garments, puts on sackcloth (a coarse material worn in mourning), and mourns for his son Joseph for a prolonged time ('many days').",
      "Methodist": "Jacob tears his clothes, puts on sackcloth, and mourns for Joseph for many days.",
      "Lutheran": "Jacob tears his garments, puts sackcloth on his loins, and mourns for his son many days.",
      "Presbyterian": "Jacob expresses deep grief by tearing his clothes, wearing sackcloth, and mourning for Joseph for a long time.",
      "Pentecostal": "Jacob tears clothes, wears sackcloth, mourns many days.",
      "Episcopalian/Anglican": "Jacob tears his clothes, puts on sackcloth, and mourns for Joseph for many days.",
      "Orthodox": "Jacob engages in customary acts of mourning: rending his clothes, donning sackcloth, and lamenting for his son for an extended duration.",
      "Other": "Then Jacob tore his clothes, put on sackcloth and mourned for his son many days.",
      "Prefer not to say": "Then Jacob tore his clothes, put on sackcloth and mourned for his son many days."
  },
  "35": {
      "General": "All his sons and daughters came to comfort him, but he refused to be comforted. \"No,\" he said, \"I will continue to mourn until I join my son in the grave.\" So his father wept for him.",
      "Non-Denominational": "All his sons and daughters came to comfort him, but he refused to be comforted. \"No,\" he said, \"I will continue to mourn until I join my son in the grave.\" So his father wept for him.",
      "Baptist": "Jacob's entire family, including his sons (the perpetrators) and daughters (Dinah is mentioned earlier), try to comfort him, but his grief is inconsolable. He refuses comfort, declaring his intention to mourn until his own death, when he expects to join Joseph in Sheol (the grave, the realm of the dead). The verse ends emphasizing Jacob's continued weeping for Joseph.",
      "Catholic": "All of Jacob's other children (sons and daughters) attempt to console him, but he refuses all comfort. He expresses the depth of his grief by declaring his intention to mourn until he descends to Sheol (the abode of the dead) to be with his son. The passage underscores his profound sorrow: 'Thus his father wept for him.'",
      "Methodist": "His other sons and daughters try to comfort Jacob, but he refuses, saying he will mourn until he goes down to Sheol (the grave) to Joseph. He continues weeping.",
      "Lutheran": "All his sons and daughters arise to comfort him, but he refuses comfort, saying he will go down to Sheol to his son, mourning. Thus his father weeps for him.",
      "Presbyterian": "Despite attempts by his other children to comfort him, Jacob remains inconsolable, vowing to mourn Joseph until his own death. He continues to weep.",
      "Pentecostal": "All children try to comfort Jacob, but he refuses, says he'll mourn until death (Sheol). He keeps weeping.",
      "Episcopalian/Anglican": "Jacob's sons and daughters attempt to comfort him, but he refuses, vowing to mourn until he joins Joseph in Sheol (the grave). Jacob continues to weep.",
      "Orthodox": "Although all his sons and daughters endeavor to console him, Jacob rejects their comfort, avowing to mourn until he descends to Sheol to join his son. His profound weeping persists.",
      "Other": "All his sons and daughters came to comfort him, but he refused to be comforted. \"No,\" he said, \"I will continue to mourn until I join my son in the grave.\" So his father wept for him.",
      "Prefer not to say": "All his sons and daughters came to comfort him, but he refused to be comforted. \"No,\" he said, \"I will continue to mourn until I join my son in the grave.\" So his father wept for him."
  },
  "36": {
      "General": "Meanwhile, the Midianites sold Joseph in Egypt to Potiphar, one of Pharaoh's officials, the captain of the guard.",
      "Non-Denominational": "Meanwhile, the Midianites sold Joseph in Egypt to Potiphar, one of Pharaoh's officials, the captain of the guard.",
      "Baptist": "The narrative shifts back to Joseph's fate. The Midianites (here seemingly synonymous with or closely linked to the Ishmaelites who bought him) sell Joseph upon arrival in Egypt. His buyer is Potiphar, an important Egyptian official serving Pharaoh, specifically identified as the captain of the guard.",
      "Catholic": "The scene shifts to Egypt. The Midianites (or Medanites, possibly another term for the same caravan traders) sell Joseph in Egypt to Potiphar. Potiphar is identified as an officer of Pharaoh and the captain of the royal guard.",
      "Methodist": "Meanwhile, the Midianites (or Ishmaelites) sell Joseph in Egypt to Potiphar, who is an official of Pharaoh and captain of the guard.",
      "Lutheran": "The Midianites sell him in Egypt to Potiphar, an officer of Pharaoh, the captain of the guard.",
      "Presbyterian": "The narrative follows Joseph to Egypt, where the Midianites sell him to Potiphar, one of Pharaoh's officials and captain of the guard.",
      "Pentecostal": "Midianites sell Joseph in Egypt to Potiphar, Pharaoh's official, captain of the guard.",
      "Episcopalian/Anglican": "The Midianites sell Joseph in Egypt to Potiphar, an officer of Pharaoh and captain of the guard.",
      "Orthodox": "Concluding the chapter, the narrative follows Joseph to Egypt, where the Midianites sell him to Potiphar, an official in Pharaoh's court holding the position of captain of the guard.",
      "Other": "Meanwhile, the Midianites sold Joseph in Egypt to Potiphar, one of Pharaoh's officials, the captain of the guard.",
      "Prefer not to say": "Meanwhile, the Midianites sold Joseph in Egypt to Potiphar, one of Pharaoh's officials, the captain of the guard."
    }
  }
} 