{
  "_comment": "Interpretations for Genesis Chapter 38",
  "book": "Genesis",
  "chapter": "38",
  "verses": {
  "1": {
      "General": "At that time, Judah left his brothers and went down to stay with a man of Adullam named Hirah.",
      "Non-Denominational": "At that time, Judah left his brothers and went down to stay with a man of Adullam named Hirah.",
      "Baptist": "The narrative temporarily shifts focus from Joseph to Judah. Around this time, Judah physically separates himself from his brothers and goes down (geographically) to associate with an Adullamite man named Hirah.",
      "Catholic": "The narrative interrupts the Joseph story to recount events concerning Judah. At about that time, Judah separates from his brothers and goes down to the region of Adullam, forming a friendship or association with an Adullamite named Hirah.",
      "Methodist": "The story shifts to Judah. He separates from his brothers and goes to stay with an Adullamite named Hirah.",
      "Lutheran": "At that time, Judah went down from his brothers and turned aside to an Adullamite man named Hirah.",
      "Presbyterian": "Interrupting the Joseph narrative, the focus shifts to Judah, who separates from his brothers and associates with Hirah, an Adullamite.",
      "Pentecostal": "Judah leaves his brothers, stays with Hirah the Adullamite.",
      "Episcopalian/Anglican": "The narrative shifts focus to Judah, who separates from his brothers and goes down to stay with Hirah, an Adullamite.",
      "Orthodox": "The narrative digresses to focus on Judah. At this juncture, Judah distances himself from his brothers and forms an association with an Adullamite named Hirah.",
      "Other": "At that time, Judah left his brothers and went down to stay with a man of Adullam named Hirah.",
      "Prefer not to say": "At that time, Judah left his brothers and went down to stay with a man of Adullam named Hirah."
  },
  "2": {
      "General": "There Judah met the daughter of a Canaanite man named Shua. He married her and made love to her;",
      "Non-Denominational": "There Judah met the daughter of a Canaanite man named Shua. He married her and made love to her;",
      "Baptist": "In Adullam, Judah sees and marries the daughter of a Canaanite man named Shua. This marriage to a Canaanite contrasts with the patriarchal practice emphasized earlier (e.g., Gen 24, 28:1).",
      "Catholic": "While there, Judah encounters the daughter of a Canaanite man named Shua. He takes her as his wife and consummates the marriage.",
      "Methodist": "Judah sees and marries the daughter of a Canaanite named Shua.",
      "Lutheran": "Judah sees the daughter of a Canaanite man named Shua, takes her, and goes in to her.",
      "Presbyterian": "Judah marries the daughter of Shua, a Canaanite man, deviating from patriarchal tradition.",
      "Pentecostal": "Judah marries the daughter of Shua, a Canaanite.",
      "Episcopalian/Anglican": "Judah meets and marries the daughter of Shua, a Canaanite man.",
      "Orthodox": "Judah encounters and marries the daughter of a Canaanite named Shua, engaging in marital relations with her.",
      "Other": "There Judah met the daughter of a Canaanite man named Shua. He married her and made love to her;",
      "Prefer not to say": "There Judah met the daughter of a Canaanite man named Shua. He married her and made love to her;"
  },
  "3": {
      "General": "she became pregnant and gave birth to a son, who was named Er.",
      "Non-Denominational": "she became pregnant and gave birth to a son, who was named Er.",
      "Baptist": "Judah's Canaanite wife conceives and bears their first son, whom Judah names Er.",
      "Catholic": "She conceives and gives birth to a son, and Judah names him Er.",
      "Methodist": "She conceives and bears a son, named Er.",
      "Lutheran": "She conceives and bears a son, and he calls his name Er.",
      "Presbyterian": "His wife bears a son named Er.",
      "Pentecostal": "She bears a son, named Er.",
      "Episcopalian/Anglican": "She conceives and bears a son, whom Judah names Er.",
      "Orthodox": "She conceives and gives birth to a son, whom Judah names Er.",
      "Other": "she became pregnant and gave birth to a son, who was named Er.",
      "Prefer not to say": "she became pregnant and gave birth to a son, who was named Er."
  },
  "4": {
      "General": "She conceived again and gave birth to a son and named him Onan.",
      "Non-Denominational": "She conceived again and gave birth to a son and named him Onan.",
      "Baptist": "She conceives again and bears a second son. This time, she (the mother) names him Onan.",
      "Catholic": "She conceives again and bears another son, whom she names Onan.",
      "Methodist": "She conceives again and bears a second son, naming him Onan.",
      "Lutheran": "She conceives again and bears a son, and calls his name Onan.",
      "Presbyterian": "She bears a second son named Onan.",
      "Pentecostal": "She bears a second son, named Onan.",
      "Episcopalian/Anglican": "She conceives again and bears a son, naming him Onan.",
      "Orthodox": "She conceives again and gives birth to another son, naming him Onan.",
      "Other": "She conceived again and gave birth to a son and named him Onan.",
      "Prefer not to say": "She conceived again and gave birth to a son and named him Onan."
  },
  "5": {
      "General": "She gave birth to still another son and named him Shelah. It was at Kezib that she gave birth to him.",
      "Non-Denominational": "She gave birth to still another son and named him Shelah. It was at Kezib that she gave birth to him.",
      "Baptist": "She bears a third son, whom she names Shelah. The text notes that Judah was at Kezib (a location near Adullam) when Shelah was born.",
      "Catholic": "She bears a third son and names him Shelah. The birth takes place while Judah is at Chezib (Kezib).",
      "Methodist": "She bears a third son, Shelah. Judah was at Kezib when he was born.",
      "Lutheran": "She bears another son and calls his name Shelah. Judah was at Chezib when she bore him.",
      "Presbyterian": "She bears a third son, Shelah. The birth occurred while Judah was at Kezib.",
      "Pentecostal": "She bears a third son, Shelah, at Kezib.",
      "Episcopalian/Anglican": "She bears a third son, named Shelah. Judah was at Kezib at the time of his birth.",
      "Orthodox": "She gives birth to a third son, naming him Shelah. This birth occurred while Judah was at Chezib.",
      "Other": "She gave birth to still another son and named him Shelah. It was at Kezib that she gave birth to him.",
      "Prefer not to say": "She gave birth to still another son and named him Shelah. It was at Kezib that she gave birth to him."
  },
  "6": {
      "General": "Judah got a wife for Er, his firstborn, and her name was Tamar.",
      "Non-Denominational": "Judah got a wife for Er, his firstborn, and her name was Tamar.",
      "Baptist": "Judah arranges a marriage for his firstborn son, Er. The wife chosen for him is named Tamar.",
      "Catholic": "Judah selects a wife for his firstborn son, Er. Her name is Tamar.",
      "Methodist": "Judah arranges a marriage for his firstborn son, Er, to a woman named Tamar.",
      "Lutheran": "Judah takes a wife for Er his firstborn; her name was Tamar.",
      "Presbyterian": "Judah selects a wife named Tamar for his firstborn son, Er.",
      "Pentecostal": "Judah gets a wife, Tamar, for his firstborn Er.",
      "Episcopalian/Anglican": "Judah finds a wife named Tamar for his firstborn son, Er.",
      "Orthodox": "Judah arranges a marriage for his firstborn son, Er, selecting a woman named Tamar.",
      "Other": "Judah got a wife for Er, his firstborn, and her name was Tamar.",
      "Prefer not to say": "Judah got a wife for Er, his firstborn, and her name was Tamar."
  },
  "7": {
      "General": "But Er, Judah's firstborn, was wicked in the Lord's sight; so the Lord put him to death.",
      "Non-Denominational": "But Er, Judah's firstborn, was wicked in the Lord's sight; so the Lord put him to death.",
      "Baptist": "Er, Judah's firstborn, is described as wicked in God's sight. Consequently, the Lord causes his premature death. The specific nature of his wickedness is not detailed.",
      "Catholic": "Er, Judah's firstborn, proves to be wicked in the estimation of the LORD, resulting in the LORD causing his death. The specific sin is not mentioned.",
      "Methodist": "Er is wicked in the Lord's sight, so the Lord causes his death.",
      "Lutheran": "Er, Judah's firstborn, was wicked in the sight of the Lord, and the Lord put him to death.",
      "Presbyterian": "Er's wickedness displeases God, leading to his premature death.",
      "Pentecostal": "Er was wicked; the Lord put him to death.",
      "Episcopalian/Anglican": "Er, Judah's firstborn, was wicked in God's sight, leading God to cause his death.",
      "Orthodox": "Er, Judah's firstborn, is deemed wicked by the LORD, who consequently ends his life. The nature of his wickedness remains unspecified.",
      "Other": "But Er, Judah's firstborn, was wicked in the Lord's sight; so the Lord put him to death.",
      "Prefer not to say": "But Er, Judah's firstborn, was wicked in the Lord's sight; so the Lord put him to death."
  },
  "8": {
      "General": "Then Judah said to Onan, \"Sleep with your brother's wife and fulfill your duty to her as a brother-in-law to raise up offspring for your brother.\"",
      "Non-Denominational": "Then Judah said to Onan, \"Sleep with your brother's wife and fulfill your duty to her as a brother-in-law to raise up offspring for your brother.\"",
      "Baptist": "Judah instructs his second son, Onan, to perform the duty of a levirate marriage (from Latin 'levir', husband's brother). This custom required a brother to marry his deceased brother's childless widow to provide an heir for the dead brother, thus preserving his name and lineage.",
      "Catholic": "Judah instructs his second son, Onan, to perform the duty of a levirate marriage (from Latin 'levir' meaning 'husband's brother'). This involved marrying the widow of his deceased brother (Tamar) in order to produce offspring who would be legally considered the heir of the dead brother, Er.",
      "Methodist": "Judah instructs Onan to perform the duty of a levir (brother-in-law) by marrying Tamar (Er's widow) to produce offspring in Er's name.",
      "Lutheran": "Judah tells Onan to go in to his brother's wife and perform the duty of a brother-in-law to her, raising up offspring for his brother.",
      "Presbyterian": "Judah instructs Onan to perform the levirate duty: marry Tamar, his brother's widow, to provide an heir for Er.",
      "Pentecostal": "Judah tells Onan to marry Tamar (brother's widow) and give offspring for Er (levirate duty).",
      "Episcopalian/Anglican": "Judah instructs Onan to perform the duty of a brother-in-law (levirate marriage) by marrying Tamar and raising offspring for his deceased brother Er.",
      "Orthodox": "Judah directs Onan to fulfill the obligation of a levirate marriage by uniting with Tamar, his deceased brother's widow, to produce an heir in Er's name.",
      "Other": "Then Judah said to Onan, \"Sleep with your brother's wife and fulfill your duty to her as a brother-in-law to raise up offspring for your brother.\"",
      "Prefer not to say": "Then Judah said to Onan, \"Sleep with your brother's wife and fulfill your duty to her as a brother-in-law to raise up offspring for your brother.\""
  },
  "9": {
      "General": "But Onan knew that the child would not be his; so whenever he slept with his brother's wife, he spilled his semen on the ground to keep from providing offspring for his brother.",
      "Non-Denominational": "But Onan knew that the child would not be his; so whenever he slept with his brother's wife, he spilled his semen on the ground to keep from providing offspring for his brother.",
      "Baptist": "Onan complies with the marriage but deliberately avoids fulfilling its purpose. Knowing any child born would be considered Er's heir, not his own, he practices coitus interruptus, spilling his semen on the ground each time he lies with Tamar, to prevent conception.",
      "Catholic": "Onan understands that any resulting offspring would not carry his name but his deceased brother's. Therefore, although he engages in intercourse with Tamar, he deliberately prevents conception by spilling his semen on the ground, thus refusing to fulfill the levirate duty.",
      "Methodist": "Onan knows the child wouldn't be legally his, only Er's. So, he sleeps with Tamar but spills his semen on the ground to avoid conception and prevent raising offspring for his brother.",
      "Lutheran": "Onan knows the offspring would not be his. So, whenever he goes in to his brother's wife, he wastes the semen on the ground, so as not to give offspring to his brother.",
      "Presbyterian": "Onan, knowing the child would not be counted as his heir, marries Tamar but deliberately avoids impregnating her by spilling his semen.",
      "Pentecostal": "Onan knows child wouldn't be his, so he sleeps with Tamar but spills semen to prevent offspring for Er.",
      "Episcopalian/Anglican": "Onan, knowing the offspring wouldn't be counted as his, spills his semen on the ground whenever he lies with Tamar, to avoid providing offspring for his brother.",
      "Orthodox": "Aware that any offspring would be attributed to his deceased brother, Onan engages in marital relations with Tamar but deliberately prevents conception by spilling his semen, thereby circumventing the levirate obligation.",
      "Other": "But Onan knew that the child would not be his; so whenever he slept with his brother's wife, he spilled his semen on the ground to keep from providing offspring for his brother.",
      "Prefer not to say": "But Onan knew that the child would not be his; so whenever he slept with his brother's wife, he spilled his semen on the ground to keep from providing offspring for his brother."
  },
  "10": {
      "General": "What he did was wicked in the Lord's sight; so the Lord put him to death also.",
      "Non-Denominational": "What he did was wicked in the Lord's sight; so the Lord put him to death also.",
      "Baptist": "Onan's action (specifically, his selfish refusal to fulfill his duty to his deceased brother and perpetuate his line) is deemed wicked by God. As a consequence, God also causes Onan's death.",
      "Catholic": "This action by Onan is deemed wicked in the sight of the LORD because it represents a selfish refusal to honor his deceased brother and fulfill a crucial family obligation. Consequently, the LORD causes Onan's death as well.",
      "Methodist": "Onan's act (refusing to provide offspring for his dead brother) was wicked in God's sight, so God also caused his death.",
      "Lutheran": "What he did was wicked in the sight of the Lord, and he put him to death also.",
      "Presbyterian": "God considers Onan's refusal to fulfill the levirate duty wicked, and Onan also dies prematurely.",
      "Pentecostal": "What Onan did was wicked; the Lord put him to death too.",
      "Episcopalian/Anglican": "Onan's action was wicked in God's sight, so God caused his death as well.",
      "Orthodox": "Onan's refusal to fulfill this familial duty is considered wicked by the LORD, resulting in his death as well.",
      "Other": "What he did was wicked in the Lord's sight; so the Lord put him to death also.",
      "Prefer not to say": "What he did was wicked in the Lord's sight; so the Lord put him to death also."
  },
  "11": {
      "General": "Judah then said to his daughter-in-law Tamar, \"Live as a widow in your father's house until my son Shelah grows up.\" For he thought, \"He may die too, just like his brothers.\" So Tamar went to live in her father's house.",
      "Non-Denominational": "Judah then said to his daughter-in-law Tamar, \"Live as a widow in your father's house until my son Shelah grows up.\" For he thought, \"He may die too, just like his brothers.\" So Tamar went to live in her father's house.",
      "Baptist": "With both Er and Onan dead, Judah instructs Tamar to return to her father's house and remain a widow until his youngest son, Shelah, is old enough to marry her (implying a continuation of the levirate obligation). However, the text reveals Judah's fear: he secretly worries Shelah might also die if married to Tamar, suggesting he perhaps blamed her for his sons' deaths. Tamar obeys and returns home.",
      "Catholic": "Judah instructs his daughter-in-law Tamar to return to her paternal home and remain a widow there until his third son, Shelah, matures. The narrator reveals Judah's underlying fear: he suspected Tamar might be somehow responsible for his sons' deaths and feared Shelah would suffer the same fate ('lest he die like his brothers'). Tamar complies and returns to her father's house.",
      "Methodist": "Judah tells Tamar to live as a widow in her father's house until Shelah grows up. Judah secretly fears Shelah will also die like his brothers (possibly blaming Tamar). Tamar returns home.",
      "Lutheran": "Judah tells his daughter-in-law Tamar to remain a widow in her father's house until Shelah his son grows up, fearing Shelah might die like his brothers. So Tamar lives in her father's house.",
      "Presbyterian": "Judah instructs Tamar to return to her father's house until Shelah is grown, secretly fearing Shelah might also die if he marries her. Tamar obeys.",
      "Pentecostal": "Judah tells Tamar go home, wait for Shelah. He fears Shelah might die too. Tamar goes home.",
      "Episcopalian/Anglican": "Judah tells Tamar to return to her father's house as a widow until Shelah grows up, fearing Shelah might also die like his brothers. Tamar returns home.",
      "Orthodox": "Judah directs Tamar to return to her father's household and remain a widow until his youngest son, Shelah, reaches maturity. However, Judah harbors a fear that Shelah might also perish like his brothers, perhaps associating Tamar with their deaths. Tamar complies.",
      "Other": "Judah then said to his daughter-in-law Tamar, \"Live as a widow in your father's house until my son Shelah grows up.\" For he thought, \"He may die too, just like his brothers.\" So Tamar went to live in her father's house.",
      "Prefer not to say": "Judah then said to his daughter-in-law Tamar, \"Live as a widow in your father's house until my son Shelah grows up.\" For he thought, \"He may die too, just like his brothers.\" So Tamar went to live in her father's house."
  },
  "12": {
      "General": "After a long time Judah's wife, the daughter of Shua, died. When Judah was comforted, he went up to Timnah to see his sheepshearers, taking his friend Hirah the Adullamite with him.",
      "Non-Denominational": "After a long time Judah's wife, the daughter of Shua, died. When Judah was comforted, he went up to Timnah to see his sheepshearers, taking his friend Hirah the Adullamite with him.",
      "Baptist": "Time passes, and Judah's Canaanite wife (Shua's daughter) dies. After the period of mourning ('when Judah was comforted'), he travels up to Timnah, likely for the festive occasion of sheep shearing, accompanied by his Adullamite friend Hirah.",
      "Catholic": "A considerable time passes ('in the course of time'), and Judah's wife, the daughter of Shua, dies. After the mourning period concludes ('Judah was comforted'), he goes up to Timnah for the sheep shearing, a typically festive event, accompanied by his friend Hirah the Adullamite.",
      "Methodist": "After a long time, Judah's wife (daughter of Shua) dies. After his mourning, Judah goes up to Timnah for sheep shearing with his friend Hirah.",
      "Lutheran": "After many days, the daughter of Shua, Judah's wife, dies. When Judah is comforted, he goes up to Timnah to his sheepshearers, he and his friend Hirah the Adullamite.",
      "Presbyterian": "Years later, Judah's wife dies. After mourning, Judah travels to Timnah for the sheep shearing festival with his friend Hirah.",
      "Pentecostal": "After long time, Judah's wife dies. After mourning, Judah goes to Timnah for sheep shearing with Hirah.",
      "Episcopalian/Anglican": "After a long time, Judah's wife (daughter of Shua) dies. After mourning, Judah goes up to Timnah for the sheep shearing, accompanied by his friend Hirah the Adullamite.",
      "Orthodox": "After a significant period, Judah's wife (the daughter of Shua) passes away. Following the customary mourning period, Judah travels to Timnah for the sheep shearing festival, accompanied by his friend Hirah the Adullamite.",
      "Other": "After a long time Judah's wife, the daughter of Shua, died. When Judah was comforted, he went up to Timnah to see his sheepshearers, taking his friend Hirah the Adullamite with him.",
      "Prefer not to say": "After a long time Judah's wife, the daughter of Shua, died. When Judah was comforted, he went up to Timnah to see his sheepshearers, taking his friend Hirah the Adullamite with him."
  },
  "13": {
      "General": "When Tamar was told, \"Your father-in-law is on his way to Timnah to shear his sheep,\"",
      "Non-Denominational": "When Tamar was told, \"Your father-in-law is on his way to Timnah to shear his sheep,\"",
      "Baptist": "Tamar, still living as a widow in her father's house, receives news that her father-in-law, Judah, is traveling to Timnah for the sheep shearing.",
      "Catholic": "Tamar receives word that her father-in-law, Judah, is going up to Timnah for the sheep shearing.",
      "Methodist": "Tamar is informed that Judah is going to Timnah for sheep shearing.",
      "Lutheran": "Tamar is told her father-in-law is going up to Timnah to shear his sheep.",
      "Presbyterian": "Tamar learns that Judah is traveling to Timnah for sheep shearing.",
      "Pentecostal": "Tamar hears Judah is going to Timnah to shear sheep.",
      "Episcopalian/Anglican": "Tamar is informed that her father-in-law Judah is going to Timnah for sheep shearing.",
      "Orthodox": "Tamar receives intelligence that her father-in-law, Judah, is journeying to Timnah for the sheep shearing.",
      "Other": "When Tamar was told, \"Your father-in-law is on his way to Timnah to shear his sheep,\"",
      "Prefer not to say": "When Tamar was told, \"Your father-in-law is on his way to Timnah to shear his sheep,\""
  },
  "14": {
      "General": "she took off her widow's clothes, covered herself with a veil to disguise herself, and then sat down at the entrance to Enaim, which is on the road to Timnah. For she saw that, though Shelah had now grown up, she had not been given to him as his wife.",
      "Non-Denominational": "she took off her widow's clothes, covered herself with a veil to disguise herself, and then sat down at the entrance to Enaim, which is on the road to Timnah. For she saw that, though Shelah had now grown up, she had not been given to him as his wife.",
      "Baptist": "Realizing Judah has failed to fulfill his promise (Shelah is grown, but she hasn't been given to him), Tamar takes action. She removes her widow's garments, disguises herself by covering her face with a veil (similar to a prostitute's attire in that context), and positions herself strategically at the entrance of Enaim, a town on the road to Timnah.",
      "Catholic": "Recognizing that Shelah has matured but Judah has not fulfilled his promise to give her to him in marriage, Tamar devises a plan. She removes her widow's attire, disguises herself by covering her face with a veil (which could signify a prostitute in that setting), and sits at the entrance of Enaim, located along the route to Timnah.",
      "Methodist": "Tamar realizes Judah hasn't given her to Shelah, who is now grown. She takes off her widow's clothes, veils herself as a disguise (like a prostitute), and sits by the road to Timnah at Enaim.",
      "Lutheran": "She takes off her widow's garments, covers herself with a veil, wraps herself up, and sits at the entrance to Enaim on the road to Timnah. She realizes Shelah is grown, yet she has not been given to him in marriage.",
      "Presbyterian": "Realizing Judah has broken his promise regarding Shelah, Tamar disguises herself by removing her widow's clothes and wearing a veil, then sits by the road to Timnah at Enaim.",
      "Pentecostal": "Tamar realizes Judah broke promise about Shelah. She removes widow's clothes, veils self, sits at Enaim entrance on Timnah road.",
      "Episcopalian/Anglican": "Tamar, seeing that Shelah is grown but she hasn't been given to him as wife, removes her widow's clothes, disguises herself with a veil, and sits at the entrance to Enaim on the road to Timnah.",
      "Orthodox": "Perceiving that Shelah has matured yet she has not been given to him in marriage as promised, Tamar removes her widow's attire, disguises herself with a veil, and positions herself at the entrance of Enaim along the path to Timnah.",
      "Other": "she took off her widow's clothes, covered herself with a veil to disguise herself, and then sat down at the entrance to Enaim, which is on the road to Timnah. For she saw that, though Shelah had now grown up, she had not been given to him as his wife.",
      "Prefer not to say": "she took off her widow's clothes, covered herself with a veil to disguise herself, and then sat down at the entrance to Enaim, which is on the road to Timnah. For she saw that, though Shelah had now grown up, she had not been given to him as his wife."
  },
  "15": {
      "General": "When Judah saw her, he thought she was a prostitute, for she had covered her face.",
      "Non-Denominational": "When Judah saw her, he thought she was a prostitute, for she had covered her face.",
      "Baptist": "Judah sees the veiled woman by the roadside and, because her face is covered, mistakes her for a prostitute.",
      "Catholic": "Seeing Tamar veiled, Judah fails to recognize her and mistakes her for a prostitute, as prostitutes in that culture might cover their faces.",
      "Methodist": "Judah sees Tamar but doesn't recognize her due to the veil, mistaking her for a prostitute.",
      "Lutheran": "Judah sees her and thinks she is a prostitute, because she covered her face.",
      "Presbyterian": "Judah sees Tamar but, due to her veil, mistakes her for a prostitute.",
      "Pentecostal": "Judah sees her, thinks she's a prostitute (face covered).",
      "Episcopalian/Anglican": "Judah sees her and, because she is veiled, mistakes her for a prostitute.",
      "Orthodox": "When Judah encounters her, he fails to recognize Tamar due to her veil and assumes she is a prostitute.",
      "Other": "When Judah saw her, he thought she was a prostitute, for she had covered her face.",
      "Prefer not to say": "When Judah saw her, he thought she was a prostitute, for she had covered her face."
  },
  "16": {
      "General": "Not realizing that she was his daughter-in-law, he went over to her by the roadside and said, \"Come now, let me sleep with you.\" \"And what will you give me to sleep with you?\" she asked.",
      "Non-Denominational": "Not realizing that she was his daughter-in-law, he went over to her by the roadside and said, \"Come now, let me sleep with you.\" \"And what will you give me to sleep with you?\" she asked.",
      "Baptist": "Unaware he is speaking to his daughter-in-law, Judah propositions her. Tamar, playing the part, negotiates her price, asking what he will give her for her services.",
      "Catholic": "Oblivious to her true identity, Judah approaches Tamar by the roadside and propositions her: 'Come, let me come in to you.' Tamar responds by asking for his proposed payment: 'What will you give me, that you may come in to me?'",
      "Methodist": "Not recognizing Tamar, Judah propositions her. She asks what payment he will offer.",
      "Lutheran": "He turns aside to her by the road and says, 'Come, let me come in to you,' not knowing she is his daughter-in-law. She asks what he will give her.",
      "Presbyterian": "Not recognizing his daughter-in-law, Judah propositions her. Tamar asks for payment.",
      "Pentecostal": "Judah propositions her (not knowing it's Tamar). She asks for payment.",
      "Episcopalian/Anglican": "Unaware she is his daughter-in-law, Judah propositions her. Tamar asks what he will give her for payment.",
      "Orthodox": "Unaware of her identity, Judah propositions Tamar. She, in turn, inquires about the payment he proposes for her services.",
      "Other": "Not realizing that she was his daughter-in-law, he went over to her by the roadside and said, \"Come now, let me sleep with you.\" \"And what will you give me to sleep with you?\" she asked.",
      "Prefer not to say": "Not realizing that she was his daughter-in-law, he went over to her by the roadside and said, \"Come now, let me sleep with you.\" \"And what will you give me to sleep with you?\" she asked."
  },
  "17": {
      "General": "\"I'll send you a young goat from my flock,\" he said. \"Will you give me something as a pledge until you send it?\" she asked.",
      "Non-Denominational": "\"I'll send you a young goat from my flock,\" he said. \"Will you give me something as a pledge until you send it?\" she asked.",
      "Baptist": "Judah offers to send a young goat from his flock later as payment. Tamar demands a pledge or security deposit to hold until the goat arrives.",
      "Catholic": "Judah offers a young goat from his flock as payment, promising to send it later. Tamar shrewdly asks for a pledge (collateral) to be held until the payment is delivered.",
      "Methodist": "Judah promises a young goat as payment. Tamar asks for a pledge until he sends it.",
      "Lutheran": "He promises to send a young goat from the flock. She asks for a pledge until he sends it.",
      "Presbyterian": "Judah promises a young goat as payment. Tamar requests a pledge as security until the goat is delivered.",
      "Pentecostal": "Judah promises a goat. She asks for a pledge until payment.",
      "Episcopalian/Anglican": "Judah offers to send a young goat from his flock. Tamar asks for a pledge as security until he sends it.",
      "Orthodox": "Judah offers a young goat from his flock as payment, to be sent later. Tamar requests collateral until the promised payment arrives.",
      "Other": "\"I'll send you a young goat from my flock,\" he said. \"Will you give me something as a pledge until you send it?\" she asked.",
      "Prefer not to say": "\"I'll send you a young goat from my flock,\" he said. \"Will you give me something as a pledge until you send it?\" she asked."
  },
  "18": {
      "General": "He asked, \"What pledge should I give you?\" \"Your seal and its cord, and the staff in your hand,\" she answered. So he gave them to her and slept with her, and she became pregnant by him.",
      "Non-Denominational": "He asked, \"What pledge should I give you?\" \"Your seal and its cord, and the staff in your hand,\" she answered. So he gave them to her and slept with her, and she became pregnant by him.",
      "Baptist": "Judah asks what pledge she requires. Tamar specifically requests his personal seal (cylinder seal used for identification and authority), its cord (used to wear the seal), and his staff (symbol of authority or identity). These are highly personal and valuable items. Judah agrees, gives them to her, sleeps with her, and Tamar conceives.",
      "Catholic": "When Judah inquires what pledge she wants, Tamar requests three items uniquely identifying him: his signet (seal), its cord, and the staff he carries. Judah complies, hands over the pledge, lies with her, and she conceives by him.",
      "Methodist": "Tamar asks for Judah's seal, its cord, and his staff as the pledge. He gives them to her, sleeps with her, and she conceives.",
      "Lutheran": "He asks what pledge. She requests his signet, cord, and staff. He gives them, goes in to her, and she conceives by him.",
      "Presbyterian": "Tamar demands Judah's seal, cord, and staff as the pledge. He agrees, gives them to her, sleeps with her, and she conceives.",
      "Pentecostal": "She asks for his seal, cord, staff. He gives them, sleeps with her, she conceives.",
      "Episcopalian/Anglican": "Tamar requests Judah's seal, cord, and staff as the pledge. He gives them to her, lies with her, and she conceives by him.",
      "Orthodox": "Tamar specifies the collateral: Judah's signet seal, its accompanying cord, and his staff – items of personal identification and value. Judah provides them, engages in intercourse with her, and she conceives as a result.",
      "Other": "He asked, \"What pledge should I give you?\" \"Your seal and its cord, and the staff in your hand,\" she answered. So he gave them to her and slept with her, and she became pregnant by him.",
      "Prefer not to say": "He asked, \"What pledge should I give you?\" \"Your seal and its cord, and the staff in your hand,\" she answered. So he gave them to her and slept with her, and she became pregnant by him."
  },
  "19": {
      "General": "After she left, she took off her veil and put on her widow's clothes again.",
      "Non-Denominational": "After she left, she took off her veil and put on her widow's clothes again.",
      "Baptist": "Having accomplished her goal, Tamar leaves, removes her disguise (the veil), and resumes wearing her widow's clothes.",
      "Catholic": "After the encounter, Tamar departs, removes her veil, and puts her widow's garments back on.",
      "Methodist": "Tamar leaves, takes off her veil, and puts her widow's clothes back on.",
      "Lutheran": "She arises and goes away, takes off her veil, and puts on her widow's garments.",
      "Presbyterian": "Tamar leaves, removes her disguise, and puts her widow's clothes back on.",
      "Pentecostal": "She leaves, removes veil, puts widow's clothes back on.",
      "Episcopalian/Anglican": "Tamar leaves, removes her veil, and puts her widow's clothes back on.",
      "Orthodox": "Following the encounter, Tamar departs, removes her veil, and resumes wearing her widow's attire.",
      "Other": "After she left, she took off her veil and put on her widow's clothes again.",
      "Prefer not to say": "After she left, she took off her veil and put on her widow's clothes again."
  },
  "20": {
      "General": "Meanwhile Judah sent the young goat by his friend the Adullamite in order to get his pledge back from the woman, but he could not find her.",
      "Non-Denominational": "Meanwhile Judah sent the young goat by his friend the Adullamite in order to get his pledge back from the woman, but he could not find her.",
      "Baptist": "Judah sends the promised young goat via his friend Hirah the Adullamite to pay the 'prostitute' and retrieve his pledge (seal, cord, staff). However, Hirah is unable to find the woman.",
      "Catholic": "Judah sends the young goat payment via his friend Hirah the Adullamite, instructing him to retrieve the pledge items from the woman. Hirah, however, cannot locate her.",
      "Methodist": "Judah sends the goat payment with Hirah to retrieve the pledge, but Hirah can't find the woman (Tamar).",
      "Lutheran": "Judah sends the young goat by his friend the Adullamite to take the pledge from the woman's hand, but he does not find her.",
      "Presbyterian": "Judah sends Hirah with the goat payment to retrieve the pledge, but Hirah cannot find the woman.",
      "Pentecostal": "Judah sends Hirah with goat to get pledge back, but Hirah can't find her.",
      "Episcopalian/Anglican": "Judah sends the goat payment with his friend Hirah to retrieve the pledge, but Hirah cannot find the woman.",
      "Orthodox": "Judah dispatches the promised goat with his friend Hirah to redeem the pledge from the woman, but Hirah is unsuccessful in locating her.",
      "Other": "Meanwhile Judah sent the young goat by his friend the Adullamite in order to get his pledge back from the woman, but he could not find her.",
      "Prefer not to say": "Meanwhile Judah sent the young goat by his friend the Adullamite in order to get his pledge back from the woman, but he could not find her."
  },
  "21": {
      "General": "He asked the men who lived there, \"Where is the shrine prostitute who was beside the road at Enaim?\" \"There hasn't been any shrine prostitute here,\" they said.",
      "Non-Denominational": "He asked the men who lived there, \"Where is the shrine prostitute who was beside the road at Enaim?\" \"There hasn't been any shrine prostitute here,\" they said.",
      "Baptist": "Hirah asks the local men about the whereabouts of the 'shrine prostitute' ('qedeshah' - a term sometimes distinct from a common prostitute, possibly associated with cultic practices, though Judah likely just meant prostitute) he assumes was at Enaim. The locals deny that any such woman was there.",
      "Catholic": "Hirah inquires of the local inhabitants, asking for the location of the 'cult prostitute' ('qedeshah') who was at Enaim by the roadside. (The term 'qedeshah' often refers to a prostitute associated with pagan shrines, though Judah might have simply assumed her profession). The locals reply that no such prostitute has been there.",
      "Methodist": "Hirah asks the locals where the 'shrine prostitute' (qedeshah) was at Enaim. They deny any prostitute was there.",
      "Lutheran": "He asks the men of the place about the cult prostitute (qedeshah) at Enaim on the road. They say no cult prostitute has been there.",
      "Presbyterian": "Hirah inquires about the 'shrine prostitute' (qedeshah) at Enaim, but the locals deny seeing one.",
      "Pentecostal": "Hirah asks locals about the shrine prostitute at Enaim. They deny seeing one.",
      "Episcopalian/Anglican": "Hirah asks the local men about the 'shrine prostitute' (qedeshah) at Enaim, but they reply that no such person was there.",
      "Orthodox": "Hirah inquires among the local men regarding the 'cult prostitute' ('qedeshah') purportedly situated at Enaim, but they assert that no such woman has been present.",
      "Other": "He asked the men who lived there, \"Where is the shrine prostitute who was beside the road at Enaim?\" \"There hasn't been any shrine prostitute here,\" they said.",
      "Prefer not to say": "He asked the men who lived there, \"Where is the shrine prostitute who was beside the road at Enaim?\" \"There hasn't been any shrine prostitute here,\" they said."
  },
  "22": {
      "General": "So he went back to Judah and said, \"I didn't find her. Besides, the men who lived there said, 'There hasn't been any shrine prostitute here.'\"",
      "Non-Denominational": "So he went back to Judah and said, \"I didn't find her. Besides, the men who lived there said, 'There hasn't been any shrine prostitute here.'\"",
      "Baptist": "Hirah returns to Judah, reporting his failure to find the woman and relaying the locals' denial that a prostitute had been there.",
      "Catholic": "Hirah returns to Judah and reports his inability to find the woman, adding that the local men denied the presence of any cult prostitute in that location.",
      "Methodist": "Hirah reports back to Judah: he couldn't find her, and the locals denied a prostitute was there.",
      "Lutheran": "He returns to Judah and reports he couldn't find her, and the locals said no cult prostitute was there.",
      "Presbyterian": "Hirah returns to Judah, reporting he couldn't find the woman and the locals denied her presence.",
      "Pentecostal": "Hirah reports back: couldn't find her, locals denied she was there.",
      "Episcopalian/Anglican": "Hirah returns to Judah, reporting he could not find the woman and that the locals denied any prostitute had been there.",
      "Orthodox": "Hirah reports his failure to locate the woman back to Judah, conveying the local inhabitants' assertion that no prostitute had been present.",
      "Other": "So he went back to Judah and said, \"I didn't find her. Besides, the men who lived there said, 'There hasn't been any shrine prostitute here.'\"",
      "Prefer not to say": "So he went back to Judah and said, \"I didn't find her. Besides, the men who lived there said, 'There hasn't been any shrine prostitute here.'\""
  },
  "23": {
      "General": "Then Judah said, \"Let her keep the pledge. Otherwise we will become a laughingstock. After all, I did send her the goat, but you didn't find her.\"",
      "Non-Denominational": "Then Judah said, \"Let her keep the pledge. Otherwise we will become a laughingstock. After all, I did send her the goat, but you didn't find her.\"",
      "Baptist": "Judah decides to let the matter drop, telling Hirah to let the woman keep the pledge items (his seal, cord, staff). He expresses concern about becoming a laughingstock or facing ridicule if they pursue the matter further. He justifies his decision by noting he fulfilled his part by sending the payment, even though Hirah couldn't find her.",
      "Catholic": "Judah decides to abandon the effort to retrieve his pledge, saying, 'Let her keep the items for herself, lest we be laughed at.' He rationalizes this by stating he did attempt payment ('I sent this young goat'), but Hirah was simply unable to find her. He prioritizes avoiding potential public ridicule over recovering his personal items.",
      "Methodist": "Judah says to let her keep the pledge to avoid becoming a laughingstock, reasoning he tried to pay but Hirah couldn't find her.",
      "Lutheran": "Judah says to let her keep the pledge, lest they be scorned. He states he sent the goat, but Hirah couldn't find her.",
      "Presbyterian": "Judah decides to forgo retrieving the pledge to avoid public embarrassment, reasoning he had attempted payment.",
      "Pentecostal": "Judah says let her keep pledge, avoid ridicule. He tried to pay.",
      "Episcopalian/Anglican": "Judah decides to let the woman keep the pledge to avoid being ridiculed, noting that he did send the goat but Hirah couldn't find her.",
      "Orthodox": "Judah decides to relinquish the pledge items, concerned about potential public humiliation ('lest we become a laughingstock'), rationalizing that he fulfilled his obligation by sending the goat.",
      "Other": "Then Judah said, \"Let her keep the pledge. Otherwise we will become a laughingstock. After all, I did send her the goat, but you didn't find her.\"",
      "Prefer not to say": "Then Judah said, \"Let her keep the pledge. Otherwise we will become a laughingstock. After all, I did send her the goat, but you didn't find her.\""
  },
  "24": {
      "General": "About three months later Judah was told, \"Your daughter-in-law Tamar is guilty of prostitution, and as a result she is now pregnant.\" Judah said, \"Bring her out and have her burned to death!\"",
      "Non-Denominational": "About three months later Judah was told, \"Your daughter-in-law Tamar is guilty of prostitution, and as a result she is now pregnant.\" Judah said, \"Bring her out and have her burned to death!\"",
      "Baptist": "Approximately three months later, word reaches Judah that his daughter-in-law Tamar (still technically betrothed or obligated to his line) is pregnant, and it is assumed her pregnancy resulted from prostitution (since she had no husband). Judah, acting with patriarchal authority and hypocrisy, immediately condemns her and orders her execution by burning.",
      "Catholic": "About three months later, Judah is informed that his daughter-in-law Tamar has engaged in harlotry and is pregnant as a result. Displaying harsh judgment and hypocrisy (given his own recent actions), Judah immediately issues a severe sentence: 'Bring her out, and let her be burned.'",
      "Methodist": "About three months later, Judah is told Tamar is pregnant due to prostitution. Judah hypocritically orders her to be brought out and burned to death.",
      "Lutheran": "About three months later, Judah is told Tamar his daughter-in-law has played the whore and is pregnant. Judah orders her brought out and burned.",
      "Presbyterian": "Three months later, Judah learns Tamar is pregnant, presumably from prostitution. He hypocritically condemns her to death by burning.",
      "Pentecostal": "3 months later, Judah hears Tamar is pregnant from prostitution. Judah orders her burned to death.",
      "Episcopalian/Anglican": "About three months later, Judah is told that Tamar is pregnant as a result of prostitution. Judah orders her to be brought out and burned.",
      "Orthodox": "Approximately three months thereafter, Judah receives news that Tamar is pregnant, allegedly due to prostitution. In a display of severe judgment and hypocrisy, Judah commands that she be brought forth and executed by burning.",
      "Other": "About three months later Judah was told, \"Your daughter-in-law Tamar is guilty of prostitution, and as a result she is now pregnant.\" Judah said, \"Bring her out and have her burned to death!\"",
      "Prefer not to say": "About three months later Judah was told, \"Your daughter-in-law Tamar is guilty of prostitution, and as a result she is now pregnant.\" Judah said, \"Bring her out and have her burned to death!\""
  },
  "25": {
      "General": "As she was being brought out, she sent a message to her father-in-law. \"I am pregnant by the man who owns these,\" she said. And she added, \"See if you recognize whose seal and cord and staff these are.\"",
      "Non-Denominational": "As she was being brought out, she sent a message to her father-in-law. \"I am pregnant by the man who owns these,\" she said. And she added, \"See if you recognize whose seal and cord and staff these are.\"",
      "Baptist": "As Tamar is being led out for execution, she sends a message to Judah. She presents the pledge items (seal, cord, staff) and declares she is pregnant by the owner of these items, pointedly asking Judah to identify them.",
      "Catholic": "As Tamar is being brought out to face her sentence, she sends the pledge items (signet, cord, and staff) to her father-in-law, Judah. Her message is clear: 'By the man to whom these belong, I am pregnant.' She adds the direct challenge: 'Please identify whose signet and cord and staff these are.'",
      "Methodist": "As Tamar is brought out, she sends the pledge items (seal, cord, staff) to Judah, saying she is pregnant by their owner and asking Judah to identify them.",
      "Lutheran": "As she is brought out, she sends word to her father-in-law: 'By the man to whom these belong, I am pregnant.' She asks him to identify the signet, cord, and staff.",
      "Presbyterian": "As Tamar is led out, she sends Judah the items he gave her as a pledge (seal, cord, staff) and asks him to identify their owner, stating he is the father.",
      "Pentecostal": "As Tamar is brought out, she sends Judah the pledge (seal, cord, staff), says owner is the father, asks Judah to identify items.",
      "Episcopalian/Anglican": "As Tamar is being brought out for execution, she sends the pledge items to Judah, stating she is pregnant by their owner and asking Judah to identify them.",
      "Orthodox": "While being led to her execution, Tamar sends the pledged items (signet, cord, and staff) to Judah, declaring that the owner of these items is the father and challenging Judah to identify them.",
      "Other": "As she was being brought out, she sent a message to her father-in-law. \"I am pregnant by the man who owns these,\" she said. And she added, \"See if you recognize whose seal and cord and staff these are.\"",
      "Prefer not to say": "As she was being brought out, she sent a message to her father-in-law. \"I am pregnant by the man who owns these,\" she said. And she added, \"See if you recognize whose seal and cord and staff these are.\""
  },
  "26": {
      "General": "Judah recognized them and said, \"She is more righteous than I, since I wouldn't give her to my son Shelah.\" And he did not sleep with her again.",
      "Non-Denominational": "Judah recognized them and said, \"She is more righteous than I, since I wouldn't give her to my son Shelah.\" And he did not sleep with her again.",
      "Baptist": "Judah immediately recognizes his personal items. He publicly acknowledges Tamar's relative righteousness compared to his own, admitting his fault in not giving her to his son Shelah as promised according to the levirate custom. The text notes he had no further sexual relations with her.",
      "Catholic": "Judah identifies his possessions and makes a crucial public admission: 'She is more righteous than I, inasmuch as I did not give her to my son Shelah.' He acknowledges his own failure to uphold the levirate duty, which implicitly justifies Tamar's desperate measures. The narrator adds that Judah did not have further sexual relations with her.",
      "Methodist": "Judah recognizes his items and declares Tamar 'more righteous' than himself because he failed to give her to Shelah as promised. He does not sleep with her again.",
      "Lutheran": "Judah identifies them and says, 'She is more righteous than I, since I did not give her to my son Shelah.' He did not know her again.",
      "Presbyterian": "Judah recognizes the items and publicly declares Tamar more righteous than himself, acknowledging his failure to give her to Shelah. He has no further relations with her.",
      "Pentecostal": "Judah recognizes items, says Tamar is more righteous because he broke promise about Shelah. He doesn't sleep with her again.",
      "Episcopalian/Anglican": "Judah recognizes the items and acknowledges Tamar is more righteous than he, because he failed to give her to his son Shelah. He does not lie with her again.",
      "Orthodox": "Upon recognizing his belongings, Judah publicly declares Tamar's greater righteousness, admitting his own culpability in failing to provide Shelah as her husband according to custom. Subsequently, he refrains from further intimate relations with her.",
      "Other": "Judah recognized them and said, \"She is more righteous than I, since I wouldn't give her to my son Shelah.\" And he did not sleep with her again.",
      "Prefer not to say": "Judah recognized them and said, \"She is more righteous than I, since I wouldn't give her to my son Shelah.\" And he did not sleep with her again."
  },
  "27": {
      "General": "When the time came for her to give birth, there were twin boys in her womb.",
      "Non-Denominational": "When the time came for her to give birth, there were twin boys in her womb.",
      "Baptist": "When Tamar's time for delivery arrives, it is discovered she is carrying twin boys.",
      "Catholic": "At the time of Tamar's delivery, it becomes apparent that she is bearing twins.",
      "Methodist": "When Tamar is due to give birth, she is found to be carrying twin boys.",
      "Lutheran": "When the time of her labor comes, there are twins in her womb.",
      "Presbyterian": "At the time of birth, Tamar is found to be carrying twins.",
      "Pentecostal": "At birth time, she has twin boys.",
      "Episcopalian/Anglican": "When Tamar's time for delivery comes, she is found to have twin boys in her womb.",
      "Orthodox": "When Tamar reaches the time for childbirth, it is revealed she carries twin boys.",
      "Other": "When the time came for her to give birth, there were twin boys in her womb.",
      "Prefer not to say": "When the time came for her to give birth, there were twin boys in her womb."
  },
  "28": {
      "General": "As she was giving birth, one of them put out his hand; so the midwife took a scarlet thread and tied it on his wrist and said, \"This one came out first.\"",
      "Non-Denominational": "As she was giving birth, one of them put out his hand; so the midwife took a scarlet thread and tied it on his wrist and said, \"This one came out first.\"",
      "Baptist": "During the birth process, one twin extends his hand first. The midwife marks him by tying a scarlet thread around his wrist, identifying him as the firstborn.",
      "Catholic": "During the delivery, one twin puts out his hand. The midwife marks this apparent firstborn by tying a scarlet thread around his wrist, declaring, 'This one came out first.'",
      "Methodist": "During birth, one twin puts out a hand. The midwife ties a scarlet thread on his wrist, marking him as the first to emerge.",
      "Lutheran": "During labor, one puts out a hand. The midwife takes and ties a scarlet thread on his hand, saying, 'This one came out first.'",
      "Presbyterian": "During childbirth, one twin puts out his hand first. The midwife ties a scarlet thread around it to mark him as the firstborn.",
      "Pentecostal": "During birth, one twin puts hand out. Midwife ties scarlet thread on wrist, says 'This one first'.",
      "Episcopalian/Anglican": "As Tamar gives birth, one twin puts out his hand. The midwife ties a scarlet thread on his wrist to mark him as the firstborn.",
      "Orthodox": "In the process of childbirth, one twin extends his hand. The midwife fastens a scarlet thread to his wrist, signifying him as the first to emerge.",
      "Other": "As she was giving birth, one of them put out his hand; so the midwife took a scarlet thread and tied it on his wrist and said, \"This one came out first.\"",
      "Prefer not to say": "As she was giving birth, one of them put out his hand; so the midwife took a scarlet thread and tied it on his wrist and said, \"This one came out first.\""
  },
  "29": {
      "General": "But when he drew back his hand, his brother came out, and she said, \"So this is how you have broken out!\" And he was named Perez.",
      "Non-Denominational": "But when he drew back his hand, his brother came out, and she said, \"So this is how you have broken out!\" And he was named Perez.",
      "Baptist": "However, the first twin withdraws his hand, and his brother unexpectedly emerges first. The midwife (or Tamar) exclaims about his forceful emergence ('What a breach you have made for yourself!'). Consequently, this twin is named Perez, meaning 'breach' or 'breaking out.'",
      "Catholic": "Unexpectedly, the first twin withdraws his hand, and his brother emerges completely first. The midwife exclaims, 'What a breach you have made for yourself!' (or similar words expressing his forceful emergence). This twin is therefore named Perez, meaning 'breach.'",
      "Methodist": "But the first twin pulls back his hand, and the other brother is born first. The midwife exclaims about his 'breaking out,' so he is named Perez ('breach').",
      "Lutheran": "But as he draws back his hand, his brother comes out. She says, 'What a breach you have made for yourself!' Therefore his name was called Perez ('breach').",
      "Presbyterian": "The first twin withdraws his hand, and his brother is born first. He is named Perez ('breach') because he 'broke out' unexpectedly.",
      "Pentecostal": "First twin pulls hand back, brother comes out first. Named Perez ('breach') for breaking out.",
      "Episcopalian/Anglican": "But the first twin withdraws his hand, and his brother is born first. The midwife exclaims, 'What a breach you have made!' So he is named Perez ('breach').",
      "Orthodox": "However, the first twin retracts his hand, and his brother emerges first. An exclamation is made regarding his forceful 'breaking through,' leading to his name Perez ('breach').",
      "Other": "But when he drew back his hand, his brother came out, and she said, \"So this is how you have broken out!\" And he was named Perez.",
      "Prefer not to say": "But when he drew back his hand, his brother came out, and she said, \"So this is how you have broken out!\" And he was named Perez."
  },
  "30": {
      "General": "Then his brother, who had the scarlet thread on his wrist, came out. And he was named Zerah.",
      "Non-Denominational": "Then his brother, who had the scarlet thread on his wrist, came out. And he was named Zerah.",
      "Baptist": "After Perez, the twin who initially put out his hand (identified by the scarlet thread) is born. He is named Zerah, possibly meaning 'scarlet' or 'rising/shining.' Perez, despite the unusual birth order, becomes the more prominent ancestor in Judah's line (leading to David and Jesus).",
      "Catholic": "Subsequently, the brother with the scarlet thread on his wrist is born. He is named Zerah (meaning uncertain, perhaps 'scarlet' or 'dawning'). Perez, though technically breaking the birth order, becomes the ancestor through whom the messianic line eventually comes.",
      "Methodist": "Then the brother with the scarlet thread is born and named Zerah ('scarlet' or 'shining'). Perez becomes the ancestor of David.",
      "Lutheran": "Afterward his brother comes out with the scarlet thread on his hand; his name was called Zerah ('scarlet'/'dawning').",
      "Presbyterian": "Finally, the twin with the scarlet thread is born and named Zerah ('scarlet' or 'rising').",
      "Pentecostal": "Then the brother with scarlet thread comes out, named Zerah.",
      "Episcopalian/Anglican": "Then his brother, with the scarlet thread on his wrist, is born and named Zerah.",
      "Orthodox": "Finally, the twin marked with the scarlet thread is born and named Zerah (possibly meaning 'scarlet' or 'rising').",
      "Other": "Then his brother, who had the scarlet thread on his wrist, came out. And he was named Zerah.",
      "Prefer not to say": "Then his brother, who had the scarlet thread on his wrist, came out. And he was named Zerah."
    }
  }
} 