{
  "chapterSummary": {
    "General": "Genesis 4 details the story of Cain and Abel, the first children of Adam and Eve. It recounts Cain's jealousy leading to the murder of his brother Abel, God's confrontation and curse upon Cain, Cain's subsequent wandering and city-building, and the beginning of his lineage, highlighting the spread of sin and the divergence of human paths. It concludes with the birth of Seth, replacing Abel, and the beginning of public worship.",
    "Non-Denominational": "Focuses on the consequences of the Fall manifesting in the first generation: flawed worship, jealousy, murder, divine judgment tempered with mercy (mark), alienation from God, the development of human culture apart from God (Cain's line), and the beginning of the godly line through Seth, marked by calling on God's name.",
    "Baptist": "Highlights the rapid spread of sin after the Fall. Contrasts Cain's faithless offering with Abel's offering by faith (Heb 11:4), accepted by God. Emphasizes Cain's hardness of heart, God's judgment, and His common grace (mark). Contrasts the ungodly lineage of Cain (violence, polygamy) with the beginning of the godly line of Seth, characterized by worship.",
    "Catholic": "Recounts the first murder stemming from envy and rejected sacrifice. Abel is seen as the first martyr, a type of Christ. God's dialogue with Cain shows He offers chances for repentance. Cain's punishment includes alienation but also divine protection. Contrasts the worldly development of Cain's line with the piety emerging in Seth's line.",
    "Methodist": "Focuses on the destructive nature of sin (jealousy, anger, murder) spreading through the family. Highlights God's confrontation with Cain, offering a path to acceptance but warning against sin's power. Notes God's judgment includes consequences but also mitigating mercy. Contrasts Cain's path of alienation with Seth's line beginning to call on God.",
    "Lutheran": "Views Cain's offering as rejected because it lacked faith (unlike Abel's, Heb 11:4). Sin's power leads Cain to murder. God confronts Cain with Law but also shows mercy (mark). Cain's lineage represents humanity living apart from God, developing earthly culture. Seth's line signifies the preservation of the faithful remnant who worship God.",
    "Presbyterian": "Illustrates the outworking of original sin. Contrasts Cain's unacceptable worship with Abel's acceptable worship offered in faith. God's interaction with Cain shows both judgment for sin and common grace. Contrasts the development of Cain's secular lineage with the establishment of the covenant line through Seth, marked by calling on the Lord.",
    "Pentecostal": "Emphasizes the spiritual dimension: Cain's anger opening the door to sin/Satan's influence. Contrasts Cain's offering (religion without relationship) with Abel's accepted sacrifice (faith/heart attitude). Highlights God's judgment and protective mark. Sees Seth's line as the beginning of revival/public worship.",
    "Anglican": "Recounts the first sibling rivalry leading to murder, illustrating sin's consequences. Notes the theological significance of acceptable vs. unacceptable sacrifice. God's judgment on Cain is severe but includes protection. Contrasts the secular advancements of Cain's descendants with the piety emerging in Seth's line ('calling on the name of the Lord').",
    "Orthodox": "Views the story as the rapid progression of sin after the Fall. Abel's sacrifice, offered with a pure heart, is accepted; Cain's, offered improperly or with wrong intent, is rejected. Cain's murder stems from envy. God's interaction shows He seeks repentance. Cain's line develops earthly skills but moves away from God. Seth's line restores the connection, beginning formal invocation of God's name."
  },
  "1": {
    "Non-Denominational": "Adam and Eve conceive and bear their first son, Cain. Eve expresses that she has 'brought forth a man with the help of the Lord'.",
    "General": "Adam and Eve conceive and bear their first son, Cain. Eve expresses that she has 'brought forth a man with the help of the Lord'.",
    "Baptist": "Eve acknowledges God's role in procreation, perhaps seeing Cain initially as the promised seed (Gen 3:15).",
    "Catholic": "Eve recognizes God's blessing in conception, attributing the birth of Cain (meaning 'acquired' or 'produced') to His help.",
    "Methodist": "Highlights the continuation of human life after the Fall, with Eve acknowledging God's partnership.",
    "Lutheran": "Eve recognizes childbirth as God's blessing, possibly misinterpreting Cain as the promised deliverer.",
    "Presbyterian": "Eve acknowledges God's providence in the birth of Cain, potentially with misplaced hope in him as the promised Seed.",
    "Pentecostal": "Eve gives credit to God for the birth of her son.",
    "Anglican": "The birth of Cain occurs, with Eve acknowledging God's involvement in bringing forth life.",
    "Orthodox": "Eve gives birth to Cain, acknowledging God's assistance in the creation of new life."
  },
  "2": {
    "Non-Denominational": "Eve bears another son, Abel. Abel becomes a shepherd, while Cain becomes a farmer (a tiller of the ground).",
    "General": "Eve bears another son, Abel. Abel becomes a shepherd, while Cain becomes a farmer (a tiller of the ground).",
    "Baptist": "Introduces Abel (meaning 'breath' or 'vapor', perhaps foreshadowing his short life) and establishes their different occupations.",
    "Catholic": "Abel's birth and the brothers' distinct vocations (shepherd, farmer) are noted.",
    "Methodist": "Establishes the brothers' differing livelihoods, potentially symbolizing different ways of life.",
    "Lutheran": "The different occupations of Cain (farmer) and Abel (shepherd) are established.",
    "Presbyterian": "Notes the birth of Abel and the divergence in the brothers' vocations.",
    "Pentecostal": "Introduces Abel and contrasts the brothers' chosen professions.",
    "Anglican": "Abel is born; the brothers pursue different livelihoods, pastoral and agricultural.",
    "Orthodox": "Abel is born (name possibly signifying transience), and the brothers choose different ways of life."
  },
  "3": {
    "Non-Denominational": "In time, Cain brings an offering to the Lord from the fruit of the ground.",
    "General": "In time, Cain brings an offering to the Lord from the fruit of the ground.",
    "Baptist": "Cain offers the product of his own labor, but potentially lacking faith or the required element (blood).",
    "Catholic": "Cain presents an offering from his harvest, an act of worship whose acceptability depends on inner disposition.",
    "Methodist": "Cain initiates an act of worship, offering produce from his work.",
    "Lutheran": "Cain brings an offering, but without faith, it is unacceptable.",
    "Presbyterian": "Cain brings an offering from the ground cursed due to sin, possibly without faith.",
    "Pentecostal": "Cain presents an offering, but the focus is often on the heart attitude behind it.",
    "Anglican": "Cain brings an offering to God from his agricultural produce.",
    "Orthodox": "Cain brings an offering from the fruits of the earth."
  },
  "4": {
    "Non-Denominational": "Abel also brings an offering, specifically the firstborn and fat portions of his flock. The Lord shows favor ('had regard') for Abel and his offering.",
    "General": "Abel also brings an offering, specifically the firstborn and fat portions of his flock. The Lord shows favor ('had regard') for Abel and his offering.",
    "Baptist": "Abel offers the best (firstborn, fat portions) by faith (Heb 11:4), likely involving blood sacrifice, which God accepts.",
    "Catholic": "Abel offers the choice parts of his flock, signifying generosity and right disposition (faith), which God accepts.",
    "Methodist": "Abel offers the best of his flock, reflecting a faithful heart, and God accepts him and his offering.",
    "Lutheran": "Abel offers the best by faith (Heb 11:4), foreshadowing Christ's sacrifice, and God regards it favorably.",
    "Presbyterian": "Abel brings the best of his flock, an offering presented in faith according to God's will (likely involving blood), which God accepts.",
    "Pentecostal": "Abel brings a quality offering with a heart of faith, which finds acceptance with God.",
    "Anglican": "Abel offers the prime parts of his flock; God accepts Abel and his offering, implying it was offered rightly (perhaps in faith, Heb 11:4).",
    "Orthodox": "Abel offers the firstlings and fat, signifying his devotion and offering the best; God looks favorably upon Abel and his gift."
  },
  "5": {
    "Non-Denominational": "The Lord does not show favor for Cain or his offering. Cain becomes very angry, and his face shows his displeasure ('his face fell').",
    "General": "The Lord does not show favor for Cain or his offering. Cain becomes very angry, and his face shows his displeasure ('his face fell').",
    "Baptist": "God rejects Cain's offering (due to lack of faith/improper type); Cain responds with sinful anger and resentment.",
    "Catholic": "God rejects Cain and his offering (due to wrong disposition/envy); Cain reacts with anger and dejection.",
    "Methodist": "God's rejection of Cain's offering (based on heart attitude) leads to Cain's anger and resentment.",
    "Lutheran": "God rejects Cain's faithless offering; Cain responds with anger against God and Abel.",
    "Presbyterian": "God rejects Cain's offering (offered without faith/improperly); Cain responds sinfully with anger.",
    "Pentecostal": "God looks at the heart; Cain's offering is rejected, leading to anger and a fallen countenance.",
    "Anglican": "God does not accept Cain or his offering; Cain responds with intense anger and visible dejection.",
    "Orthodox": "God does not look favorably on Cain or his gift (due to inner disposition); Cain reacts with anger and sadness."
  },
  "6": {
    "Non-Denominational": "The Lord speaks to Cain, questioning his anger and fallen countenance.",
    "General": "The Lord speaks to Cain, questioning his anger and fallen countenance.",
    "Baptist": "God confronts Cain's sinful attitude, giving him an opportunity to repent.",
    "Catholic": "God initiates dialogue, questioning Cain's anger to lead him to self-reflection and repentance.",
    "Methodist": "God graciously engages with Cain, probing the reason for his anger.",
    "Lutheran": "God confronts Cain's anger, calling him to examine his heart.",
    "Presbyterian": "God confronts Cain's sinful response, calling him to account.",
    "Pentecostal": "God addresses Cain's outward expression of inner turmoil.",
    "Anglican": "God questions Cain about his anger and dejection, prompting introspection.",
    "Orthodox": "God speaks to Cain, questioning his anger and sorrow, inviting dialogue."
  },
  "7": {
    "Non-Denominational": "God warns Cain that acceptance comes through doing right. He cautions that sin is 'crouching at the door,' desiring mastery over Cain, but Cain must rule over it.",
    "General": "God warns Cain that acceptance comes through doing right. He cautions that sin is 'crouching at the door,' desiring mastery over Cain, but Cain must rule over it.",
    "Baptist": "God clarifies the path to acceptance (obedience/faith) and warns Cain about sin's predatory nature and the need for self-control.",
    "Catholic": "God explains that right action leads to acceptance and warns Cain of the imminent danger of sin personified, urging him to master it.",
    "Methodist": "God offers the possibility of restoration ('do well') but warns of sin's lurking power and the responsibility to resist it.",
    "Lutheran": "God shows the way of acceptance (doing well by faith) and warns of sin's desire to dominate, urging resistance.",
    "Presbyterian": "God reminds Cain of the path to acceptance (obedience) and warns him of sin's desire to control him, commanding him to rule over it.",
    "Pentecostal": "God reveals the principle of acceptance and gives a stark warning about sin's power and Cain's responsibility to overcome it.",
    "Anglican": "God explains the condition for acceptance ('do well') and vividly warns Cain about the predatory nature of sin and his need to master it.",
    "Orthodox": "God indicates the path to acceptance involves right action/disposition and warns Cain that sin seeks to master him, urging vigilance and control."
  },
  "8": {
    "Non-Denominational": "Cain speaks to his brother Abel (some manuscripts add 'Let us go out to the field'). While they are in the field, Cain attacks and kills Abel.",
    "General": "Cain speaks to his brother Abel (some manuscripts add 'Let us go out to the field'). While they are in the field, Cain attacks and kills Abel.",
    "Baptist": "Cain ignores God's warning, allows sin to rule, deceives his brother, and commits the first murder.",
    "Catholic": "Cain rejects God's counsel, lures his brother under false pretenses, and commits fratricide, letting sin master him.",
    "Methodist": "Cain disregards God's warning, premeditates, and carries out the murder of his brother.",
    "Lutheran": "Cain succumbs to sin, deceives Abel, and murders him.",
    "Presbyterian": "Cain rejects God's warning, acts on his sinful anger, and murders Abel.",
    "Pentecostal": "Cain gives place to sin, leads Abel into a vulnerable situation, and murders him.",
    "Anglican": "Despite God's warning, Cain speaks deceptively to Abel, leads him to a field, and murders him.",
    "Orthodox": "Cain fails to master sin, speaks deceitfully, and murders his brother Abel."
  },
  "9": {
    "Non-Denominational": "The Lord asks Cain, 'Where is Abel your brother?' Cain evasively and defiantly replies, 'I do not know; am I my brother's keeper?'.",
    "General": "The Lord asks Cain, 'Where is Abel your brother?' Cain evasively and defiantly replies, 'I do not know; am I my brother's keeper?'.",
    "Baptist": "God confronts Cain again. Cain lies and denies responsibility for his brother, revealing hardness of heart.",
    "Catholic": "God's question aims to elicit confession. Cain responds with a lie and a defiant rejection of fraternal responsibility.",
    "Methodist": "God holds Cain accountable. Cain responds deceitfully and dismisses his responsibility.",
    "Lutheran": "God confronts Cain. Cain lies and denies the universal responsibility to care for one's neighbor.",
    "Presbyterian": "God confronts Cain. Cain lies and rejects his duty towards his brother.",
    "Pentecostal": "God questions Cain. Cain lies and shows callous disregard for his brother.",
    "Anglican": "God questions Cain about Abel's whereabouts. Cain lies and answers with defiant callousness.",
    "Orthodox": "God questions Cain, giving another chance for truth. Cain lies and rejects his natural responsibility for his brother."
  },
  "10": {
    "Non-Denominational": "God confronts Cain, asking what he has done and revealing that Abel's blood cries out to Him from the ground.",
    "General": "God confronts Cain, asking what he has done and revealing that Abel's blood cries out to Him from the ground.",
    "Baptist": "God reveals His omniscience; the innocent blood cries for justice.",
    "Catholic": "God exposes Cain's sin, revealing that innocent blood cries out to Him for vengeance/justice.",
    "Methodist": "God reveals the hidden sin; Abel's blood acts as a witness before God.",
    "Lutheran": "God exposes Cain's deed; Abel's blood cries out against the injustice.",
    "Presbyterian": "God confronts Cain with the reality of his sin; Abel's blood demands justice.",
    "Pentecostal": "God reveals the truth; the blood of the innocent cries out.",
    "Anglican": "God confronts Cain directly, revealing that the crime is known to Him through the cry of Abel's blood.",
    "Orthodox": "God reveals His knowledge of the murder; the blood itself cries out, signifying the gravity of the sin against life."
  },
  "11": {
    "Non-Denominational": "God pronounces a curse on Cain: he is now cursed from the ground, which received his brother's blood.",
    "General": "God pronounces a curse on Cain: he is now cursed from the ground, which received his brother's blood.",
    "Baptist": "God pronounces judgment, cursing Cain in relation to the very ground stained by his sin.",
    "Catholic": "God imposes a curse upon Cain, linking his punishment to the earth itself which was defiled by Abel's blood.",
    "Methodist": "God declares the specific consequence: a curse affecting Cain's relationship with the earth.",
    "Lutheran": "God curses Cain, separating him further from the blessings of the earth.",
    "Presbyterian": "God pronounces the curse upon Cain as judgment for his sin.",
    "Pentecostal": "God decrees the curse upon Cain related to the ground.",
    "Anglican": "God pronounces a curse upon Cain relating to the ground, which is implicated in the murder.",
    "Orthodox": "God curses Cain from the earth, signifying his alienation from the source of sustenance."
  },
  "12": {
    "Non-Denominational": "The curse entails that the ground will no longer yield its strength for Cain; he will be a restless wanderer on the earth.",
    "General": "The curse entails that the ground will no longer yield its strength for Cain; he will be a restless wanderer on the earth.",
    "Baptist": "The specifics of the curse: unproductive labor and alienation/exile.",
    "Catholic": "The curse involves agricultural failure and a life of exile and restlessness.",
    "Methodist": "The curse manifests as frustrating work and a life of aimless wandering.",
    "Lutheran": "The curse results in unfruitful labor and restless exile.",
    "Presbyterian": "The curse results in the ground's infertility for Cain and a life of wandering separation.",
    "Pentecostal": "The curse affects Cain's livelihood and condemns him to a life of wandering.",
    "Anglican": "The curse involves agricultural failure and condemns Cain to be a fugitive and wanderer.",
    "Orthodox": "The curse results in the earth's resistance to Cain's labor and a life of unstable wandering."
  },
  "13": {
    "Non-Denominational": "Cain protests to the Lord that his punishment is too great to bear.",
    "General": "Cain protests to the Lord that his punishment is too great to bear.",
    "Baptist": "Cain complains about the severity of the punishment, showing self-pity rather than repentance.",
    "Catholic": "Cain laments the harshness of his sentence, focusing on the consequence rather than the guilt.",
    "Methodist": "Cain expresses despair over the punishment, but without true remorse for the sin.",
    "Lutheran": "Cain despairs under the weight of the punishment, not showing godly sorrow.",
    "Presbyterian": "Cain protests the severity of the judgment, demonstrating worldly sorrow rather than repentance.",
    "Pentecostal": "Cain focuses on the difficulty of the punishment, not the evil of his actions.",
    "Anglican": "Cain complains that his punishment is unbearable.",
    "Orthodox": "Cain laments the severity of the punishment, showing despair rather than repentance."
  },
  "14": {
    "Non-Denominational": "Cain laments being driven from the land and God's presence, becoming a wanderer, and fears that anyone who finds him will kill him.",
    "General": "Cain laments being driven from the land and God's presence, becoming a wanderer, and fears that anyone who finds him will kill him.",
    "Baptist": "Cain recognizes his separation from God and fears retribution from others.",
    "Catholic": "Cain bemoans his exile from God's face (presence) and fears potential human vengeance.",
    "Methodist": "Cain articulates the pain of separation from land, God's presence, and community, fearing death.",
    "Lutheran": "Cain laments his exile from God's presence and fears death at the hands of others.",
    "Presbyterian": "Cain fears the consequences: separation from land and God's presence, and vulnerability to vengeance.",
    "Pentecostal": "Cain expresses fear of separation and retribution.",
    "Anglican": "Cain elaborates on his punishment: exile from the land, hidden from God's presence, and vulnerability to being killed.",
    "Orthodox": "Cain fears his separation from God's face (presence) and the potential for others to kill him."
  },
  "15": {
    "Non-Denominational": "The Lord offers Cain a measure of protection, declaring that vengeance will be taken sevenfold on anyone who kills Cain. God puts a mark on Cain to prevent this.",
    "General": "The Lord offers Cain a measure of protection, declaring that vengeance will be taken sevenfold on anyone who kills Cain. God puts a mark on Cain to prevent this.",
    "Baptist": "God shows common grace even to the unrepentant, protecting Cain's life despite his sin.",
    "Catholic": "God, in His mercy, grants Cain protection from vengeance, placing a sign on him.",
    "Methodist": "God demonstrates mercy amidst judgment by providing protection for Cain.",
    "Lutheran": "God mercifully protects Cain's life with a threat and a mark.",
    "Presbyterian": "God extends common grace, protecting Cain's life from immediate vengeance.",
    "Pentecostal": "God shows mercy even in judgment by placing a protective mark on Cain.",
    "Anglican": "God offers Cain protection from vengeance, instituting a severe penalty for killing him and providing a protective sign.",
    "Orthodox": "God demonstrates mercy by protecting Cain from blood vengeance, placing a mark upon him."
  },
  "16": {
    "Non-Denominational": "Cain leaves the Lord's presence and settles in the land of Nod (meaning 'wandering'), east of Eden.",
    "General": "Cain leaves the Lord's presence and settles in the land of Nod (meaning 'wandering'), east of Eden.",
    "Baptist": "Cain lives out his sentence of separation from God's manifest presence.",
    "Catholic": "Cain departs from God's presence, beginning his life as an exile in the land of 'Wandering'.",
    "Methodist": "Cain physically departs from God's presence, settling into his life of wandering.",
    "Lutheran": "Cain goes away from God's presence into exile.",
    "Presbyterian": "Cain departs from God's presence, settling in Nod, signifying his alienation.",
    "Pentecostal": "Cain lives out the consequence of separation from God's presence.",
    "Anglican": "Cain departs from God's presence and lives as a wanderer in the land of Nod.",
    "Orthodox": "Cain departs from the face of God, settling in the land of Nod (Wandering)."
  },
  "17": {
    "Non-Denominational": "Cain has a son, Enoch. Cain then builds a city and names it after his son, Enoch.",
    "General": "Cain has a son, Enoch. Cain then builds a city and names it after his son, Enoch.",
    "Baptist": "Cain attempts to counteract his wandering curse by building a city, seeking security apart from God.",
    "Catholic": "Cain fathers a son and builds the first city, perhaps seeking stability and self-made security in his exile.",
    "Methodist": "Cain establishes a lineage and builds a city, marking the beginning of human civilization independent of God.",
    "Lutheran": "Cain builds a city, representing human attempts to create security and meaning apart from God.",
    "Presbyterian": "Cain builds a city, seeking stability and establishing a counter-culture apart from God's presence.",
    "Pentecostal": "Cain attempts to establish his own security by building a city.",
    "Anglican": "Cain has descendants and founds the first city, named after his son.",
    "Orthodox": "Cain builds a city, signifying the beginning of human attempts to create security and permanence outside of communion with God."
  },
  "18": {
    "Non-Denominational": "Lists the descendants of Cain through Enoch: Irad, Mehujael, Methushael, and Lamech.",
    "General": "Lists the descendants of Cain through Enoch: Irad, Mehujael, Methushael, and Lamech.",
    "Baptist": "Traces the ungodly line stemming from Cain.",
    "Catholic": "The genealogy of Cain is presented.",
    "Methodist": "Lists Cain's lineage, leading to Lamech.",
    "Lutheran": "The lineage of Cain develops.",
    "Presbyterian": "Details the lineage of Cain, separated from the line of promise.",
    "Pentecostal": "Shows the progression of Cain's descendants.",
    "Anglican": "Provides the genealogy of Cain down to Lamech.",
    "Orthodox": "Lists the descendants of Cain."
  },
  "19": {
    "Non-Denominational": "Lamech, a descendant of Cain, takes two wives, Adah and Zillah, introducing polygamy.",
    "General": "Lamech, a descendant of Cain, takes two wives, Adah and Zillah, introducing polygamy.",
    "Baptist": "Lamech further departs from God's design by instituting polygamy.",
    "Catholic": "Lamech introduces polygamy, violating the original unity of marriage established by God.",
    "Methodist": "Shows further degradation of God's original plan through the introduction of polygamy.",
    "Lutheran": "Lamech introduces bigamy, contrary to God's institution of marriage.",
    "Presbyterian": "Lamech violates God's design for marriage by taking two wives.",
    "Pentecostal": "Lamech introduces polygamy, a departure from God's pattern.",
    "Anglican": "Lamech, a descendant of Cain, introduces polygamy.",
    "Orthodox": "Lamech takes two wives, marking a departure from the original monogamous union."
  },
  "20": {
    "Non-Denominational": "Adah gives birth to Jabal, the ancestor of those who live in tents and raise livestock.",
    "General": "Adah gives birth to Jabal, the ancestor of those who live in tents and raise livestock.",
    "Baptist": "Notes the development of nomadic, pastoral lifestyles within Cain's line.",
    "Catholic": "Jabal originates the nomadic pastoral way of life.",
    "Methodist": "Highlights the development of specific livelihoods (nomadic herding).",
    "Lutheran": "Jabal pioneers the lifestyle of nomadic shepherds.",
    "Presbyterian": "Notes the origin of nomadic pastoralism in Cain's line.",
    "Pentecostal": "Shows the beginning of nomadic lifestyles and animal husbandry.",
    "Anglican": "Jabal is noted as the ancestor of nomadic pastoralists.",
    "Orthodox": "Jabal originates the nomadic way of life associated with animal husbandry."
  },
  "21": {
    "Non-Denominational": "Jabal's brother is Jubal, the ancestor of all who play stringed instruments and pipes.",
    "General": "Jabal's brother is Jubal, the ancestor of all who play stringed instruments and pipes.",
    "Baptist": "Notes the development of music and arts within Cain's line.",
    "Catholic": "Jubal originates the musical arts.",
    "Methodist": "Highlights the development of cultural arts (music).",
    "Lutheran": "Jubal pioneers the art of music.",
    "Presbyterian": "Notes the origin of musicianship in Cain's line.",
    "Pentecostal": "Shows the beginning of musical arts.",
    "Anglican": "Jubal is noted as the ancestor of musicians.",
    "Orthodox": "Jubal originates the playing of musical instruments."
  },
  "22": {
    "Non-Denominational": "Zillah gives birth to Tubal-cain, who forged tools of bronze and iron. His sister is Naamah.",
    "General": "Zillah gives birth to Tubal-cain, who forged tools of bronze and iron. His sister is Naamah.",
    "Baptist": "Notes the development of metalworking technology within Cain's line.",
    "Catholic": "Tubal-cain originates metalworking crafts.",
    "Methodist": "Highlights the development of technology (metalworking).",
    "Lutheran": "Tubal-cain pioneers metalworking.",
    "Presbyterian": "Notes the origin of metalworking in Cain's line.",
    "Pentecostal": "Shows the beginning of craftsmanship in metals.",
    "Anglican": "Tubal-cain is noted as the ancestor of metalworkers. Naamah is mentioned.",
    "Orthodox": "Tubal-cain originates the craft of forging metals."
  },
  "23": {
    "Non-Denominational": "Lamech boasts to his wives, claiming he has killed a man for wounding him, escalating violence beyond self-defense.",
    "General": "Lamech boasts to his wives, claiming he has killed a man for wounding him, escalating violence beyond self-defense.",
    "Baptist": "Lamech's boast reveals escalating violence, pride, and disregard for human life in Cain's line.",
    "Catholic": "Lamech's 'Song of the Sword' exemplifies the arrogance and escalating violence characterizing Cain's lineage.",
    "Methodist": "Lamech's poem illustrates the pride and unchecked violence developing apart from God.",
    "Lutheran": "Lamech boasts of vengeful violence, showing the degradation of Cain's descendants.",
    "Presbyterian": "Lamech's boast demonstrates the increasing depravity and violence in Cain's line.",
    "Pentecostal": "Lamech's arrogant boast reveals a spirit of violence and vengeance.",
    "Anglican": "Lamech boasts to his wives about killing a man, showcasing escalating violence and pride.",
    "Orthodox": "Lamech's boastful song reveals the progression of violence and vengeance in Cain's line."
  },
  "24": {
    "Non-Denominational": "Lamech extends the principle of vengeance declared for Cain, boasting that if Cain is avenged sevenfold, then Lamech seventy-sevenfold, indicating extreme pride and violence.",
    "General": "Lamech extends the principle of vengeance declared for Cain, boasting that if Cain is avenged sevenfold, then Lamech seventy-sevenfold, indicating extreme pride and violence.",
    "Baptist": "Lamech twists God's protective decree for Cain into a boast of extreme personal vengeance.",
    "Catholic": "Lamech arrogantly magnifies the principle of vengeance far beyond God's protective measure for Cain.",
    "Methodist": "Lamech perverts God's mercy into a justification for unlimited personal revenge.",
    "Lutheran": "Lamech proudly claims extreme vengeance for himself, perverting God's grace to Cain.",
    "Presbyterian": "Lamech arrogantly escalates the principle of vengeance, showing extreme pride.",
    "Pentecostal": "Lamech boasts of excessive vengeance, demonstrating profound arrogance.",
    "Anglican": "Lamech arrogantly claims a far greater degree of vengeance for himself than was promised for Cain.",
    "Orthodox": "Lamech boasts of disproportionate vengeance, showing extreme pride and perverting God's protection of Cain."
  },
  "25": {
    "Non-Denominational": "Adam and Eve have another son, Seth. Eve sees him as God's provision, a replacement ('appointed') for Abel, whom Cain killed.",
    "General": "Adam and Eve have another son, Seth. Eve sees him as God's provision, a replacement ('appointed') for Abel, whom Cain killed.",
    "Baptist": "God provides Seth to carry on the godly line after Abel's death.",
    "Catholic": "Seth's birth signifies God's continued blessing and the beginning of the lineage through which redemption will come.",
    "Methodist": "God graciously provides Seth to continue the lineage of promise.",
    "Lutheran": "God provides Seth as the replacement for Abel, continuing the line of faith.",
    "Presbyterian": "God sovereignly provides Seth to continue the covenant line from which the promised Seed will come.",
    "Pentecostal": "God appoints Seth to replace Abel and carry the godly heritage.",
    "Anglican": "Seth is born, seen by Eve as God's provision to replace Abel and continue the lineage.",
    "Orthodox": "God grants Seth ('appointed') to replace Abel, ensuring the continuation of the godly line."
  },
  "26": {
    "Non-Denominational": "Seth also has a son, named Enosh. At this time, the text notes, people began to 'call upon the name of the Lord,' suggesting the beginning of formal or public worship.",
    "General": "Seth also has a son, named Enosh. At this time, the text notes, people began to 'call upon the name of the Lord,' suggesting the beginning of formal or public worship.",
    "Baptist": "Marks the beginning of public worship or invocation of God's name in prayer and praise within Seth's line.",
    "Catholic": "In the time of Enosh (meaning 'mortal man'), public invocation of God's name begins, signifying formal worship and differentiation from Cain's line.",
    "Methodist": "Highlights a revival of piety and the beginning of communal worship in Seth's generation.",
    "Lutheran": "Public worship begins; people start calling on the Lord, signifying the presence of faith.",
    "Presbyterian": "Marks the beginning of formal, public covenant worship ('calling on the name of the Lord') in the line of Seth.",
    "Pentecostal": "A time of seeking God begins, with people publicly calling upon His name.",
    "Anglican": "With the birth of Enosh, people began the practice of public worship ('calling on the name of the Lord').",
    "Orthodox": "In the generation of Enosh ('frail man'), the formal invocation of God's name begins, marking the start of organized worship."
  }
} 