{
  "_comment": "Interpretations for Genesis Chapter 40",
  "book": "Genesis",
  "chapter": "40",
  "verses": {
  "1": {
      "General": "Some time later, the cupbearer and the baker of the king of Egypt offended their master, the king of Egypt.",
      "Non-Denominational": "Some time later, the cupbearer and the baker of the king of Egypt offended their master, the king of Egypt.",
      "Baptist": "Introduces two new characters: Pharaoh's chief cupbearer (butler) and chief baker. Both officials commit an unspecified offense against Pharaoh, leading to their downfall.",
      "Catholic": "The narrative introduces two significant officials from Pharaoh's court, the chief cupbearer and the chief baker, who fall into disgrace by offending their master, the king of Egypt.",
      "Methodist": "Pharaoh's cupbearer and baker offend the king.",
      "Lutheran": "After this, the cupbearer of the king of Egypt and his baker committed an offense against their lord the king of Egypt.",
      "Presbyterian": "The narrative introduces Pharaoh's cupbearer and baker, who offend the king, setting the stage for their imprisonment with Joseph.",
      "Pentecostal": "Pharaoh's cupbearer and baker offend the king.",
      "Episcopalian/Anglican": "Pharaoh's cupbearer and baker offend their master, the king of Egypt.",
      "Orthodox": "Two prominent court officials, the chief cupbearer and chief baker, incur Pharaoh's displeasure through an unspecified offense.",
      "Other": "Some time later, the cupbearer and the baker of the king of Egypt offended their master, the king of Egypt.",
      "Prefer not to say": "Some time later, the cupbearer and the baker of the king of Egypt offended their master, the king of Egypt."
  },
  "2": {
      "General": "Pharaoh was angry with his two officials, the chief cupbearer and the chief baker,",
      "Non-Denominational": "Pharaoh was angry with his two officials, the chief cupbearer and the chief baker,",
      "Baptist": "Pharaoh reacts with anger towards these two high-ranking officials due to their offense.",
      "Catholic": "Pharaoh expresses his anger towards these two court officials as a result of their offense.",
      "Methodist": "Pharaoh becomes angry with both officials.",
      "Lutheran": "Pharaoh was angry with his two officers, the chief cupbearer and the chief baker.",
      "Presbyterian": "Pharaoh's anger leads to the officials' imprisonment.",
      "Pentecostal": "Pharaoh is angry with the cupbearer and baker.",
      "Episcopalian/Anglican": "Pharaoh is angry with his chief cupbearer and chief baker.",
      "Orthodox": "Pharaoh's anger is directed at these two officials.",
      "Other": "Pharaoh was angry with his two officials, the chief cupbearer and the chief baker,",
      "Prefer not to say": "Pharaoh was angry with his two officials, the chief cupbearer and the chief baker,"
  },
  "3": {
      "General": "and put them in custody in the house of the captain of the guard, in the same prison where Joseph was confined.",
      "Non-Denominational": "and put them in custody in the house of the captain of the guard, in the same prison where Joseph was confined.",
      "Baptist": "Pharaoh has them imprisoned in the facility overseen by the captain of the guard (Potiphar), specifically noting it's the same prison where Joseph is being held. This places them in proximity to Joseph.",
      "Catholic": "They are placed in custody within the house of the captain of the guard (Potiphar), specifically in the prison where Joseph was already incarcerated. This brings them into contact with Joseph.",
      "Methodist": "He imprisons them in the house of the captain of the guard (Potiphar), the same prison where Joseph is.",
      "Lutheran": "He put them in custody in the house of the captain of the guard, in the prison where Joseph was confined.",
      "Presbyterian": "They are imprisoned under the authority of the captain of the guard (Potiphar), in the same location as Joseph, facilitating their interaction.",
      "Pentecostal": "They are put in custody in the captain of the guard's house, the prison where Joseph is.",
      "Episcopalian/Anglican": "Pharaoh puts them in custody in the house of the captain of the guard, in the same prison where Joseph is confined.",
      "Orthodox": "They are incarcerated under the supervision of the captain of the guard (Potiphar), bringing them into the same prison environment as Joseph.",
      "Other": "and put them in custody in the house of the captain of the guard, in the same prison where Joseph was confined.",
      "Prefer not to say": "and put them in custody in the house of the captain of the guard, in the same prison where Joseph was confined."
  },
  "4": {
      "General": "The captain of the guard assigned them to Joseph, and he attended them.",
      "Non-Denominational": "The captain of the guard assigned them to Joseph, and he attended them.",
      "Baptist": "Reflecting Joseph's trusted position (established in Ch 39), the captain of the guard (or the chief jailer acting under him) assigns Joseph to attend to the needs of these high-profile prisoners.",
      "Catholic": "The captain of the guard (Potiphar, or perhaps the chief jailer under his authority) assigns Joseph to serve these two officials, attending to their needs during their imprisonment.",
      "Methodist": "The captain assigns Joseph to attend to these officials.",
      "Lutheran": "The captain of the guard appointed Joseph to be with them, and he attended them. They continued for some time in custody.",
      "Presbyterian": "Joseph, due to his position of responsibility in the prison, is assigned to care for the cupbearer and baker.",
      "Pentecostal": "Captain assigns Joseph to attend to the cupbearer and baker.",
      "Episcopalian/Anglican": "The captain of the guard assigns Joseph to attend to the cupbearer and baker.",
      "Orthodox": "Joseph is tasked by the prison authorities with attending to the requirements of these two prominent prisoners.",
      "Other": "The captain of the guard assigned them to Joseph, and he attended them.",
      "Prefer not to say": "The captain of the guard assigned them to Joseph, and he attended them."
  },
  "5": {
      "General": "After they had been in custody for some time, each of the two men—the cupbearer and the baker of the king of Egypt, who were being held in prison—had a dream the same night, and each dream had a meaning of its own.",
      "Non-Denominational": "After they had been in custody for some time, each of the two men—the cupbearer and the baker of the king of Egypt, who were being held in prison—had a dream the same night, and each dream had a meaning of its own.",
      "Baptist": "While imprisoned, both the cupbearer and the baker have significant dreams on the same night. The text emphasizes that each dream had its own distinct interpretation.",
      "Catholic": "During their confinement, both officials have dreams on the same night. The narrative highlights that each dream possessed its own unique significance and interpretation.",
      "Methodist": "Both men have dreams on the same night, each with its own meaning.",
      "Lutheran": "Both of them, the cupbearer and the baker of the king of Egypt, who were confined in the prison, dreamed a dream the same night, each according to the interpretation of his own dream.",
      "Presbyterian": "Both officials receive dreams on the same night, each dream carrying a specific, distinct meaning, setting up Joseph's role as interpreter.",
      "Pentecostal": "Cupbearer and baker both dream on the same night; each dream has its own meaning.",
      "Episcopalian/Anglican": "The cupbearer and baker both have dreams on the same night while in prison, each dream having its own specific meaning.",
      "Orthodox": "On a single night, both the cupbearer and the baker experience dreams, each bearing a unique interpretation relevant to their situation.",
      "Other": "After they had been in custody for some time, each of the two men—the cupbearer and the baker of the king of Egypt, who were being held in prison—had a dream the same night, and each dream had a meaning of its own.",
      "Prefer not to say": "After they had been in custody for some time, each of the two men—the cupbearer and the baker of the king of Egypt, who were being held in prison—had a dream the same night, and each dream had a meaning of its own."
  },
  "6": {
      "General": "When Joseph came to them the next morning, he saw that they were dejected.",
      "Non-Denominational": "When Joseph came to them the next morning, he saw that they were dejected.",
      "Baptist": "Attending to them the following morning, Joseph observes their troubled or dejected appearance, indicating the dreams had disturbed them.",
      "Catholic": "The next morning, when Joseph comes to attend to them, he notices their despondent or troubled demeanor, evidently caused by their dreams.",
      "Methodist": "Joseph sees they are dejected or sad the next morning.",
      "Lutheran": "When Joseph came to them in the morning, he saw that they were troubled.",
      "Presbyterian": "Joseph notices their distress the next morning, prompting his inquiry.",
      "Pentecostal": "Joseph sees they are sad/troubled in the morning.",
      "Episcopalian/Anglican": "Joseph notices the next morning that the cupbearer and baker appear dejected.",
      "Orthodox": "Joseph perceives their troubled state the following morning, suggesting the dreams left a significant impact.",
      "Other": "When Joseph came to them the next morning, he saw that they were dejected.",
      "Prefer not to say": "When Joseph came to them the next morning, he saw that they were dejected."
  },
  "7": {
      "General": "So he asked Pharaoh's officials who were in custody with him in his master's house, \"Why do you look so sad today?\"",
      "Non-Denominational": "So he asked Pharaoh's officials who were in custody with him in his master's house, \"Why do you look so sad today?\"",
      "Baptist": "Joseph shows compassion and initiative by inquiring about the cause of their sadness or troubled appearance.",
      "Catholic": "Displaying concern, Joseph asks these officials, imprisoned alongside him, the reason for their evident sadness ('Why are your faces downcast today').",
      "Methodist": "Joseph asks them why they look sad.",
      "Lutheran": "He asked Pharaoh's officers who were with him in custody in his master's house, 'Why are your faces downcast today?'",
      "Presbyterian": "Joseph demonstrates empathy by asking about the cause of their distress.",
      "Pentecostal": "Joseph asks them why they look sad.",
      "Episcopalian/Anglican": "Joseph inquires why the officials look so dejected.",
      "Orthodox": "Joseph shows empathy and initiative by inquiring about the reason for their distress.",
      "Other": "So he asked Pharaoh's officials who were in custody with him in his master's house, \"Why do you look so sad today?\"",
      "Prefer not to say": "So he asked Pharaoh's officials who were in custody with him in his master's house, \"Why do you look so sad today?\""
  },
  "8": {
      "General": "\"We both had dreams,\" they answered, \"but there is no one to interpret them.\" Then Joseph said to them, \"Do not interpretations belong to God? Tell me your dreams.\"",
      "Non-Denominational": "\"We both had dreams,\" they answered, \"but there is no one to interpret them.\" Then Joseph said to them, \"Do not interpretations belong to God? Tell me your dreams.\"",
      "Baptist": "They explain their distress stems from having dreams but lacking an interpreter. Joseph responds by affirming that the ability to interpret dreams comes solely from God ('Do not interpretations belong to God?') and then invites them to share their dreams with him, implying God can reveal the meaning through him.",
      "Catholic": "They reply that they have each dreamed but lack an interpreter. Joseph immediately directs them to the divine source of interpretation ('Do not interpretations belong to God?'), implicitly positioning himself as a potential conduit for God's revelation, and invites them to narrate their dreams.",
      "Methodist": "They explain they had dreams but no interpreter. Joseph affirms interpretations belong to God and asks them to tell him their dreams.",
      "Lutheran": "They said they dreamed dreams, and there is no interpreter. Joseph asked if interpretations belong to God and invited them to tell him the dreams.",
      "Presbyterian": "They attribute their sadness to uninterpreted dreams. Joseph points to God as the source of interpretation and invites them to share, positioning himself as God's instrument.",
      "Pentecostal": "They had dreams, no interpreter. Joseph points to God for interpretations, asks them to share.",
      "Episcopalian/Anglican": "They explain they had dreams but lack an interpreter. Joseph responds that interpretations belong to God and asks them to tell him their dreams.",
      "Orthodox": "They attribute their gloom to their dreams and the absence of an interpreter. Joseph asserts that interpretation originates with God and invites them to relate their dreams, implying he might receive insight from God.",
      "Other": "\"We both had dreams,\" they answered, \"but there is no one to interpret them.\" Then Joseph said to them, \"Do not interpretations belong to God? Tell me your dreams.\"",
      "Prefer not to say": "\"We both had dreams,\" they answered, \"but there is no one to interpret them.\" Then Joseph said to them, \"Do not interpretations belong to God? Tell me your dreams.\""
  },
  "9": {
      "General": "So the chief cupbearer told Joseph his dream. He said to him, \"In my dream I saw a vine in front of me,",
      "Non-Denominational": "So the chief cupbearer told Joseph his dream. He said to him, \"In my dream I saw a vine in front of me,",
      "Baptist": "The chief cupbearer recounts his dream first. It begins with the image of a grapevine before him.",
      "Catholic": "The chief cupbearer proceeds to narrate his dream to Joseph, starting with the central image of a vine.",
      "Methodist": "The cupbearer tells his dream: he saw a vine.",
      "Lutheran": "The chief cupbearer told his dream to Joseph, saying he saw a vine before him.",
      "Presbyterian": "The cupbearer begins recounting his dream, describing a vine.",
      "Pentecostal": "Cupbearer tells dream: saw a vine.",
      "Episcopalian/Anglican": "The chief cupbearer recounts his dream to Joseph, beginning with seeing a vine.",
      "Orthodox": "The chief cupbearer narrates his dream, commencing with the vision of a grapevine.",
      "Other": "So the chief cupbearer told Joseph his dream. He said to him, \"In my dream I saw a vine in front of me,",
      "Prefer not to say": "So the chief cupbearer told Joseph his dream. He said to him, \"In my dream I saw a vine in front of me,"
  },
  "10": {
      "General": "and on the vine were three branches. As soon as it budded, it blossomed, and its clusters ripened into grapes.",
      "Non-Denominational": "and on the vine were three branches. As soon as it budded, it blossomed, and its clusters ripened into grapes.",
      "Baptist": "The vine in the dream had three branches that rapidly went through the growth cycle: budding, blossoming, and producing ripe grapes.",
      "Catholic": "He describes the vine having three branches which miraculously and swiftly bud, blossom, and yield ripe clusters of grapes.",
      "Methodist": "The vine had three branches that quickly budded, blossomed, and produced ripe grapes.",
      "Lutheran": "On the vine were three branches. As it budded, its blossoms shot forth, and the clusters ripened into grapes.",
      "Presbyterian": "He describes three branches on the vine rapidly producing ripe grapes.",
      "Pentecostal": "Vine had 3 branches; quickly budded, blossomed, grapes ripened.",
      "Episcopalian/Anglican": "The vine had three branches that quickly budded, blossomed, and ripened into grapes.",
      "Orthodox": "The vine possessed three branches that underwent an accelerated process of budding, flowering, and yielding mature grapes.",
      "Other": "and on the vine were three branches. As soon as it budded, it blossomed, and its clusters ripened into grapes.",
      "Prefer not to say": "and on the vine were three branches. As soon as it budded, it blossomed, and its clusters ripened into grapes."
  },
  "11": {
      "General": "Pharaoh's cup was in my hand, and I took the grapes, squeezed them into Pharaoh's cup and put the cup in his hand.\"",
      "Non-Denominational": "Pharaoh's cup was in my hand, and I took the grapes, squeezed them into Pharaoh's cup and put the cup in his hand.\"",
      "Baptist": "In the dream, the cupbearer holds Pharaoh's cup, takes the ripe grapes, presses them into the cup (making fresh wine/juice), and serves it directly to Pharaoh, reflecting his official duties.",
      "Catholic": "He sees himself holding Pharaoh's cup, taking the grapes, pressing their juice into the cup, and presenting the cup to Pharaoh, thus performing his function as royal cupbearer.",
      "Methodist": "He holds Pharaoh's cup, squeezes the grapes into it, and gives the cup to Pharaoh.",
      "Lutheran": "Pharaoh's cup was in his hand, and he took the grapes and pressed them into Pharaoh's cup and placed the cup into Pharaoh's hand.",
      "Presbyterian": "He dreams he is performing his duties: squeezing grapes into Pharaoh's cup and serving him.",
      "Pentecostal": "Had Pharaoh's cup, squeezed grapes into it, gave cup to Pharaoh.",
      "Episcopalian/Anglican": "The cupbearer dreams he holds Pharaoh's cup, squeezes the grapes into it, and places the cup in Pharaoh's hand.",
      "Orthodox": "In the dream, he holds Pharaoh's cup, presses the grapes into it, and serves the resulting beverage to Pharaoh, mirroring his courtly duties.",
      "Other": "Pharaoh's cup was in my hand, and I took the grapes, squeezed them into Pharaoh's cup and put the cup in his hand.\"",
      "Prefer not to say": "Pharaoh's cup was in my hand, and I took the grapes, squeezed them into Pharaoh's cup and put the cup in his hand.\""
  },
  "12": {
      "General": "\"This is what it means,\" Joseph said to him. \"The three branches are three days.",
      "Non-Denominational": "\"This is what it means,\" Joseph said to him. \"The three branches are three days.",
      "Baptist": "Joseph provides the interpretation, stating clearly its divine origin (implied from v. 8). He equates the three branches with three days.",
      "Catholic": "Joseph begins the interpretation, attributing the insight to God (as established in v. 8). He explains that the three branches symbolize three days.",
      "Methodist": "Joseph interprets: the three branches represent three days.",
      "Lutheran": "Joseph said this is its interpretation: the three branches are three days.",
      "Presbyterian": "Joseph begins the interpretation, equating the three branches to three days.",
      "Pentecostal": "Joseph interprets: 3 branches = 3 days.",
      "Episcopalian/Anglican": "Joseph gives the interpretation: the three branches signify three days.",
      "Orthodox": "Joseph delivers the interpretation, explaining that the three branches correspond to a period of three days.",
      "Other": "\"This is what it means,\" Joseph said to him. \"The three branches are three days.",
      "Prefer not to say": "\"This is what it means,\" Joseph said to him. \"The three branches are three days."
  },
  "13": {
      "General": "Within three days Pharaoh will lift up your head and restore you to your position, and you will put Pharaoh's cup in his hand, just as you used to do when you were his cupbearer.",
      "Non-Denominational": "Within three days Pharaoh will lift up your head and restore you to your position, and you will put Pharaoh's cup in his hand, just as you used to do when you were his cupbearer.",
      "Baptist": "Joseph predicts that within three days, Pharaoh will 'lift up the head' of the cupbearer (an idiom meaning restore or give attention to, often favorably) and reinstate him to his former position, resuming his duties.",
      "Catholic": "Joseph foretells that in three days, Pharaoh will 'lift up your head' (a phrase indicating restoration or pardon in this context) and restore the cupbearer to his office, allowing him to resume his task of serving Pharaoh's cup.",
      "Methodist": "Within three days, Pharaoh will restore the cupbearer to his position ('lift up your head'), and he will resume his duties.",
      "Lutheran": "In three days Pharaoh will lift up your head and restore you to your office, and you shall place Pharaoh's cup in his hand as formerly, when you were his cupbearer.",
      "Presbyterian": "Joseph predicts the cupbearer's restoration to his position within three days, signified by Pharaoh 'lifting up his head.'",
      "Pentecostal": "In 3 days, Pharaoh will restore cupbearer ('lift up head') to his job.",
      "Episcopalian/Anglican": "Joseph predicts that within three days, Pharaoh will restore the cupbearer to his position ('lift up your head'), and he will serve Pharaoh as before.",
      "Orthodox": "Joseph foretells the cupbearer's imminent restoration: within three days, Pharaoh will pardon him ('lift up your head') and reinstate him to his former duties.",
      "Other": "Within three days Pharaoh will lift up your head and restore you to your position, and you will put Pharaoh's cup in his hand, just as you used to do when you were his cupbearer.",
      "Prefer not to say": "Within three days Pharaoh will lift up your head and restore you to your position, and you will put Pharaoh's cup in his hand, just as you used to do when you were his cupbearer."
  },
  "14": {
      "General": "But when all goes well with you, remember me and show me kindness; mention me to Pharaoh and get me out of this prison.",
      "Non-Denominational": "But when all goes well with you, remember me and show me kindness; mention me to Pharaoh and get me out of this prison.",
      "Baptist": "Having delivered the good news, Joseph makes a personal appeal. He asks the cupbearer to remember him and show him kindness ('hesed') by mentioning his plight to Pharaoh once restored, hoping for release from prison.",
      "Catholic": "Joseph then makes a personal request: when the cupbearer is restored and prosperous ('when it is well with you'), he should remember Joseph, show him kindness ('hesed' - loyal favor), and intercede with Pharaoh to secure Joseph's release from prison.",
      "Methodist": "Joseph asks the cupbearer to remember him, show kindness ('hesed'), and mention him to Pharaoh to help get him released when things go well for the cupbearer.",
      "Lutheran": "He asks the cupbearer only to remember him when it is well with him, show him kindness (hesed), mention him to Pharaoh, and bring him out of this house (prison).",
      "Presbyterian": "Joseph appeals to the cupbearer to remember him and advocate for his release from unjust imprisonment once restored to favor.",
      "Pentecostal": "Joseph asks cupbearer: when you're restored, remember me, show kindness, mention me to Pharaoh, get me out.",
      "Episcopalian/Anglican": "Joseph appeals to the cupbearer to remember him and show kindness by mentioning him to Pharaoh to secure his release from prison.",
      "Orthodox": "Joseph makes a heartfelt plea for the cupbearer, upon his restoration, to remember him, demonstrate kindness ('hesed'), and advocate to Pharaoh for his release from imprisonment.",
      "Other": "But when all goes well with you, remember me and show me kindness; mention me to Pharaoh and get me out of this prison.",
      "Prefer not to say": "But when all goes well with you, remember me and show me kindness; mention me to Pharaoh and get me out of this prison."
  },
  "15": {
      "General": "I was forcibly carried off from the land of the Hebrews, and even here I have done nothing to deserve being put in a dungeon.\"",
      "Non-Denominational": "I was forcibly carried off from the land of the Hebrews, and even here I have done nothing to deserve being put in a dungeon.\"",
      "Baptist": "Joseph briefly explains his situation, emphasizing his innocence: he was unjustly kidnapped ('stolen') from his homeland and has done nothing wrong in Egypt to warrant imprisonment.",
      "Catholic": "Joseph justifies his plea by briefly recounting his innocence: he was unjustly taken ('stolen') from the land of the Hebrews, and likewise, he committed no offense in Egypt deserving of imprisonment ('the pit').",
      "Methodist": "Joseph explains his innocence: he was kidnapped ('stolen') from home and did nothing here to deserve prison.",
      "Lutheran": "He explains he was stolen from the land of the Hebrews and has done nothing here that they should put him into the pit (dungeon).",
      "Presbyterian": "Joseph asserts his innocence, stating he was kidnapped from home and unjustly imprisoned in Egypt.",
      "Pentecostal": "Joseph explains his innocence: kidnapped from home, did nothing here to deserve prison.",
      "Episcopalian/Anglican": "Joseph emphasizes his innocence, stating he was forcibly taken from his homeland and has done nothing in Egypt to deserve imprisonment.",
      "Orthodox": "Joseph briefly asserts his innocence, stating he was abducted from his homeland and has committed no crime in Egypt warranting incarceration.",
      "Other": "I was forcibly carried off from the land of the Hebrews, and even here I have done nothing to deserve being put in a dungeon.\"",
      "Prefer not to say": "I was forcibly carried off from the land of the Hebrews, and even here I have done nothing to deserve being put in a dungeon.\""
  },
  "16": {
      "General": "When the chief baker saw that Joseph had given a favorable interpretation, he said to Joseph, \"I too had a dream: On my head were three baskets of white bread.",
      "Non-Denominational": "When the chief baker saw that Joseph had given a favorable interpretation, he said to Joseph, \"I too had a dream: On my head were three baskets of white bread.",
      "Baptist": "Encouraged by the positive interpretation given to the cupbearer, the chief baker shares his own dream. It begins with three baskets of white bread (or fine baked goods) balanced on his head.",
      "Catholic": "Observing the favorable nature of the cupbearer's interpretation, the chief baker is prompted to relate his own dream, which involves three baskets of white bread (or possibly cakes) carried on his head.",
      "Methodist": "Seeing the favorable interpretation for the cupbearer, the baker tells his dream: three baskets of white bread on his head.",
      "Lutheran": "When the chief baker saw that the interpretation was favorable, he told Joseph about his dream: three baskets of white bread were on his head.",
      "Presbyterian": "Encouraged by the good news for the cupbearer, the baker shares his dream involving three baskets of bread on his head.",
      "Pentecostal": "Baker sees good interpretation for cupbearer, shares his dream: 3 baskets of white bread on head.",
      "Episcopalian/Anglican": "Encouraged by the favorable interpretation given to the cupbearer, the chief baker recounts his dream involving three baskets of white bread on his head.",
      "Orthodox": "Motivated by the positive interpretation received by the cupbearer, the chief baker recounts his dream, featuring three baskets of bread carried upon his head.",
      "Other": "When the chief baker saw that Joseph had given a favorable interpretation, he said to Joseph, \"I too had a dream: On my head were three baskets of white bread.",
      "Prefer not to say": "When the chief baker saw that Joseph had given a favorable interpretation, he said to Joseph, \"I too had a dream: On my head were three baskets of white bread."
  },
  "17": {
      "General": "In the top basket were all kinds of baked goods for Pharaoh, but the birds were eating them out of the basket on my head.\"",
      "Non-Denominational": "In the top basket were all kinds of baked goods for Pharaoh, but the birds were eating them out of the basket on my head.\"",
      "Baptist": "The uppermost basket contained various baked goods intended for Pharaoh, but birds were eating these goods directly from the basket while it was still on the baker's head.",
      "Catholic": "The top basket contained assorted baked goods prepared for Pharaoh, but birds were consuming them from the basket while it remained on the baker's head.",
      "Methodist": "The top basket had baked goods for Pharaoh, but birds were eating from it while on his head.",
      "Lutheran": "In the uppermost basket were all sorts of baked goods for Pharaoh, but the birds were eating them out of the basket on his head.",
      "Presbyterian": "He describes birds eating Pharaoh's baked goods from the top basket on his head.",
      "Pentecostal": "Top basket had baked goods for Pharaoh, but birds ate them from the basket on his head.",
      "Episcopalian/Anglican": "The top basket held various baked goods for Pharaoh, but birds were eating them out of the basket on his head.",
      "Orthodox": "The uppermost basket held baked items for Pharaoh, yet birds were consuming them directly from the basket atop his head.",
      "Other": "In the top basket were all kinds of baked goods for Pharaoh, but the birds were eating them out of the basket on my head.\"",
      "Prefer not to say": "In the top basket were all kinds of baked goods for Pharaoh, but the birds were eating them out of the basket on my head.\""
  },
  "18": {
      "General": "\"This is what it means,\" Joseph answered. \"The three baskets are three days.",
      "Non-Denominational": "\"This is what it means,\" Joseph answered. \"The three baskets are three days.",
      "Baptist": "Joseph begins interpreting the baker's dream, again equating the three baskets with three days.",
      "Catholic": "Joseph proceeds to interpret the baker's dream, stating that the three baskets likewise symbolize three days.",
      "Methodist": "Joseph interprets: the three baskets represent three days.",
      "Lutheran": "Joseph answered, 'This is its interpretation: the three baskets are three days.'",
      "Presbyterian": "Joseph begins interpreting the baker's dream, identifying the three baskets as three days.",
      "Pentecostal": "Joseph interprets: 3 baskets = 3 days.",
      "Episcopalian/Anglican": "Joseph gives the interpretation: the three baskets signify three days.",
      "Orthodox": "Joseph provides the interpretation, explaining that the three baskets correspond to three days.",
      "Other": "\"This is what it means,\" Joseph answered. \"The three baskets are three days.",
      "Prefer not to say": "\"This is what it means,\" Joseph answered. \"The three baskets are three days."
  },
  "19": {
      "General": "Within three days Pharaoh will lift off your head and impale your body on a pole. And the birds will eat away your flesh.\"",
      "Non-Denominational": "Within three days Pharaoh will lift off your head and impale your body on a pole. And the birds will eat away your flesh.\"",
      "Baptist": "Joseph delivers a grim interpretation: within three days, Pharaoh will 'lift up the head from off' the baker (same idiom as v.13 but used negatively, meaning execution, likely decapitation) and hang his body on a tree/pole, where birds will eat his flesh (reflecting the birds in the dream).",
      "Catholic": "Joseph reveals the dream's ominous meaning: within three days, Pharaoh will 'lift up your head from you' (signifying execution, possibly decapitation) and hang the baker's corpse on a tree, where birds will consume his flesh, mirroring the dream's imagery.",
      "Methodist": "Within three days, Pharaoh will execute the baker ('lift your head from you') and hang his body on a pole, where birds will eat his flesh.",
      "Lutheran": "In three days Pharaoh will lift up your head—from you!—and hang you on a tree. And the birds will eat the flesh from you.",
      "Presbyterian": "Joseph predicts the baker's execution ('lift up your head from you') and public display of his body within three days, echoing the dream's imagery.",
      "Pentecostal": "In 3 days, Pharaoh will execute baker ('lift head from you'), hang body on pole, birds eat flesh.",
      "Episcopalian/Anglican": "Joseph predicts that within three days, Pharaoh will execute the baker ('lift off your head') and hang his body on a pole, where birds will eat his flesh.",
      "Orthodox": "Joseph conveys the dire interpretation: within three days, Pharaoh will execute the baker ('lift up your head from upon you') and display his corpse impaled on wood, where birds will devour his flesh.",
      "Other": "Within three days Pharaoh will lift off your head and impale your body on a pole. And the birds will eat away your flesh.\"",
      "Prefer not to say": "Within three days Pharaoh will lift off your head and impale your body on a pole. And the birds will eat away your flesh.\""
  },
  "20": {
      "General": "Now the third day was Pharaoh's birthday, and he gave a feast for all his officials. He lifted up the heads of the chief cupbearer and the chief baker in the presence of his officials:",
      "Non-Denominational": "Now the third day was Pharaoh's birthday, and he gave a feast for all his officials. He lifted up the heads of the chief cupbearer and the chief baker in the presence of his officials:",
      "Baptist": "The third day arrives, coinciding with Pharaoh's birthday celebration and feast. During this event, Pharaoh makes a decision regarding the two officials ('lifted up the heads'), bringing their cases to resolution before his court.",
      "Catholic": "The fulfillment occurs on the third day, Pharaoh's birthday, during a banquet for his officials. On this occasion, Pharaoh publicly dealt with the cases of the chief cupbearer and chief baker ('lifted up the head of...'), deciding their fates.",
      "Methodist": "On the third day, Pharaoh's birthday, he holds a feast and publicly addresses the cases of the cupbearer and baker ('lifted up the heads').",
      "Lutheran": "On the third day, which was Pharaoh's birthday, he made a feast for all his servants and lifted up the head of the chief cupbearer and the head of the chief baker among his servants.",
      "Presbyterian": "Joseph's interpretations are fulfilled exactly three days later on Pharaoh's birthday, when Pharaoh pronounces judgment on both officials.",
      "Pentecostal": "Third day is Pharaoh's birthday feast. He deals with cupbearer/baker cases ('lifted heads') before officials.",
      "Episcopalian/Anglican": "On the third day, Pharaoh's birthday, he gives a feast and publicly settles the cases of the chief cupbearer and chief baker ('lifted up the heads').",
      "Orthodox": "On the third day, coinciding with Pharaoh's birthday feast, Pharaoh brings the cases of the cupbearer and baker to a public resolution ('lifted up the head').",
      "Other": "Now the third day was Pharaoh's birthday, and he gave a feast for all his officials. He lifted up the heads of the chief cupbearer and the chief baker in the presence of his officials:",
      "Prefer not to say": "Now the third day was Pharaoh's birthday, and he gave a feast for all his officials. He lifted up the heads of the chief cupbearer and the chief baker in the presence of his officials:"
  },
  "21": {
      "General": "He restored the chief cupbearer to his position, so that he once again put the cup into Pharaoh's hand,",
      "Non-Denominational": "He restored the chief cupbearer to his position, so that he once again put the cup into Pharaoh's hand,",
      "Baptist": "Just as Joseph predicted, Pharaoh restores the chief cupbearer to his former office and duties.",
      "Catholic": "In fulfillment of Joseph's interpretation, Pharaoh reinstates the chief cupbearer to his position, allowing him to resume serving the king.",
      "Methodist": "Pharaoh restores the cupbearer to his job, fulfilling Joseph's interpretation.",
      "Lutheran": "He restored the chief cupbearer to his position, and he placed the cup in Pharaoh's hand.",
      "Presbyterian": "The cupbearer is restored to his former position, exactly as Joseph foretold.",
      "Pentecostal": "Cupbearer restored to his position, serves Pharaoh again.",
      "Episcopalian/Anglican": "Pharaoh restores the chief cupbearer to his position, fulfilling Joseph's prediction.",
      "Orthodox": "In accordance with Joseph's interpretation, the chief cupbearer is reinstated to his former office.",
      "Other": "He restored the chief cupbearer to his position, so that he once again put the cup into Pharaoh's hand,",
      "Prefer not to say": "He restored the chief cupbearer to his position, so that he once again put the cup into Pharaoh's hand,"
  },
  "22": {
      "General": "but he impaled the chief baker, just as Joseph had said to them in his interpretation.",
      "Non-Denominational": "but he impaled the chief baker, just as Joseph had said to them in his interpretation.",
      "Baptist": "Also fulfilling Joseph's interpretation, Pharaoh has the chief baker executed by hanging/impalement.",
      "Catholic": "Correspondingly, Pharaoh executes the chief baker by hanging him, precisely as Joseph had interpreted his dream.",
      "Methodist": "Pharaoh executes the baker by hanging/impalement, also fulfilling Joseph's interpretation.",
      "Lutheran": "But he hanged the chief baker, as Joseph had interpreted to them.",
      "Presbyterian": "The baker is executed and his body displayed, exactly as Joseph predicted.",
      "Pentecostal": "Baker is hanged/impaled, just as Joseph interpreted.",
      "Episcopalian/Anglican": "Pharaoh executes the chief baker by hanging/impalement, also as Joseph had interpreted.",
      "Orthodox": "Conversely, the chief baker is executed by hanging/impalement, precisely fulfilling Joseph's interpretation.",
      "Other": "but he impaled the chief baker, just as Joseph had said to them in his interpretation.",
      "Prefer not to say": "but he impaled the chief baker, just as Joseph had said to them in his interpretation."
  },
  "23": {
      "General": "The chief cupbearer, however, did not remember Joseph; he forgot him.",
      "Non-Denominational": "The chief cupbearer, however, did not remember Joseph; he forgot him.",
      "Baptist": "Despite Joseph's accurate interpretation and his plea (v. 14), the restored chief cupbearer forgets about Joseph once he is back in his position of comfort and privilege.",
      "Catholic": "Despite the accuracy of the interpretation and Joseph's specific request, the chief cupbearer, once restored to his position, fails to remember Joseph and neglects his plea.",
      "Methodist": "Despite Joseph's help and request, the cupbearer forgets Joseph after being restored.",
      "Lutheran": "Yet the chief cupbearer did not remember Joseph, but forgot him.",
      "Presbyterian": "The cupbearer fails to remember Joseph or advocate for him, leaving Joseph languishing in prison.",
      "Pentecostal": "Cupbearer gets restored but forgets Joseph.",
      "Episcopalian/Anglican": "The chief cupbearer, however, fails to remember Joseph and forgets his request.",
      "Orthodox": "Regrettably, the restored chief cupbearer fails to recall Joseph or act upon his plea, leaving him forgotten in prison.",
      "Other": "The chief cupbearer, however, did not remember Joseph; he forgot him.",
      "Prefer not to say": "The chief cupbearer, however, did not remember Joseph; he forgot him."
    }
  }
} 