{
  "chapterSummary": {
    "General": "Genesis 47 describes the settlement of Jacob's family in Goshen. Joseph presents some brothers and then Jacob to Pharaoh. Jacob blesses Pharaoh and states his age (130). Pharaoh grants them Goshen. Joseph provides for his family. As the famine worsens, Joseph implements a policy where Egyptians exchange livestock, then land, and finally themselves for food, making all land (except priests') and people Pharaoh's property, subject to a one-fifth tax. Israel thrives and multiplies in Goshen. Jacob lives 17 years in Egypt (to age 147). Nearing death, he makes Joseph swear to bury him in Canaan with his ancestors, not Egypt. Joseph swears, and Jacob worships God.",
    "Non-Denominational": "Focuses on themes of settlement, blessing (Jacob blesses Pharaoh), wisdom and administration (Joseph's famine policy), preservation of Israel in Goshen, contrasting outcomes (Egyptians lose land/freedom, Israelites thrive), faithfulness to heritage (Jacob's burial request), and piety in old age (Jacob worships).",
    "Baptist": "Highlights Joseph's wise administration, God's blessing on Israel causing them to multiply even in a foreign land, Jacob's faith expressed in blessing Pharaoh and desiring burial in Canaan (the promised land). Joseph's policy, while harsh, is seen within the context of survival and perhaps points to the need for ultimate redemption beyond earthly rulers.",
    "Catholic": "Notes Jacob's patriarchal blessing upon Pharaoh, the fulfillment of God's promise for Israel to thrive in Egypt, the socio-economic impact of Joseph's famine policies (centralizing power), Jacob's profound attachment to the promised land shown in his burial request (an act of faith in future promises), and his final act of worship.",
    "Methodist": "Stresses the practical aspects of settlement, Joseph's effective (though potentially controversial) governance during crisis, the contrast between Israel's flourishing and Egypt's servitude, Jacob's enduring connection to his ancestral land and faith, and his peaceful preparation for death expressed through the oath and worship.",
    "Lutheran": "Views Joseph's policies as Law, preserving life physically but leading to bondage. Israel's flourishing in Goshen shows God's grace preserving His people separately. Jacob's blessing of Pharaoh shows the patriarch's authority. His burial request demonstrates faith in God's promise tied to Canaan, looking beyond Egypt.",
    "Presbyterian": "Underscores God's providence in settling Israel favorably in Goshen and causing them to multiply according to His plan. Joseph's administration, while consolidating Pharaoh's power, served God's purpose of preserving life. Jacob's insistence on burial in Canaan demonstrates unwavering faith in God's covenant land promise.",
    "Pentecostal": "May emphasize Jacob operating in patriarchal authority (blessing Pharaoh), God's supernatural blessing causing Israel's rapid multiplication, Joseph's wisdom in administration. Jacob's burial request is seen as a prophetic act of faith concerning the promised inheritance, and his worship as spiritual sensitivity nearing death.",
    "Anglican": "Notes the formal presentation to Pharaoh, the granting of Goshen, Joseph's administrative actions during the famine, the contrast between Israel's prosperity and Egypt's submission, Jacob's blessing of Pharaoh, and his significant final request regarding burial in Canaan, followed by an act of worship.",
    "Orthodox": "Views Jacob's blessing of Pharaoh as significant. Israel's flourishing in Goshen foreshadows their growth into a nation. Joseph's policies change Egypt's structure. Jacob's insistence on burial in Canaan underscores the importance of the promised land and ancestral tombs, signifying faith in the resurrection and God's ultimate promises. His worship is a final act of faith."
  },
  "1": {
    "Non-Denominational": "Joseph informs Pharaoh his family has arrived and are in Goshen.",
    "General": "Joseph informs Pharaoh his family has arrived and are in Goshen.",
    "Baptist": "Joseph formally reports the family's arrival as planned.",
    "Catholic": "Joseph dutifully informs Pharaoh of his family's presence and location.",
    "Methodist": "Joseph communicates the family's arrival to the Egyptian ruler.",
    "Lutheran": "Joseph reports to Pharaoh as required.",
    "Presbyterian": "Joseph formally notifies Pharaoh of his family's arrival.",
    "Pentecostal": "Joseph informs the authorities of the family's arrival.",
    "Anglican": "Joseph informs Pharaoh that his father and brothers have arrived and are in Goshen.",
    "Orthodox": "Joseph announces his family's arrival to Pharaoh."
  },
  "2": {
    "Non-Denominational": "He presents five of his brothers to Pharaoh.",
    "General": "He presents five of his brothers to Pharaoh.",
    "Baptist": "Presenting representatives of the family to the king.",
    "Catholic": "Joseph formally introduces a delegation of his brothers to the Pharaoh.",
    "Methodist": "Joseph facilitates the formal introduction of his brothers.",
    "Lutheran": "Joseph brings some brothers before Pharaoh.",
    "Presbyterian": "Joseph presents representatives of his family to Pharaoh.",
    "Pentecostal": "Introducing some of the family to the ruler.",
    "Anglican": "Joseph selects five brothers to formally present to Pharaoh.",
    "Orthodox": "Joseph presents a representative group of his brothers to Pharaoh."
  },
  "3": {
    "Non-Denominational": "Pharaoh asks their occupation.",
    "General": "Pharaoh asks their occupation.",
    "Baptist": "The expected question regarding their livelihood and potential role in Egypt.",
    "Catholic": "Pharaoh inquires about their profession, a standard question for newcomers.",
    "Methodist": "Pharaoh seeks practical information about the newcomers.",
    "Lutheran": "Pharaoh asks about their work.",
    "Presbyterian": "Pharaoh inquires about their occupation, relevant for settlement.",
    "Pentecostal": "The ruler asks about their profession.",
    "Anglican": "Pharaoh predictably asks about their occupation.",
    "Orthodox": "Pharaoh inquires about their means of subsistence."
  },
  "4": {
    "Non-Denominational": "Following Joseph's instruction, they identify as shepherds whose ancestors were also shepherds.",
    "General": "Following Joseph's instruction, they identify as shepherds whose ancestors were also shepherds.",
    "Baptist": "They follow the strategy, identifying with their traditional, perhaps lowly regarded, profession.",
    "Catholic": "They answer according to Joseph's counsel, stating their traditional family occupation.",
    "Methodist": "They implement Joseph's plan by stating their lifelong occupation.",
    "Lutheran": "They identify themselves as shepherds as instructed.",
    "Presbyterian": "They follow Joseph's wise counsel in identifying their occupation.",
    "Pentecostal": "They follow the strategy given by Joseph.",
    "Anglican": "As instructed by Joseph, they state that they and their ancestors have always been shepherds.",
    "Orthodox": "They declare their profession as shepherds, following Joseph's direction."
  },
  "5": {
    "Non-Denominational": "They request permission to live in Goshen due to the famine in Canaan.",
    "General": "They request permission to live in Goshen due to the famine in Canaan.",
    "Baptist": "Clearly stating their need and desired location.",
    "Catholic": "They formally request settlement in Goshen, citing the famine as the reason for leaving Canaan.",
    "Methodist": "They make the formal request for settlement in the desired region.",
    "Lutheran": "They request Goshen as their place of residence.",
    "Presbyterian": "They formally request to settle in Goshen.",
    "Pentecostal": "Making the request to dwell in Goshen.",
    "Anglican": "They formally request to settle in the Goshen area due to the lack of pasture in Canaan.",
    "Orthodox": "They petition Pharaoh to allow them to reside in Goshen."
  },
  "6": {
    "Non-Denominational": "Pharaoh grants permission, offering Goshen and suggesting capable brothers manage his livestock.",
    "General": "Pharaoh grants permission, offering Goshen and suggesting capable brothers manage his livestock.",
    "Baptist": "Pharaoh's favorable response, granting their request and even offering royal employment.",
    "Catholic": "Pharaoh graciously grants their request for Goshen and extends an offer of royal service, showing favor to Joseph's family.",
    "Methodist": "Pharaoh agrees, confirming the settlement plan and showing additional favor.",
    "Lutheran": "Pharaoh approves their request and offers employment.",
    "Presbyterian": "Pharaoh grants their request, confirming God's provision through him.",
    "Pentecostal": "Pharaoh responds favorably, granting permission and opportunity.",
    "Anglican": "Pharaoh grants their request to settle in Goshen and generously offers employment for capable men among them.",
    "Orthodox": "Pharaoh approves their settlement in Goshen and offers royal patronage."
  },
  "7": {
    "Non-Denominational": "Joseph brings Jacob before Pharaoh.",
    "General": "Joseph brings Jacob before Pharaoh.",
    "Baptist": "Presenting the patriarch of the family to the king.",
    "Catholic": "The formal presentation of the patriarch Jacob to the ruler of Egypt.",
    "Methodist": "The significant moment of Jacob's audience with Pharaoh.",
    "Lutheran": "Joseph presents his father to Pharaoh.",
    "Presbyterian": "Joseph formally presents Jacob to Pharaoh.",
    "Pentecostal": "Bringing the patriarch before the throne.",
    "Anglican": "Joseph then presents his father Jacob to Pharaoh.",
    "Orthodox": "Joseph introduces his father, the patriarch Jacob, to Pharaoh."
  },
  "8": {
    "Non-Denominational": "Jacob blesses Pharaoh.",
    "General": "Jacob blesses Pharaoh.",
    "Baptist": "An act of spiritual authority; the patriarch, bearer of God's covenant, blesses the gentile king.",
    "Catholic": "Jacob, as patriarch and heir of the blessing, invokes God's favor upon Pharaoh, signifying the superior spiritual status ('the lesser is blessed by the greater,' Heb 7:7).",
    "Methodist": "Shows Jacob acting with spiritual dignity, offering a blessing to the powerful ruler.",
    "Lutheran": "Jacob, as the bearer of God's promise, blesses the earthly ruler.",
    "Presbyterian": "Jacob, representing the covenant people, bestows a blessing upon the Egyptian king.",
    "Pentecostal": "Jacob operates in his patriarchal authority, imparting a blessing.",
    "Anglican": "Jacob greets Pharaoh with a blessing, an act of patriarchal dignity.",
    "Orthodox": "Jacob, the patriarch, bestows a blessing upon Pharaoh, signifying spiritual precedence."
  },
  "9": {
    "Non-Denominational": "Pharaoh asks Jacob his age.",
    "General": "Pharaoh asks Jacob his age.",
    "Baptist": "A natural question given Jacob's appearance and the formality of the occasion.",
    "Catholic": "Pharaoh respectfully inquires about the aged patriarch's lifespan.",
    "Methodist": "Pharaoh shows interest in the elderly patriarch.",
    "Lutheran": "Pharaoh asks Jacob how old he is.",
    "Presbyterian": "Pharaoh inquires about Jacob's age.",
    "Pentecostal": "Pharaoh asks about Jacob's years.",
    "Anglican": "Pharaoh asks Jacob his age.",
    "Orthodox": "Pharaoh inquires about Jacob's longevity."
  },
  "10": {
    "Non-Denominational": "Jacob answers 130 years, calling his life a pilgrimage, few and difficult compared to his ancestors.",
    "General": "Jacob answers 130 years, calling his life a pilgrimage, few and difficult compared to his ancestors.",
    "Baptist": "Jacob's humble perspective on his life: transient ('pilgrimage'), short, and full of hardship, reflecting a life of faith struggles.",
    "Catholic": "Jacob reflects on his life as a temporary sojourn, marked by hardship, acknowledging the greater longevity of previous patriarchs.",
    "Methodist": "Jacob offers a poignant summary of his life, emphasizing its transient and difficult nature.",
    "Lutheran": "Jacob views his life as a difficult journey, short compared to his forefathers.",
    "Presbyterian": "Jacob describes his life realistically as a difficult pilgrimage, reflecting his trials.",
    "Pentecostal": "Jacob reflects on his life's journey as short and challenging.",
    "Anglican": "Jacob states his age and reflects humbly on his life as a short and difficult pilgrimage compared to his ancestors.",
    "Orthodox": "Jacob describes his life as a pilgrimage (paroikia), emphasizing its transience and hardships."
  },
  "11": {
    "Non-Denominational": "Jacob blesses Pharaoh again before leaving.",
    "General": "Jacob blesses Pharaoh again before leaving.",
    "Baptist": "Concluding the audience with another bestowal of blessing.",
    "Catholic": "Jacob concludes the meeting by again invoking God's blessing upon the ruler.",
    "Methodist": "Jacob departs after offering a second blessing.",
    "Lutheran": "Jacob blesses Pharaoh again upon departure.",
    "Presbyterian": "Jacob concludes his audience with Pharaoh by offering another blessing.",
    "Pentecostal": "Jacob imparts a final blessing before leaving Pharaoh's presence.",
    "Anglican": "Jacob concludes his audience with Pharaoh by blessing him once more.",
    "Orthodox": "Jacob departs from Pharaoh's presence with a final blessing."
  },
  "12": {
    "Non-Denominational": "Joseph settles his family in the best land (Rameses/Goshen) as commanded.",
    "General": "Joseph settles his family in the best land (Rameses/Goshen) as commanded.",
    "Baptist": "Fulfilling Pharaoh's command and ensuring his family has prime resources.",
    "Catholic": "Joseph establishes his family in the fertile region designated by Pharaoh.",
    "Methodist": "Joseph implements the settlement plan in the most favorable area.",
    "Lutheran": "Joseph settles his family in the choice land of Goshen.",
    "Presbyterian": "Joseph settles his family in the best land provided by God's providence.",
    "Pentecostal": "Joseph establishes the family in the prime land of Goshen.",
    "Anglican": "Joseph settles his father and brothers in the best part of Egypt, the district of Rameses (Goshen).",
    "Orthodox": "Joseph settles his family in the most fertile part of Goshen (Rameses)."
  },
  "13": {
    "Non-Denominational": "Joseph provides food for the entire household according to their needs.",
    "General": "Joseph provides food for the entire household according to their needs.",
    "Baptist": "Joseph faithfully cares for his family's needs during the famine.",
    "Catholic": "Joseph ensures the sustenance of his entire extended family throughout the famine.",
    "Methodist": "Shows Joseph's ongoing care and provision for his relatives.",
    "Lutheran": "Joseph provides sustenance for his whole family.",
    "Presbyterian": "Joseph acts as God's instrument to provide for the covenant family.",
    "Pentecostal": "Joseph faithfully provides for his family's needs.",
    "Anglican": "Joseph ensures his entire family is provided with food according to their needs.",
    "Orthodox": "Joseph sustains his family with provisions throughout the famine."
  },
  "14": {
    "Non-Denominational": "The famine worsens; money fails in Egypt and Canaan.",
    "General": "The famine worsens; money fails in Egypt and Canaan.",
    "Baptist": "The situation deteriorates, leading to economic collapse.",
    "Catholic": "The increasing severity of the famine leads to the depletion of monetary resources.",
    "Methodist": "Highlights the escalating crisis and its economic impact.",
    "Lutheran": "The famine intensifies, causing money to become worthless.",
    "Presbyterian": "The severity of the famine leads to economic failure.",
    "Pentecostal": "The crisis deepens, rendering money useless.",
    "Anglican": "The famine becomes extremely severe, and money is exhausted in Egypt and Canaan.",
    "Orthodox": "The worsening famine causes a complete failure of the monetary system."
  },
  "15": {
    "Non-Denominational": "Egyptians come to Joseph for food, offering livestock when money is gone.",
    "General": "Egyptians come to Joseph for food, offering livestock when money is gone.",
    "Baptist": "People become desperate, offering their assets for survival.",
    "Catholic": "Driven by desperation, the Egyptians offer their livestock as payment for food.",
    "Methodist": "Shows the next stage of desperation: bartering livestock for grain.",
    "Lutheran": "The Egyptians offer their animals in exchange for food.",
    "Presbyterian": "The Egyptians turn to bartering livestock as the famine worsens.",
    "Pentecostal": "Desperation leads people to trade livestock for sustenance.",
    "Anglican": "With money gone, the Egyptians offer their livestock to Joseph in exchange for food.",
    "Orthodox": "The Egyptians resort to bartering their livestock for survival."
  },
  "16": {
    "Non-Denominational": "Joseph accepts livestock in exchange for food for a year.",
    "General": "Joseph accepts livestock in exchange for food for a year.",
    "Baptist": "Joseph implements the next phase of his famine policy.",
    "Catholic": "Joseph manages the crisis by exchanging food for the Egyptians' livestock.",
    "Methodist": "Joseph's policy allows people to survive another year by trading animals.",
    "Lutheran": "Joseph provides food in exchange for their animals.",
    "Presbyterian": "Joseph implements the policy of trading food for livestock.",
    "Pentecostal": "Joseph manages the exchange of livestock for food.",
    "Anglican": "Joseph provides food for the Egyptians for a year in exchange for their livestock.",
    "Orthodox": "Joseph exchanges food supplies for the Egyptians' livestock assets."
  },
  "17": {
    "Non-Denominational": "The next year, people offer their bodies and land, asking for seed and to become Pharaoh's slaves.",
    "General": "The next year, people offer their bodies and land, asking for seed and to become Pharaoh's slaves.",
    "Baptist": "Ultimate desperation: people offer their freedom and land for bare survival.",
    "Catholic": "In complete destitution, the Egyptians offer themselves and their land into bondage to Pharaoh in exchange for life and seed.",
    "Methodist": "The final stage of the crisis: people surrender their land and liberty for survival.",
    "Lutheran": "The Egyptians offer themselves and their land into servitude for food and seed.",
    "Presbyterian": "Total desperation leads the Egyptians to offer their land and freedom to Pharaoh.",
    "Pentecostal": "The people surrender everything, including their freedom, for survival.",
    "Anglican": "Having exhausted money and livestock, the Egyptians offer their land and themselves as slaves to Pharaoh in return for food and seed.",
    "Orthodox": "The Egyptians offer total servitude and surrender their land for seed and sustenance."
  },
  "18": {
    "Non-Denominational": "Joseph buys all the land (except priests') for Pharaoh.",
    "General": "Joseph buys all the land (except priests') for Pharaoh.",
    "Baptist": "Joseph consolidates land ownership under Pharaoh, centralizing state power.",
    "Catholic": "Joseph acquires almost all Egyptian land for the state, dramatically altering the socio-economic structure.",
    "Methodist": "Joseph implements the policy, transferring land ownership to Pharaoh.",
    "Lutheran": "Joseph acquires the land for Pharaoh as offered.",
    "Presbyterian": "Joseph carries out the transaction, bringing Egyptian land under Pharaoh's control.",
    "Pentecostal": "Joseph finalizes the transfer of land to Pharaoh.",
    "Anglican": "Joseph buys up all the private land in Egypt for Pharaoh, excluding the priests' land.",
    "Orthodox": "Joseph consolidates land ownership under Pharaoh, excepting the temple lands."
  },
  "19": {
    "Non-Denominational": "He moves people into cities.",
    "General": "He moves people into cities.",
    "Baptist": "Perhaps an administrative measure for distributing food or managing the now landless population.",
    "Catholic": "This relocation might reflect administrative reorganization or control over the newly dependent population.",
    "Methodist": "An administrative action, possibly related to food distribution or labor organization.",
    "Lutheran": "Joseph relocates the population, possibly for administrative efficiency.",
    "Presbyterian": "An administrative decision by Joseph to reorganize the population.",
    "Pentecostal": "Reorganizing the populace under the new system.",
    "Anglican": "Joseph relocates the people into cities across Egypt.",
    "Orthodox": "Joseph reorganizes the population, moving them into urban centers."
  },
  "20": {
    "Non-Denominational": "Priests' land is exempt as they received allowances from Pharaoh.",
    "General": "Priests' land is exempt as they received allowances from Pharaoh.",
    "Baptist": "Explaining the exception for the priestly class due to their state support.",
    "Catholic": "Notes the special status of the Egyptian priesthood, supported by state rations and thus retaining their land.",
    "Methodist": "Highlights the privileged status of the Egyptian priests.",
    "Lutheran": "The priests retain their land due to state support.",
    "Presbyterian": "Explains the exemption for the priestly class.",
    "Pentecostal": "The priests maintain their land due to their separate provision.",
    "Anglican": "Explains why the priests did not need to sell their land, as they were supported by Pharaoh.",
    "Orthodox": "The exemption of priestly lands highlights their distinct status in Egyptian society."
  },
  "21": {
    "Non-Denominational": "Joseph gives people seed, establishing a law: one-fifth of the harvest belongs to Pharaoh.",
    "General": "Joseph gives people seed, establishing a law: one-fifth of the harvest belongs to Pharaoh.",
    "Baptist": "Establishing a permanent tax system (20%) in exchange for seed and use of the land.",
    "Catholic": "Joseph establishes a long-term agricultural policy and tax structure (one-fifth) for Egypt.",
    "Methodist": "Joseph sets up the terms of the new relationship: seed provided, one-fifth tax owed.",
    "Lutheran": "Joseph provides seed and institutes a 20% tax for Pharaoh.",
    "Presbyterian": "Joseph establishes the ongoing terms of land use and taxation.",
    "Pentecostal": "Joseph institutes the agricultural law and tax.",
    "Anglican": "Joseph provides seed and establishes a permanent law requiring one-fifth of the produce as tax to Pharaoh.",
    "Orthodox": "Joseph institutes an enduring agricultural tax (20%) for the use of Pharaoh's land."
  },
  "22": {
    "Non-Denominational": "The people accept, acknowledging Joseph saved their lives and agreeing to be Pharaoh's slaves.",
    "General": "The people accept, acknowledging Joseph saved their lives and agreeing to be Pharaoh's slaves.",
    "Baptist": "The people express gratitude for survival, accepting their new status.",
    "Catholic": "The Egyptians gratefully acknowledge Joseph's role in their survival and accept their subservient status to Pharaoh.",
    "Methodist": "The people voice their gratitude for life, accepting the terms of bondage.",
    "Lutheran": "The people acknowledge Joseph saved them and accept servitude.",
    "Presbyterian": "The Egyptians accept the terms, grateful for survival.",
    "Pentecostal": "The people express gratitude and submission.",
    "Anglican": "The people gratefully accept the terms, acknowledging Joseph saved them and agreeing to be Pharaoh's tenants/slaves.",
    "Orthodox": "The Egyptians express gratitude for their lives and accept the terms of servitude."
  },
  "23": {
    "Non-Denominational": "This one-fifth law becomes permanent, except for priests' land.",
    "General": "This one-fifth law becomes permanent, except for priests' land.",
    "Baptist": "Emphasizing the lasting impact of Joseph's policy on Egyptian land tenure and taxation.",
    "Catholic": "Notes the enduring nature of the land tenure and tax system established by Joseph.",
    "Methodist": "Highlights the long-term consequences of Joseph's administration.",
    "Lutheran": "The tax law remains in effect long after Joseph.",
    "Presbyterian": "States the permanency of the established law.",
    "Pentecostal": "The lasting nature of the established decree.",
    "Anglican": "Reiterates that this tax law became enduring in Egypt, apart from the priests' land.",
    "Orthodox": "Emphasizes the lasting effect of Joseph's fiscal policy in Egypt."
  },
  "24": {
    "Non-Denominational": "Israel settles, acquires property, and multiplies greatly in Goshen.",
    "General": "Israel settles, acquires property, and multiplies greatly in Goshen.",
    "Baptist": "Contrast: While Egyptians lost property, Israel gains it and flourishes, fulfilling God's promise.",
    "Catholic": "In stark contrast to the Egyptians, the Israelites thrive, gain possessions, and multiply exceedingly in Goshen, showing God's blessing.",
    "Methodist": "Highlights the contrasting fortune of the Israelites, who prosper and grow rapidly.",
    "Lutheran": "Israel flourishes and multiplies under God's blessing in Goshen.",
    "Presbyterian": "God blesses Israel in Goshen, causing them to prosper and multiply greatly, fulfilling His promise.",
    "Pentecostal": "Supernatural growth and blessing upon Israel in Goshen.",
    "Anglican": "In contrast to the Egyptians, the Israelites prosper in Goshen, acquiring property and increasing greatly in number.",
    "Orthodox": "Israel experiences significant growth and prosperity in Goshen, demonstrating God's favor."
  },
  "25": {
    "Non-Denominational": "Jacob lives 17 years in Egypt, reaching age 147.",
    "General": "Jacob lives 17 years in Egypt, reaching age 147.",
    "Baptist": "Specifying the duration of Jacob's time in Egypt and his final age.",
    "Catholic": "Notes the length of Jacob's peaceful final years in Egypt and his total lifespan.",
    "Methodist": "Provides the timeline for Jacob's final years.",
    "Lutheran": "States Jacob's remaining lifespan spent in Egypt.",
    "Presbyterian": "Specifies Jacob's age and time spent in Egypt.",
    "Pentecostal": "Jacob's final years and total age.",
    "Anglican": "States the duration of Jacob's life in Egypt and his final age.",
    "Orthodox": "Gives the length of Jacob's sojourn in Egypt and his age at death."
  },
  "26": {
    "Non-Denominational": "Nearing death, Jacob calls Joseph to swear an oath.",
    "General": "Nearing death, Jacob calls Joseph to swear an oath.",
    "Baptist": "Jacob prepares for death, seeking a binding promise from his most powerful son.",
    "Catholic": "Jacob, anticipating his death, summons Joseph to make a solemn request secured by an oath.",
    "Methodist": "Jacob takes steps to ensure his final wishes are carried out.",
    "Lutheran": "As death approaches, Jacob seeks an oath from Joseph.",
    "Presbyterian": "Jacob prepares for death by securing Joseph's promise.",
    "Pentecostal": "Jacob initiates arrangements for his burial.",
    "Anglican": "As Jacob approaches death, he summons Joseph to exact a solemn oath.",
    "Orthodox": "Sensing his approaching death, Jacob calls Joseph to secure a promise."
  },
  "27": {
    "Non-Denominational": "The oath: Joseph must promise not to bury Jacob in Egypt.",
    "General": "The oath: Joseph must promise not to bury Jacob in Egypt.",
    "Baptist": "Jacob's heart is still tied to the promised land, not Egypt.",
    "Catholic": "Jacob's first concern is not to be buried in Egypt, expressing his detachment from it.",
    "Methodist": "Jacob makes his primary concern clear: burial outside Egypt.",
    "Lutheran": "Jacob insists on not being buried in Egypt.",
    "Presbyterian": "Jacob explicitly forbids burial in Egypt.",
    "Pentecostal": "Jacob's strong desire not to remain in Egypt after death.",
    "Anglican": "Jacob makes Joseph promise, using a traditional oath gesture (hand under thigh), not to bury him in Egypt.",
    "Orthodox": "Jacob requests an oath ensuring he will not be buried in Egypt."
  },
  "28": {
    "Non-Denominational": "Instead, Joseph must carry him back to be buried with his ancestors in Canaan.",
    "General": "Instead, Joseph must carry him back to be buried with his ancestors in Canaan.",
    "Baptist": "An act of faith in God's land promise and desire to rest with his forefathers in Machpelah.",
    "Catholic": "Jacob directs his burial in the ancestral tomb in Canaan, affirming his belonging to the promised land and faith in God's covenant.",
    "Methodist": "Jacob expresses his deep connection to his heritage and the promised land.",
    "Lutheran": "Jacob desires burial in Canaan, the land of promise, with his ancestors.",
    "Presbyterian": "Jacob demands burial in Canaan, demonstrating faith in God's ultimate plan and land promise.",
    "Pentecostal": "A prophetic act of faith, claiming his inheritance in the promised land even in death.",
    "Anglican": "Jacob insists on being carried back to Canaan and buried in the ancestral tomb.",
    "Orthodox": "Jacob mandates his burial in the ancestral tomb in Canaan, affirming his place among the patriarchs and faith in the promise."
  },
  "29": {
    "Non-Denominational": "Joseph agrees to do as Jacob asks.",
    "General": "Joseph agrees to do as Jacob asks.",
    "Baptist": "Joseph respects his father's wishes and promises obedience.",
    "Catholic": "Joseph readily consents to fulfill his father's pious request.",
    "Methodist": "Joseph assures his father he will honor his request.",
    "Lutheran": "Joseph promises to fulfill Jacob's desire.",
    "Presbyterian": "Joseph agrees to carry out his father's instructions.",
    "Pentecostal": "Joseph commits to honoring his father's last wish.",
    "Anglican": "Joseph agrees to fulfill his father's request.",
    "Orthodox": "Joseph consents to his father's burial instructions."
  },
  "30": {
    "Non-Denominational": "Jacob insists Joseph swear the oath, which he does.",
    "General": "Jacob insists Joseph swear the oath, which he does.",
    "Baptist": "Jacob seeks the absolute certainty of a sworn oath for this crucial final request.",
    "Catholic": "Jacob requires the solemnity of an oath to ensure the fulfillment of this important duty.",
    "Methodist": "Jacob needs the added assurance of a formal oath.",
    "Lutheran": "Jacob requires the oath, and Joseph complies.",
    "Presbyterian": "Jacob insists on the oath, and Joseph formally swears.",
    "Pentecostal": "Jacob secures the promise with a binding oath.",
    "Anglican": "Jacob insists on the added solemnity of an oath, which Joseph provides.",
    "Orthodox": "Jacob requires the confirmation of an oath, which Joseph gives."
  },
  "31": {
    "Non-Denominational": "Then Israel (Jacob) worships God, bowing/leaning on his staff/bed.",
    "General": "Then Israel (Jacob) worships God, bowing/leaning on his staff/bed.",
    "Baptist": "An act of faith and gratitude, acknowledging God's faithfulness and resting in His promises as death approaches.",
    "Catholic": "Jacob concludes his final arrangements with an act of worship, expressing gratitude and faith in God, likely leaning on his staff in weakness (cf. Heb 11:21).",
    "Methodist": "Jacob responds to Joseph's oath with worship, expressing gratitude and peace.",
    "Lutheran": "Having secured the promise, Jacob turns to worship, expressing his faith.",
    "Presbyterian": "Jacob responds to Joseph's oath with worship, acknowledging God's faithfulness.",
    "Pentecostal": "An act of worship and surrender as Jacob prepares for death.",
    "Anglican": "Having received Joseph's oath, Jacob turns in worship, leaning on his staff or the head of his bed.",
    "Orthodox": "Assured of his burial wishes, Jacob engages in a final act of worship, acknowledging God's sovereignty and faithfulness."
  }
} 