{
  "chapterSummary": {
    "General": "Genesis 48 describes Jacob, near death, adopting Joseph's two sons, Manasseh and Ephraim, as his own, equal to Reuben and Simeon. Recalling God's promise at Bethel, Jacob prepares to bless them. Despite Joseph positioning the older Manasseh for the primary blessing (right hand), Jacob deliberately crosses his hands, placing his right hand on the younger Ephraim. He blesses them, invoking God as the God of his fathers, his lifelong shepherd, and redeeming Angel. He prophesies that both will be great, but Ephraim will be greater, becoming a 'multitude of nations.' He establishes the blessing formula, 'May God make you like Ephraim and Manasseh,' placing Ephraim first. Jacob assures Joseph of God's presence and future return to Canaan, giving Joseph an extra portion of inheritance ('Shechem') taken from the Amorites.",
    "Non-Denominational": "Focuses on themes of patriarchal blessing, adoption, divine sovereignty overriding tradition (Ephraim over Manasseh), Jacob's faith testimony (God as shepherd/redeemer), perpetuation of the covenant lineage through Joseph's sons, prophetic insight into the future tribes, and the significance of the land promise.",
    "Baptist": "Highlights Jacob acting in faith (blessing, adopting, prophesying). God's sovereign choice is emphasized in elevating the younger Ephraim, showing grace over birth order. Jacob's testimony points to God's personal guidance and redemption. The adoption incorporates Joseph's sons fully into Israel's covenant heritage. The extra portion for Joseph reflects his prominence.",
    "Catholic": "Emphasizes Jacob exercising his patriarchal authority through adoption and blessing. The crossing of hands signifies a deliberate choice guided by divine insight, privileging Ephraim. Jacob's invocation of God highlights God's faithfulness across generations. The blessing looks towards the future establishment and growth of the tribes of Israel.",
    "Methodist": "Stresses Jacob's preparations for death, ensuring the continuation of the lineage and blessing. The surprising reversal of birth order in the blessing highlights God's mysterious ways. Jacob's personal testimony about God's care is significant. The chapter shows the formal incorporation of Joseph's line into Israel.",
    "Lutheran": "Sees Jacob acting by faith (Heb 11:21), conferring God's promised blessing. The preference for Ephraim demonstrates God's freedom to choose according to grace, not merit or birthright. Jacob's blessing points to Christ, the ultimate Shepherd and Redeemer. The adoption secures Joseph's double portion within Israel.",
    "Presbyterian": "Underscores God's sovereign election demonstrated in Jacob's inspired choice of Ephraim over Manasseh. Jacob acts as God's covenant representative, transmitting the blessing. His testimony affirms God's lifelong providential care. The adoption and blessing align with God's plan for the future tribes of Israel.",
    "Pentecostal": "May focus on Jacob operating under prophetic anointing, discerning God's will to bless Ephraim over Manasseh. The crossing of hands is seen as a Spirit-led act. Jacob's testimony reflects a deep personal relationship with God. The blessing imparts spiritual destiny upon the sons.",
    "Anglican": "Notes Jacob's deliberate actions in adopting Joseph's sons and conferring the blessing. The surprising preference for Ephraim is key. Jacob's Trinitarian-like invocation (God of fathers, Shepherd, Angel) is noteworthy. The chapter formalizes the status of Ephraim and Manasseh as heads of tribes within Israel.",
    "Orthodox": "Views Jacob's blessing as a crucial transmission of grace and patriarchal authority. The adoption integrates Joseph's sons into the chosen people. The crossing of hands, guided by the Spirit, prefigures God's election. Jacob's invocation reflects deep experiential knowledge of God. The blessing shapes the future identity and destiny of these tribes."
  },
  "1": {
    "Non-Denominational": "Joseph hears his father Jacob is ill and visits him with his sons, Manasseh and Ephraim.",
    "General": "Joseph hears his father Jacob is ill and visits him with his sons, Manasseh and Ephraim.",
    "Baptist": "Joseph shows filial piety, bringing his sons to receive blessing from the patriarch.",
    "Catholic": "Joseph responds dutifully to news of his father's illness, bringing his sons for a final encounter and blessing.",
    "Methodist": "Joseph demonstrates care for his father, bringing his sons at the news of illness.",
    "Lutheran": "Joseph visits his ailing father, bringing his sons.",
    "Presbyterian": "Joseph brings his sons to the dying patriarch, likely seeking Jacob's blessing upon them.",
    "Pentecostal": "Joseph responds to the news, bringing his sons into the patriarch's presence.",
    "Anglican": "Upon hearing of Jacob's illness, Joseph visits him, taking his two sons along.",
    "Orthodox": "Joseph, hearing of Jacob's illness, brings his sons for a final paternal blessing."
  },
  "2": {
    "Non-Denominational": "Jacob is informed of Joseph's arrival and musters his strength to sit up.",
    "General": "Jacob is informed of Joseph's arrival and musters his strength to sit up.",
    "Baptist": "Jacob prepares himself, understanding the significance of this visit.",
    "Catholic": "Despite his weakness, Jacob gathers his strength, recognizing the importance of this meeting.",
    "Methodist": "Shows Jacob rallying himself for this important family interaction.",
    "Lutheran": "Jacob exerts effort to receive Joseph and his sons properly.",
    "Presbyterian": "Jacob prepares himself to fulfill his patriarchal duty of blessing.",
    "Pentecostal": "Jacob gathers strength for the significant encounter.",
    "Anglican": "Jacob makes an effort to sit up, recognizing the importance of Joseph's visit.",
    "Orthodox": "Jacob summons his strength, preparing to bestow his final blessings."
  },
  "3": {
    "Non-Denominational": "Jacob reminds Joseph of God Almighty's (El Shaddai) appearance at Luz (Bethel).",
    "General": "Jacob reminds Joseph of God Almighty's (El Shaddai) appearance at Luz (Bethel).",
    "Baptist": "Jacob grounds the coming blessing in God's past covenant revelation and promises.",
    "Catholic": "Jacob prefaces the blessing by recalling the foundational divine encounter and promises at Bethel.",
    "Methodist": "Jacob recalls a key moment of divine encounter, setting the context for the blessing.",
    "Lutheran": "Jacob bases the blessing on God's prior revelation and promise.",
    "Presbyterian": "Jacob explicitly links the blessing to God's covenant promises revealed at Bethel.",
    "Pentecostal": "Jacob recounts the foundational divine encounter that underpins the blessing.",
    "Anglican": "Jacob begins by recounting God Almighty's foundational appearance and promise to him at Luz (Bethel).",
    "Orthodox": "Jacob bases the impending blessing on the prior divine revelation and covenant at Bethel."
  },
  "4": {
    "Non-Denominational": "He recounts God's promise of fruitfulness, multiplication, and the land as an everlasting possession.",
    "General": "He recounts God's promise of fruitfulness, multiplication, and the land as an everlasting possession.",
    "Baptist": "Reiterating the core elements of the Abrahamic covenant passed down to him.",
    "Catholic": "Jacob summarizes the key covenant promises concerning descendants and the land, which he is about to transmit.",
    "Methodist": "Jacob focuses on the core promises of descendants and land inheritance.",
    "Lutheran": "Jacob recalls the specific promises of descendants and land.",
    "Presbyterian": "Jacob reaffirms the content of the covenant promise: descendants and land.",
    "Pentecostal": "Jacob declares the covenant promises of multiplication and inheritance.",
    "Anglican": "He recalls God's specific promises of numerous descendants and the land of Canaan.",
    "Orthodox": "Jacob reiterates the fundamental covenant promises regarding progeny and the land."
  },
  "5": {
    "Non-Denominational": "Jacob formally adopts Ephraim and Manasseh, declaring them his own, equal to Reuben and Simeon.",
    "General": "Jacob formally adopts Ephraim and Manasseh, declaring them his own, equal to Reuben and Simeon.",
    "Baptist": "A legal act elevating Joseph's sons to the status of Jacob's direct sons, granting them tribal headship and inheritance rights.",
    "Catholic": "Jacob performs a formal act of adoption, conferring upon Ephraim and Manasseh the full status and inheritance rights of his own firstborn sons (effectively giving Joseph a double portion).",
    "Methodist": "Jacob elevates his grandsons to the status of sons, ensuring Joseph's line receives a full inheritance portion (double).",
    "Lutheran": "Jacob adopts Joseph's sons, granting them the status and inheritance rights of his own sons.",
    "Presbyterian": "Jacob formally adopts Ephraim and Manasseh, incorporating them directly into the tribal structure of Israel as heads of tribes.",
    "Pentecostal": "An act of patriarchal authority, adopting the grandsons as sons.",
    "Anglican": "Jacob formally adopts Joseph's two sons, giving them status equal to his own sons and thus granting Joseph a double portion.",
    "Orthodox": "Jacob adopts Ephraim and Manasseh, elevating them to the rank of his own sons and ensuring Joseph's double inheritance."
  },
  "6": {
    "Non-Denominational": "He states any subsequent children of Joseph will belong to Joseph but inherit under Ephraim and Manasseh.",
    "General": "He states any subsequent children of Joseph will belong to Joseph but inherit under Ephraim and Manasseh.",
    "Baptist": "Clarifying the inheritance structure: the adoption applies only to these two sons.",
    "Catholic": "Jacob clarifies that future children of Joseph will remain his own descendants, inheriting through the lines of Ephraim and Manasseh.",
    "Methodist": "Jacob sets the boundary for the adoption and future inheritance.",
    "Lutheran": "Jacob specifies the inheritance rights for any future sons of Joseph.",
    "Presbyterian": "Jacob clarifies the limitation of the adoption to Ephraim and Manasseh.",
    "Pentecostal": "Defining the scope of the adoption and inheritance.",
    "Anglican": "Jacob clarifies that any further children born to Joseph will inherit under the names of Ephraim and Manasseh.",
    "Orthodox": "Jacob delineates the inheritance rights, limiting the direct patriarchal status to Ephraim and Manasseh."
  },
  "7": {
    "Non-Denominational": "Jacob recalls Rachel's death near Ephrath (Bethlehem) on the journey.",
    "General": "Jacob recalls Rachel's death near Ephrath (Bethlehem) on the journey.",
    "Baptist": "A poignant memory perhaps explaining his deep affection for Joseph and Benjamin, Rachel's sons, and his desire to honor her through adopting Joseph's sons.",
    "Catholic": "Jacob's recollection of Rachel's death underscores his enduring love for her and provides emotional context for his actions regarding her descendants.",
    "Methodist": "A touching personal reflection on loss, likely connected to his special feelings for Joseph and his sons.",
    "Lutheran": "Jacob remembers Rachel's death, perhaps linking the blessing of her grandsons to her memory.",
    "Presbyterian": "Jacob's memory of Rachel provides context for his special focus on Joseph's sons.",
    "Pentecostal": "A heartfelt remembrance influencing his actions towards Rachel's descendants.",
    "Anglican": "Jacob shares a personal, sorrowful memory about the death of Rachel, Joseph's mother.",
    "Orthodox": "Jacob's remembrance of Rachel provides the emotional backdrop for elevating her grandsons."
  },
  "8": {
    "Non-Denominational": "Jacob sees Joseph's sons and asks who they are (due to failing eyesight).",
    "General": "Jacob sees Joseph's sons and asks who they are (due to failing eyesight).",
    "Baptist": "Highlights Jacob's physical decline but spiritual readiness to bless.",
    "Catholic": "Jacob's failing sight contrasts with his spiritual insight, necessitating Joseph's identification of the boys.",
    "Methodist": "Shows Jacob's physical frailty in old age.",
    "Lutheran": "Jacob's poor eyesight requires him to ask for identification.",
    "Presbyterian": "Jacob's physical sight is dim, but his spiritual purpose is clear.",
    "Pentecostal": "Despite physical limitations, Jacob prepares to impart spiritual blessing.",
    "Anglican": "Jacob's eyesight is failing, so he asks Joseph to identify the boys.",
    "Orthodox": "Jacob's diminished physical vision contrasts with his spiritual clarity in blessing."
  },
  "9": {
    "Non-Denominational": "Joseph identifies them, and Jacob asks for them to be brought near for blessing.",
    "General": "Joseph identifies them, and Jacob asks for them to be brought near for blessing.",
    "Baptist": "Setting the stage for the act of blessing.",
    "Catholic": "Joseph confirms their identity, and Jacob prepares to confer the patriarchal blessing.",
    "Methodist": "Jacob calls for the boys to receive his blessing.",
    "Lutheran": "Jacob asks for the boys to come near to receive the blessing.",
    "Presbyterian": "Jacob prepares to bestow the blessing upon Joseph's sons.",
    "Pentecostal": "Jacob calls the boys forward for the impartation.",
    "Anglican": "Joseph identifies his sons, and Jacob asks for them to be brought close so he can bless them.",
    "Orthodox": "Jacob requests the boys be brought near for the transmission of the blessing."
  },
  "10": {
    "Non-Denominational": "Jacob expresses gratitude for seeing both Joseph and his children.",
    "General": "Jacob expresses gratitude for seeing both Joseph and his children.",
    "Baptist": "Acknowledging God's unexpected, abundant blessing beyond his hopes.",
    "Catholic": "Jacob marvels at God's goodness, having exceeded his expectations by allowing him to see Joseph's offspring.",
    "Methodist": "Jacob voices his thankfulness for this unexpected joy.",
    "Lutheran": "Jacob expresses his joy and gratitude to God for this reunion.",
    "Presbyterian": "Jacob acknowledges God's grace in allowing him to see Joseph's children.",
    "Pentecostal": "Jacob gives thanks for the unexpected blessing of seeing his grandchildren.",
    "Anglican": "Jacob expresses his profound gratitude, having never expected to see Joseph again, let alone his children.",
    "Orthodox": "Jacob expresses wonder and gratitude at the unforeseen blessing of seeing Joseph's sons."
  },
  "11": {
    "Non-Denominational": "Joseph brings them close; Jacob kisses and embraces them.",
    "General": "Joseph brings them close; Jacob kisses and embraces them.",
    "Baptist": "An expression of grandfatherly affection and acceptance before the blessing.",
    "Catholic": "Jacob shows tender affection and familial love towards his adopted sons/grandsons.",
    "Methodist": "A moment of physical affection and bonding.",
    "Lutheran": "Jacob shows affection before blessing them.",
    "Presbyterian": "Jacob expresses personal affection for the boys.",
    "Pentecostal": "An embrace signifying love and acceptance.",
    "Anglican": "Joseph presents his sons, and Jacob shows his affection by kissing and embracing them.",
    "Orthodox": "Jacob expresses his love and acceptance through physical embrace."
  },
  "12": {
    "Non-Denominational": "Joseph positions Ephraim (younger) at Jacob's left, Manasseh (older) at Jacob's right.",
    "General": "Joseph positions Ephraim (younger) at Jacob's left, Manasseh (older) at Jacob's right.",
    "Baptist": "Joseph follows tradition, expecting the firstborn (Manasseh) to receive the primary blessing (right hand).",
    "Catholic": "Joseph arranges his sons according to customary practice, anticipating the greater blessing for the firstborn.",
    "Methodist": "Joseph attempts to guide the blessing according to birth order convention.",
    "Lutheran": "Joseph positions the sons according to birthright tradition.",
    "Presbyterian": "Joseph arranges the sons according to primogeniture, expecting Manasseh to get the main blessing.",
    "Pentecostal": "Joseph follows protocol, setting up the expected order of blessing.",
    "Anglican": "Joseph carefully positions his sons to receive the traditional blessing according to birth order.",
    "Orthodox": "Joseph arranges his sons according to the custom of primogeniture."
  },
  "13": {
    "Non-Denominational": "Jacob deliberately crosses his hands, placing the right on Ephraim (younger) and left on Manasseh (older).",
    "General": "Jacob deliberately crosses his hands, placing the right on Ephraim (younger) and left on Manasseh (older).",
    "Baptist": "The pivotal moment: Jacob, guided by God, intentionally reverses the expected order, signifying God's sovereign choice.",
    "Catholic": "Jacob knowingly and purposefully overrides custom, crossing his hands to bestow the primary blessing upon the younger son, signifying divine election.",
    "Methodist": "Jacob intentionally reverses the hand placement, indicating a deliberate choice contrary to custom.",
    "Lutheran": "Jacob intentionally crosses his hands, demonstrating God's choice favoring the younger over the elder.",
    "Presbyterian": "Jacob, acting under divine guidance, deliberately crosses his hands to signify God's election of Ephraim for the greater blessing.",
    "Pentecostal": "A Spirit-led act: Jacob intentionally crosses his hands to align with God's preferred order.",
    "Anglican": "Jacob deliberately crosses his hands, placing his right hand of greater blessing on the younger son, Ephraim.",
    "Orthodox": "Jacob intentionally reverses the expected blessing order, crossing his hands to signify God's unexpected choice."
  },
  "14": {
    "Non-Denominational": "Jacob blesses Joseph (through his sons), invoking God in three ways: God of the fathers, his lifelong Shepherd, his redeeming Angel.",
    "General": "Jacob blesses Joseph (through his sons), invoking God in three ways: God of the fathers, his lifelong Shepherd, his redeeming Angel.",
    "Baptist": "Jacob's rich testimony of faith: acknowledging God's covenant faithfulness, personal guidance/provision, and deliverance/protection.",
    "Catholic": "Jacob invokes God under three aspects: His covenant relationship with the patriarchs, His personal providence (Shepherd), and His saving action (Angel/Messenger). This confers God's blessing upon the boys.",
    "Methodist": "Jacob's blessing reflects his deep, personal experience of God's faithfulness, guidance, and protection throughout his life.",
    "Lutheran": "Jacob blesses them in the name of the Triune God, experienced as faithful to the fathers, his Shepherd, and his Redeemer.",
    "Presbyterian": "Jacob invokes God's covenant faithfulness, providential care (Shepherd), and redemptive power (Angel), grounding the blessing in God's character.",
    "Pentecostal": "Jacob blesses based on his experiential knowledge of God as generational God, personal Shepherd, and delivering Angel.",
    "Anglican": "Jacob bestows the blessing, invoking God experienced as the God of his ancestors, his personal Shepherd, and the Angel who redeemed him.",
    "Orthodox": "Jacob invokes God's blessing, drawing on his experience of God's ancestral covenant, personal guidance (Shepherd), and deliverance (Angel)."
  },
  "15": {
    "Non-Denominational": "He prays for God's blessing, the perpetuation of the patriarchal names, and immense growth for the boys.",
    "General": "He prays for God's blessing, the perpetuation of the patriarchal names, and immense growth for the boys.",
    "Baptist": "The content of the blessing: divine favor, covenant continuity, and extraordinary multiplication.",
    "Catholic": "Jacob prays for God's grace upon them, the continuation of the covenant lineage, and their growth into a multitude.",
    "Methodist": "Jacob asks for God's blessing, the continuation of the family name/legacy, and future prosperity.",
    "Lutheran": "Jacob prays for blessing, covenant identity, and abundant growth.",
    "Presbyterian": "Jacob prays for God's blessing, covenant identity, and fulfillment of the promise of multiplication.",
    "Pentecostal": "Jacob speaks blessing, generational continuity, and exponential growth over them.",
    "Anglican": "He prays for God to bless the boys, for the names of the patriarchs to continue in them, and for them to multiply greatly.",
    "Orthodox": "Jacob prays for divine blessing, the carrying on of the patriarchal lineage, and abundant multiplication."
  },
  "16": {
    "Non-Denominational": "Joseph is displeased and tries to correct Jacob's hand placement.",
    "General": "Joseph is displeased and tries to correct Jacob's hand placement.",
    "Baptist": "Joseph misunderstands, thinking it's a mistake due to poor eyesight, not a deliberate, inspired choice.",
    "Catholic": "Joseph, adhering to custom and concerned for the firstborn's rights, attempts to rectify what he perceives as his father's error.",
    "Methodist": "Joseph reacts based on tradition and concern for the proper protocol.",
    "Lutheran": "Joseph seeks to uphold the tradition of birthright blessing.",
    "Presbyterian": "Joseph assumes Jacob made a mistake, not understanding the divine intention.",
    "Pentecostal": "Joseph reacts according to natural understanding, not perceiving the spiritual significance yet.",
    "Anglican": "Joseph, seeing the crossed hands, assumes it's a mistake due to his father's poor sight and tries to correct it.",
    "Orthodox": "Joseph attempts to correct the blessing according to custom, misunderstanding Jacob's inspired action."
  },
  "17": {
    "Non-Denominational": "Joseph points out Manasseh is the firstborn and should receive the right hand.",
    "General": "Joseph points out Manasseh is the firstborn and should receive the right hand.",
    "Baptist": "Joseph appeals to the principle of primogeniture.",
    "Catholic": "Joseph explicitly states the reason for his concern: Manasseh's status as the firstborn.",
    "Methodist": "Joseph explains his reasoning based on Manasseh's birth order.",
    "Lutheran": "Joseph appeals to the rights of the firstborn.",
    "Presbyterian": "Joseph argues based on the traditional rights of the firstborn.",
    "Pentecostal": "Joseph states the natural order of precedence.",
    "Anglican": "Joseph reminds Jacob that Manasseh is the firstborn and thus should receive the blessing of the right hand.",
    "Orthodox": "Joseph advocates for Manasseh based on his status as the firstborn."
  },
  "18": {
    "Non-Denominational": "Jacob refuses, affirming he knows what he's doing.",
    "General": "Jacob refuses, affirming he knows what he's doing.",
    "Baptist": "Jacob asserts his deliberate, conscious choice, implying divine guidance.",
    "Catholic": "Jacob confirms his action was intentional and knowledgeable, overriding Joseph's objection.",
    "Methodist": "Jacob insists his action was purposeful and informed.",
    "Lutheran": "Jacob overrides Joseph, confirming his intention was deliberate.",
    "Presbyterian": "Jacob confirms his action was intentional, implying it was directed by God.",
    "Pentecostal": "Jacob affirms he is acting with spiritual awareness and intention.",
    "Anglican": "Jacob refuses to change his hands, assuring Joseph that his action is deliberate and knowledgeable.",
    "Orthodox": "Jacob confirms his intentionality, indicating his action is not a mistake but deliberate."
  },
  "19": {
    "Non-Denominational": "Jacob prophesies Manasseh will be great, but Ephraim will be greater, a multitude of nations.",
    "General": "Jacob prophesies Manasseh will be great, but Ephraim will be greater, a multitude of nations.",
    "Baptist": "The specific prophecy explaining the reversal: both blessed, but Ephraim receives greater prominence and future influence.",
    "Catholic": "Jacob prophesies the future destinies: Manasseh's greatness acknowledged, but Ephraim's surpassing greatness and numerous posterity foretold.",
    "Methodist": "Jacob foretells the future prominence, explaining his choice to favor Ephraim.",
    "Lutheran": "Jacob prophesies Ephraim's greater destiny, fulfilling God's elective purpose.",
    "Presbyterian": "Jacob reveals the prophetic basis for his action: Ephraim's divinely ordained greater destiny.",
    "Pentecostal": "Jacob speaks forth the prophetic destiny of both sons, revealing God's plan for Ephraim's greater influence.",
    "Anglican": "Jacob explains his deliberate choice by prophesying that while Manasseh will be great, Ephraim will be greater, his descendants becoming a multitude.",
    "Orthodox": "Jacob prophesies the respective futures, foretelling Ephraim's greater prominence and proliferation."
  },
  "20": {
    "Non-Denominational": "Jacob establishes the blessing formula, placing Ephraim before Manasseh.",
    "General": "Jacob establishes the blessing formula, placing Ephraim before Manasseh.",
    "Baptist": "Formalizing Ephraim's precedence in Israelite blessing tradition.",
    "Catholic": "Jacob institutes a standard blessing in Israel that reflects the preeminence given to Ephraim.",
    "Methodist": "Jacob creates a lasting legacy of this blessing order.",
    "Lutheran": "Jacob sets the precedent for future blessings, prioritizing Ephraim.",
    "Presbyterian": "Jacob establishes a blessing pattern reflecting the divinely ordained order.",
    "Pentecostal": "Jacob sets a spiritual precedent, naming Ephraim first in blessing.",
    "Anglican": "He concludes the blessing by establishing a formula for future blessings in Israel, naming Ephraim before Manasseh.",
    "Orthodox": "Jacob institutes a blessing formula that enshrines Ephraim's precedence."
  },
  "21": {
    "Non-Denominational": "Jacob tells Joseph he is dying but assures him God will be with them and return them to Canaan.",
    "General": "Jacob tells Joseph he is dying but assures him God will be with them and return them to Canaan.",
    "Baptist": "Jacob expresses faith in God's continued presence and the ultimate fulfillment of the land promise beyond his own lifetime.",
    "Catholic": "Jacob faces death with faith, assuring Joseph of God's enduring presence with the family and the certainty of their eventual return to the promised land.",
    "Methodist": "Jacob offers final words of comfort and faith, pointing to God's presence and future restoration.",
    "Lutheran": "Jacob reaffirms his faith in God's presence and promise of return to Canaan.",
    "Presbyterian": "Jacob expresses his confidence in God's faithfulness to His presence and land promises after his death.",
    "Pentecostal": "Jacob speaks faith over the future, assuring Joseph of God's continued presence and the promise of return.",
    "Anglican": "Jacob acknowledges his impending death but reassures Joseph of God's ongoing presence and the promise of returning to Canaan.",
    "Orthodox": "Jacob affirms God's continued providence and the promise of return to the land, even as he faces death."
  },
  "22": {
    "Non-Denominational": "Jacob gives Joseph an extra portion ('Shechem') taken from the Amorites.",
    "General": "Jacob gives Joseph an extra portion ('Shechem') taken from the Amorites.",
    "Baptist": "Symbolically granting Joseph the firstborn's double portion through this specific, perhaps contested, piece of land.",
    "Catholic": "Jacob bestows a specific, additional inheritance upon Joseph (Shechem), possibly representing the double portion befitting the functional firstborn, citing a past conquest.",
    "Methodist": "Jacob grants a special inheritance to Joseph, signifying his preeminence among the brothers.",
    "Lutheran": "Jacob gives Joseph the double portion (represented by Shechem), acknowledging his unique role.",
    "Presbyterian": "Jacob gives Joseph the additional portion (Shechem), signifying the transfer of the birthright privileges to him.",
    "Pentecostal": "Jacob bestows a special inheritance, the double portion, upon Joseph.",
    "Anglican": "Jacob bequeaths a specific, additional portion of land (Shechem) to Joseph, signifying his preeminence, referring to its capture from the Amorites.",
    "Orthodox": "Jacob grants Joseph an extra share (Shechem), symbolizing the double portion, referencing its acquisition by force."
  }
} 