{
  "chapterSummary": {
    "General": "Genesis 49 contains Jacob's final prophetic blessings for his twelve sons, outlining the future character and destiny of the tribes descending from them. Key prophecies include: Reuben losing his birthright due to instability and transgression; Simeon and Levi being scattered for their violence; Judah receiving promise of kingship (the scepter) and messianic hope ('until Shiloh comes'); Zebulun's maritime connection; Issachar's submission for comfort; Dan's role as judge (and serpent); Gad's resilience; Asher's richness; Naphtali's freedom/eloquence; Joseph's extensive blessing for fruitfulness, divine protection, and leadership; and Benjamin's warlike nature. Jacob concludes by reiterating his command to be buried in the cave of Machpelah in Canaan with his ancestors. He then dies peacefully.",
    "Non-Denominational": "Focuses on themes of patriarchal authority, prophetic utterance, character assessment leading to destiny, consequences of past actions (Reuben, Simeon, Levi), the centrality of the Judahic blessing (leadership, messianic hope), the diversity of tribal roles, God's sovereign oversight of future history, faithfulness to ancestral burial traditions, and Jacob's peaceful death after fulfilling his final duties.",
    "Baptist": "Highlights Jacob acting as a prophet under divine inspiration. Emphasizes the consequences of sin (Reuben, Simeon, Levi forfeiting blessing) and the sovereignty of God in choosing Judah for the messianic line ('Shiloh'). Joseph's blessing reflects God's reward for faithfulness. Jacob's burial request reaffirms faith in the land promise. His death is portrayed as peacefully being 'gathered to his people.'",
    "Catholic": "Stresses Jacob exercising his patriarchal role in bestowing blessings that shape future history. Views the prophecy concerning Judah and Shiloh as a key Old Testament messianic prediction pointing towards Christ's kingship. Notes the moral dimension where past sins affect future status. Joseph's blessing highlights divine favor. Jacob's burial instructions show faith in the resurrection and the importance of the Holy Land.",
    "Methodist": "Focuses on Jacob's final words as a blend of prophecy, character insight, and blessing. Highlights the moral accountability reflected in the prophecies for Reuben, Simeon, and Levi. Emphasizes the hope embedded in Judah's blessing and the richness of Joseph's. Jacob's meticulous burial instructions show his enduring connection to his heritage and faith.",
    "Lutheran": "Sees Jacob distributing blessings and curses based on past actions and future destinies ordained by God. Judah's blessing stands out, pointing ultimately to Christ (Shiloh) as the true King. Joseph's blessing reflects God's grace despite suffering. Jacob's desire for burial in Canaan demonstrates faith looking towards God's promise, not earthly security in Egypt.",
    "Presbyterian": "Underscores Jacob acting as God's covenant mouthpiece, declaring the divinely ordained futures of the tribes. Highlights God's sovereign election in designating Judah for kingship and the Messianic line. Notes the outworking of consequences for sin. Joseph's blessing reflects God's faithfulness. Jacob's burial request is an ultimate act of faith in God's land covenant.",
    "Pentecostal": "Emphasizes Jacob operating in a strong prophetic gifting, declaring the future destinies of his sons and tribes under divine inspiration. The blessings impart spiritual power and destiny. Judah's prophecy about Shiloh is seen as a major messianic revelation. Joseph's extensive blessing reflects spiritual favor. Jacob's death is a peaceful transition.",
    "Anglican": "Notes the formal poetic structure of the blessings. Highlights the mixture of praise, rebuke, and prophecy for each son. Recognizes the theological significance of the Judah/Shiloh prophecy. Values Joseph's extensive blessing. Views Jacob's final instructions and death as dignified and faith-filled conclusions to his patriarchal ministry.",
    "Orthodox": "Views Jacob's blessings as profound prophetic utterances determining the future roles and charisms of the tribes within God's plan. The Judah/Shiloh prophecy is central, foretelling Christ's kingdom. The distinction between blessings and rebukes reflects divine judgment and mercy. Jacob's insistence on burial in Machpelah affirms communion with the saints (ancestors) and hope in the promised land."
  },
  "1": {
    "Non-Denominational": "Jacob gathers his sons to tell them their future destinies.",
    "General": "Jacob gathers his sons to tell them their future destinies.",
    "Baptist": "The patriarch prepares to deliver final, prophetic words concerning his descendants.",
    "Catholic": "Jacob summons his sons for a solemn pronouncement regarding their future as tribes of Israel.",
    "Methodist": "Jacob calls his family together for his last significant act: prophetic blessings.",
    "Lutheran": "Jacob prepares to reveal the future God has ordained for his sons' descendants.",
    "Presbyterian": "Jacob gathers his sons to declare God's revealed plan for their future tribes.",
    "Pentecostal": "The patriarch prepares to release prophetic words over his sons.",
    "Anglican": "Jacob summons his sons to hear his final prophetic words about their future.",
    "Orthodox": "Jacob assembles his sons to pronounce prophecies concerning their future tribal destinies."
  },
  "2": {
    "Non-Denominational": "He urges them to assemble and listen to what he, Israel, declares.",
    "General": "He urges them to assemble and listen to what he, Israel, declares.",
    "Baptist": "A call for attention, emphasizing the importance and authority of the words to follow.",
    "Catholic": "Jacob commands their attention, speaking with the authority of the patriarch Israel.",
    "Methodist": "Jacob calls for focused listening to these crucial final words.",
    "Lutheran": "A formal call to hear the pronouncements of their father Israel.",
    "Presbyterian": "Jacob commands them to hear the words spoken through him as Israel.",
    "Pentecostal": "A call to gather and receive the patriarchal impartation.",
    "Anglican": "Jacob formally calls his sons to gather and listen attentively to his final pronouncements.",
    "Orthodox": "Jacob commands his sons to gather and heed his final patriarchal prophecies."
  },
  "3": {
    "Non-Denominational": "Reuben: Acknowledged as firstborn, preeminent in dignity and power.",
    "General": "Reuben: Acknowledged as firstborn, preeminent in dignity and power.",
    "Baptist": "Recognizing Reuben's natural position and potential as the firstborn son.",
    "Catholic": "Jacob acknowledges Reuben's primogeniture rights and inherent status.",
    "Methodist": "Jacob starts by affirming Reuben's status by birth order.",
    "Lutheran": "Jacob acknowledges Reuben's position as firstborn.",
    "Presbyterian": "Jacob recognizes Reuben's natural status as the firstborn.",
    "Pentecostal": "Affirming Reuben's place as the firstborn.",
    "Anglican": "Jacob begins with Reuben, acknowledging his status as the firstborn.",
    "Orthodox": "Jacob acknowledges Reuben's natural rights as the firstborn."
  },
  "4": {
    "Non-Denominational": "Reuben: Condemned as unstable (turbulent/reckless as water), he defiled Jacob's bed and thus forfeits his preeminence.",
    "General": "Reuben: Condemned as unstable (turbulent/reckless as water), he defiled Jacob's bed and thus forfeits his preeminence.",
    "Baptist": "Because of character flaw (instability) and specific transgression (incest with Bilhah), Reuben loses the firstborn's blessing and leadership role.",
    "Catholic": "Jacob denounces Reuben's lack of self-control and grave sin, resulting in the forfeiture of his birthright privileges.",
    "Methodist": "Jacob points to Reuben's character weakness and past sin as the reason he loses his primary position.",
    "Lutheran": "Reuben's sin leads to the loss of the birthright blessing; instability marks his character.",
    "Presbyterian": "Reuben's sin and unstable character result in the loss of the firstborn's privileges, demonstrating consequences.",
    "Pentecostal": "Reuben's failure in character and conduct disqualifies him from the firstborn's position.",
    "Anglican": "Jacob condemns Reuben's instability and recalls his transgression, declaring he has forfeited the rights of the firstborn.",
    "Orthodox": "Jacob highlights Reuben's moral instability and past sin (defiling his father's bed) as the cause for losing his primogeniture."
  },
  "5": {
    "Non-Denominational": "Simeon and Levi: Grouped as brothers whose tools are weapons of violence.",
    "General": "Simeon and Levi: Grouped as brothers whose tools are weapons of violence.",
    "Baptist": "Identifying their shared characteristic: violent anger and cruelty.",
    "Catholic": "Jacob links Simeon and Levi due to their shared violent nature and actions.",
    "Methodist": "Jacob addresses Simeon and Levi together, highlighting their shared tendency towards violence.",
    "Lutheran": "Simeon and Levi are condemned together for their violent character.",
    "Presbyterian": "Jacob groups Simeon and Levi, condemning their shared violent tendencies.",
    "Pentecostal": "Identifying the shared violent spirit of Simeon and Levi.",
    "Anglican": "Jacob addresses Simeon and Levi together, condemning their shared capacity for violence.",
    "Orthodox": "Jacob links Simeon and Levi, denouncing their shared inclination towards violence."
  },
  "6": {
    "Non-Denominational": "Jacob curses their anger and dissociates himself from their violent assembly (referencing Shechem massacre).",
    "General": "Jacob curses their anger and dissociates himself from their violent assembly (referencing Shechem massacre).",
    "Baptist": "Condemning their specific sin at Shechem and its underlying ruthless anger.",
    "Catholic": "Jacob curses their unrestrained anger, not the men themselves, and distances himself from their sinful conspiracy and actions.",
    "Methodist": "Jacob strongly condemns their past actions driven by uncontrolled anger.",
    "Lutheran": "Jacob curses their sinful anger and violence, distancing himself from their guilt.",
    "Presbyterian": "Jacob denounces their sinful anger and dissociates himself from their violent conspiracy.",
    "Pentecostal": "Condemning the destructive nature of their anger and violence.",
    "Anglican": "Jacob vehemently condemns their fierce anger and dissociates himself from their violent actions.",
    "Orthodox": "Jacob curses their specific type of fierce, cruel anger and disavows their violent conspiracy."
  },
  "7": {
    "Non-Denominational": "Simeon and Levi: Prophesies they will be scattered/divided in Israel.",
    "General": "Simeon and Levi: Prophesies they will be scattered/divided in Israel.",
    "Baptist": "The consequence of their violence: lack of cohesive territory and dispersal among other tribes.",
    "Catholic": "Jacob foretells their future as scattered tribes within Israel, lacking distinct territorial unity (fulfilled historically).",
    "Methodist": "Jacob predicts their future status as scattered peoples within Israel.",
    "Lutheran": "The judgment for their sin is dispersal among the other tribes.",
    "Presbyterian": "Jacob declares the consequence: they will be scattered, lacking unified land.",
    "Pentecostal": "The prophetic word of judgment: scattering and division.",
    "Anglican": "Jacob prophesies that the descendants of Simeon and Levi will be scattered among the other tribes in Israel.",
    "Orthodox": "Jacob foretells their destiny: dispersal within Israel rather than a unified territory."
  },
  "8": {
    "Non-Denominational": "Judah: Extensively praised; his brothers will praise him and bow to him; he will defeat enemies.",
    "General": "Judah: Extensively praised; his brothers will praise him and bow to him; he will defeat enemies.",
    "Baptist": "Judah receives the blessing of leadership, honor, and victory originally due the firstborn.",
    "Catholic": "Jacob bestows upon Judah the blessing of preeminence, leadership among his brothers, and power over enemies.",
    "Methodist": "Judah is singled out for praise, leadership, and military prowess.",
    "Lutheran": "Judah receives the blessing of leadership and victory.",
    "Presbyterian": "Judah is designated for leadership, honor, and victory over enemies.",
    "Pentecostal": "Judah is elevated to a position of honor, leadership, and power.",
    "Anglican": "In contrast to the first three, Judah receives high praise, predicting honor, leadership, and victory.",
    "Orthodox": "Judah receives the blessing of leadership, honor from his brothers, and dominance over adversaries."
  },
  "9": {
    "Non-Denominational": "Judah: Compared to a powerful, fearless lion.",
    "General": "Judah: Compared to a powerful, fearless lion.",
    "Baptist": "Imagery symbolizing Judah's royal strength, courage, and dominance.",
    "Catholic": "The lion imagery signifies royal authority, strength, and unconquerable power.",
    "Methodist": "The lion metaphor emphasizes Judah's strength and royal character.",
    "Lutheran": "The lion symbolizes Judah's royal power and authority.",
    "Presbyterian": "The lion imagery points to Judah's royal strength and authority.",
    "Pentecostal": "The lion represents kingly authority and power bestowed on Judah.",
    "Anglican": "Jacob uses the powerful imagery of a lion to depict Judah's strength and royal nature.",
    "Orthodox": "The lion metaphor highlights Judah's royal dignity, power, and invincibility."
  },
  "10": {
    "Non-Denominational": "Judah: The scepter (kingship) will not depart until Shiloh comes, who will command nations' obedience.",
    "General": "Judah: The scepter (kingship) will not depart until Shiloh comes, who will command nations' obedience.",
    "Baptist": "The key messianic prophecy: Judah holds kingship until the arrival of Shiloh (Messiah), who will have universal authority.",
    "Catholic": "A major messianic prophecy: The tribe of Judah will hold royal authority until the coming of the Messiah (Shiloh), who will command universal allegiance.",
    "Methodist": "The prophecy of enduring kingship in Judah, culminating in a figure (Shiloh/Messiah) with universal dominion.",
    "Lutheran": "Prophecy of Judah's kingship, pointing ultimately to Christ (Shiloh), the true King who gathers the nations.",
    "Presbyterian": "The promise of perpetual kingship in Judah's line until the Messiah (Shiloh) comes, establishing universal rule.",
    "Pentecostal": "A powerful messianic prophecy revealing Judah's role in bringing forth the King (Shiloh) who commands the nations.",
    "Anglican": "The crucial prophecy ensuring the royal line remains with Judah until the coming of 'Shiloh' (often interpreted messianically) who will receive international obedience.",
    "Orthodox": "The prophecy guaranteeing Judah's royal lineage until the advent of the Messiah (Shiloh), whose rule will be universal."
  },
  "11": {
    "Non-Denominational": "Judah: Associated with abundance, especially wine.",
    "General": "Judah: Associated with abundance, especially wine.",
    "Baptist": "Symbolizing the prosperity and richness of Judah's future inheritance.",
    "Catholic": "Imagery depicting the extraordinary fertility and prosperity associated with Judah's territory.",
    "Methodist": "Metaphors suggesting great agricultural abundance in Judah's portion.",
    "Lutheran": "Symbolic language pointing to the richness and blessing of Judah's inheritance.",
    "Presbyterian": "Imagery signifying the material abundance and blessing accompanying Judah's leadership.",
    "Pentecostal": "Pictures of lavish abundance associated with Judah's blessing.",
    "Anglican": "Imagery suggesting great prosperity and fertility, particularly viticulture, in Judah's allotted land.",
    "Orthodox": "Symbolism indicating the exceptional fertility and prosperity of Judah's inheritance."
  },
  "12": {
    "Non-Denominational": "Judah: Description implies health and vitality (dark eyes, white teeth).",
    "General": "Judah: Description implies health and vitality (dark eyes, white teeth).",
    "Baptist": "Further symbols of prosperity, health, and vitality.",
    "Catholic": "Descriptions suggesting overflowing health and vitality resulting from abundance.",
    "Methodist": "Imagery conveying health and well-being associated with prosperity.",
    "Lutheran": "Symbols of health derived from the land's richness.",
    "Presbyterian": "Symbols of vitality flowing from the blessing of abundance.",
    "Pentecostal": "Pictures of vibrant health resulting from abundant blessing.",
    "Anglican": "Figurative language suggesting robust health and vitality stemming from the land's richness.",
    "Orthodox": "Symbolism suggesting vigorous health derived from the abundance of Judah's portion."
  },
  "13": {
    "Non-Denominational": "Zebulun: Prophesied to live by the sea, be a haven for ships, bordering Sidon.",
    "General": "Zebulun: Prophesied to live by the sea, be a haven for ships, bordering Sidon.",
    "Baptist": "Predicting Zebulun's geographical location and involvement in maritime trade.",
    "Catholic": "Jacob foretells Zebulun's coastal settlement and engagement with maritime commerce.",
    "Methodist": "Describes Zebulun's future geographical and economic situation.",
    "Lutheran": "Prophecy concerning Zebulun's coastal territory and maritime activity.",
    "Presbyterian": "Declares Zebulun's future location and connection to the sea.",
    "Pentecostal": "Prophetic word about Zebulun's geographical placement and function.",
    "Anglican": "Jacob prophesies Zebulun's geographical destiny near the sea, involved in shipping.",
    "Orthodox": "Jacob foretells Zebulun's location by the sea and connection to maritime life."
  },
  "14": {
    "Non-Denominational": "Issachar: Compared to a strong donkey resting but submitting to labor for comfort.",
    "General": "Issachar: Compared to a strong donkey resting but submitting to labor for comfort.",
    "Baptist": "Symbolizing strength and love of ease, leading to submission and service rather than conflict.",
    "Catholic": "The metaphor suggests Issachar possesses strength but prefers peace and comfort, leading to a submissive role.",
    "Methodist": "Imagery suggesting Issachar values comfort and security, willing to serve for it.",
    "Lutheran": "Issachar is depicted as strong but peace-loving, choosing service over strife.",
    "Presbyterian": "Issachar is characterized by strength coupled with a desire for ease, leading to servitude.",
    "Pentecostal": "Issachar values rest and comfort, choosing submission over struggle.",
    "Anglican": "Jacob uses the metaphor of a strong donkey preferring rest, suggesting Issachar will value peace and comfort, even at the cost of submission.",
    "Orthodox": "The image portrays Issachar as strong yet valuing tranquility, leading to acceptance of burdens for the sake of peace."
  },
  "15": {
    "Non-Denominational": "Issachar: Seeing the pleasant land, he accepts burdensome labor.",
    "General": "Issachar: Seeing the pleasant land, he accepts burdensome labor.",
    "Baptist": "Motivated by the goodness of his inheritance, he accepts a life of toil.",
    "Catholic": "Appreciating his fertile portion, Issachar chooses to bear the yoke of labor.",
    "Methodist": "His appreciation for his pleasant surroundings leads him to accept servitude.",
    "Lutheran": "Contentment with his portion leads Issachar to accept hard labor.",
    "Presbyterian": "Love for his pleasant inheritance leads Issachar to submit to labor.",
    "Pentecostal": "The pleasantness of his lot motivates acceptance of toil.",
    "Anglican": "Appreciating the quality of his land, Issachar submits to potentially heavy labor.",
    "Orthodox": "Contentment with his pleasant territory leads Issachar to accept burdensome service."
  },
  "16": {
    "Non-Denominational": "Dan: Prophesied to judge/provide justice for his people.",
    "General": "Dan: Prophesied to judge/provide justice for his people.",
    "Baptist": "Predicting Dan's role in leadership and judgment within Israel (fulfilled partly by Samson).",
    "Catholic": "Jacob foretells Dan's function of judgment within the tribal confederacy.",
    "Methodist": "Describes Dan's future role related to justice and judgment.",
    "Lutheran": "Prophecy concerning Dan's role as a judge in Israel.",
    "Presbyterian": "Declares Dan's future function of judgment among the tribes.",
    "Pentecostal": "Prophetic word about Dan's governmental/judicial role.",
    "Anglican": "Jacob prophesies that Dan (meaning 'judge') will provide justice for his people within Israel.",
    "Orthodox": "Jacob foretells Dan's judicial function among the tribes."
  },
  "17": {
    "Non-Denominational": "Dan: Compared to a treacherous serpent/viper striking unexpectedly.",
    "General": "Dan: Compared to a treacherous serpent/viper striking unexpectedly.",
    "Baptist": "Symbolizing cunning, danger, and perhaps guerilla warfare tactics associated with the tribe.",
    "Catholic": "The serpent imagery suggests cunning, potentially dangerous, tactics used by Dan.",
    "Methodist": "Metaphor suggesting Dan might employ stealth and surprise in conflict.",
    "Lutheran": "The serpent symbolizes Dan's potentially dangerous and cunning nature.",
    "Presbyterian": "The serpent imagery points to Dan's cunning or potentially harmful influence.",
    "Pentecostal": "Imagery suggesting strategic, potentially hidden, methods of operation.",
    "Anglican": "Jacob uses the metaphor of a viper striking suddenly, perhaps indicating cunning or danger associated with Dan.",
    "Orthodox": "The serpent image suggests guile and potentially destructive tactics employed by Dan."
  },
  "18": {
    "Non-Denominational": "Jacob interjects a personal prayer: 'For your salvation I wait, O LORD.'",
    "General": "Jacob interjects a personal prayer: 'For your salvation I wait, O LORD.'",
    "Baptist": "A spontaneous expression of faith and hope in God's ultimate deliverance, perhaps prompted by the thought of Dan's dangerous nature or simply acknowledging dependence on God.",
    "Catholic": "Jacob momentarily interrupts his prophecies with a personal ejaculation of faith, expressing his ultimate hope and reliance on God's salvation.",
    "Methodist": "A personal cry of faith amidst the prophecies, looking beyond tribal destinies to God's ultimate salvation.",
    "Lutheran": "Jacob expresses his personal hope in God's salvation amidst predicting future strife.",
    "Presbyterian": "Jacob voices his personal trust and hope in God's ultimate salvation.",
    "Pentecostal": "An expression of Jacob's personal faith and anticipation of God's deliverance.",
    "Anglican": "Jacob inserts a personal expression of faith, looking expectantly for God's salvation.",
    "Orthodox": "Jacob pauses to express his personal longing and hope for God's ultimate salvation (Yeshua)."
  },
  "19": {
    "Non-Denominational": "Gad: Predicted to be raided but to raid back successfully.",
    "General": "Gad: Predicted to be raided but to raid back successfully.",
    "Baptist": "A prophecy reflecting Gad's likely location on a frontier, facing attacks but ultimately retaliating.",
    "Catholic": "Jacob foretells Gad's experience of conflict on the borderlands but also their resilience and ability to counter-attack.",
    "Methodist": "Describes Gad's future involving border skirmishes and resilience.",
    "Lutheran": "Prophecy concerning Gad's military struggles and eventual success.",
    "Presbyterian": "Declares Gad's future struggles with raiders but ultimate victory.",
    "Pentecostal": "Prophetic word about Gad facing opposition but overcoming.",
    "Anglican": "Jacob prophesies using a play on Gad's name, predicting conflict but ultimate retaliation and success.",
    "Orthodox": "Jacob foretells Gad's embattled existence but ultimate ability to strike back."
  },
  "20": {
    "Non-Denominational": "Asher: Foretold to have rich food and provide royal delicacies.",
    "General": "Asher: Foretold to have rich food and provide royal delicacies.",
    "Baptist": "Predicting Asher's fertile territory and agricultural wealth.",
    "Catholic": "Jacob foretells Asher's portion will be exceptionally fertile, producing luxury foods.",
    "Methodist": "Describes Asher's future prosperity derived from fertile land.",
    "Lutheran": "Prophecy concerning Asher's material abundance and rich produce.",
    "Presbyterian": "Declares Asher's future blessing of agricultural richness.",
    "Pentecostal": "Prophetic word about Asher's prosperity and abundance.",
    "Anglican": "Jacob prophesies exceptional fertility and richness for Asher's territory.",
    "Orthodox": "Jacob foretells Asher's destiny of material abundance and fine produce."
  },
  "21": {
    "Non-Denominational": "Naphtali: Compared to a free doe bearing beautiful fawns/words.",
    "General": "Naphtali: Compared to a free doe bearing beautiful fawns/words.",
    "Baptist": "Imagery suggesting freedom, agility, grace, and perhaps eloquence or positive outcomes.",
    "Catholic": "The metaphor suggests Naphtali's characteristics of agility, grace, and possibly pleasing speech or fruitfulness.",
    "Methodist": "Poetic imagery conveying freedom, gracefulness, and pleasing results.",
    "Lutheran": "Naphtali is depicted with imagery of freedom and beauty/eloquence.",
    "Presbyterian": "Naphtali characterized by freedom, grace, and pleasing words/offspring.",
    "Pentecostal": "Imagery of freedom, beauty, and graceful expression.",
    "Anglican": "Jacob uses the graceful image of a doe, suggesting Naphtali will be known for freedom, agility, or perhaps eloquence.",
    "Orthodox": "The image portrays Naphtali with characteristics of freedom, grace, and perhaps beautiful speech or offspring."
  },
  "22": {
    "Non-Denominational": "Joseph: Blessed as a fruitful vine by a spring, overcoming boundaries.",
    "General": "Joseph: Blessed as a fruitful vine by a spring, overcoming boundaries.",
    "Baptist": "Extensive blessing symbolizing Joseph's extraordinary fruitfulness (two tribes), prosperity, and influence extending beyond typical limits.",
    "Catholic": "The imagery signifies Joseph's exceptional fertility, blessedness, and expansive growth, nourished by divine sources.",
    "Methodist": "Metaphor highlighting Joseph's exceptional growth, prosperity, and ability to flourish.",
    "Lutheran": "Joseph is blessed with extraordinary fruitfulness and prosperity.",
    "Presbyterian": "Joseph is blessed with remarkable fruitfulness and expansive influence.",
    "Pentecostal": "Imagery of supernatural fruitfulness, growth, and expansion.",
    "Anglican": "Jacob begins Joseph's extensive blessing with imagery of remarkable fruitfulness and growth.",
    "Orthodox": "Joseph is blessed with exceptional fertility and expansive growth, drawing life from divine springs."
  },
  "23": {
    "Non-Denominational": "Joseph: Acknowledges the bitter attacks he endured from archers.",
    "General": "Joseph: Acknowledges the bitter attacks he endured from archers.",
    "Baptist": "Recalling the past hostility and persecution Joseph faced (from brothers, Potiphar's wife, etc.).",
    "Catholic": "Jacob acknowledges the severe opposition and suffering Joseph endured throughout his life.",
    "Methodist": "Jacob references the hardships and attacks Joseph survived.",
    "Lutheran": "Recalling the suffering and opposition Joseph faced.",
    "Presbyterian": "Acknowledging the intense hostility Joseph overcame.",
    "Pentecostal": "Remembering the spiritual and physical attacks against Joseph.",
    "Anglican": "Jacob acknowledges the fierce hostility and attacks Joseph endured in his past.",
    "Orthodox": "Jacob recalls the bitter persecution Joseph suffered."
  },
  "24": {
    "Non-Denominational": "Joseph: Affirms his strength remained due to God's help (Mighty One, Shepherd, Rock).",
    "General": "Joseph: Affirms his strength remained due to God's help (Mighty One, Shepherd, Rock).",
    "Baptist": "Attributing Joseph's resilience and steadfastness directly to God's power, guidance, and stability.",
    "Catholic": "Jacob affirms that Joseph's endurance came from divine assistance, invoking powerful names for God signifying strength, guidance, and refuge.",
    "Methodist": "Jacob attributes Joseph's ability to withstand adversity to God's sustaining power.",
    "Lutheran": "Joseph's strength came from God, the Mighty One, Shepherd, and Rock.",
    "Presbyterian": "Jacob declares Joseph's strength was sustained by God's power and care.",
    "Pentecostal": "Joseph's endurance and strength were divinely empowered by God.",
    "Anglican": "He affirms that Joseph's strength endured through the power of God, described with multiple titles (Mighty One, Shepherd, Rock).",
    "Orthodox": "Jacob attributes Joseph's resilience to the power and support of God, the Mighty Shepherd and Rock."
  },
  "25": {
    "Non-Denominational": "Joseph: Receives blessings from God Almighty (El Shaddai) - heaven, deep, fertility.",
    "General": "Joseph: Receives blessings from God Almighty (El Shaddai) - heaven, deep, fertility.",
    "Baptist": "Bestowing comprehensive blessings covering cosmic (heaven/rain, underground springs/deep) and biological (human/animal fertility) dimensions.",
    "Catholic": "Jacob invokes blessings from El Shaddai, encompassing celestial (rain), terrestrial (water sources), and biological fruitfulness.",
    "Methodist": "Jacob calls down abundant blessings relating to nature and fertility upon Joseph.",
    "Lutheran": "Joseph is blessed with comprehensive abundance from God Almighty.",
    "Presbyterian": "Jacob bestows abundant blessings related to creation and fertility from God Almighty.",
    "Pentecostal": "Imparting extensive blessings of abundance, provision, and multiplication.",
    "Anglican": "Jacob invokes abundant blessings from God Almighty upon Joseph, encompassing blessings from the sky, the earth, and fertility.",
    "Orthodox": "Jacob bestows manifold blessings upon Joseph, invoking God Almighty for cosmic and biological fruitfulness."
  },
  "26": {
    "Non-Denominational": "Joseph: Jacob's blessings surpass ancestral blessings, resting on Joseph as the prince/separated one.",
    "General": "Joseph: Jacob's blessings surpass ancestral blessings, resting on Joseph as the prince/separated one.",
    "Baptist": "Jacob declares the unique intensity and scope of his blessing on Joseph, recognizing Joseph's unique status and suffering.",
    "Catholic": "Jacob emphasizes the exceptional nature of the blessings conferred on Joseph, acknowledging his unique status (`nazir`) among his brothers.",
    "Methodist": "Jacob highlights the exceptional quality of blessing given to Joseph, the one set apart.",
    "Lutheran": "Jacob emphasizes the superiority of the blessing on Joseph, the chosen one among his brothers.",
    "Presbyterian": "Jacob declares the unique magnitude of blessing upon Joseph, the one separated unto God.",
    "Pentecostal": "Jacob releases an exceptional anointing and blessing upon Joseph, the consecrated one.",
    "Anglican": "Jacob emphasizes the surpassing quality of these blessings, fitting for Joseph, the one distinguished (`nazir`) among his brothers.",
    "Orthodox": "Jacob stresses the extraordinary measure of blessing upon Joseph, acknowledging his unique status as the one set apart (`nazir`)."
  },
  "27": {
    "Non-Denominational": "Benjamin: Described as a ravenous wolf, fierce and successful in conflict.",
    "General": "Benjamin: Described as a ravenous wolf, fierce and successful in conflict.",
    "Baptist": "Predicting Benjamin's warlike character and martial success.",
    "Catholic": "The wolf imagery suggests Benjamin's tribe will be fierce and adept in warfare.",
    "Methodist": "Metaphor emphasizing Benjamin's future reputation for fierceness in battle.",
    "Lutheran": "Benjamin is characterized by warlike ferocity.",
    "Presbyterian": "Benjamin is described metaphorically as fierce and successful in war.",
    "Pentecostal": "Imagery suggesting a warrior spirit and success in conflict.",
    "Anglican": "Jacob describes Benjamin using the metaphor of a predatory wolf, suggesting fierceness and success in warfare.",
    "Orthodox": "The wolf metaphor portrays Benjamin as fierce, predatory, and successful in conflict."
  },
  "28": {
    "Non-Denominational": "Summary: These are the twelve tribes, each blessed according to his specific blessing.",
    "General": "Summary: These are the twelve tribes, each blessed according to his specific blessing.",
    "Baptist": "Concluding statement emphasizing the distinct destinies prophesied for each tribe.",
    "Catholic": "The narrative confirms Jacob blessed each son individually according to their unique future role and destiny.",
    "Methodist": "Reiterates that each son received a unique and appropriate blessing/prophecy.",
    "Lutheran": "Confirms the completion of the individual blessings for the twelve tribes.",
    "Presbyterian": "Summarizes that Jacob blessed each son according to his divinely appointed destiny.",
    "Pentecostal": "Affirms that each son received his specific impartation and prophetic word.",
    "Anglican": "The narrative concludes the section by stating these are the ancestors of the twelve tribes, each receiving a distinct blessing.",
    "Orthodox": "Confirms that Jacob bestowed a unique, fitting blessing upon each of his twelve sons."
  },
  "29": {
    "Non-Denominational": "Jacob commands his sons to bury him with his fathers in the cave in Canaan.",
    "General": "Jacob commands his sons to bury him with his fathers in the cave in Canaan.",
    "Baptist": "Repeating his earlier instruction, now to all his sons, emphasizing his desire rooted in faith.",
    "Catholic": "Jacob gives his final command regarding his burial, instructing all his sons to ensure his return to the ancestral tomb.",
    "Methodist": "Jacob issues his final instruction concerning his burial place.",
    "Lutheran": "Jacob commands his sons regarding his burial in the promised land.",
    "Presbyterian": "Jacob gives his final command, directing burial in the covenant land.",
    "Pentecostal": "Jacob gives the final instruction about his burial in Canaan.",
    "Anglican": "Jacob gives his final charge to his sons concerning his burial place in Canaan.",
    "Orthodox": "Jacob instructs all his sons regarding his burial in the ancestral tomb at Machpelah."
  },
  "30": {
    "Non-Denominational": "He specifies the location: Cave of Machpelah, bought by Abraham.",
    "General": "He specifies the location: Cave of Machpelah, bought by Abraham.",
    "Baptist": "Detailing the exact location and its legitimate acquisition by Abraham.",
    "Catholic": "Jacob precisely identifies the burial site, emphasizing its significance as the purchased possession of Abraham.",
    "Methodist": "Jacob provides specific details about the intended burial location.",
    "Lutheran": "Jacob names the specific ancestral burial cave.",
    "Presbyterian": "Jacob specifies the exact location, emphasizing its connection to Abraham.",
    "Pentecostal": "Identifying the specific ancestral burial plot.",
    "Anglican": "He precisely identifies the cave of Machpelah, recalling its purchase by Abraham.",
    "Orthodox": "Jacob specifies the exact location, the cave purchased by Abraham."
  },
  "31": {
    "Non-Denominational": "He lists those buried there: Abraham, Sarah, Isaac, Rebekah, Leah.",
    "General": "He lists those buried there: Abraham, Sarah, Isaac, Rebekah, Leah.",
    "Baptist": "Emphasizing the continuity of family and faith associated with this sacred place.",
    "Catholic": "Jacob enumerates the patriarchs and matriarchs interred there, stressing his desire to join them in the communion of the faithful departed.",
    "Methodist": "Jacob highlights the family connection to the burial site.",
    "Lutheran": "Jacob names the ancestors buried there, desiring to join them.",
    "Presbyterian": "Jacob lists the generations buried there, emphasizing his connection to the covenant line.",
    "Pentecostal": "Naming the family members already interred in the ancestral tomb.",
    "Anglican": "He lists the family members already buried in the cave, emphasizing its ancestral importance.",
    "Orthodox": "Jacob names the patriarchs and matriarchs buried in Machpelah, signifying his place within that sacred lineage."
  },
  "32": {
    "Non-Denominational": "He repeats the field and cave were bought from the Hittites.",
    "General": "He repeats the field and cave were bought from the Hittites.",
    "Baptist": "Reaffirming the legitimate ownership of the burial site.",
    "Catholic": "Jacob reiterates the legal acquisition of the property, securing the right of burial.",
    "Methodist": "Jacob emphasizes the legal basis for their claim to the burial site.",
    "Lutheran": "Jacob stresses the legitimate purchase of the tomb.",
    "Presbyterian": "Jacob confirms the legitimate purchase of the burial site.",
    "Pentecostal": "Affirming the legal right to the burial place.",
    "Anglican": "He reiterates that the field and cave were legally purchased from the Hittites.",
    "Orthodox": "Jacob reaffirms the legitimate acquisition of the burial site."
  },
  "33": {
    "Non-Denominational": "After finishing his instructions, Jacob draws up his feet, breathes his last, and dies.",
    "General": "After finishing his instructions, Jacob draws up his feet, breathes his last, and dies.",
    "Baptist": "A peaceful death after faithfully completing his final patriarchal duties.",
    "Catholic": "Jacob dies serenely after fulfilling his final obligations, being 'gathered to his people' in faith.",
    "Methodist": "Describes Jacob's peaceful death after concluding his final instructions.",
    "Lutheran": "Jacob dies peacefully, his earthly pilgrimage complete.",
    "Presbyterian": "Jacob dies peacefully after completing his final covenant duties.",
    "Pentecostal": "Jacob peacefully transitions after finishing his earthly assignment.",
    "Anglican": "Having completed his final instructions, Jacob dies peacefully and is 'gathered to his people.'",
    "Orthodox": "Having fulfilled his final patriarchal duties, Jacob peacefully departs this life."
  }
} 