{
  "chapterSummary": {
    "General": "Genesis 7 details the final instructions for entering the ark, differentiating between clean (seven pairs) and unclean (one pair) animals. Noah, his family, and the animals enter the ark as commanded. God shuts them in. Then, the flood begins with rain for forty days and forty nights, covering the entire earth, including the highest mountains, destroying all land-based life outside the ark. Only Noah and those with him in the ark survive.",
    "Non-Denominational": "Focuses on Noah's final obedience, the distinction between clean/unclean animals (for sacrifice/food later), God's timing and sovereignty in initiating the Flood (both rain and subterranean waters), the ark as the sole means of salvation, God's personal act of securing Noah ('shut him in'), the totality of the destruction, and the preservation of the remnant in the ark.",
    "Baptist": "Emphasizes Noah's complete obedience based on faith. Highlights the distinction between clean (7 pairs for sacrifice) and unclean animals. Affirms the global nature of the Flood, destroying all air-breathing life outside the ark. Sees God shutting the door as an act of both security for Noah and finality of judgment for the world.",
    "Catholic": "Notes Noah's obedience and God's specific instructions regarding animals (distinction anticipating sacrificial worship). Views the Flood as a cataclysmic, universal judgment. The ark, sheltering Noah's family and animals, is a primary type/symbol of the Church providing salvation. God shutting the door signifies divine protection and the definitive start of the judgment.",
    "Methodist": "Stresses Noah's faithfulness and obedience in the face of impending doom. Highlights the distinction among animals for future purposes. Notes the dual sources of the Flood (rain and deep). Emphasizes God's protective care in securing Noah within the ark, the sole place of refuge from the universal judgment.",
    "Lutheran": "Highlights Noah's faith expressed through obedience. The distinction between clean/unclean animals points towards future worship. Affirms the Flood as universal divine judgment upon sin. God shutting the door signifies both protection for the faithful remnant inside and judgment upon those outside. The ark represents Christ/the Church.",
    "Presbyterian": "Focuses on Noah's covenant obedience. The instruction about clean animals anticipates post-Flood sacrifice. Affirms the Flood as God's worldwide judgment executed upon pervasive sin. God shutting the door secures the elect remnant within the ark (symbol of salvation) and seals the fate of the wicked world.",
    "Pentecostal": "Emphasizes Noah's unwavering obedience and faith. Highlights the supernatural aspects: God bringing animals, God shutting the door. Stresses the universality and totality of the Flood judgment. Views the ark as God's provided escape from judgment for the righteous.",
    "Anglican": "Notes Noah's obedience, the practical instructions (clean/unclean animals), the timing (7 days), the description of the Flood's sources and devastating extent. God shutting the door emphasizes His protection of Noah and the finality of the event. The ark symbolizes the Church.",
    "Orthodox": "Highlights Noah's obedience. Sees the distinction of animals anticipating future liturgical practice. Views the Flood as a catastrophic, cleansing judgment upon sin, returning creation towards its primordial watery state before re-creation. God shuts the door, protecting the remnant. The ark is a type of the Church."
  },
  "1": {
    "Non-Denominational": "The Lord tells Noah to go into the ark with his whole family, reaffirming Noah's righteousness in that generation.",
    "General": "The Lord tells Noah to go into the ark with his whole family, reaffirming Noah's righteousness in that generation.",
    "Baptist": "God commands entry into the ark, confirming Noah's righteous standing by faith.",
    "Catholic": "God invites Noah and his family into the ark, acknowledging Noah's justice in a corrupt world.",
    "Methodist": "God calls Noah and his family into safety, based on Noah's recognized righteousness.",
    "Lutheran": "God commands Noah, the righteous one (by faith), to enter the ark.",
    "Presbyterian": "God commands Noah, declared righteous by grace, to enter the ark.",
    "Pentecostal": "God instructs Noah, the righteous man, to enter the ark with his family.",
    "Anglican": "God commands Noah and family to enter the ark, acknowledging Noah's righteousness.",
    "Orthodox": "God calls the righteous Noah and his family into the ark."
  },
  "2": {
    "Non-Denominational": "God instructs Noah to take seven pairs (male and female) of every kind of clean animal and one pair (male and female) of every kind of unclean animal.",
    "General": "God instructs Noah to take seven pairs (male and female) of every kind of clean animal and one pair (male and female) of every kind of unclean animal.",
    "Baptist": "Specific instruction distinguishing clean (more pairs, likely for sacrifice) and unclean animals.",
    "Catholic": "Distinction made between clean (7 pairs, for sacrifice) and unclean (1 pair, for propagation) animals.",
    "Methodist": "Instruction highlights distinction for future needs, likely sacrifice and food.",
    "Lutheran": "Command differentiates clean (7 pairs) and unclean (1 pair) animals, anticipating sacrifice.",
    "Presbyterian": "God commands taking more clean animals, anticipating post-Flood sacrifice.",
    "Pentecostal": "Specific instruction regarding quantities of clean and unclean animals.",
    "Anglican": "Instruction specifies taking seven pairs of clean animals/birds and one pair of unclean.",
    "Orthodox": "Distinction between clean (seven pairs) and unclean (two pairs - possibly implied from v. 15/16 or textual variant) animals, anticipating liturgical needs."
  },
  "3": {
    "Non-Denominational": "Similarly, Noah is to take seven pairs (male and female) of every kind of bird to ensure their survival on the earth.",
    "General": "Similarly, Noah is to take seven pairs (male and female) of every kind of bird to ensure their survival on the earth.",
    "Baptist": "Instruction extended to include seven pairs of birds (likely referring to clean birds).",
    "Catholic": "Command includes seven pairs of birds for propagation.",
    "Methodist": "Extends the instruction to birds, ensuring their preservation.",
    "Lutheran": "Also seven pairs of birds to preserve them.",
    "Presbyterian": "Instruction includes seven pairs of birds.",
    "Pentecostal": "Command includes seven pairs of birds.",
    "Anglican": "Reiteration for birds: seven pairs to preserve species.",
    "Orthodox": "Command includes seven pairs of birds."
  },
  "4": {
    "Non-Denominational": "God gives a final warning: in seven days, He will send rain on the earth for forty days and forty nights, wiping out every living creature He has made from the face of the earth.",
    "General": "God gives a final warning: in seven days, He will send rain on the earth for forty days and forty nights, wiping out every living creature He has made from the face of the earth.",
    "Baptist": "God specifies the timeframe (7 days) and duration (40 days/nights) of the impending judgment.",
    "Catholic": "God announces the imminent start (7 days) and duration (40 days/nights) of the destructive Flood.",
    "Methodist": "God gives a final countdown and specifies the duration of the initial phase of the Flood.",
    "Lutheran": "God gives a final seven-day warning before the Flood begins.",
    "Presbyterian": "God announces the specific timing and duration of the Flood judgment.",
    "Pentecostal": "God gives the final timeline before judgment falls.",
    "Anglican": "God gives a seven-day warning before initiating the forty-day period of rain.",
    "Orthodox": "God gives a final seven-day period before the Flood begins, lasting forty days and nights."
  },
  "5": {
    "Non-Denominational": "Noah again demonstrates obedience, doing everything the Lord commanded him.",
    "General": "Noah again demonstrates obedience, doing everything the Lord commanded him.",
    "Baptist": "Noah's faith is demonstrated through his complete obedience.",
    "Catholic": "Reaffirms Noah's perfect obedience to all divine commands.",
    "Methodist": "Highlights Noah's consistent pattern of obedience.",
    "Lutheran": "Noah faithfully obeys all of God's commands.",
    "Presbyterian": "Noah demonstrates his faith through exact obedience.",
    "Pentecostal": "Noah's complete obedience underscores his righteousness.",
    "Anglican": "Reiteration of Noah's complete obedience to God's commands.",
    "Orthodox": "Affirms Noah's full obedience to God's instructions."
  },
  "6": {
    "Non-Denominational": "States Noah's age at the time of the flood: six hundred years old when the floodwaters came upon the earth.",
    "General": "States Noah's age at the time of the flood: six hundred years old when the floodwaters came upon the earth.",
    "Baptist": "Records Noah's age when the judgment began.",
    "Catholic": "Specifies Noah's age (600) at the onset of the Flood.",
    "Methodist": "Provides the specific age of Noah when the Flood started.",
    "Lutheran": "Noah was 600 years old when the Flood began.",
    "Presbyterian": "Notes Noah's age at the time of the Flood.",
    "Pentecostal": "Records Noah's age at the start of the Flood.",
    "Anglican": "Records Noah's age (600) when the Flood commenced.",
    "Orthodox": "Specifies Noah's age (600) when the Flood began."
  },
  "7": {
    "Non-Denominational": "Noah, his sons, his wife, and his sons' wives enter the ark to escape the waters of the flood.",
    "General": "Noah, his sons, his wife, and his sons' wives enter the ark to escape the waters of the flood.",
    "Baptist": "The righteous remnant enters the ark for salvation from judgment.",
    "Catholic": "Noah and his family enter the ark, the means of salvation provided by God.",
    "Methodist": "The chosen family enters the place of refuge.",
    "Lutheran": "Noah and his family enter the ark to escape God's wrath.",
    "Presbyterian": "The elect family enters the ark according to God's command.",
    "Pentecostal": "Noah and his family obey God and enter the ark.",
    "Anglican": "Noah and his immediate family enter the ark for safety from the Flood.",
    "Orthodox": "Noah and his family enter the ark, the vessel of salvation."
  },
  "8": {
    "Non-Denominational": "Pairs of clean and unclean animals, birds, and all creatures that move along the ground...",
    "General": "Pairs of clean and unclean animals, birds, and all creatures that move along the ground...",
    "Baptist": "Animals begin entering the ark as commanded.",
    "Catholic": "The various categories of animals begin to enter the ark.",
    "Methodist": "Describes the animals entering the ark.",
    "Lutheran": "Animals enter the ark as commanded.",
    "Presbyterian": "Animals enter the ark.",
    "Pentecostal": "The animals begin boarding the ark.",
    "Anglican": "The different categories of animals also enter.",
    "Orthodox": "Animals of all specified kinds enter."
  },
  "9": {
    "Non-Denominational": "...came to Noah and entered the ark, male and female, just as God had commanded Noah.",
    "General": "...came to Noah and entered the ark, male and female, just as God had commanded Noah.",
    "Baptist": "Highlights God's providence in bringing the animals to Noah, fulfilling His command.",
    "Catholic": "Emphasizes that the animals came to Noah (divine action) in pairs as commanded.",
    "Methodist": "Notes the animals coming to Noah, signifying God's orchestration, fulfilling the command.",
    "Lutheran": "The animals came to Noah in pairs as God commanded.",
    "Presbyterian": "The animals came to Noah as pairs, fulfilling God's command.",
    "Pentecostal": "The animals supernaturally come to Noah and enter the ark as commanded.",
    "Anglican": "They came in pairs, male and female, fulfilling God's command.",
    "Orthodox": "The animals came in pairs to Noah, fulfilling God's instruction."
  },
  "10": {
    "Non-Denominational": "After the seven days specified by God, the floodwaters came upon the earth.",
    "General": "After the seven days specified by God, the floodwaters came upon the earth.",
    "Baptist": "The period of grace ends, and the judgment begins exactly as God foretold.",
    "Catholic": "The Flood begins precisely after the specified seven-day period.",
    "Methodist": "The Flood commences according to God's timetable.",
    "Lutheran": "The seven-day warning period ends, and the Flood begins.",
    "Presbyterian": "After the seven days, the Flood begins as decreed.",
    "Pentecostal": "The judgment begins exactly when God said it would.",
    "Anglican": "Precisely after the seven days, the Flood begins.",
    "Orthodox": "After the seven days, the Flood commences upon the earth."
  },
  "11": {
    "Non-Denominational": "Pinpoints the start of the flood: the seventeenth day of the second month of Noah's six hundredth year. On that day, all the springs of the great deep burst forth, and the floodgates of the heavens were opened.",
    "General": "Pinpoints the start of the flood: the seventeenth day of the second month of Noah's six hundredth year. On that day, all the springs of the great deep burst forth, and the floodgates of the heavens were opened.",
    "Baptist": "Describes the dual sources of the global Flood: subterranean waters and torrential rain.",
    "Catholic": "Gives the date and describes the cataclysmic opening of both subterranean and celestial water sources.",
    "Methodist": "Provides a specific date and describes the immense scale of the Flood's sources (deep and heavens).",
    "Lutheran": "Describes the cataclysmic beginning of the Flood from below and above.",
    "Presbyterian": "Details the commencement of the Flood, involving waters from the deep and the heavens.",
    "Pentecostal": "Highlights the supernatural, cataclysmic nature of the Flood's beginning.",
    "Anglican": "Provides a precise date and describes the two sources of the Flood waters: subterranean ('springs of the great deep') and atmospheric ('floodgates of the heavens').",
    "Orthodox": "Gives the date and describes the cataclysmic release of waters from the abyss below and the heavens above."
  },
  "12": {
    "Non-Denominational": "Rain fell upon the earth for forty days and forty nights.",
    "General": "Rain fell upon the earth for forty days and forty nights.",
    "Baptist": "Specifies the duration of the torrential rainfall.",
    "Catholic": "Notes the forty-day period of intense rain, a number often associated with testing and judgment.",
    "Methodist": "States the duration of the continuous rain.",
    "Lutheran": "Rain lasts forty days and nights.",
    "Presbyterian": "Specifies the forty-day duration of the rainfall.",
    "Pentecostal": "Highlights the significant forty-day period of rain.",
    "Anglican": "Records the duration of the rainfall: forty days and nights.",
    "Orthodox": "Notes the forty-day period of intense rainfall."
  },
  "13": {
    "Non-Denominational": "On that very same day, Noah and his sons (Shem, Ham, Japheth), along with his wife and his sons' wives, entered the ark.",
    "General": "On that very same day, Noah and his sons (Shem, Ham, Japheth), along with his wife and his sons' wives, entered the ark.",
    "Baptist": "Reemphasizes that Noah's family entered the ark on the day the Flood began.",
    "Catholic": "Reiterates the entry of Noah and his family into the ark on the very day the Flood started.",
    "Methodist": "Confirms the family's entry coinciding with the Flood's beginning.",
    "Lutheran": "Noah and his family entered the ark just as the Flood began.",
    "Presbyterian": "Reaffirms the entry of Noah's family into the ark on the day the Flood began.",
    "Pentecostal": "Emphasizes their timely obedience, entering on the specified day.",
    "Anglican": "Reiterates that Noah's family entered the ark on the very day the Flood began.",
    "Orthodox": "Confirms Noah and his family entered the ark on the day the Flood started."
  },
  "14": {
    "Non-Denominational": "They entered with every kind of wild animal, livestock, creature that moves along the ground, and bird.",
    "General": "They entered with every kind of wild animal, livestock, creature that moves along the ground, and bird.",
    "Baptist": "Confirms the animals also entered as commanded.",
    "Catholic": "Reiterates the presence of all categories of land animals and birds in the ark.",
    "Methodist": "Lists the categories of creatures accompanying Noah's family.",
    "Lutheran": "All kinds of animals entered with them.",
    "Presbyterian": "Confirms the presence of all kinds of animals in the ark.",
    "Pentecostal": "Reaffirms the animals entering the ark.",
    "Anglican": "Specifies again the various categories of creatures that entered with Noah.",
    "Orthodox": "Reiterates that all specified kinds of creatures entered the ark."
  },
  "15": {
    "Non-Denominational": "Pairs of all creatures that have the breath of life in them came to Noah and entered the ark.",
    "General": "Pairs of all creatures that have the breath of life in them came to Noah and entered the ark.",
    "Baptist": "Reemphasizes that pairs of all air-breathing creatures entered.",
    "Catholic": "Confirms pairs of all creatures possessing the breath of life entered.",
    "Methodist": "Reiterates that pairs of all living creatures entered.",
    "Lutheran": "Pairs of all creatures with the breath of life entered.",
    "Presbyterian": "Reaffirms pairs of all air-breathing life entered.",
    "Pentecostal": "States again that pairs of all life entered.",
    "Anglican": "Reiterates that pairs of all creatures with the breath of life entered.",
    "Orthodox": "Confirms pairs of all creatures having the breath of life entered."
  },
  "16": {
    "Non-Denominational": "The animals entering were male and female of every living thing, as God had commanded. Then the Lord shut him in (closing the door of the ark).",
    "General": "The animals entering were male and female of every living thing, as God had commanded. Then the Lord shut him in (closing the door of the ark).",
    "Baptist": "God Himself secures Noah and seals the ark, signifying both protection and the finality of judgment for those outside.",
    "Catholic": "God divinely seals the ark, protecting those inside and definitively excluding those outside. A symbol of God securing the Church.",
    "Methodist": "God's personal act of shutting the door emphasizes His protection over Noah and the irrevocable start of judgment.",
    "Lutheran": "God Himself shuts the door, protecting Noah and sealing the fate of the ungodly world.",
    "Presbyterian": "God shuts the door, an act signifying divine protection for the remnant and irreversible judgment on the world.",
    "Pentecostal": "God supernaturally shuts the door, securing Noah and sealing the judgment.",
    "Anglican": "The animals enter as commanded; significantly, the Lord Himself shuts Noah in, signifying protection and finality.",
    "Orthodox": "God Himself seals the ark, protecting Noah and signifying the separation between salvation and judgment."
  },
  "17": {
    "Non-Denominational": "The flood continued for forty days on the earth. As the waters increased, they lifted the ark high above the earth.",
    "General": "The flood continued for forty days on the earth. As the waters increased, they lifted the ark high above the earth.",
    "Baptist": "Describes the initial 40-day period of the Flood and the ark being lifted.",
    "Catholic": "Notes the 40-day duration of the Flood's initial stage and the ark floating.",
    "Methodist": "The Flood progresses, lifting the ark.",
    "Lutheran": "The Flood continues 40 days, lifting the ark.",
    "Presbyterian": "Describes the Flood's initial stage and its effect on the ark.",
    "Pentecostal": "Details the 40 days and the ark rising.",
    "Anglican": "The Flood continues for forty days, lifting the ark clear of the ground.",
    "Orthodox": "The Flood persists 40 days, lifting the ark."
  },
  "18": {
    "Non-Denominational": "The waters rose and increased greatly, and the ark floated on the surface of the water.",
    "General": "The waters rose and increased greatly, and the ark floated on the surface of the water.",
    "Baptist": "Emphasizes the increasing depth of the water and the ark floating safely.",
    "Catholic": "Describes the rising waters and the ark floating securely upon them.",
    "Methodist": "Highlights the rising waters and the ark's buoyancy.",
    "Lutheran": "The waters rise significantly; the ark floats.",
    "Presbyterian": "The waters increase greatly; the ark floats.",
    "Pentecostal": "The waters prevail; the ark floats.",
    "Anglican": "The waters continue to rise, and the ark floats freely.",
    "Orthodox": "The waters increase, and the ark is borne upon them."
  },
  "19": {
    "Non-Denominational": "The waters prevailed so mightily upon the earth that all the high mountains under the entire heavens were covered.",
    "General": "The waters prevailed so mightily upon the earth that all the high mountains under the entire heavens were covered.",
    "Baptist": "Stresses the global extent of the Flood, covering even the highest mountains.",
    "Catholic": "Emphasizes the universality of the Flood, covering all mountains.",
    "Methodist": "Highlights the immense scale of the Flood, submerging the entire landscape.",
    "Lutheran": "The Flood covers all the mountains, indicating its universal extent.",
    "Presbyterian": "Affirms the global nature of the Flood, covering the highest mountains.",
    "Pentecostal": "Stresses the worldwide extent of the Flood covering all mountains.",
    "Anglican": "Emphasizes the vast extent of the waters, covering all the high mountains.",
    "Orthodox": "Highlights the universality of the Flood, covering all high mountains."
  },
  "20": {
    "Non-Denominational": "The waters rose fifteen cubits (about 22.5 feet or 7 meters) above the tops of the covered mountains.",
    "General": "The waters rose fifteen cubits (about 22.5 feet or 7 meters) above the tops of the covered mountains.",
    "Baptist": "Provides the depth of the water above the mountains, ensuring total destruction.",
    "Catholic": "Specifies the depth over the mountains, ensuring the totality of the deluge.",
    "Methodist": "Gives the measure of the water above the peaks, underscoring the depth.",
    "Lutheran": "The waters covered the mountains by a significant depth.",
    "Presbyterian": "Specifies the depth above the mountains, emphasizing the Flood's totality.",
    "Pentecostal": "Details the depth above the mountains.",
    "Anglican": "Specifies the depth of the water (15 cubits) above the submerged mountains.",
    "Orthodox": "Notes the depth of the waters above the highest mountains."
  },
  "21": {
    "Non-Denominational": "Every living thing that moved on land perished—birds, livestock, wild animals, all creatures swarming over the earth, and all mankind.",
    "General": "Every living thing that moved on land perished—birds, livestock, wild animals, all creatures swarming over the earth, and all mankind.",
    "Baptist": "Details the comprehensive destruction of all air-breathing land life outside the ark.",
    "Catholic": "Lists the categories of terrestrial life destroyed by the Flood.",
    "Methodist": "Emphasizes the totality of the destruction of land-based life.",
    "Lutheran": "All land creatures outside the ark, including humanity, perished.",
    "Presbyterian": "Details the destruction of all flesh outside the ark.",
    "Pentecostal": "Highlights the death of all land-based life not in the ark.",
    "Anglican": "Lists the comprehensive destruction of all terrestrial life outside the ark.",
    "Orthodox": "Details the destruction of all land creatures, including humanity."
  },
  "22": {
    "Non-Denominational": "Everything on dry land that had the breath of life in its nostrils died.",
    "General": "Everything on dry land that had the breath of life in its nostrils died.",
    "Baptist": "Reiterates the destruction of all air-breathing life on land.",
    "Catholic": "Confirms the death of all creatures possessing the breath of life on dry land.",
    "Methodist": "Emphasizes the destruction of all air-breathing land creatures.",
    "Lutheran": "All air-breathing life on land died.",
    "Presbyterian": "Reaffirms the death of all creatures with the breath of life.",
    "Pentecostal": "Confirms the death of everything with the breath of life.",
    "Anglican": "A summarizing statement: all air-breathing life on land perished.",
    "Orthodox": "Confirms the death of all on dry land having the breath of life."
  },
  "23": {
    "Non-Denominational": "Every living thing on the face of the earth was wiped out—people, animals, creatures moving on the ground, and birds. Only Noah was left, along with those who were with him in the ark.",
    "General": "Every living thing on the face of the earth was wiped out—people, animals, creatures moving on the ground, and birds. Only Noah was left, along with those who were with him in the ark.",
    "Baptist": "Emphatic summary of the total destruction outside the ark and the sole survival of Noah and those with him.",
    "Catholic": "Summarizes the universal destruction, contrasting it with the salvation of the remnant within the ark.",
    "Methodist": "Concludes the description of destruction, highlighting the exclusive survival of those in the ark.",
    "Lutheran": "Summarizes the destruction, leaving only Noah and those in the ark alive.",
    "Presbyterian": "Summarizes the judgment's execution and the preservation of the remnant in the ark.",
    "Pentecostal": "Emphasizes the complete destruction outside and the preservation inside the ark.",
    "Anglican": "Summarizes the outcome: comprehensive destruction outside the ark, survival only for those inside.",
    "Orthodox": "Summarizes the destruction of all life outside the ark, with only Noah and his companions surviving."
  },
  "24": {
    "Non-Denominational": "The waters flooded the earth for a hundred and fifty days.",
    "General": "The waters flooded the earth for a hundred and fifty days.",
    "Baptist": "Specifies the total duration the waters prevailed upon the earth.",
    "Catholic": "Notes the 150-day period during which the floodwaters covered the earth.",
    "Methodist": "Gives the total time the waters remained at their peak.",
    "Lutheran": "The waters prevailed for 150 days.",
    "Presbyterian": "States the duration the waters prevailed: 150 days.",
    "Pentecostal": "Specifies the 150-day period of the waters covering the earth.",
    "Anglican": "Records the total duration the waters flooded the earth (150 days).",
    "Orthodox": "Notes the 150-day period the waters covered the earth."
  }
} 