{
  "chapterSummary": {
    "General": "God announces the final plague - the death of the firstborn. This plague will demonstrate God's complete authority over life and death, and will finally break Pharaoh's resistance. The Israelites are instructed to prepare for their departure.",
    "Non-Denominational": "Focuses on God's announcement of the final plague and preparation for departure, showing His ultimate authority.",
    "Baptist": "Emphasizes God's sovereign power in judging Egypt and preparing His people for deliverance.",
    "Catholic": "Highlights God's authority over life and death through the final plague and His care for His people.",
    "Methodist": "Focuses on God's judgment of Egyptian oppression and His preparation of His people for freedom.",
    "Lutheran": "Emphasizes God's authority over life and death and His preparation of His people for deliverance.",
    "Presbyterian": "Stresses God's covenantal faithfulness in judging Egypt and preparing His people for departure.",
    "Pentecostal": "Highlights God's supernatural power in judging Egypt and preparing His people for deliverance.",
    "Anglican": "Emphasizes God's authority over life and death and His preparation of His people for departure.",
    "Orthodox": "Focuses on God's authority over life and death and His care for His people in preparation for deliverance."
  },
  "1": {
    "General": "The divine revelation of final judgment, demonstrating God's sovereignty and power",
    "Non-Denominational": "The Lord's announcement of ultimate plague, showing His authority and justice",
    "Baptist": "The divine revelation of final judgment, demonstrating God's sovereignty and His righteous judgment",
    "Catholic": "The Lord's announcement of ultimate plague, showing His authority and His care for His people",
    "Methodist": "The divine revelation of final judgment, demonstrating God's sovereignty and His call to justice",
    "Lutheran": "The Lord's announcement of ultimate plague, showing His authority and His righteous judgment",
    "Presbyterian": "The divine revelation of final judgment, demonstrating God's sovereignty and His covenantal faithfulness",
    "Pentecostal": "The Lord's announcement of ultimate plague, showing His authority and His supernatural power",
    "Anglican": "The divine revelation of final judgment, demonstrating God's sovereignty and His care for His people",
    "Orthodox": "The Lord's announcement of ultimate plague, showing His authority and His care for His people"
  },
  "2": {
    "General": "Divine instruction for preparation and provision before departure",
    "Non-Denominational": "The Lord's command to prepare for liberation through material provision",
    "Baptist": "The divine instruction for preparation, demonstrating God's provision and care",
    "Catholic": "The Lord's command to prepare for liberation, showing His provision and care",
    "Methodist": "The divine instruction for preparation, demonstrating God's justice and provision",
    "Lutheran": "The Lord's command to prepare for liberation, showing His provision and care",
    "Presbyterian": "The divine instruction for preparation, demonstrating God's covenantal faithfulness",
    "Pentecostal": "The Lord's command to prepare for liberation, showing His supernatural provision",
    "Anglican": "The divine instruction for preparation, demonstrating God's provision and care",
    "Orthodox": "The Lord's command to prepare for liberation, showing His provision and care"
  },
  "3": {
    "Catholic": "God's grace manifested in Egyptian regard for the Israelites",
    "Protestant": "The Lord's favor evident in Egyptian respect for Moses",
    "Orthodox": "God's grace manifested in Egyptian regard for the Israelites",
    "Jewish": "The Lord's favor evident in Egyptian respect for Moses",
    "Mormon": "God's grace manifested in Egyptian regard for the Israelites"
  },
  "4": {
    "Catholic": "Divine proclamation of the final plague upon Egypt",
    "Protestant": "The Lord's declaration of ultimate judgment through the firstborn",
    "Orthodox": "Divine proclamation of the final plague upon Egypt",
    "Jewish": "The Lord's declaration of ultimate judgment through the firstborn",
    "Mormon": "Divine proclamation of the final plague upon Egypt"
  },
  "5": {
    "Catholic": "The universal scope of the final plague",
    "Protestant": "The comprehensive nature of divine judgment",
    "Orthodox": "The universal scope of the final plague",
    "Jewish": "The comprehensive nature of divine judgment",
    "Mormon": "The universal scope of the final plague"
  },
  "6": {
    "Catholic": "The extraordinary nature of the final plague",
    "Protestant": "The unparalleled impact of divine judgment",
    "Orthodox": "The extraordinary nature of the final plague",
    "Jewish": "The unparalleled impact of divine judgment",
    "Mormon": "The extraordinary nature of the final plague"
  },
  "7": {
    "Catholic": "The divine distinction between the faithful and the unfaithful",
    "Protestant": "God's protection of His chosen people",
    "Orthodox": "The divine distinction between the faithful and the unfaithful",
    "Jewish": "God's protection of His chosen people",
    "Mormon": "The divine distinction between the faithful and the unfaithful"
  },
  "8": {
    "Catholic": "The submission of Egyptian authority to divine power",
    "Protestant": "The recognition of God's authority by Egyptian leaders",
    "Orthodox": "The submission of Egyptian authority to divine power",
    "Jewish": "The recognition of God's authority by Egyptian leaders",
    "Mormon": "The submission of Egyptian authority to divine power"
  },
  "9": {
    "Catholic": "God's will in manifesting His wonders in Egypt",
    "Protestant": "The divine purpose in demonstrating power through plagues",
    "Orthodox": "God's will in manifesting His wonders in Egypt",
    "Jewish": "The divine purpose in demonstrating power through plagues",
    "Mormon": "God's will in manifesting His wonders in Egypt"
  },
  "10": {
    "Catholic": "The fulfillment of divine wonders through Moses and Aaron",
    "Protestant": "The completion of God's signs through His servants",
    "Orthodox": "The fulfillment of divine wonders through Moses and Aaron",
    "Jewish": "The completion of God's signs through His servants",
    "Mormon": "The fulfillment of divine wonders through Moses and Aaron"
  }
} 