{
  "chapter": 20,
  "verses": [
    {
      "verse": 1,
      "interpretations": {
        "General": "God's introduction reflects His authority and the importance of His word.",
        "Non-Denominational": "God's introduction demonstrates His authority and the importance of His word.",
        "Baptist": "God's introduction represents His authority and the importance of biblical faith in His word.",
        "Catholic": "God's introduction reflects the Catholic understanding of His authority and the importance of His word.",
        "Methodist": "God's introduction demonstrates His authority and the need for faithful service in His word.",
        "Lutheran": "God's introduction represents His authority and the importance of biblical faith in His word.",
        "Presbyterian": "God's introduction reflects God's covenantal faithfulness and the importance of His word.",
        "Pentecostal": "God's introduction demonstrates His authority and the need for spiritual faith in His word.",
        "Anglican": "God's introduction represents His authority and the need for faithful service in His word.",
        "Orthodox": "God's introduction reflects the Orthodox understanding of His authority and the importance of His word."
      }
    },
    {
      "verse": 2,
      "interpretations": {
        "General": "God's self-identification reflects His deliverance and the importance of remembering His works.",
        "Non-Denominational": "God's self-identification demonstrates His deliverance and the importance of remembering His works.",
        "Baptist": "God's self-identification represents His deliverance and the importance of biblical faith in remembering His works.",
        "Catholic": "God's self-identification reflects the Catholic understanding of His deliverance and the importance of remembering His works.",
        "Methodist": "God's self-identification demonstrates His deliverance and the need for faithful service in remembering His works.",
        "Lutheran": "God's self-identification represents His deliverance and the importance of biblical faith in remembering His works.",
        "Presbyterian": "God's self-identification reflects God's covenantal faithfulness and the importance of remembering His works.",
        "Pentecostal": "God's self-identification demonstrates His deliverance and the need for spiritual faith in remembering His works.",
        "Anglican": "God's self-identification represents His deliverance and the need for faithful service in remembering His works.",
        "Orthodox": "God's self-identification reflects the Orthodox understanding of His deliverance and the importance of remembering His works."
      }
    },
    {
      "verse": 3,
      "interpretations": {
        "General": "The first commandment reflects God's uniqueness and the importance of exclusive worship.",
        "Non-Denominational": "The first commandment demonstrates God's uniqueness and the importance of exclusive worship.",
        "Baptist": "The first commandment represents God's uniqueness and the importance of exclusive worship.",
        "Catholic": "The first commandment reflects the Catholic understanding of God's uniqueness and the importance of exclusive worship.",
        "Methodist": "The first commandment demonstrates God's uniqueness and the importance of exclusive worship.",
        "Lutheran": "The first commandment represents God's uniqueness and the importance of exclusive worship.",
        "Presbyterian": "The first commandment reflects God's covenantal faithfulness and the importance of exclusive worship.",
        "Pentecostal": "The first commandment demonstrates God's uniqueness and the importance of exclusive worship.",
        "Anglican": "The first commandment represents God's uniqueness and the importance of exclusive worship.",
        "Orthodox": "The first commandment represents the Orthodox understanding of God's uniqueness and the importance of exclusive worship."
      }
    },
    {
      "verse": 4,
      "interpretations": {
        "General": "The second commandment reflects God's spirituality and the importance of proper worship.",
        "Non-Denominational": "The second commandment demonstrates God's spirituality and the importance of proper worship.",
        "Baptist": "The second commandment represents God's spirituality and the importance of proper worship.",
        "Catholic": "The second commandment reflects the Catholic understanding of God's spirituality and the importance of proper worship.",
        "Methodist": "The second commandment demonstrates God's spirituality and the importance of proper worship.",
        "Lutheran": "The second commandment represents God's spirituality and the importance of proper worship.",
        "Presbyterian": "The second commandment reflects God's covenantal faithfulness and the importance of proper worship.",
        "Pentecostal": "The second commandment demonstrates God's spirituality and the importance of proper worship.",
        "Anglican": "The second commandment represents God's spirituality and the importance of proper worship.",
        "Orthodox": "The second commandment represents the Orthodox understanding of God's spirituality and the importance of proper worship."
      }
    },
    {
      "verse": 5,
      "interpretations": {
        "General": "God's jealousy reflects His holiness and the importance of faithfulness.",
        "Non-Denominational": "God's jealousy demonstrates His holiness and the importance of faithfulness.",
        "Baptist": "God's jealousy represents His holiness and the importance of faithfulness.",
        "Catholic": "God's jealousy reflects the Catholic understanding of His holiness and the importance of faithfulness.",
        "Methodist": "God's jealousy demonstrates His holiness and the importance of faithfulness.",
        "Lutheran": "God's jealousy represents His holiness and the importance of faithfulness.",
        "Presbyterian": "God's jealousy reflects God's covenantal faithfulness and the importance of faithfulness.",
        "Pentecostal": "God's jealousy demonstrates His holiness and the importance of faithfulness.",
        "Anglican": "God's jealousy represents His holiness and the importance of faithfulness.",
        "Orthodox": "God's jealousy represents the Orthodox understanding of His holiness and the importance of faithfulness."
      }
    },
    {
      "verse": 6,
      "interpretations": {
        "General": "God's mercy reflects His love and the importance of obedience.",
        "Non-Denominational": "God's mercy demonstrates His love and the importance of obedience.",
        "Baptist": "God's mercy represents His love and the importance of obedience.",
        "Catholic": "God's mercy reflects the Catholic understanding of His love and the importance of obedience.",
        "Methodist": "God's mercy demonstrates His love and the importance of obedience.",
        "Lutheran": "God's mercy represents His love and the importance of obedience.",
        "Presbyterian": "God's mercy reflects God's covenantal faithfulness and the importance of obedience.",
        "Pentecostal": "God's mercy demonstrates His love and the importance of obedience.",
        "Anglican": "God's mercy represents His love and the importance of obedience.",
        "Orthodox": "God's mercy represents the Orthodox understanding of His love and the importance of obedience."
      }
    },
    {
      "verse": 7,
      "interpretations": {
        "General": "The third commandment reflects God's name and the importance of reverence.",
        "Non-Denominational": "The third commandment demonstrates God's name and the importance of reverence.",
        "Baptist": "The third commandment represents God's name and the importance of reverence.",
        "Catholic": "The third commandment reflects the Catholic understanding of God's name and the importance of reverence.",
        "Methodist": "The third commandment demonstrates God's name and the importance of reverence.",
        "Lutheran": "The third commandment represents God's name and the importance of reverence.",
        "Presbyterian": "The third commandment reflects God's covenantal faithfulness and the importance of reverence.",
        "Pentecostal": "The third commandment demonstrates God's name and the importance of reverence.",
        "Anglican": "The third commandment represents God's name and the importance of reverence.",
        "Orthodox": "The third commandment represents the Orthodox understanding of God's name and the importance of reverence."
      }
    },
    {
      "verse": 8,
      "interpretations": {
        "General": "The fourth commandment reflects God's rest and the importance of the Sabbath.",
        "Non-Denominational": "The fourth commandment demonstrates God's rest and the importance of the Sabbath.",
        "Baptist": "The fourth commandment represents God's rest and the importance of the Sabbath.",
        "Catholic": "The fourth commandment reflects the Catholic understanding of God's rest and the importance of the Sabbath.",
        "Methodist": "The fourth commandment demonstrates God's rest and the importance of the Sabbath.",
        "Lutheran": "The fourth commandment represents God's rest and the importance of the Sabbath.",
        "Presbyterian": "The fourth commandment reflects God's covenantal faithfulness and the importance of the Sabbath.",
        "Pentecostal": "The fourth commandment demonstrates God's rest and the importance of the Sabbath.",
        "Anglican": "The fourth commandment represents God's rest and the importance of the Sabbath.",
        "Orthodox": "The fourth commandment represents the Orthodox understanding of God's rest and the importance of the Sabbath."
      }
    },
    {
      "verse": 9,
      "interpretations": {
        "General": "The work days reflect God's order and the importance of labor.",
        "Non-Denominational": "The work days demonstrate God's order and the importance of labor.",
        "Baptist": "The work days represent God's order and the importance of labor.",
        "Catholic": "The work days reflect the Catholic understanding of God's order and the importance of labor.",
        "Methodist": "The work days demonstrate God's order and the importance of labor.",
        "Lutheran": "The work days represent God's order and the importance of labor.",
        "Presbyterian": "The work days reflect God's covenantal faithfulness and the importance of labor.",
        "Pentecostal": "The work days demonstrate God's order and the importance of labor.",
        "Anglican": "The work days represent God's order and the importance of labor.",
        "Orthodox": "The work days represent the Orthodox understanding of God's order and the importance of labor."
      }
    },
    {
      "verse": 10,
      "interpretations": {
        "General": "The Sabbath rest reflects God's holiness and the importance of rest.",
        "Non-Denominational": "The Sabbath rest demonstrates God's holiness and the importance of rest.",
        "Baptist": "The Sabbath rest represents God's holiness and the importance of rest.",
        "Catholic": "The Sabbath rest reflects the Catholic understanding of God's holiness and the importance of rest.",
        "Methodist": "The Sabbath rest demonstrates God's holiness and the importance of rest.",
        "Lutheran": "The Sabbath rest represents God's holiness and the importance of rest.",
        "Presbyterian": "The Sabbath rest reflects God's covenantal faithfulness and the importance of rest.",
        "Pentecostal": "The Sabbath rest demonstrates God's holiness and the importance of rest.",
        "Anglican": "The Sabbath rest represents God's holiness and the importance of rest.",
        "Orthodox": "The Sabbath rest represents the Orthodox understanding of God's holiness and the importance of rest."
      }
    },
    {
      "verse": 11,
      "interpretations": {
        "General": "The Sabbath blessing reflects God's creation and the importance of rest.",
        "Non-Denominational": "The Sabbath blessing demonstrates God's creation and the importance of rest.",
        "Baptist": "The Sabbath blessing represents God's creation and the importance of rest.",
        "Catholic": "The Sabbath blessing reflects the Catholic understanding of God's creation and the importance of rest.",
        "Methodist": "The Sabbath blessing demonstrates God's creation and the importance of rest.",
        "Lutheran": "The Sabbath blessing represents God's creation and the importance of rest.",
        "Presbyterian": "The Sabbath blessing reflects God's covenantal faithfulness and the importance of rest.",
        "Pentecostal": "The Sabbath blessing demonstrates God's creation and the importance of rest.",
        "Anglican": "The Sabbath blessing represents God's creation and the importance of rest.",
        "Orthodox": "The Sabbath blessing represents the Orthodox understanding of God's creation and the importance of rest."
      }
    },
    {
      "verse": 12,
      "interpretations": {
        "General": "The fifth commandment reflects God's order and the importance of family.",
        "Non-Denominational": "The fifth commandment demonstrates God's order and the importance of family.",
        "Baptist": "The fifth commandment represents God's order and the importance of family.",
        "Catholic": "The fifth commandment reflects the Catholic understanding of God's order and the importance of family.",
        "Methodist": "The fifth commandment demonstrates God's order and the importance of family.",
        "Lutheran": "The fifth commandment represents God's order and the importance of family.",
        "Presbyterian": "The fifth commandment reflects God's covenantal faithfulness and the importance of family.",
        "Pentecostal": "The fifth commandment demonstrates God's order and the importance of family.",
        "Anglican": "The fifth commandment represents God's order and the importance of family.",
        "Orthodox": "The fifth commandment represents the Orthodox understanding of God's order and the importance of family."
      }
    },
    {
      "verse": 13,
      "interpretations": {
        "General": "The sixth commandment reflects God's sanctity of life and the importance of respect.",
        "Non-Denominational": "The sixth commandment demonstrates God's sanctity of life and the importance of respect.",
        "Baptist": "The sixth commandment represents God's sanctity of life and the importance of respect.",
        "Catholic": "The sixth commandment reflects the Catholic understanding of God's sanctity of life and the importance of respect.",
        "Methodist": "The sixth commandment demonstrates God's sanctity of life and the importance of respect.",
        "Lutheran": "The sixth commandment represents God's sanctity of life and the importance of respect.",
        "Presbyterian": "The sixth commandment reflects God's covenantal faithfulness and the importance of respect.",
        "Pentecostal": "The sixth commandment demonstrates God's sanctity of life and the importance of respect.",
        "Anglican": "The sixth commandment represents God's sanctity of life and the importance of respect.",
        "Orthodox": "The sixth commandment represents the Orthodox understanding of God's sanctity of life and the importance of respect."
      }
    },
    {
      "verse": 14,
      "interpretations": {
        "General": "The seventh commandment reflects God's purity and the importance of faithfulness.",
        "Non-Denominational": "The seventh commandment demonstrates God's purity and the importance of faithfulness.",
        "Baptist": "The seventh commandment represents God's purity and the importance of faithfulness.",
        "Catholic": "The seventh commandment reflects the Catholic understanding of God's purity and the importance of faithfulness.",
        "Methodist": "The seventh commandment demonstrates God's purity and the importance of faithfulness.",
        "Lutheran": "The seventh commandment represents God's purity and the importance of faithfulness.",
        "Presbyterian": "The seventh commandment reflects God's covenantal faithfulness and the importance of faithfulness.",
        "Pentecostal": "The seventh commandment demonstrates God's purity and the importance of faithfulness.",
        "Anglican": "The seventh commandment represents God's purity and the importance of faithfulness.",
        "Orthodox": "The seventh commandment represents the Orthodox understanding of God's purity and the importance of faithfulness."
      }
    },
    {
      "verse": 15,
      "interpretations": {
        "General": "The eighth commandment reflects God's justice and the importance of honesty.",
        "Non-Denominational": "The eighth commandment demonstrates God's justice and the importance of honesty.",
        "Baptist": "The eighth commandment represents God's justice and the importance of honesty.",
        "Catholic": "The eighth commandment reflects the Catholic understanding of God's justice and the importance of honesty.",
        "Methodist": "The eighth commandment demonstrates God's justice and the importance of honesty.",
        "Lutheran": "The eighth commandment represents God's justice and the importance of honesty.",
        "Presbyterian": "The eighth commandment reflects God's covenantal faithfulness and the importance of honesty.",
        "Pentecostal": "The eighth commandment demonstrates God's justice and the importance of honesty.",
        "Anglican": "The eighth commandment represents God's justice and the importance of honesty.",
        "Orthodox": "The eighth commandment represents the Orthodox understanding of God's justice and the importance of honesty."
      }
    },
    {
      "verse": 16,
      "interpretations": {
        "General": "The ninth commandment reflects God's truth and the importance of honesty.",
        "Non-Denominational": "The ninth commandment demonstrates God's truth and the importance of honesty.",
        "Baptist": "The ninth commandment represents God's truth and the importance of honesty.",
        "Catholic": "The ninth commandment reflects the Catholic understanding of God's truth and the importance of honesty.",
        "Methodist": "The ninth commandment demonstrates God's truth and the importance of honesty.",
        "Lutheran": "The ninth commandment represents God's truth and the importance of honesty.",
        "Presbyterian": "The ninth commandment reflects God's covenantal faithfulness and the importance of honesty.",
        "Pentecostal": "The ninth commandment demonstrates God's truth and the importance of honesty.",
        "Anglican": "The ninth commandment represents God's truth and the importance of honesty.",
        "Orthodox": "The ninth commandment represents the Orthodox understanding of God's truth and the importance of honesty."
      }
    },
    {
      "verse": 17,
      "interpretations": {
        "General": "The tenth commandment reflects God's contentment and the importance of satisfaction.",
        "Non-Denominational": "The tenth commandment demonstrates God's contentment and the importance of satisfaction.",
        "Baptist": "The tenth commandment represents God's contentment and the importance of satisfaction.",
        "Catholic": "The tenth commandment reflects the Catholic understanding of God's contentment and the importance of satisfaction.",
        "Methodist": "The tenth commandment demonstrates God's contentment and the importance of satisfaction.",
        "Lutheran": "The tenth commandment represents God's contentment and the importance of satisfaction.",
        "Presbyterian": "The tenth commandment reflects God's covenantal faithfulness and the importance of satisfaction.",
        "Pentecostal": "The tenth commandment demonstrates God's contentment and the importance of satisfaction.",
        "Anglican": "The tenth commandment represents God's contentment and the importance of satisfaction.",
        "Orthodox": "The tenth commandment represents the Orthodox understanding of God's contentment and the importance of satisfaction."
      }
    },
    {
      "verse": 18,
      "interpretations": {
        "General": "The people's fear reflects God's power and the importance of reverence.",
        "Non-Denominational": "The people's fear demonstrates God's power and the importance of reverence.",
        "Baptist": "The people's fear represents God's power and the importance of reverence.",
        "Catholic": "The people's fear reflects the Catholic understanding of God's power and the importance of reverence.",
        "Methodist": "The people's fear demonstrates God's power and the importance of reverence.",
        "Lutheran": "The people's fear represents God's power and the importance of reverence.",
        "Presbyterian": "The people's fear reflects God's covenantal faithfulness and the importance of reverence.",
        "Pentecostal": "The people's fear demonstrates God's power and the importance of reverence.",
        "Anglican": "The people's fear represents God's power and the importance of reverence.",
        "Orthodox": "The people's fear represents the Orthodox understanding of God's power and the importance of reverence."
      }
    },
    {
      "verse": 19,
      "interpretations": {
        "General": "The people's request reflects God's holiness and the importance of mediation.",
        "Non-Denominational": "The people's request demonstrates God's holiness and the importance of mediation.",
        "Baptist": "The people's request represents God's holiness and the importance of mediation.",
        "Catholic": "The people's request reflects the Catholic understanding of God's holiness and the importance of mediation.",
        "Methodist": "The people's request demonstrates God's holiness and the importance of mediation.",
        "Lutheran": "The people's request represents God's holiness and the importance of mediation.",
        "Presbyterian": "The people's request reflects God's covenantal faithfulness and the importance of mediation.",
        "Pentecostal": "The people's request demonstrates God's holiness and the importance of mediation.",
        "Anglican": "The people's request represents God's holiness and the importance of mediation.",
        "Orthodox": "The people's request represents the Orthodox understanding of God's holiness and the importance of mediation."
      }
    },
    {
      "verse": 20,
      "interpretations": {
        "General": "Moses' response reflects God's testing and the importance of fear.",
        "Non-Denominational": "Moses' response demonstrates God's testing and the importance of fear.",
        "Baptist": "Moses' response represents God's testing and the importance of fear.",
        "Catholic": "Moses' response reflects the Catholic understanding of God's testing and the importance of fear.",
        "Methodist": "Moses' response demonstrates God's testing and the importance of fear.",
        "Lutheran": "Moses' response represents God's testing and the importance of fear.",
        "Presbyterian": "Moses' response reflects God's covenantal faithfulness and the importance of fear.",
        "Pentecostal": "Moses' response demonstrates God's testing and the importance of fear.",
        "Anglican": "Moses' response represents God's testing and the importance of fear.",
        "Orthodox": "Moses' response represents the Orthodox understanding of God's testing and the importance of fear."
      }
    },
    {
      "verse": 21,
      "interpretations": {
        "General": "The people's distance reflects God's holiness and the importance of respect.",
        "Non-Denominational": "The people's distance demonstrates God's holiness and the importance of respect.",
        "Baptist": "The people's distance represents God's holiness and the importance of respect.",
        "Catholic": "The people's distance reflects the Catholic understanding of God's holiness and the importance of respect.",
        "Methodist": "The people's distance demonstrates God's holiness and the importance of respect.",
        "Lutheran": "The people's distance represents God's holiness and the importance of respect.",
        "Presbyterian": "The people's distance reflects God's covenantal faithfulness and the importance of respect.",
        "Pentecostal": "The people's distance demonstrates God's holiness and the importance of respect.",
        "Anglican": "The people's distance represents God's holiness and the importance of respect.",
        "Orthodox": "The people's distance represents the Orthodox understanding of God's holiness and the importance of respect."
      }
    },
    {
      "verse": 22,
      "interpretations": {
        "General": "God's instruction reflects His authority and the importance of obedience.",
        "Non-Denominational": "God's instruction demonstrates His authority and the importance of obedience.",
        "Baptist": "God's instruction represents His authority and the importance of obedience.",
        "Catholic": "God's instruction reflects the Catholic understanding of His authority and the importance of obedience.",
        "Methodist": "God's instruction demonstrates His authority and the importance of obedience.",
        "Lutheran": "God's instruction represents His authority and the importance of obedience.",
        "Presbyterian": "God's instruction reflects God's covenantal faithfulness and the importance of obedience.",
        "Pentecostal": "God's instruction demonstrates His authority and the importance of obedience.",
        "Anglican": "God's instruction represents His authority and the importance of obedience.",
        "Orthodox": "God's instruction reflects the Orthodox understanding of His authority and the importance of obedience."
      }
    },
    {
      "verse": 23,
      "interpretations": {
        "General": "God's warning reflects His uniqueness and the importance of proper worship.",
        "Non-Denominational": "God's warning demonstrates His uniqueness and the importance of proper worship.",
        "Baptist": "God's warning represents His uniqueness and the importance of proper worship.",
        "Catholic": "God's warning reflects the Catholic understanding of His uniqueness and the importance of proper worship.",
        "Methodist": "God's warning demonstrates His uniqueness and the importance of proper worship.",
        "Lutheran": "God's warning represents His uniqueness and the importance of proper worship.",
        "Presbyterian": "God's warning reflects God's covenantal faithfulness and the importance of proper worship.",
        "Pentecostal": "God's warning demonstrates His uniqueness and the importance of proper worship.",
        "Anglican": "God's warning represents His uniqueness and the importance of proper worship.",
        "Orthodox": "God's warning reflects the Orthodox understanding of His uniqueness and the importance of proper worship."
      }
    },
    {
      "verse": 24,
      "interpretations": {
        "General": "God's altar reflects His presence and the importance of worship.",
        "Non-Denominational": "God's altar demonstrates His presence and the importance of worship.",
        "Baptist": "God's altar represents His presence and the importance of worship.",
        "Catholic": "God's altar reflects the Catholic understanding of His presence and the importance of worship.",
        "Methodist": "God's altar demonstrates His presence and the importance of worship.",
        "Lutheran": "God's altar represents His presence and the importance of worship.",
        "Presbyterian": "God's altar reflects God's covenantal faithfulness and the importance of worship.",
        "Pentecostal": "God's altar demonstrates His presence and the importance of worship.",
        "Anglican": "God's altar represents His presence and the importance of worship.",
        "Orthodox": "God's altar reflects the Orthodox understanding of His presence and the importance of worship."
      }
    },
    {
      "verse": 25,
      "interpretations": {
        "General": "God's instruction about the altar reflects His simplicity and the importance of purity.",
        "Non-Denominational": "God's instruction about the altar demonstrates His simplicity and the importance of purity.",
        "Baptist": "God's instruction about the altar represents His simplicity and the importance of purity.",
        "Catholic": "God's instruction about the altar reflects the Catholic understanding of His simplicity and the importance of purity.",
        "Methodist": "God's instruction about the altar demonstrates His simplicity and the importance of purity.",
        "Lutheran": "God's instruction about the altar represents His simplicity and the importance of purity.",
        "Presbyterian": "God's instruction about the altar reflects God's covenantal faithfulness and the importance of purity.",
        "Pentecostal": "God's instruction about the altar demonstrates His simplicity and the importance of purity.",
        "Anglican": "God's instruction about the altar represents His simplicity and the importance of purity.",
        "Orthodox": "God's instruction about the altar reflects the Orthodox understanding of His simplicity and the importance of purity."
      }
    },
    {
      "verse": 26,
      "interpretations": {
        "General": "God's warning about steps reflects His holiness and the importance of modesty.",
        "Non-Denominational": "God's warning about steps demonstrates His holiness and the importance of modesty.",
        "Baptist": "God's warning about steps represents His holiness and the importance of modesty.",
        "Catholic": "God's warning about steps reflects the Catholic understanding of His holiness and the importance of modesty.",
        "Methodist": "God's warning about steps demonstrates His holiness and the importance of modesty.",
        "Lutheran": "God's warning about steps represents His holiness and the importance of modesty.",
        "Presbyterian": "God's warning about steps reflects God's covenantal faithfulness and the importance of modesty.",
        "Pentecostal": "God's warning about steps demonstrates His holiness and the importance of modesty.",
        "Anglican": "God's warning about steps represents His holiness and the importance of modesty.",
        "Orthodox": "God's warning about steps reflects the Orthodox understanding of His holiness and the importance of modesty."
      }
    }
  ]
} 