{
  "chapter": 22,
  "verses": [
    {
      "verse": 1,
      "interpretations": {
        "Catholic": "The theft law reflects the Catholic understanding of God's justice and the importance of property rights.",
        "Protestant": "The theft law demonstrates God's justice and the importance of property rights.",
        "Orthodox": "The theft law represents the Orthodox understanding of God's justice and the importance of property rights.",
        "Jewish": "The theft law establishes God's justice and the importance of property rights.",
        "Mormon": "The theft law teaches that God is just and the importance of property rights."
      }
    },
    {
      "verse": 2,
      "interpretations": {
        "Catholic": "The night theft law reflects the Catholic understanding of God's protection and the importance of self-defense.",
        "Protestant": "The night theft law demonstrates God's protection and the importance of self-defense.",
        "Orthodox": "The night theft law represents the Orthodox understanding of God's protection and the importance of self-defense.",
        "Jewish": "The night theft law establishes God's protection and the importance of self-defense.",
        "Mormon": "The night theft law teaches that God protects and the importance of self-defense."
      }
    },
    {
      "verse": 3,
      "interpretations": {
        "Catholic": "The daylight theft law reflects the Catholic understanding of God's mercy and the importance of restitution.",
        "Protestant": "The daylight theft law demonstrates God's mercy and the importance of restitution.",
        "Orthodox": "The daylight theft law represents the Orthodox understanding of God's mercy and the importance of restitution.",
        "Jewish": "The daylight theft law establishes God's mercy and the importance of restitution.",
        "Mormon": "The daylight theft law teaches that God is merciful and the importance of restitution."
      }
    },
    {
      "verse": 4,
      "interpretations": {
        "Catholic": "The animal theft law reflects the Catholic understanding of God's justice and the importance of fair compensation.",
        "Protestant": "The animal theft law demonstrates God's justice and the importance of fair compensation.",
        "Orthodox": "The animal theft law represents the Orthodox understanding of God's justice and the importance of fair compensation.",
        "Jewish": "The animal theft law establishes God's justice and the importance of fair compensation.",
        "Mormon": "The animal theft law teaches that God is just and the importance of fair compensation."
      }
    },
    {
      "verse": 5,
      "interpretations": {
        "Catholic": "The grazing damage law reflects the Catholic understanding of God's justice and the importance of responsibility.",
        "Protestant": "The grazing damage law demonstrates God's justice and the importance of responsibility.",
        "Orthodox": "The grazing damage law represents the Orthodox understanding of God's justice and the importance of responsibility.",
        "Jewish": "The grazing damage law establishes God's justice and the importance of responsibility.",
        "Mormon": "The grazing damage law teaches that God is just and the importance of responsibility."
      }
    },
    {
      "verse": 6,
      "interpretations": {
        "Catholic": "The fire damage law reflects the Catholic understanding of God's justice and the importance of accountability.",
        "Protestant": "The fire damage law demonstrates God's justice and the importance of accountability.",
        "Orthodox": "The fire damage law represents the Orthodox understanding of God's justice and the importance of accountability.",
        "Jewish": "The fire damage law establishes God's justice and the importance of accountability.",
        "Mormon": "The fire damage law teaches that God is just and the importance of accountability."
      }
    },
    {
      "verse": 7,
      "interpretations": {
        "Catholic": "The safekeeping law reflects the Catholic understanding of God's justice and the importance of trust.",
        "Protestant": "The safekeeping law demonstrates God's justice and the importance of trust.",
        "Orthodox": "The safekeeping law represents the Orthodox understanding of God's justice and the importance of trust.",
        "Jewish": "The safekeeping law establishes God's justice and the importance of trust.",
        "Mormon": "The safekeeping law teaches that God is just and the importance of trust."
      }
    },
    {
      "verse": 8,
      "interpretations": {
        "Catholic": "The oath law reflects the Catholic understanding of God's holiness and the importance of truth.",
        "Protestant": "The oath law demonstrates God's holiness and the importance of truth.",
        "Orthodox": "The oath law represents the Orthodox understanding of God's holiness and the importance of truth.",
        "Jewish": "The oath law establishes God's holiness and the importance of truth.",
        "Mormon": "The oath law teaches that God is holy and the importance of truth."
      }
    },
    {
      "verse": 9,
      "interpretations": {
        "Catholic": "The disputed property law reflects the Catholic understanding of God's justice and the importance of fair judgment.",
        "Protestant": "The disputed property law demonstrates God's justice and the importance of fair judgment.",
        "Orthodox": "The disputed property law represents the Orthodox understanding of God's justice and the importance of fair judgment.",
        "Jewish": "The disputed property law establishes God's justice and the importance of fair judgment.",
        "Mormon": "The disputed property law teaches that God is just and the importance of fair judgment."
      }
    },
    {
      "verse": 10,
      "interpretations": {
        "Catholic": "The animal care law reflects the Catholic understanding of God's mercy and the importance of stewardship.",
        "Protestant": "The animal care law demonstrates God's mercy and the importance of stewardship.",
        "Orthodox": "The animal care law represents the Orthodox understanding of God's mercy and the importance of stewardship.",
        "Jewish": "The animal care law establishes God's mercy and the importance of stewardship.",
        "Mormon": "The animal care law teaches that God is merciful and the importance of stewardship."
      }
    },
    {
      "verse": 11,
      "interpretations": {
        "Catholic": "The oath of innocence law reflects the Catholic understanding of God's justice and the importance of honesty.",
        "Protestant": "The oath of innocence law demonstrates God's justice and the importance of honesty.",
        "Orthodox": "The oath of innocence law represents the Orthodox understanding of God's justice and the importance of honesty.",
        "Jewish": "The oath of innocence law establishes God's justice and the importance of honesty.",
        "Mormon": "The oath of innocence law teaches that God is just and the importance of honesty."
      }
    },
    {
      "verse": 12,
      "interpretations": {
        "Catholic": "The borrowed animal law reflects the Catholic understanding of God's justice and the importance of responsibility.",
        "Protestant": "The borrowed animal law demonstrates God's justice and the importance of responsibility.",
        "Orthodox": "The borrowed animal law represents the Orthodox understanding of God's justice and the importance of responsibility.",
        "Jewish": "The borrowed animal law establishes God's justice and the importance of responsibility.",
        "Mormon": "The borrowed animal law teaches that God is just and the importance of responsibility."
      }
    },
    {
      "verse": 13,
      "interpretations": {
        "Catholic": "The marriage law reflects the Catholic understanding of God's order and the importance of family.",
        "Protestant": "The marriage law demonstrates God's order and the importance of family.",
        "Orthodox": "The marriage law represents the Orthodox understanding of God's order and the importance of family.",
        "Jewish": "The marriage law establishes God's order and the importance of family.",
        "Mormon": "The marriage law teaches that God is orderly and the importance of family."
      }
    },
    {
      "verse": 14,
      "interpretations": {
        "Catholic": "The seduction law reflects the Catholic understanding of God's justice and the importance of purity.",
        "Protestant": "The seduction law demonstrates God's justice and the importance of purity.",
        "Orthodox": "The seduction law represents the Orthodox understanding of God's justice and the importance of purity.",
        "Jewish": "The seduction law establishes God's justice and the importance of purity.",
        "Mormon": "The seduction law teaches that God is just and the importance of purity."
      }
    },
    {
      "verse": 15,
      "interpretations": {
        "Catholic": "The marriage payment law reflects the Catholic understanding of God's justice and the importance of commitment.",
        "Protestant": "The marriage payment law demonstrates God's justice and the importance of commitment.",
        "Orthodox": "The marriage payment law represents the Orthodox understanding of God's justice and the importance of commitment.",
        "Jewish": "The marriage payment law establishes God's justice and the importance of commitment.",
        "Mormon": "The marriage payment law teaches that God is just and the importance of commitment."
      }
    },
    {
      "verse": 16,
      "interpretations": {
        "Catholic": "The sorcery law reflects the Catholic understanding of God's holiness and the importance of worship.",
        "Protestant": "The sorcery law demonstrates God's holiness and the importance of worship.",
        "Orthodox": "The sorcery law represents the Orthodox understanding of God's holiness and the importance of worship.",
        "Jewish": "The sorcery law establishes God's holiness and the importance of worship.",
        "Mormon": "The sorcery law teaches that God is holy and the importance of worship."
      }
    },
    {
      "verse": 17,
      "interpretations": {
        "Catholic": "The bestiality law reflects the Catholic understanding of God's holiness and the importance of purity.",
        "Protestant": "The bestiality law demonstrates God's holiness and the importance of purity.",
        "Orthodox": "The bestiality law represents the Orthodox understanding of God's holiness and the importance of purity.",
        "Jewish": "The bestiality law establishes God's holiness and the importance of purity.",
        "Mormon": "The bestiality law teaches that God is holy and the importance of purity."
      }
    },
    {
      "verse": 18,
      "interpretations": {
        "Catholic": "The idolatry law reflects the Catholic understanding of God's uniqueness and the importance of worship.",
        "Protestant": "The idolatry law demonstrates God's uniqueness and the importance of worship.",
        "Orthodox": "The idolatry law represents the Orthodox understanding of God's uniqueness and the importance of worship.",
        "Jewish": "The idolatry law establishes God's uniqueness and the importance of worship.",
        "Mormon": "The idolatry law teaches that God is unique and the importance of worship."
      }
    },
    {
      "verse": 19,
      "interpretations": {
        "Catholic": "The stranger law reflects the Catholic understanding of God's love and the importance of hospitality.",
        "Protestant": "The stranger law demonstrates God's love and the importance of hospitality.",
        "Orthodox": "The stranger law represents the Orthodox understanding of God's love and the importance of hospitality.",
        "Jewish": "The stranger law establishes God's love and the importance of hospitality.",
        "Mormon": "The stranger law teaches that God is loving and the importance of hospitality."
      }
    },
    {
      "verse": 20,
      "interpretations": {
        "Catholic": "The widow and orphan law reflects the Catholic understanding of God's compassion and the importance of care.",
        "Protestant": "The widow and orphan law demonstrates God's compassion and the importance of care.",
        "Orthodox": "The widow and orphan law represents the Orthodox understanding of God's compassion and the importance of care.",
        "Jewish": "The widow and orphan law establishes God's compassion and the importance of care.",
        "Mormon": "The widow and orphan law teaches that God is compassionate and the importance of care."
      }
    },
    {
      "verse": 21,
      "interpretations": {
        "Catholic": "The loan law reflects the Catholic understanding of God's mercy and the importance of generosity.",
        "Protestant": "The loan law demonstrates God's mercy and the importance of generosity.",
        "Orthodox": "The loan law represents the Orthodox understanding of God's mercy and the importance of generosity.",
        "Jewish": "The loan law establishes God's mercy and the importance of generosity.",
        "Mormon": "The loan law teaches that God is merciful and the importance of generosity."
      }
    },
    {
      "verse": 22,
      "interpretations": {
        "Catholic": "The pledge law reflects the Catholic understanding of God's justice and the importance of dignity.",
        "Protestant": "The pledge law demonstrates God's justice and the importance of dignity.",
        "Orthodox": "The pledge law represents the Orthodox understanding of God's justice and the importance of dignity.",
        "Jewish": "The pledge law establishes God's justice and the importance of dignity.",
        "Mormon": "The pledge law teaches that God is just and the importance of dignity."
      }
    },
    {
      "verse": 23,
      "interpretations": {
        "Catholic": "The garment law reflects the Catholic understanding of God's mercy and the importance of basic needs.",
        "Protestant": "The garment law demonstrates God's mercy and the importance of basic needs.",
        "Orthodox": "The garment law represents the Orthodox understanding of God's mercy and the importance of basic needs.",
        "Jewish": "The garment law establishes God's mercy and the importance of basic needs.",
        "Mormon": "The garment law teaches that God is merciful and the importance of basic needs."
      }
    },
    {
      "verse": 24,
      "interpretations": {
        "Catholic": "The blessing law reflects the Catholic understanding of God's goodness and the importance of obedience.",
        "Protestant": "The blessing law demonstrates God's goodness and the importance of obedience.",
        "Orthodox": "The blessing law represents the Orthodox understanding of God's goodness and the importance of obedience.",
        "Jewish": "The blessing law establishes God's goodness and the importance of obedience.",
        "Mormon": "The blessing law teaches that God is good and the importance of obedience."
      }
    },
    {
      "verse": 25,
      "interpretations": {
        "Catholic": "The ruler law reflects the Catholic understanding of God's authority and the importance of respect.",
        "Protestant": "The ruler law demonstrates God's authority and the importance of respect.",
        "Orthodox": "The ruler law represents the Orthodox understanding of God's authority and the importance of respect.",
        "Jewish": "The ruler law establishes God's authority and the importance of respect.",
        "Mormon": "The ruler law teaches that God has authority and the importance of respect."
      }
    },
    {
      "verse": 26,
      "interpretations": {
        "Catholic": "The firstfruits law reflects the Catholic understanding of God's provision and the importance of gratitude.",
        "Protestant": "The firstfruits law demonstrates God's provision and the importance of gratitude.",
        "Orthodox": "The firstfruits law represents the Orthodox understanding of God's provision and the importance of gratitude.",
        "Jewish": "The firstfruits law establishes God's provision and the importance of gratitude.",
        "Mormon": "The firstfruits law teaches that God provides and the importance of gratitude."
      }
    },
    {
      "verse": 27,
      "interpretations": {
        "Catholic": "The clean meat law reflects the Catholic understanding of God's holiness and the importance of purity.",
        "Protestant": "The clean meat law demonstrates God's holiness and the importance of purity.",
        "Orthodox": "The clean meat law represents the Orthodox understanding of God's holiness and the importance of purity.",
        "Jewish": "The clean meat law establishes God's holiness and the importance of purity.",
        "Mormon": "The clean meat law teaches that God is holy and the importance of purity."
      }
    },
    {
      "verse": 28,
      "interpretations": {
        "Catholic": "The holy men law reflects the Catholic understanding of God's holiness and the importance of respect.",
        "Protestant": "The holy men law demonstrates God's holiness and the importance of respect.",
        "Orthodox": "The holy men law represents the Orthodox understanding of God's holiness and the importance of respect.",
        "Jewish": "The holy men law establishes God's holiness and the importance of respect.",
        "Mormon": "The holy men law teaches that God is holy and the importance of respect."
      }
    },
    {
      "verse": 29,
      "interpretations": {
        "Catholic": "The offering law reflects the Catholic understanding of God's holiness and the importance of worship.",
        "Protestant": "The offering law demonstrates God's holiness and the importance of worship.",
        "Orthodox": "The offering law represents the Orthodox understanding of God's holiness and the importance of worship.",
        "Jewish": "The offering law establishes God's holiness and the importance of worship.",
        "Mormon": "The offering law teaches that God is holy and the importance of worship."
      }
    },
    {
      "verse": 30,
      "interpretations": {
        "Catholic": "The consecration law reflects the Catholic understanding of God's holiness and the importance of dedication.",
        "Protestant": "The consecration law demonstrates God's holiness and the importance of dedication.",
        "Orthodox": "The consecration law represents the Orthodox understanding of God's holiness and the importance of dedication.",
        "Jewish": "The consecration law establishes God's holiness and the importance of dedication.",
        "Mormon": "The consecration law teaches that God is holy and the importance of dedication."
      }
    },
    {
      "verse": 31,
      "interpretations": {
        "Catholic": "The clean food law reflects the Catholic understanding of God's holiness and the importance of purity.",
        "Protestant": "The clean food law demonstrates God's holiness and the importance of purity.",
        "Orthodox": "The clean food law represents the Orthodox understanding of God's holiness and the importance of purity.",
        "Jewish": "The clean food law establishes God's holiness and the importance of purity.",
        "Mormon": "The clean food law teaches that God is holy and the importance of purity."
      }
    }
  ]
} 