{
  "chapterSummary": {
    "General": "Exodus 27 describes God's instructions for building the altar of burnt offering and the courtyard. The chapter emphasizes God's holiness, sacrifice, and the importance of worship in the covenant relationship.",
    "Non-Denominational": "Exodus 27 presents God's instructions for building the altar of burnt offering and the courtyard. This demonstrates God's holiness, sacrifice, and the importance of worship in the covenant relationship.",
    "Baptist": "Exodus 27 recounts God's instructions for building the altar of burnt offering and the courtyard. This reveals God's holiness, sacrifice, and the importance of biblical faith in worship.",
    "Catholic": "Exodus 27 contains God's instructions for building the altar of burnt offering and the courtyard. The Catholic interpretation emphasizes God's holiness, sacrifice, and the importance of worship in the covenant relationship.",
    "Methodist": "Exodus 27 presents God's instructions for building the altar of burnt offering and the courtyard. This shows God's holiness, sacrifice, and the importance of faithful service in worship.",
    "Lutheran": "Exodus 27 recounts God's instructions for building the altar of burnt offering and the courtyard. This reveals God's holiness, sacrifice, and the importance of biblical faith in worship.",
    "Presbyterian": "Exodus 27 contains God's instructions for building the altar of burnt offering and the courtyard. This establishes God's covenantal faithfulness, sacrifice, and the importance of worship.",
    "Pentecostal": "Exodus 27 presents God's instructions for building the altar of burnt offering and the courtyard. This teaches about God's holiness, sacrifice, and the importance of spiritual faith in worship.",
    "Anglican": "Exodus 27 recounts God's instructions for building the altar of burnt offering and the courtyard. This demonstrates God's holiness, sacrifice, and the importance of faithful service in worship.",
    "Orthodox": "Exodus 27 contains God's instructions for building the altar of burnt offering and the courtyard. The Orthodox Church interprets this as showing God's holiness, sacrifice, and the importance of worship in the covenant relationship."
  },
  "1": {
    "General": "The altar command reflects God's sacrifice and the importance of atonement.",
    "Non-Denominational": "The altar command demonstrates God's sacrifice and the importance of atonement.",
    "Baptist": "The altar command represents God's sacrifice and the importance of biblical faith in atonement.",
        "Catholic": "The altar command reflects the Catholic understanding of God's sacrifice and the importance of atonement.",
    "Methodist": "The altar command demonstrates God's sacrifice and the need for faithful service in atonement.",
    "Lutheran": "The altar command represents God's sacrifice and the importance of biblical faith in atonement.",
    "Presbyterian": "The altar command reflects God's covenantal faithfulness and the importance of atonement.",
    "Pentecostal": "The altar command demonstrates God's sacrifice and the need for spiritual faith in atonement.",
    "Anglican": "The altar command represents God's sacrifice and the need for faithful service in atonement.",
    "Orthodox": "The altar command reflects the Orthodox understanding of God's sacrifice and the importance of atonement."
  },
  "2": {
    "General": "The horns reflect God's power and the importance of refuge.",
    "Non-Denominational": "The horns demonstrate God's power and the importance of refuge.",
    "Baptist": "The horns represent God's power and the importance of biblical faith in refuge.",
        "Catholic": "The horns reflect the Catholic understanding of God's power and the importance of refuge.",
    "Methodist": "The horns demonstrate God's power and the need for faithful service in refuge.",
    "Lutheran": "The horns represent God's power and the importance of biblical faith in refuge.",
    "Presbyterian": "The horns reflect God's covenantal faithfulness and the importance of refuge.",
    "Pentecostal": "The horns demonstrate God's power and the need for spiritual faith in refuge.",
    "Anglican": "The horns represent God's power and the need for faithful service in refuge.",
    "Orthodox": "The horns reflect the Orthodox understanding of God's power and the importance of refuge."
  },
  "3": {
    "General": "The utensils reflect God's service and the importance of preparation.",
    "Non-Denominational": "The utensils demonstrate God's service and the importance of preparation.",
    "Baptist": "The utensils represent God's service and the importance of biblical faith in preparation.",
    "Catholic": "The utensils reflect the Catholic understanding of God's service and the importance of preparation.",
    "Methodist": "The utensils demonstrate God's service and the need for faithful service in preparation.",
    "Lutheran": "The utensils represent God's service and the importance of biblical faith in preparation.",
    "Presbyterian": "The utensils reflect God's covenantal faithfulness and the importance of preparation.",
    "Pentecostal": "The utensils demonstrate God's service and the need for spiritual faith in preparation.",
    "Anglican": "The utensils represent God's service and the need for faithful service in preparation.",
    "Orthodox": "The utensils reflect the Orthodox understanding of God's service and the importance of preparation."
  },
  "4": {
    "General": "The grating reflects God's separation and the importance of holiness.",
    "Non-Denominational": "The grating demonstrates God's separation and the importance of holiness.",
    "Baptist": "The grating represents God's separation and the importance of biblical faith in holiness.",
    "Catholic": "The grating reflect the Catholic understanding of God's separation and the importance of holiness.",
    "Methodist": "The grating demonstrate God's separation and the need for faithful service in holiness.",
    "Lutheran": "The grating represent God's separation and the importance of biblical faith in holiness.",
    "Presbyterian": "The grating reflect God's covenantal faithfulness and the importance of holiness.",
    "Pentecostal": "The grating demonstrate God's separation and the need for spiritual faith in holiness.",
    "Anglican": "The grating represent God's separation and the need for faithful service in holiness.",
    "Orthodox": "The grating reflect the Orthodox understanding of God's separation and the importance of holiness."
  },
  "5": {
    "General": "The grating placement reflects God's order and the importance of arrangement.",
    "Non-Denominational": "The grating placement demonstrates God's order and the importance of arrangement.",
    "Baptist": "The grating placement represents God's order and the importance of biblical faith in arrangement.",
    "Catholic": "The grating placement reflect the Catholic understanding of God's order and the importance of arrangement.",
    "Methodist": "The grating placement demonstrate God's order and the need for faithful service in arrangement.",
    "Lutheran": "The grating placement represent God's order and the importance of biblical faith in arrangement.",
    "Presbyterian": "The grating placement reflect God's covenantal faithfulness and the importance of arrangement.",
    "Pentecostal": "The grating placement demonstrate God's order and the need for spiritual faith in arrangement.",
    "Anglican": "The grating placement represent God's order and the need for faithful service in arrangement.",
    "Orthodox": "The grating placement reflect the Orthodox understanding of God's order and the importance of arrangement."
  },
  "6": {
    "General": "The poles reflect God's mobility and the importance of transport.",
    "Non-Denominational": "The poles demonstrate God's mobility and the importance of transport.",
    "Baptist": "The poles represent God's mobility and the importance of biblical faith in transport.",
    "Catholic": "The poles reflect the Catholic understanding of God's mobility and the importance of transport.",
    "Methodist": "The poles demonstrate God's mobility and the need for faithful service in transport.",
    "Lutheran": "The poles represent God's mobility and the importance of biblical faith in transport.",
    "Presbyterian": "The poles reflect God's covenantal faithfulness and the importance of transport.",
    "Pentecostal": "The poles demonstrate God's mobility and the need for spiritual faith in transport.",
    "Anglican": "The poles represent God's mobility and the need for faithful service in transport.",
    "Orthodox": "The poles reflect the Orthodox understanding of God's mobility and the importance of transport."
  },
  "7": {
    "General": "The pole placement reflects God's order and the importance of arrangement.",
    "Non-Denominational": "The pole placement demonstrates God's order and the importance of arrangement.",
    "Baptist": "The pole placement represents God's order and the importance of biblical faith in arrangement.",
    "Catholic": "The pole placement reflect the Catholic understanding of God's order and the importance of arrangement.",
    "Methodist": "The pole placement demonstrate God's order and the need for faithful service in arrangement.",
    "Lutheran": "The pole placement represent God's order and the importance of biblical faith in arrangement.",
    "Presbyterian": "The pole placement reflect God's covenantal faithfulness and the importance of arrangement.",
    "Pentecostal": "The pole placement demonstrate God's order and the need for spiritual faith in arrangement.",
    "Anglican": "The pole placement represent God's order and the need for faithful service in arrangement.",
    "Orthodox": "The pole placement reflect the Orthodox understanding of God's order and the importance of arrangement."
  },
  "8": {
    "General": "The hollow construction reflects God's wisdom and the importance of design.",
    "Non-Denominational": "The hollow construction demonstrates God's wisdom and the importance of design.",
    "Baptist": "The hollow construction represents God's wisdom and the importance of biblical faith in design.",
    "Catholic": "The hollow construction reflect the Catholic understanding of God's wisdom and the importance of design.",
    "Methodist": "The hollow construction demonstrate God's wisdom and the need for faithful service in design.",
    "Lutheran": "The hollow construction represent God's wisdom and the importance of biblical faith in design.",
    "Presbyterian": "The hollow construction reflect God's covenantal faithfulness and the importance of design.",
    "Pentecostal": "The hollow construction demonstrate God's wisdom and the need for spiritual faith in design.",
    "Anglican": "The hollow construction represent God's wisdom and the need for faithful service in design.",
    "Orthodox": "The hollow construction reflect the Orthodox understanding of God's wisdom and the importance of design."
  },
  "9": {
    "General": "The courtyard reflects God's separation and the importance of holiness.",
    "Non-Denominational": "The courtyard demonstrates God's separation and the importance of holiness.",
    "Baptist": "The courtyard represents God's separation and the importance of biblical faith in holiness.",
    "Catholic": "The courtyard reflect the Catholic understanding of God's separation and the importance of holiness.",
    "Methodist": "The courtyard demonstrate God's separation and the need for faithful service in holiness.",
    "Lutheran": "The courtyard represent God's separation and the importance of biblical faith in holiness.",
    "Presbyterian": "The courtyard reflect God's covenantal faithfulness and the importance of holiness.",
    "Pentecostal": "The courtyard demonstrate God's separation and the need for spiritual faith in holiness.",
    "Anglican": "The courtyard represent God's separation and the need for faithful service in holiness.",
    "Orthodox": "The courtyard reflect the Orthodox understanding of God's separation and the importance of holiness."
  },
  "10": {
    "General": "The pillars reflect God's support and the importance of structure.",
    "Non-Denominational": "The pillars demonstrate God's support and the importance of structure.",
    "Baptist": "The pillars represent God's support and the importance of biblical faith in structure.",
        "Catholic": "The pillars reflect the Catholic understanding of God's support and the importance of structure.",
    "Methodist": "The pillars demonstrate God's support and the need for faithful service in structure.",
    "Lutheran": "The pillars represent God's support and the importance of biblical faith in structure.",
    "Presbyterian": "The pillars reflect God's covenantal faithfulness and the importance of structure.",
    "Pentecostal": "The pillars demonstrate God's support and the need for spiritual faith in structure.",
    "Anglican": "The pillars represent God's support and the need for faithful service in structure.",
    "Orthodox": "The pillars reflect the Orthodox understanding of God's support and the importance of structure."
  },
  "11": {
    "General": "The hooks reflect God's connection and the importance of attachment.",
    "Non-Denominational": "The hooks demonstrate God's connection and the importance of attachment.",
    "Baptist": "The hooks represent God's connection and the importance of biblical faith in attachment.",
    "Catholic": "The hooks reflect the Catholic understanding of God's connection and the importance of attachment.",
    "Methodist": "The hooks demonstrate God's connection and the need for faithful service in attachment.",
    "Lutheran": "The hooks represent God's connection and the importance of biblical faith in attachment.",
    "Presbyterian": "The hooks reflect God's covenantal faithfulness and the importance of attachment.",
    "Pentecostal": "The hooks demonstrate God's connection and the need for spiritual faith in attachment.",
    "Anglican": "The hooks represent God's connection and the need for faithful service in attachment.",
    "Orthodox": "The hooks reflect the Orthodox understanding of God's connection and the importance of attachment."
  },
  "12": {
    "General": "The width reflects God's sufficiency and the importance of space.",
    "Non-Denominational": "The width demonstrates God's sufficiency and the importance of space.",
    "Baptist": "The width represents God's sufficiency and the importance of biblical faith in space.",
    "Catholic": "The width reflect the Catholic understanding of God's sufficiency and the importance of space.",
    "Methodist": "The width demonstrate God's sufficiency and the need for faithful service in space.",
    "Lutheran": "The width represent God's sufficiency and the importance of biblical faith in space.",
    "Presbyterian": "The width reflect God's covenantal faithfulness and the importance of space.",
    "Pentecostal": "The width demonstrate God's sufficiency and the need for spiritual faith in space.",
    "Anglican": "The width represent God's sufficiency and the need for faithful service in space.",
    "Orthodox": "The width reflect the Orthodox understanding of God's sufficiency and the importance of space."
  },
  "13": {
    "General": "The length reflects God's completeness and the importance of measurement.",
    "Non-Denominational": "The length demonstrates God's completeness and the importance of measurement.",
    "Baptist": "The length represents God's completeness and the importance of biblical faith in measurement.",
    "Catholic": "The length reflect the Catholic understanding of God's completeness and the importance of measurement.",
    "Methodist": "The length demonstrate God's completeness and the need for faithful service in measurement.",
    "Lutheran": "The length represent God's completeness and the importance of biblical faith in measurement.",
    "Presbyterian": "The length reflect God's covenantal faithfulness and the importance of measurement.",
    "Pentecostal": "The length demonstrate God's completeness and the need for spiritual faith in measurement.",
    "Anglican": "The length represent God's completeness and the need for faithful service in measurement.",
    "Orthodox": "The length reflect the Orthodox understanding of God's completeness and the importance of measurement."
  },
  "14": {
    "General": "The hangings reflect God's separation and the importance of boundaries.",
    "Non-Denominational": "The hangings demonstrate God's separation and the importance of boundaries.",
    "Baptist": "The hangings represent God's separation and the importance of biblical faith in boundaries.",
    "Catholic": "The hangings reflect the Catholic understanding of God's separation and the importance of boundaries.",
    "Methodist": "The hangings demonstrate God's separation and the need for faithful service in boundaries.",
    "Lutheran": "The hangings represent God's separation and the importance of biblical faith in boundaries.",
    "Presbyterian": "The hangings reflect God's covenantal faithfulness and the importance of boundaries.",
    "Pentecostal": "The hangings demonstrate God's separation and the need for spiritual faith in boundaries.",
    "Anglican": "The hangings represent God's separation and the need for faithful service in boundaries.",
    "Orthodox": "The hangings reflect the Orthodox understanding of God's separation and the importance of boundaries."
  },
  "15": {
    "General": "The pillars reflect God's support and the importance of structure.",
    "Non-Denominational": "The pillars demonstrate God's support and the importance of structure.",
    "Baptist": "The pillars represent God's support and the importance of biblical faith in structure.",
    "Catholic": "The pillars reflect the Catholic understanding of God's support and the importance of structure.",
    "Methodist": "The pillars demonstrate God's support and the need for faithful service in structure.",
    "Lutheran": "The pillars represent God's support and the importance of biblical faith in structure.",
    "Presbyterian": "The pillars reflect God's covenantal faithfulness and the importance of structure.",
    "Pentecostal": "The pillars demonstrate God's support and the need for spiritual faith in structure.",
    "Anglican": "The pillars represent God's support and the need for faithful service in structure.",
    "Orthodox": "The pillars reflect the Orthodox understanding of God's support and the importance of structure."
  },
  "16": {
    "General": "The gate reflects God's access and the importance of entrance.",
    "Non-Denominational": "The gate demonstrates God's access and the importance of entrance.",
    "Baptist": "The gate represents God's access and the importance of biblical faith in entrance.",
    "Catholic": "The gate reflect the Catholic understanding of God's access and the importance of entrance.",
    "Methodist": "The gate demonstrate God's access and the need for faithful service in entrance.",
    "Lutheran": "The gate represent God's access and the importance of biblical faith in entrance.",
    "Presbyterian": "The gate reflect God's covenantal faithfulness and the importance of entrance.",
    "Pentecostal": "The gate demonstrate God's access and the need for spiritual faith in entrance.",
    "Anglican": "The gate represent God's access and the need for faithful service in entrance.",
    "Orthodox": "The gate reflect the Orthodox understanding of God's access and the importance of entrance."
  },
  "17": {
    "General": "The pillars reflect God's support and the importance of structure.",
    "Non-Denominational": "The pillars demonstrate God's support and the importance of structure.",
    "Baptist": "The pillars represent God's support and the importance of biblical faith in structure.",
    "Catholic": "The pillars reflect the Catholic understanding of God's support and the importance of structure.",
    "Methodist": "The pillars demonstrate God's support and the need for faithful service in structure.",
    "Lutheran": "The pillars represent God's support and the importance of biblical faith in structure.",
    "Presbyterian": "The pillars reflect God's covenantal faithfulness and the importance of structure.",
    "Pentecostal": "The pillars demonstrate God's support and the need for spiritual faith in structure.",
    "Anglican": "The pillars represent God's support and the need for faithful service in structure.",
    "Orthodox": "The pillars reflect the Orthodox understanding of God's support and the importance of structure."
  },
  "18": {
    "General": "The length reflects God's completeness and the importance of measurement.",
    "Non-Denominational": "The length demonstrates God's completeness and the importance of measurement.",
    "Baptist": "The length represents God's completeness and the importance of biblical faith in measurement.",
    "Catholic": "The length reflect the Catholic understanding of God's completeness and the importance of measurement.",
    "Methodist": "The length demonstrate God's completeness and the need for faithful service in measurement.",
    "Lutheran": "The length represent God's completeness and the importance of biblical faith in measurement.",
    "Presbyterian": "The length reflect God's covenantal faithfulness and the importance of measurement.",
    "Pentecostal": "The length demonstrate God's completeness and the need for spiritual faith in measurement.",
    "Anglican": "The length represent God's completeness and the need for faithful service in measurement.",
    "Orthodox": "The length reflect the Orthodox understanding of God's completeness and the importance of measurement."
  },
  "19": {
    "General": "The utensils reflect God's service and the importance of preparation.",
    "Non-Denominational": "The utensils demonstrate God's service and the importance of preparation.",
    "Baptist": "The utensils represent God's service and the importance of biblical faith in preparation.",
    "Catholic": "The utensils reflect the Catholic understanding of God's service and the importance of preparation.",
    "Methodist": "The utensils demonstrate God's service and the need for faithful service in preparation.",
    "Lutheran": "The utensils represent God's service and the importance of biblical faith in preparation.",
    "Presbyterian": "The utensils reflect God's covenantal faithfulness and the importance of preparation.",
    "Pentecostal": "The utensils demonstrate God's service and the need for spiritual faith in preparation.",
    "Anglican": "The utensils represent God's service and the need for faithful service in preparation.",
    "Orthodox": "The utensils reflect the Orthodox understanding of God's service and the importance of preparation."
  },
  "20": {
    "General": "The oil command reflects God's light and the importance of illumination.",
    "Non-Denominational": "The oil command demonstrates God's light and the importance of illumination.",
    "Baptist": "The oil command represents God's light and the importance of biblical faith in illumination.",
    "Catholic": "The oil command reflect the Catholic understanding of God's light and the importance of illumination.",
    "Methodist": "The oil command demonstrate God's light and the need for faithful service in illumination.",
    "Lutheran": "The oil command represent God's light and the importance of biblical faith in illumination.",
    "Presbyterian": "The oil command reflect God's covenantal faithfulness and the importance of illumination.",
    "Pentecostal": "The oil command demonstrate God's light and the need for spiritual faith in illumination.",
    "Anglican": "The oil command represent God's light and the need for faithful service in illumination.",
    "Orthodox": "The oil command reflect the Orthodox understanding of God's light and the importance of illumination."
  }
} 