{
  "chapterSummary": {
    "General": "Exodus 28 describes God's instructions for the priestly garments. The chapter emphasizes God's holiness, service, and the importance of consecration in worship.",
    "Non-Denominational": "Exodus 28 presents God's instructions for the priestly garments. This demonstrates God's holiness, service, and the importance of consecration in worship.",
    "Baptist": "Exodus 28 recounts God's instructions for the priestly garments. This reveals God's holiness, service, and the importance of biblical faith in worship.",
    "Catholic": "Exodus 28 contains God's instructions for the priestly garments. The Catholic interpretation emphasizes God's holiness, service, and the importance of worship in the covenant relationship.",
    "Methodist": "Exodus 28 presents God's instructions for the priestly garments. This shows God's holiness, service, and the importance of faithful service in worship.",
    "Lutheran": "Exodus 28 recounts God's instructions for the priestly garments. This reveals God's holiness, service, and the importance of biblical faith in worship.",
    "Presbyterian": "Exodus 28 contains God's instructions for the priestly garments. This establishes God's covenantal faithfulness, service, and the importance of worship.",
    "Pentecostal": "Exodus 28 presents God's instructions for the priestly garments. This teaches about God's holiness, service, and the importance of spiritual faith in worship.",
    "Anglican": "Exodus 28 recounts God's instructions for the priestly garments. This demonstrates God's holiness, service, and the importance of faithful service in worship.",
    "Orthodox": "Exodus 28 contains God's instructions for the priestly garments. The Orthodox Church interprets this as showing God's holiness, service, and the importance of worship in the covenant relationship."
  },
  "1": {
    "General": "The priestly selection reflects God's calling and the importance of service.",
    "Non-Denominational": "The priestly selection demonstrates God's calling and the importance of service.",
    "Baptist": "The priestly selection represents God's calling and the importance of biblical faith in service.",
        "Catholic": "The priestly selection reflects the Catholic understanding of God's calling and the importance of service.",
    "Methodist": "The priestly selection demonstrates God's calling and the need for faithful service.",
    "Lutheran": "The priestly selection represents God's calling and the importance of biblical faith in service.",
    "Presbyterian": "The priestly selection reflects God's covenantal faithfulness and the importance of service.",
    "Pentecostal": "The priestly selection demonstrates God's calling and the need for spiritual faith in service.",
    "Anglican": "The priestly selection represents God's calling and the need for faithful service.",
    "Orthodox": "The priestly selection reflects the Orthodox understanding of God's calling and the importance of service."
  },
  "2": {
    "General": "The garments reflect God's holiness and the importance of consecration.",
    "Non-Denominational": "The garments demonstrate God's holiness and the importance of consecration.",
    "Baptist": "The garments represent God's holiness and the importance of biblical faith in consecration.",
        "Catholic": "The garments reflect the Catholic understanding of God's holiness and the importance of consecration.",
    "Methodist": "The garments demonstrate God's holiness and the need for faithful service in consecration.",
    "Lutheran": "The garments represent God's holiness and the importance of biblical faith in consecration.",
    "Presbyterian": "The garments reflect God's covenantal faithfulness and the importance of consecration.",
    "Pentecostal": "The garments demonstrate God's holiness and the need for spiritual faith in consecration.",
    "Anglican": "The garments represent God's holiness and the need for faithful service in consecration.",
    "Orthodox": "The garments reflect the Orthodox understanding of God's holiness and the importance of consecration."
  },
  "3": {
    "General": "The skilled workers reflect God's gifting and the importance of craftsmanship.",
    "Non-Denominational": "The skilled workers demonstrate God's gifting and the importance of craftsmanship.",
    "Baptist": "The skilled workers represent God's gifting and the importance of biblical faith in craftsmanship.",
        "Catholic": "The skilled workers reflect the Catholic understanding of God's gifting and the importance of craftsmanship.",
    "Methodist": "The skilled workers demonstrate God's gifting and the need for faithful service in craftsmanship.",
    "Lutheran": "The skilled workers represent God's gifting and the importance of biblical faith in craftsmanship.",
    "Presbyterian": "The skilled workers reflect God's covenantal faithfulness and the importance of craftsmanship.",
    "Pentecostal": "The skilled workers demonstrate God's gifting and the need for spiritual faith in craftsmanship.",
    "Anglican": "The skilled workers represent God's gifting and the need for faithful service in craftsmanship.",
    "Orthodox": "The skilled workers reflect the Orthodox understanding of God's gifting and the importance of craftsmanship."
  },
  "4": {
    "General": "The garment list reflects God's completeness and the importance of preparation.",
    "Non-Denominational": "The garment list demonstrates God's completeness and the importance of preparation.",
    "Baptist": "The garment list represents God's completeness and the importance of biblical faith in preparation.",
    "Catholic": "The garment list reflect the Catholic understanding of God's completeness and the importance of preparation.",
    "Methodist": "The garment list demonstrate God's completeness and the need for faithful service in preparation.",
    "Lutheran": "The garment list represent God's completeness and the importance of biblical faith in preparation.",
    "Presbyterian": "The garment list reflect God's covenantal faithfulness and the importance of preparation.",
    "Pentecostal": "The garment list demonstrate God's completeness and the need for spiritual faith in preparation.",
    "Anglican": "The garment list represent God's completeness and the need for faithful service in preparation.",
    "Orthodox": "The garment list reflect the Orthodox understanding of God's completeness and the importance of preparation."
  },
  "5": {
    "General": "The materials reflect God's provision and the importance of quality.",
    "Non-Denominational": "The materials demonstrate God's provision and the importance of quality.",
    "Baptist": "The materials represent God's provision and the importance of biblical faith in quality.",
        "Catholic": "The materials reflect the Catholic understanding of God's provision and the importance of quality.",
    "Methodist": "The materials demonstrate God's provision and the need for faithful service in quality.",
    "Lutheran": "The materials represent God's provision and the importance of biblical faith in quality.",
    "Presbyterian": "The materials reflect God's covenantal faithfulness and the importance of quality.",
    "Pentecostal": "The materials demonstrate God's provision and the need for spiritual faith in quality.",
    "Anglican": "The materials represent God's provision and the need for faithful service in quality.",
    "Orthodox": "The materials reflect the Orthodox understanding of God's provision and the importance of quality."
  },
  "6": {
    "General": "The ephod reflects God's authority and the importance of service.",
    "Non-Denominational": "The ephod demonstrates God's authority and the importance of service.",
    "Baptist": "The ephod represents God's authority and the importance of biblical faith in service.",
    "Catholic": "The ephod reflect the Catholic understanding of God's authority and the importance of service.",
    "Methodist": "The ephod demonstrate God's authority and the need for faithful service.",
    "Lutheran": "The ephod represent God's authority and the importance of biblical faith in service.",
    "Presbyterian": "The ephod reflect God's covenantal faithfulness and the importance of service.",
    "Pentecostal": "The ephod demonstrate God's authority and the need for spiritual faith in service.",
    "Anglican": "The ephod represent God's authority and the need for faithful service.",
    "Orthodox": "The ephod reflect the Orthodox understanding of God's authority and the importance of service."
  },
  "7": {
    "General": "The shoulder pieces reflect God's support and the importance of strength.",
    "Non-Denominational": "The shoulder pieces demonstrate God's support and the importance of strength.",
    "Baptist": "The shoulder pieces represent God's support and the importance of biblical faith in strength.",
        "Catholic": "The shoulder pieces reflect the Catholic understanding of God's support and the importance of strength.",
    "Methodist": "The shoulder pieces demonstrate God's support and the need for faithful service in strength.",
    "Lutheran": "The shoulder pieces represent God's support and the importance of biblical faith in strength.",
    "Presbyterian": "The shoulder pieces reflect God's covenantal faithfulness and the importance of strength.",
    "Pentecostal": "The shoulder pieces demonstrate God's support and the need for spiritual faith in strength.",
    "Anglican": "The shoulder pieces represent God's support and the need for faithful service in strength.",
    "Orthodox": "The shoulder pieces reflect the Orthodox understanding of God's support and the importance of strength."
  },
  "8": {
    "General": "The waistband reflects God's unity and the importance of connection.",
    "Non-Denominational": "The waistband demonstrates God's unity and the importance of connection.",
    "Baptist": "The waistband represents God's unity and the importance of biblical faith in connection.",
    "Catholic": "The waistband reflect the Catholic understanding of God's unity and the importance of connection.",
    "Methodist": "The waistband demonstrate God's unity and the need for faithful service in connection.",
    "Lutheran": "The waistband represent God's unity and the importance of biblical faith in connection.",
    "Presbyterian": "The waistband reflect God's covenantal faithfulness and the importance of connection.",
    "Pentecostal": "The waistband demonstrate God's unity and the need for spiritual faith in connection.",
    "Anglican": "The waistband represent God's unity and the need for faithful service in connection.",
    "Orthodox": "The waistband reflect the Orthodox understanding of God's unity and the importance of connection."
  },
  "9": {
    "General": "The onyx stones reflect God's remembrance and the importance of identity.",
    "Non-Denominational": "The onyx stones demonstrate God's remembrance and the importance of identity.",
    "Baptist": "The onyx stones represent God's remembrance and the importance of biblical faith in identity.",
        "Catholic": "The onyx stones reflect the Catholic understanding of God's remembrance and the importance of identity.",
    "Methodist": "The onyx stones demonstrate God's remembrance and the need for faithful service in identity.",
    "Lutheran": "The onyx stones represent God's remembrance and the importance of biblical faith in identity.",
    "Presbyterian": "The onyx stones reflect God's covenantal faithfulness and the importance of identity.",
    "Pentecostal": "The onyx stones demonstrate God's remembrance and the need for spiritual faith in identity.",
    "Anglican": "The onyx stones represent God's remembrance and the need for faithful service in identity.",
    "Orthodox": "The onyx stones reflect the Orthodox understanding of God's remembrance and the importance of identity."
  },
  "10": {
    "General": "The stone order reflects God's order and the importance of arrangement.",
    "Non-Denominational": "The stone order demonstrates God's order and the importance of arrangement.",
    "Baptist": "The stone order represents God's order and the importance of biblical faith in arrangement.",
    "Catholic": "The stone order reflect the Catholic understanding of God's order and the importance of arrangement.",
    "Methodist": "The stone order demonstrate God's order and the need for faithful service in arrangement.",
    "Lutheran": "The stone order represent God's order and the importance of biblical faith in arrangement.",
    "Presbyterian": "The stone order reflect God's covenantal faithfulness and the importance of arrangement.",
    "Pentecostal": "The stone order demonstrate God's order and the need for spiritual faith in arrangement.",
    "Anglican": "The stone order represent God's order and the need for faithful service in arrangement.",
    "Orthodox": "The stone order reflect the Orthodox understanding of God's order and the importance of arrangement."
  },
  "11": {
    "General": "The engraving reflects God's permanence and the importance of memory.",
    "Non-Denominational": "The engraving demonstrates God's permanence and the importance of memory.",
    "Baptist": "The engraving represents God's permanence and the importance of biblical faith in memory.",
    "Catholic": "The engraving reflect the Catholic understanding of God's permanence and the importance of memory.",
    "Methodist": "The engraving demonstrate God's permanence and the need for faithful service in memory.",
    "Lutheran": "The engraving represent God's permanence and the importance of biblical faith in memory.",
    "Presbyterian": "The engraving reflect God's covenantal faithfulness and the importance of memory.",
    "Pentecostal": "The engraving demonstrate God's permanence and the need for spiritual faith in memory.",
    "Anglican": "The engraving represent God's permanence and the need for faithful service in memory.",
    "Orthodox": "The engraving reflect the Orthodox understanding of God's permanence and the importance of memory."
  },
  "12": {
    "General": "The stone placement reflects God's remembrance and the importance of memorial.",
    "Non-Denominational": "The stone placement demonstrates God's remembrance and the importance of memorial.",
    "Baptist": "The stone placement represents God's remembrance and the importance of biblical faith in memorial.",
    "Catholic": "The stone placement reflect the Catholic understanding of God's remembrance and the importance of memorial.",
    "Methodist": "The stone placement demonstrate God's remembrance and the need for faithful service in memorial.",
    "Lutheran": "The stone placement represent God's remembrance and the importance of biblical faith in memorial.",
    "Presbyterian": "The stone placement reflect God's covenantal faithfulness and the importance of memorial.",
    "Pentecostal": "The stone placement demonstrate God's remembrance and the need for spiritual faith in memorial.",
    "Anglican": "The stone placement represent God's remembrance and the need for faithful service in memorial.",
    "Orthodox": "The stone placement reflect the Orthodox understanding of God's remembrance and the importance of memorial."
  },
  "13": {
    "General": "The gold settings reflect God's value and the importance of protection.",
    "Non-Denominational": "The gold settings demonstrate God's value and the importance of protection.",
    "Baptist": "The gold settings represent God's value and the importance of biblical faith in protection.",
        "Catholic": "The gold settings reflect the Catholic understanding of God's value and the importance of protection.",
    "Methodist": "The gold settings demonstrate God's value and the need for faithful service in protection.",
    "Lutheran": "The gold settings represent God's value and the importance of biblical faith in protection.",
    "Presbyterian": "The gold settings reflect God's covenantal faithfulness and the importance of protection.",
    "Pentecostal": "The gold settings demonstrate God's value and the need for spiritual faith in protection.",
    "Anglican": "The gold settings represent God's value and the need for faithful service in protection.",
    "Orthodox": "The gold settings reflect the Orthodox understanding of God's value and the importance of protection."
  },
  "14": {
    "General": "The chains reflect God's connection and the importance of attachment.",
    "Non-Denominational": "The chains demonstrate God's connection and the importance of attachment.",
    "Baptist": "The chains represent God's connection and the importance of biblical faith in attachment.",
        "Catholic": "The chains reflect the Catholic understanding of God's connection and the importance of attachment.",
    "Methodist": "The chains demonstrate God's connection and the need for faithful service in attachment.",
    "Lutheran": "The chains represent God's connection and the importance of biblical faith in attachment.",
    "Presbyterian": "The chains reflect God's covenantal faithfulness and the importance of attachment.",
    "Pentecostal": "The chains demonstrate God's connection and the need for spiritual faith in attachment.",
    "Anglican": "The chains represent God's connection and the need for faithful service in attachment.",
    "Orthodox": "The chains reflect the Orthodox understanding of God's connection and the importance of attachment."
  },
  "15": {
    "General": "The breastpiece reflects God's judgment and the importance of discernment.",
    "Non-Denominational": "The breastpiece demonstrates God's judgment and the importance of discernment.",
    "Baptist": "The breastpiece represents God's judgment and the importance of biblical faith in discernment.",
    "Catholic": "The breastpiece reflect the Catholic understanding of God's judgment and the importance of discernment.",
    "Methodist": "The breastpiece demonstrate God's judgment and the need for faithful service in discernment.",
    "Lutheran": "The breastpiece represent God's judgment and the importance of biblical faith in discernment.",
    "Presbyterian": "The breastpiece reflect God's covenantal faithfulness and the importance of discernment.",
    "Pentecostal": "The breastpiece demonstrate God's judgment and the need for spiritual faith in discernment.",
    "Anglican": "The breastpiece represent God's judgment and the need for faithful service in discernment.",
    "Orthodox": "The breastpiece reflect the Orthodox understanding of God's judgment and the importance of discernment."
  },
  "16": {
    "General": "The breastpiece dimensions reflect God's perfection and the importance of proportion.",
    "Non-Denominational": "The breastpiece dimensions demonstrate God's perfection and the importance of proportion.",
    "Baptist": "The breastpiece dimensions represent God's perfection and the importance of biblical faith in proportion.",
        "Catholic": "The breastpiece dimensions reflect the Catholic understanding of God's perfection and the importance of proportion.",
    "Methodist": "The breastpiece dimensions demonstrate God's perfection and the need for faithful service in proportion.",
    "Lutheran": "The breastpiece dimensions represent God's perfection and the importance of biblical faith in proportion.",
    "Presbyterian": "The breastpiece dimensions reflect God's covenantal faithfulness and the importance of proportion.",
    "Pentecostal": "The breastpiece dimensions demonstrate God's perfection and the need for spiritual faith in proportion.",
    "Anglican": "The breastpiece dimensions represent God's perfection and the need for faithful service in proportion.",
    "Orthodox": "The breastpiece dimensions reflect the Orthodox understanding of God's perfection and the importance of proportion."
  },
  "17": {
    "General": "The stones reflect God's beauty and the importance of variety.",
    "Non-Denominational": "The stones demonstrate God's beauty and the importance of variety.",
    "Baptist": "The stones represent God's beauty and the importance of biblical faith in variety.",
        "Catholic": "The stones reflect the Catholic understanding of God's beauty and the importance of variety.",
    "Methodist": "The stones demonstrate God's beauty and the need for faithful service in variety.",
    "Lutheran": "The stones represent God's beauty and the importance of biblical faith in variety.",
    "Presbyterian": "The stones reflect God's covenantal faithfulness and the importance of variety.",
    "Pentecostal": "The stones demonstrate God's beauty and the need for spiritual faith in variety.",
    "Anglican": "The stones represent God's beauty and the need for faithful service in variety.",
    "Orthodox": "The stones reflect the Orthodox understanding of God's beauty and the importance of variety."
  },
  "18": {
    "General": "The stone arrangement reflects God's order and the importance of arrangement.",
    "Non-Denominational": "The stone arrangement demonstrates God's order and the importance of arrangement.",
    "Baptist": "The stone arrangement represents God's order and the importance of biblical faith in arrangement.",
    "Catholic": "The stone arrangement reflect the Catholic understanding of God's order and the importance of arrangement.",
    "Methodist": "The stone arrangement demonstrate God's order and the need for faithful service in arrangement.",
    "Lutheran": "The stone arrangement represent God's order and the importance of biblical faith in arrangement.",
    "Presbyterian": "The stone arrangement reflect God's covenantal faithfulness and the importance of arrangement.",
    "Pentecostal": "The stone arrangement demonstrate God's order and the need for spiritual faith in arrangement.",
    "Anglican": "The stone arrangement represent God's order and the need for faithful service in arrangement.",
    "Orthodox": "The stone arrangement reflect the Orthodox understanding of God's order and the importance of arrangement."
  },
  "19": {
    "General": "The stone completion reflects God's completeness and the importance of wholeness.",
    "Non-Denominational": "The stone completion demonstrates God's completeness and the importance of wholeness.",
    "Baptist": "The stone completion represents God's completeness and the importance of biblical faith in wholeness.",
    "Catholic": "The stone completion reflect the Catholic understanding of God's completeness and the importance of wholeness.",
    "Methodist": "The stone completion demonstrate God's completeness and the need for faithful service in wholeness.",
    "Lutheran": "The stone completion represent God's completeness and the importance of biblical faith in wholeness.",
    "Presbyterian": "The stone completion reflect God's covenantal faithfulness and the importance of wholeness.",
    "Pentecostal": "The stone completion demonstrate God's completeness and the need for spiritual faith in wholeness.",
    "Anglican": "The stone completion represent God's completeness and the need for faithful service in wholeness.",
    "Orthodox": "The stone completion reflect the Orthodox understanding of God's completeness and the importance of wholeness."
  },
  "20": {
    "General": "The stone variety reflects God's diversity and the importance of uniqueness.",
    "Non-Denominational": "The stone variety demonstrates God's diversity and the importance of uniqueness.",
    "Baptist": "The stone variety represents God's diversity and the importance of biblical faith in uniqueness.",
    "Catholic": "The stone variety reflect the Catholic understanding of God's diversity and the importance of uniqueness.",
    "Methodist": "The stone variety demonstrate God's diversity and the need for faithful service in uniqueness.",
    "Lutheran": "The stone variety represent God's diversity and the importance of biblical faith in uniqueness.",
    "Presbyterian": "The stone variety reflect God's covenantal faithfulness and the importance of uniqueness.",
    "Pentecostal": "The stone variety demonstrate God's diversity and the need for spiritual faith in uniqueness.",
    "Anglican": "The stone variety represent God's diversity and the need for faithful service in uniqueness.",
    "Orthodox": "The stone variety reflect the Orthodox understanding of God's diversity and the importance of uniqueness."
  }
} 