{
  "chapterSummary": {
    "General": "Exodus 31 describes the calling of Bezalel and Oholiab, and the Sabbath law. The chapter emphasizes God's wisdom, service, and the importance of rest.",
    "Non-Denominational": "Exodus 31 presents the calling of Bezalel and Oholiab, and the Sabbath law. This demonstrates God's wisdom, service, and the importance of rest.",
    "Baptist": "Exodus 31 recounts the calling of Bezalel and Oholiab, and the Sabbath law. This reveals God's wisdom, service, and the importance of biblical faith in rest.",
    "Catholic": "Exodus 31 contains the calling of Bezalel and Oholiab, and the Sabbath law. The Catholic interpretation emphasizes God's wisdom, service, and the importance of rest in the covenant relationship.",
    "Methodist": "Exodus 31 presents the calling of Bezalel and Oholiab, and the Sabbath law. This shows God's wisdom, service, and the importance of faithful service in rest.",
    "Lutheran": "Exodus 31 recounts the calling of Bezalel and Oholiab, and the Sabbath law. This reveals God's wisdom, service, and the importance of biblical faith in rest.",
    "Presbyterian": "Exodus 31 contains the calling of Bezalel and Oholiab, and the Sabbath law. This establishes God's covenantal faithfulness, service, and the importance of rest.",
    "Pentecostal": "Exodus 31 presents the calling of Bezalel and Oholiab, and the Sabbath law. This teaches about God's wisdom, service, and the importance of spiritual faith in rest.",
    "Anglican": "Exodus 31 recounts the calling of Bezalel and Oholiab, and the Sabbath law. This demonstrates God's wisdom, service, and the importance of faithful service in rest.",
    "Orthodox": "Exodus 31 contains the calling of Bezalel and Oholiab, and the Sabbath law. The Orthodox Church interprets this as showing God's wisdom, service, and the importance of rest in the covenant relationship."
  },
  "1": {
    "General": "The calling of Bezalel reflects God's wisdom and the importance of craftsmanship.",
    "Non-Denominational": "The calling of Bezalel demonstrates God's wisdom and the importance of craftsmanship.",
    "Baptist": "The calling of Bezalel represents God's wisdom and the importance of biblical faith in craftsmanship.",
        "Catholic": "The calling of Bezalel reflects the Catholic understanding of God's wisdom and the importance of craftsmanship.",
    "Methodist": "The calling of Bezalel demonstrates God's wisdom and the need for faithful service in craftsmanship.",
    "Lutheran": "The calling of Bezalel represents God's wisdom and the importance of biblical faith in craftsmanship.",
    "Presbyterian": "The calling of Bezalel reflects God's covenantal faithfulness and the importance of craftsmanship.",
    "Pentecostal": "The calling of Bezalel demonstrates God's wisdom and the need for spiritual faith in craftsmanship.",
    "Anglican": "The calling of Bezalel represents God's wisdom and the need for faithful service in craftsmanship.",
    "Orthodox": "The calling of Bezalel reflects the Orthodox understanding of God's wisdom and the importance of craftsmanship."
  },
  "2": {
    "General": "The naming reflects God's knowledge and the importance of identity.",
    "Non-Denominational": "The naming demonstrates God's knowledge and the importance of identity.",
    "Baptist": "The naming represents God's knowledge and the importance of biblical faith in identity.",
    "Catholic": "The naming reflect the Catholic understanding of God's knowledge and the importance of identity.",
    "Methodist": "The naming demonstrate God's knowledge and the need for faithful service in identity.",
    "Lutheran": "The naming represent God's knowledge and the importance of biblical faith in identity.",
    "Presbyterian": "The naming reflect God's covenantal faithfulness and the importance of identity.",
    "Pentecostal": "The naming demonstrate God's knowledge and the need for spiritual faith in identity.",
    "Anglican": "The naming represent God's knowledge and the need for faithful service in identity.",
    "Orthodox": "The naming reflect the Orthodox understanding of God's knowledge and the importance of identity."
  },
  "3": {
    "General": "The Spirit reflects God's presence and the importance of empowerment.",
    "Non-Denominational": "The Spirit demonstrates God's presence and the importance of empowerment.",
    "Baptist": "The Spirit represents God's presence and the importance of biblical faith in empowerment.",
    "Catholic": "The Spirit reflect the Catholic understanding of God's presence and the importance of empowerment.",
    "Methodist": "The Spirit demonstrate God's presence and the need for faithful service in empowerment.",
    "Lutheran": "The Spirit represent God's presence and the importance of biblical faith in empowerment.",
    "Presbyterian": "The Spirit reflect God's covenantal faithfulness and the importance of empowerment.",
    "Pentecostal": "The Spirit demonstrate God's presence and the need for spiritual faith in empowerment.",
    "Anglican": "The Spirit represent God's presence and the need for faithful service in empowerment.",
    "Orthodox": "The Spirit reflect the Orthodox understanding of God's presence and the importance of empowerment."
  },
  "4": {
    "General": "The skills reflect God's gifting and the importance of ability.",
    "Non-Denominational": "The skills demonstrate God's gifting and the importance of ability.",
    "Baptist": "The skills represent God's gifting and the importance of biblical faith in ability.",
    "Catholic": "The skills reflect the Catholic understanding of God's gifting and the importance of ability.",
    "Methodist": "The skills demonstrate God's gifting and the need for faithful service in ability.",
    "Lutheran": "The skills represent God's gifting and the importance of biblical faith in ability.",
    "Presbyterian": "The skills reflect God's covenantal faithfulness and the importance of ability.",
    "Pentecostal": "The skills demonstrate God's gifting and the need for spiritual faith in ability.",
    "Anglican": "The skills represent God's gifting and the need for faithful service in ability.",
    "Orthodox": "The skills reflect the Orthodox understanding of God's gifting and the importance of ability."
  },
  "5": {
    "General": "The craftsmanship reflects God's creativity and the importance of work.",
    "Non-Denominational": "The craftsmanship demonstrates God's creativity and the importance of work.",
    "Baptist": "The craftsmanship represents God's creativity and the importance of biblical faith in work.",
    "Catholic": "The craftsmanship reflect the Catholic understanding of God's creativity and the importance of work.",
    "Methodist": "The craftsmanship demonstrate God's creativity and the need for faithful service in work.",
    "Lutheran": "The craftsmanship represent God's creativity and the importance of biblical faith in work.",
    "Presbyterian": "The craftsmanship reflect God's covenantal faithfulness and the importance of work.",
    "Pentecostal": "The craftsmanship demonstrate God's creativity and the need for spiritual faith in work.",
    "Anglican": "The craftsmanship represent God's creativity and the need for faithful service in work.",
    "Orthodox": "The craftsmanship reflect the Orthodox understanding of God's creativity and the importance of work."
  },
  "6": {
    "General": "The helper reflects God's provision and the importance of partnership.",
    "Non-Denominational": "The helper demonstrates God's provision and the importance of partnership.",
    "Baptist": "The helper represents God's provision and the importance of biblical faith in partnership.",
    "Catholic": "The helper reflect the Catholic understanding of God's provision and the importance of partnership.",
    "Methodist": "The helper demonstrate God's provision and the need for faithful service in partnership.",
    "Lutheran": "The helper represent God's provision and the importance of biblical faith in partnership.",
    "Presbyterian": "The helper reflect God's covenantal faithfulness and the importance of partnership.",
    "Pentecostal": "The helper demonstrate God's provision and the need for spiritual faith in partnership.",
    "Anglican": "The helper represent God's provision and the need for faithful service in partnership.",
    "Orthodox": "The helper reflect the Orthodox understanding of God's provision and the importance of partnership."
  },
  "7": {
    "General": "The tent reflects God's presence and the importance of dwelling.",
    "Non-Denominational": "The tent demonstrates God's presence and the importance of dwelling.",
    "Baptist": "The tent represents God's presence and the importance of biblical faith in dwelling.",
    "Catholic": "The tent reflect the Catholic understanding of God's presence and the importance of dwelling.",
    "Methodist": "The tent demonstrate God's presence and the need for faithful service in dwelling.",
    "Lutheran": "The tent represent God's presence and the importance of biblical faith in dwelling.",
    "Presbyterian": "The tent reflect God's covenantal faithfulness and the importance of dwelling.",
    "Pentecostal": "The tent demonstrate God's presence and the need for spiritual faith in dwelling.",
    "Anglican": "The tent represent God's presence and the need for faithful service in dwelling.",
    "Orthodox": "The tent reflect the Orthodox understanding of God's presence and the importance of dwelling."
  },
  "8": {
    "General": "The ark reflects God's presence and the importance of covenant.",
    "Non-Denominational": "The ark demonstrates God's presence and the importance of covenant.",
    "Baptist": "The ark represents God's presence and the importance of biblical faith in covenant.",
    "Catholic": "The ark reflect the Catholic understanding of God's presence and the importance of covenant.",
    "Methodist": "The ark demonstrate God's presence and the need for faithful service in covenant.",
    "Lutheran": "The ark represent God's presence and the importance of biblical faith in covenant.",
    "Presbyterian": "The ark reflect God's covenantal faithfulness and the importance of covenant.",
    "Pentecostal": "The ark demonstrate God's presence and the need for spiritual faith in covenant.",
    "Anglican": "The ark represent God's presence and the need for faithful service in covenant.",
    "Orthodox": "The ark reflect the Orthodox understanding of God's presence and the importance of covenant."
  },
  "9": {
    "General": "The table reflects God's provision and the importance of sustenance.",
    "Non-Denominational": "The table demonstrates God's provision and the importance of sustenance.",
    "Baptist": "The table represents God's provision and the importance of biblical faith in sustenance.",
    "Catholic": "The table reflect the Catholic understanding of God's provision and the importance of sustenance.",
    "Methodist": "The table demonstrate God's provision and the need for faithful service in sustenance.",
    "Lutheran": "The table represent God's provision and the importance of biblical faith in sustenance.",
    "Presbyterian": "The table reflect God's covenantal faithfulness and the importance of sustenance.",
    "Pentecostal": "The table demonstrate God's provision and the need for spiritual faith in sustenance.",
    "Anglican": "The table represent God's provision and the need for faithful service in sustenance.",
    "Orthodox": "The table reflect the Orthodox understanding of God's provision and the importance of sustenance."
  },
  "10": {
    "General": "The garments reflect God's holiness and the importance of service.",
    "Non-Denominational": "The garments demonstrate God's holiness and the importance of service.",
    "Baptist": "The garments represent God's holiness and the importance of biblical faith in service.",
    "Catholic": "The garments reflect the Catholic understanding of God's holiness and the importance of service.",
    "Methodist": "The garments demonstrate God's holiness and the need for faithful service.",
    "Lutheran": "The garments represent God's holiness and the importance of biblical faith in service.",
    "Presbyterian": "The garments reflect God's covenantal faithfulness and the importance of service.",
    "Pentecostal": "The garments demonstrate God's holiness and the need for spiritual faith in service.",
    "Anglican": "The garments represent God's holiness and the need for faithful service.",
    "Orthodox": "The garments reflect the Orthodox understanding of God's holiness and the importance of service."
  },
  "11": {
    "General": "The anointing oil reflects God's presence and the importance of consecration.",
    "Non-Denominational": "The anointing oil demonstrates God's presence and the importance of consecration.",
    "Baptist": "The anointing oil represents God's presence and the importance of biblical faith in consecration.",
    "Catholic": "The anointing oil reflect the Catholic understanding of God's presence and the importance of consecration.",
    "Methodist": "The anointing oil demonstrate God's presence and the need for faithful service in consecration.",
    "Lutheran": "The anointing oil represent God's presence and the importance of biblical faith in consecration.",
    "Presbyterian": "The anointing oil reflect God's covenantal faithfulness and the importance of consecration.",
    "Pentecostal": "The anointing oil demonstrate God's presence and the need for spiritual faith in consecration.",
    "Anglican": "The anointing oil represent God's presence and the need for faithful service in consecration.",
    "Orthodox": "The anointing oil reflect the Orthodox understanding of God's presence and the importance of consecration."
  },
  "12": {
    "General": "The Sabbath reflects God's rest and the importance of holiness.",
    "Non-Denominational": "The Sabbath demonstrates God's rest and the importance of holiness.",
    "Baptist": "The Sabbath represents God's rest and the importance of biblical faith in holiness.",
    "Catholic": "The Sabbath reflect the Catholic understanding of God's rest and the importance of holiness.",
    "Methodist": "The Sabbath demonstrate God's rest and the need for faithful service in holiness.",
    "Lutheran": "The Sabbath represent God's rest and the importance of biblical faith in holiness.",
    "Presbyterian": "The Sabbath reflect God's covenantal faithfulness and the importance of holiness.",
    "Pentecostal": "The Sabbath demonstrate God's rest and the need for spiritual faith in holiness.",
    "Anglican": "The Sabbath represent God's rest and the need for faithful service in holiness.",
    "Orthodox": "The Sabbath reflect the Orthodox understanding of God's rest and the importance of holiness."
  },
  "13": {
    "General": "The sign reflects God's covenant and the importance of remembrance.",
    "Non-Denominational": "The sign demonstrates God's covenant and the importance of remembrance.",
    "Baptist": "The sign represents God's covenant and the importance of biblical faith in remembrance.",
    "Catholic": "The sign reflect the Catholic understanding of God's covenant and the importance of remembrance.",
    "Methodist": "The sign demonstrate God's covenant and the need for faithful service in remembrance.",
    "Lutheran": "The sign represent God's covenant and the importance of biblical faith in remembrance.",
    "Presbyterian": "The sign reflect God's covenantal faithfulness and the importance of remembrance.",
    "Pentecostal": "The sign demonstrate God's covenant and the need for spiritual faith in remembrance.",
    "Anglican": "The sign represent God's covenant and the need for faithful service in remembrance.",
    "Orthodox": "The sign reflect the Orthodox understanding of God's covenant and the importance of remembrance."
  },
  "14": {
    "General": "The holiness reflects God's nature and the importance of separation.",
    "Non-Denominational": "The holiness demonstrates God's nature and the importance of separation.",
    "Baptist": "The holiness represents God's nature and the importance of biblical faith in separation.",
    "Catholic": "The holiness reflect the Catholic understanding of God's nature and the importance of separation.",
    "Methodist": "The holiness demonstrate God's nature and the need for faithful service in separation.",
    "Lutheran": "The holiness represent God's nature and the importance of biblical faith in separation.",
    "Presbyterian": "The holiness reflect God's covenantal faithfulness and the importance of separation.",
    "Pentecostal": "The holiness demonstrate God's nature and the need for spiritual faith in separation.",
    "Anglican": "The holiness represent God's nature and the need for faithful service in separation.",
    "Orthodox": "The holiness reflect the Orthodox understanding of God's nature and the importance of separation."
  },
  "15": {
    "General": "The work reflects God's command and the importance of obedience.",
    "Non-Denominational": "The work demonstrates God's command and the importance of obedience.",
    "Baptist": "The work represents God's command and the importance of biblical faith in obedience.",
    "Catholic": "The work reflect the Catholic understanding of God's command and the importance of obedience.",
    "Methodist": "The work demonstrate God's command and the need for faithful service in obedience.",
    "Lutheran": "The work represent God's command and the importance of biblical faith in obedience.",
    "Presbyterian": "The work reflect God's covenantal faithfulness and the importance of obedience.",
    "Pentecostal": "The work demonstrate God's command and the need for spiritual faith in obedience.",
    "Anglican": "The work represent God's command and the need for faithful service in obedience.",
    "Orthodox": "The work reflect the Orthodox understanding of God's command and the importance of obedience."
  },
  "16": {
    "General": "The Sabbath reflects God's rest and the importance of covenant.",
    "Non-Denominational": "The Sabbath demonstrates God's rest and the importance of covenant.",
    "Baptist": "The Sabbath represents God's rest and the importance of biblical faith in covenant.",
    "Catholic": "The Sabbath reflect the Catholic understanding of God's rest and the importance of covenant.",
    "Methodist": "The Sabbath demonstrate God's rest and the need for faithful service in covenant.",
    "Lutheran": "The Sabbath represent God's rest and the importance of biblical faith in covenant.",
    "Presbyterian": "The Sabbath reflect God's covenantal faithfulness and the importance of covenant.",
    "Pentecostal": "The Sabbath demonstrate God's rest and the need for spiritual faith in covenant.",
    "Anglican": "The Sabbath represent God's rest and the need for faithful service in covenant.",
    "Orthodox": "The Sabbath reflect the Orthodox understanding of God's rest and the importance of covenant."
  },
  "17": {
    "General": "The sign reflects God's covenant and the importance of remembrance.",
    "Non-Denominational": "The sign demonstrates God's covenant and the importance of remembrance.",
    "Baptist": "The sign represents God's covenant and the importance of biblical faith in remembrance.",
    "Catholic": "The sign reflect the Catholic understanding of God's covenant and the importance of remembrance.",
    "Methodist": "The sign demonstrate God's covenant and the need for faithful service in remembrance.",
    "Lutheran": "The sign represent God's covenant and the importance of biblical faith in remembrance.",
    "Presbyterian": "The sign reflect God's covenantal faithfulness and the importance of remembrance.",
    "Pentecostal": "The sign demonstrate God's covenant and the need for spiritual faith in remembrance.",
    "Anglican": "The sign represent God's covenant and the need for faithful service in remembrance.",
    "Orthodox": "The sign reflect the Orthodox understanding of God's covenant and the importance of remembrance."
  },
  "18": {
    "General": "The tablets reflect God's law and the importance of covenant.",
    "Non-Denominational": "The tablets demonstrate God's law and the importance of covenant.",
    "Baptist": "The tablets represent God's law and the importance of biblical faith in covenant.",
    "Catholic": "The tablets reflect the Catholic understanding of God's law and the importance of covenant.",
    "Methodist": "The tablets demonstrate God's law and the need for faithful service in covenant.",
    "Lutheran": "The tablets represent God's law and the importance of biblical faith in covenant.",
    "Presbyterian": "The tablets reflect God's covenantal faithfulness and the importance of covenant.",
    "Pentecostal": "The tablets demonstrate God's law and the need for spiritual faith in covenant.",
    "Anglican": "The tablets represent God's law and the need for faithful service in covenant.",
    "Orthodox": "The tablets reflect the Orthodox understanding of God's law and the importance of covenant."
  }
} 