{
  "chapterSummary": {
    "General": "Exodus 35 describes the gathering of materials and workers for the tabernacle. The chapter emphasizes God's provision, the importance of willing service, and the community's participation in worship.",
    "Non-Denominational": "Exodus 35 presents the gathering of materials and workers for the tabernacle. This demonstrates God's provision, the importance of willing service, and the community's participation in worship.",
    "Baptist": "Exodus 35 recounts the gathering of materials and workers for the tabernacle. This reveals God's provision, the importance of willing service, and the community's participation in biblical worship.",
    "Catholic": "Exodus 35 contains the gathering of materials and workers for the tabernacle. The Catholic interpretation emphasizes God's provision, the importance of willing service, and the community's participation in sacramental worship.",
    "Methodist": "Exodus 35 presents the gathering of materials and workers for the tabernacle. This shows God's provision, the importance of willing service, and the community's participation in faithful worship.",
    "Lutheran": "Exodus 35 recounts the gathering of materials and workers for the tabernacle. This reveals God's provision, the importance of willing service, and the community's participation in biblical worship.",
    "Presbyterian": "Exodus 35 contains the gathering of materials and workers for the tabernacle. This establishes God's provision, the importance of willing service, and the community's participation in covenantal worship.",
    "Pentecostal": "Exodus 35 presents the gathering of materials and workers for the tabernacle. This teaches about God's provision, the importance of willing service, and the community's participation in spiritual worship.",
    "Anglican": "Exodus 35 recounts the gathering of materials and workers for the tabernacle. This demonstrates God's provision, the importance of willing service, and the community's participation in faithful worship.",
    "Orthodox": "Exodus 35 contains the gathering of materials and workers for the tabernacle. The Orthodox Church interprets this as showing God's provision, the importance of willing service, and the community's participation in sacramental worship."
  },
  "1": {
    "General": "Moses' assembly reflects God's authority and the importance of community.",
    "Non-Denominational": "Moses' assembly demonstrates God's authority and the importance of community.",
    "Baptist": "Moses' assembly represents God's authority and the importance of biblical community.",
    "Catholic": "Moses' assembly reflects the Catholic understanding of God's authority and the importance of sacramental community.",
    "Methodist": "Moses' assembly demonstrates God's authority and the need for faithful community.",
    "Lutheran": "Moses' assembly represents God's authority and the importance of biblical community.",
    "Presbyterian": "Moses' assembly reflects God's authority and the importance of covenantal community.",
    "Pentecostal": "Moses' assembly demonstrates God's authority and the need for spiritual community.",
    "Anglican": "Moses' assembly represents God's authority and the need for faithful community.",
    "Orthodox": "Moses' assembly reflects the Orthodox understanding of God's authority and the importance of sacramental community."
  },
  "2": {
    "General": "The Sabbath command reflects God's rest and the importance of worship.",
    "Non-Denominational": "The Sabbath command demonstrates God's rest and the importance of worship.",
    "Baptist": "The Sabbath command represents God's rest and the importance of biblical worship.",
    "Catholic": "The Sabbath command reflects the Catholic understanding of God's rest and the importance of sacramental worship.",
    "Methodist": "The Sabbath command demonstrates God's rest and the need for faithful worship.",
    "Lutheran": "The Sabbath command represents God's rest and the importance of biblical worship.",
    "Presbyterian": "The Sabbath command reflects God's rest and the importance of covenantal worship.",
    "Pentecostal": "The Sabbath command demonstrates God's rest and the need for spiritual worship.",
    "Anglican": "The Sabbath command represents God's rest and the need for faithful worship.",
    "Orthodox": "The Sabbath command reflects the Orthodox understanding of God's rest and the importance of sacramental worship."
  },
  "3": {
    "General": "The fire prohibition reflects God's holiness and the importance of rest.",
    "Non-Denominational": "The fire prohibition demonstrates God's holiness and the importance of rest.",
    "Baptist": "The fire prohibition represents God's holiness and the importance of biblical rest.",
    "Catholic": "The fire prohibition reflects the Catholic understanding of God's holiness and the importance of sacramental rest.",
    "Methodist": "The fire prohibition demonstrates God's holiness and the need for faithful rest.",
    "Lutheran": "The fire prohibition represents God's holiness and the importance of biblical rest.",
    "Presbyterian": "The fire prohibition reflects God's holiness and the importance of covenantal rest.",
    "Pentecostal": "The fire prohibition demonstrates God's holiness and the need for spiritual rest.",
    "Anglican": "The fire prohibition represents God's holiness and the need for faithful rest.",
    "Orthodox": "The fire prohibition reflects the Orthodox understanding of God's holiness and the importance of sacramental rest."
  },
  "4": {
    "General": "Moses' command reflects God's provision and the importance of giving.",
    "Non-Denominational": "Moses' command demonstrates God's provision and the importance of giving.",
    "Baptist": "Moses' command represents God's provision and the importance of biblical giving.",
    "Catholic": "Moses' command reflects the Catholic understanding of God's provision and the importance of sacramental giving.",
    "Methodist": "Moses' command demonstrates God's provision and the need for faithful giving.",
    "Lutheran": "Moses' command represents God's provision and the importance of biblical giving.",
    "Presbyterian": "Moses' command reflects God's provision and the importance of covenantal giving.",
    "Pentecostal": "Moses' command demonstrates God's provision and the need for spiritual giving.",
    "Anglican": "Moses' command represents God's provision and the need for faithful giving.",
    "Orthodox": "Moses' command reflects the Orthodox understanding of God's provision and the importance of sacramental giving."
  },
  "5": {
    "General": "The offering reflects God's holiness and the importance of sacrifice.",
    "Non-Denominational": "The offering demonstrates God's holiness and the importance of sacrifice.",
    "Baptist": "The offering represents God's holiness and the importance of biblical sacrifice.",
    "Catholic": "The offering reflects the Catholic understanding of God's holiness and the importance of sacramental sacrifice.",
    "Methodist": "The offering demonstrates God's holiness and the need for faithful sacrifice.",
    "Lutheran": "The offering represents God's holiness and the importance of biblical sacrifice.",
    "Presbyterian": "The offering reflects God's holiness and the importance of covenantal sacrifice.",
    "Pentecostal": "The offering demonstrates God's holiness and the need for spiritual sacrifice.",
    "Anglican": "The offering represents God's holiness and the need for faithful sacrifice.",
    "Orthodox": "The offering reflects the Orthodox understanding of God's holiness and the importance of sacramental sacrifice."
  },
  "6": {
    "General": "The materials reflect God's beauty and the importance of excellence.",
    "Non-Denominational": "The materials demonstrate God's beauty and the importance of excellence.",
    "Baptist": "The materials represent God's beauty and the importance of biblical excellence.",
    "Catholic": "The materials reflect the Catholic understanding of God's beauty and the importance of sacramental excellence.",
    "Methodist": "The materials demonstrate God's beauty and the need for faithful excellence.",
    "Lutheran": "The materials represent God's beauty and the importance of biblical excellence.",
    "Presbyterian": "The materials reflect God's beauty and the importance of covenantal excellence.",
    "Pentecostal": "The materials demonstrate God's beauty and the need for spiritual excellence.",
    "Anglican": "The materials represent God's beauty and the need for faithful excellence.",
    "Orthodox": "The materials reflect the Orthodox understanding of God's beauty and the importance of sacramental excellence."
  },
  "7": {
    "General": "The skins reflect God's provision and the importance of covering.",
    "Non-Denominational": "The skins demonstrate God's provision and the importance of covering.",
    "Baptist": "The skins represent God's provision and the importance of biblical covering.",
    "Catholic": "The skins reflect the Catholic understanding of God's provision and the importance of sacramental covering.",
    "Methodist": "The skins demonstrate God's provision and the need for faithful covering.",
    "Lutheran": "The skins represent God's provision and the importance of biblical covering.",
    "Presbyterian": "The skins reflect God's provision and the importance of covenantal covering.",
    "Pentecostal": "The skins demonstrate God's provision and the need for spiritual covering.",
    "Anglican": "The skins represent God's provision and the need for faithful covering.",
    "Orthodox": "The skins reflect the Orthodox understanding of God's provision and the importance of sacramental covering."
  },
  "8": {
    "General": "The oil reflects God's presence and the importance of anointing.",
    "Non-Denominational": "The oil demonstrates God's presence and the importance of anointing.",
    "Baptist": "The oil represents God's presence and the importance of biblical anointing.",
    "Catholic": "The oil reflects the Catholic understanding of God's presence and the importance of sacramental anointing.",
    "Methodist": "The oil demonstrates God's presence and the need for faithful anointing.",
    "Lutheran": "The oil represents God's presence and the importance of biblical anointing.",
    "Presbyterian": "The oil reflects God's presence and the importance of covenantal anointing.",
    "Pentecostal": "The oil demonstrates God's presence and the need for spiritual anointing.",
    "Anglican": "The oil represents God's presence and the need for faithful anointing.",
    "Orthodox": "The oil reflects the Orthodox understanding of God's presence and the importance of sacramental anointing."
  },
  "9": {
    "General": "The stones reflect God's beauty and the importance of foundation.",
    "Non-Denominational": "The stones demonstrate God's beauty and the importance of foundation.",
    "Baptist": "The stones represent God's beauty and the importance of biblical foundation.",
    "Catholic": "The stones reflect the Catholic understanding of God's beauty and the importance of sacramental foundation.",
    "Methodist": "The stones demonstrate God's beauty and the need for faithful foundation.",
    "Lutheran": "The stones represent God's beauty and the importance of biblical foundation.",
    "Presbyterian": "The stones reflect God's beauty and the importance of covenantal foundation.",
    "Pentecostal": "The stones demonstrate God's beauty and the need for spiritual foundation.",
    "Anglican": "The stones represent God's beauty and the need for faithful foundation.",
    "Orthodox": "The stones reflect the Orthodox understanding of God's beauty and the importance of sacramental foundation."
  },
  "10": {
    "General": "The craftsmen reflect God's wisdom and the importance of skill.",
    "Non-Denominational": "The craftsmen demonstrate God's wisdom and the importance of skill.",
    "Baptist": "The craftsmen represent God's wisdom and the importance of biblical skill.",
    "Catholic": "The craftsmen reflect the Catholic understanding of God's wisdom and the importance of sacramental skill.",
    "Methodist": "The craftsmen demonstrate God's wisdom and the need for faithful skill.",
    "Lutheran": "The craftsmen represent God's wisdom and the importance of biblical skill.",
    "Presbyterian": "The craftsmen reflect God's wisdom and the importance of covenantal skill.",
    "Pentecostal": "The craftsmen demonstrate God's wisdom and the need for spiritual skill.",
    "Anglican": "The craftsmen represent God's wisdom and the need for faithful skill.",
    "Orthodox": "The craftsmen reflect the Orthodox understanding of God's wisdom and the importance of sacramental skill."
  },
  "11": {
    "General": "The tabernacle reflects God's dwelling and the importance of worship.",
    "Non-Denominational": "The tabernacle demonstrates God's dwelling and the importance of worship.",
    "Baptist": "The tabernacle represents God's dwelling and the importance of biblical worship.",
    "Catholic": "The tabernacle reflects the Catholic understanding of God's dwelling and the importance of sacramental worship.",
    "Methodist": "The tabernacle demonstrates God's dwelling and the need for faithful worship.",
    "Lutheran": "The tabernacle represents God's dwelling and the importance of biblical worship.",
    "Presbyterian": "The tabernacle reflects God's dwelling and the importance of covenantal worship.",
    "Pentecostal": "The tabernacle demonstrates God's dwelling and the need for spiritual worship.",
    "Anglican": "The tabernacle represents God's dwelling and the need for faithful worship.",
    "Orthodox": "The tabernacle reflects the Orthodox understanding of God's dwelling and the importance of sacramental worship."
  },
  "12": {
    "General": "The ark reflects God's presence and the importance of covenant.",
    "Non-Denominational": "The ark demonstrates God's presence and the importance of covenant.",
    "Baptist": "The ark represents God's presence and the importance of biblical covenant.",
    "Catholic": "The ark reflects the Catholic understanding of God's presence and the importance of sacramental covenant.",
    "Methodist": "The ark demonstrates God's presence and the need for faithful covenant.",
    "Lutheran": "The ark represents God's presence and the importance of biblical covenant.",
    "Presbyterian": "The ark reflects God's presence and the importance of covenantal relationship.",
    "Pentecostal": "The ark demonstrates God's presence and the need for spiritual covenant.",
    "Anglican": "The ark represents God's presence and the need for faithful covenant.",
    "Orthodox": "The ark reflects the Orthodox understanding of God's presence and the importance of sacramental covenant."
  },
  "13": {
    "General": "The table reflects God's provision and the importance of fellowship.",
    "Non-Denominational": "The table demonstrates God's provision and the importance of fellowship.",
    "Baptist": "The table represents God's provision and the importance of biblical fellowship.",
    "Catholic": "The table reflects the Catholic understanding of God's provision and the importance of sacramental fellowship.",
    "Methodist": "The table demonstrates God's provision and the need for faithful fellowship.",
    "Lutheran": "The table represents God's provision and the importance of biblical fellowship.",
    "Presbyterian": "The table reflects God's provision and the importance of covenantal fellowship.",
    "Pentecostal": "The table demonstrates God's provision and the need for spiritual fellowship.",
    "Anglican": "The table represents God's provision and the need for faithful fellowship.",
    "Orthodox": "The table reflects the Orthodox understanding of God's provision and the importance of sacramental fellowship."
  },
  "14": {
    "General": "The lampstand reflects God's light and the importance of illumination.",
    "Non-Denominational": "The lampstand demonstrates God's light and the importance of illumination.",
    "Baptist": "The lampstand represents God's light and the importance of biblical illumination.",
    "Catholic": "The lampstand reflects the Catholic understanding of God's light and the importance of sacramental illumination.",
    "Methodist": "The lampstand demonstrates God's light and the need for faithful illumination.",
    "Lutheran": "The lampstand represents God's light and the importance of biblical illumination.",
    "Presbyterian": "The lampstand reflects God's light and the importance of covenantal illumination.",
    "Pentecostal": "The lampstand demonstrates God's light and the need for spiritual illumination.",
    "Anglican": "The lampstand represents God's light and the need for faithful illumination.",
    "Orthodox": "The lampstand reflects the Orthodox understanding of God's light and the importance of sacramental illumination."
  },
  "15": {
    "General": "The altar reflects God's holiness and the importance of sacrifice.",
    "Non-Denominational": "The altar demonstrates God's holiness and the importance of sacrifice.",
    "Baptist": "The altar represents God's holiness and the importance of biblical sacrifice.",
    "Catholic": "The altar reflects the Catholic understanding of God's holiness and the importance of sacramental sacrifice.",
    "Methodist": "The altar demonstrates God's holiness and the need for faithful sacrifice.",
    "Lutheran": "The altar represents God's holiness and the importance of biblical sacrifice.",
    "Presbyterian": "The altar reflects God's holiness and the importance of covenantal sacrifice.",
    "Pentecostal": "The altar demonstrates God's holiness and the need for spiritual sacrifice.",
    "Anglican": "The altar represents God's holiness and the need for faithful sacrifice.",
    "Orthodox": "The altar reflects the Orthodox understanding of God's holiness and the importance of sacramental sacrifice."
  },
  "16": {
    "General": "The courtyard reflects God's presence and the importance of separation.",
    "Non-Denominational": "The courtyard demonstrates God's presence and the importance of separation.",
    "Baptist": "The courtyard represents God's presence and the importance of biblical separation.",
    "Catholic": "The courtyard reflects the Catholic understanding of God's presence and the importance of sacramental separation.",
    "Methodist": "The courtyard demonstrates God's presence and the need for faithful separation.",
    "Lutheran": "The courtyard represents God's presence and the importance of biblical separation.",
    "Presbyterian": "The courtyard reflects God's presence and the importance of covenantal separation.",
    "Pentecostal": "The courtyard demonstrates God's presence and the need for spiritual separation.",
    "Anglican": "The courtyard represents God's presence and the need for faithful separation.",
    "Orthodox": "The courtyard reflects the Orthodox understanding of God's presence and the importance of sacramental separation."
  },
  "17": {
    "General": "The curtains reflect God's beauty and the importance of covering.",
    "Non-Denominational": "The curtains demonstrate God's beauty and the importance of covering.",
    "Baptist": "The curtains represent God's beauty and the importance of biblical covering.",
    "Catholic": "The curtains reflect the Catholic understanding of God's beauty and the importance of sacramental covering.",
    "Methodist": "The curtains demonstrate God's beauty and the need for faithful covering.",
    "Lutheran": "The curtains represent God's beauty and the importance of biblical covering.",
    "Presbyterian": "The curtains reflect God's beauty and the importance of covenantal covering.",
    "Pentecostal": "The curtains demonstrate God's beauty and the need for spiritual covering.",
    "Anglican": "The curtains represent God's beauty and the need for faithful covering.",
    "Orthodox": "The curtains reflect the Orthodox understanding of God's beauty and the importance of sacramental covering."
  },
  "18": {
    "General": "The pegs reflect God's stability and the importance of foundation.",
    "Non-Denominational": "The pegs demonstrate God's stability and the importance of foundation.",
    "Baptist": "The pegs represent God's stability and the importance of biblical foundation.",
    "Catholic": "The pegs reflect the Catholic understanding of God's stability and the importance of sacramental foundation.",
    "Methodist": "The pegs demonstrate God's stability and the need for faithful foundation.",
    "Lutheran": "The pegs represent God's stability and the importance of biblical foundation.",
    "Presbyterian": "The pegs reflect God's stability and the importance of covenantal foundation.",
    "Pentecostal": "The pegs demonstrate God's stability and the need for spiritual foundation.",
    "Anglican": "The pegs represent God's stability and the need for faithful foundation.",
    "Orthodox": "The pegs reflect the Orthodox understanding of God's stability and the importance of sacramental foundation."
  },
  "19": {
    "General": "The garments reflect God's holiness and the importance of consecration.",
    "Non-Denominational": "The garments demonstrate God's holiness and the importance of consecration.",
    "Baptist": "The garments represent God's holiness and the importance of biblical consecration.",
    "Catholic": "The garments reflect the Catholic understanding of God's holiness and the importance of sacramental consecration.",
    "Methodist": "The garments demonstrate God's holiness and the need for faithful consecration.",
    "Lutheran": "The garments represent God's holiness and the importance of biblical consecration.",
    "Presbyterian": "The garments reflect God's holiness and the importance of covenantal consecration.",
    "Pentecostal": "The garments demonstrate God's holiness and the need for spiritual consecration.",
    "Anglican": "The garments represent God's holiness and the need for faithful consecration.",
    "Orthodox": "The garments reflect the Orthodox understanding of God's holiness and the importance of sacramental consecration."
  },
  "20": {
    "General": "The people's departure reflects God's command and the importance of obedience.",
    "Non-Denominational": "The people's departure demonstrates God's command and the importance of obedience.",
    "Baptist": "The people's departure represents God's command and the importance of biblical obedience.",
    "Catholic": "The people's departure reflects the Catholic understanding of God's command and the importance of sacramental obedience.",
    "Methodist": "The people's departure demonstrates God's command and the need for faithful obedience.",
    "Lutheran": "The people's departure represents God's command and the importance of biblical obedience.",
    "Presbyterian": "The people's departure reflects God's command and the importance of covenantal obedience.",
    "Pentecostal": "The people's departure demonstrates God's command and the need for spiritual obedience.",
    "Anglican": "The people's departure represents God's command and the need for faithful obedience.",
    "Orthodox": "The people's departure reflects the Orthodox understanding of God's command and the importance of sacramental obedience."
  },
  "21": {
    "General": "The people's offering reflects God's provision and the importance of generosity.",
    "Non-Denominational": "The people's offering demonstrates God's provision and the importance of generosity.",
    "Baptist": "The people's offering represents God's provision and the importance of biblical generosity.",
    "Catholic": "The people's offering reflects the Catholic understanding of God's provision and the importance of sacramental generosity.",
    "Methodist": "The people's offering demonstrates God's provision and the need for faithful generosity.",
    "Lutheran": "The people's offering represents God's provision and the importance of biblical generosity.",
    "Presbyterian": "The people's offering reflects God's provision and the importance of covenantal generosity.",
    "Pentecostal": "The people's offering demonstrates God's provision and the need for spiritual generosity.",
    "Anglican": "The people's offering represents God's provision and the need for faithful generosity.",
    "Orthodox": "The people's offering reflects the Orthodox understanding of God's provision and the importance of sacramental generosity."
  },
  "22": {
    "General": "The men's offering reflects God's provision and the importance of sacrifice.",
    "Non-Denominational": "The men's offering demonstrates God's provision and the importance of sacrifice.",
    "Baptist": "The men's offering represents God's provision and the importance of biblical sacrifice.",
    "Catholic": "The men's offering reflects the Catholic understanding of God's provision and the importance of sacramental sacrifice.",
    "Methodist": "The men's offering demonstrates God's provision and the need for faithful sacrifice.",
    "Lutheran": "The men's offering represents God's provision and the importance of biblical sacrifice.",
    "Presbyterian": "The men's offering reflects God's provision and the importance of covenantal sacrifice.",
    "Pentecostal": "The men's offering demonstrates God's provision and the need for spiritual sacrifice.",
    "Anglican": "The men's offering represents God's provision and the need for faithful sacrifice.",
    "Orthodox": "The men's offering reflects the Orthodox understanding of God's provision and the importance of sacramental sacrifice."
  },
  "23": {
    "General": "The women's offering reflects God's provision and the importance of service.",
    "Non-Denominational": "The women's offering demonstrates God's provision and the importance of service.",
    "Baptist": "The women's offering represents God's provision and the importance of biblical service.",
    "Catholic": "The women's offering reflects the Catholic understanding of God's provision and the importance of sacramental service.",
    "Methodist": "The women's offering demonstrates God's provision and the need for faithful service.",
    "Lutheran": "The women's offering represents God's provision and the importance of biblical service.",
    "Presbyterian": "The women's offering reflects God's provision and the importance of covenantal service.",
    "Pentecostal": "The women's offering demonstrates God's provision and the need for spiritual service.",
    "Anglican": "The women's offering represents God's provision and the need for faithful service.",
    "Orthodox": "The women's offering reflects the Orthodox understanding of God's provision and the importance of sacramental service."
  },
  "24": {
    "General": "The rulers' offering reflects God's provision and the importance of leadership.",
    "Non-Denominational": "The rulers' offering demonstrates God's provision and the importance of leadership.",
    "Baptist": "The rulers' offering represents God's provision and the importance of biblical leadership.",
    "Catholic": "The rulers' offering reflects the Catholic understanding of God's provision and the importance of sacramental leadership.",
    "Methodist": "The rulers' offering demonstrates God's provision and the need for faithful leadership.",
    "Lutheran": "The rulers' offering represents God's provision and the importance of biblical leadership.",
    "Presbyterian": "The rulers' offering reflects God's provision and the importance of covenantal leadership.",
    "Pentecostal": "The rulers' offering demonstrates God's provision and the need for spiritual leadership.",
    "Anglican": "The rulers' offering represents God's provision and the need for faithful leadership.",
    "Orthodox": "The rulers' offering reflects the Orthodox understanding of God's provision and the importance of sacramental leadership."
  },
  "25": {
    "General": "The women's skill reflects God's wisdom and the importance of craftsmanship.",
    "Non-Denominational": "The women's skill demonstrates God's wisdom and the importance of craftsmanship.",
    "Baptist": "The women's skill represents God's wisdom and the importance of biblical craftsmanship.",
    "Catholic": "The women's skill reflects the Catholic understanding of God's wisdom and the importance of sacramental craftsmanship.",
    "Methodist": "The women's skill demonstrates God's wisdom and the need for faithful craftsmanship.",
    "Lutheran": "The women's skill represents God's wisdom and the importance of biblical craftsmanship.",
    "Presbyterian": "The women's skill reflects God's wisdom and the importance of covenantal craftsmanship.",
    "Pentecostal": "The women's skill demonstrates God's wisdom and the need for spiritual craftsmanship.",
    "Anglican": "The women's skill represents God's wisdom and the need for faithful craftsmanship.",
    "Orthodox": "The women's skill reflects the Orthodox understanding of God's wisdom and the importance of sacramental craftsmanship."
  },
  "26": {
    "General": "The women's offering reflects God's provision and the importance of service.",
    "Non-Denominational": "The women's offering demonstrates God's provision and the importance of service.",
    "Baptist": "The women's offering represents God's provision and the importance of biblical service.",
    "Catholic": "The women's offering reflects the Catholic understanding of God's provision and the importance of sacramental service.",
    "Methodist": "The women's offering demonstrates God's provision and the need for faithful service.",
    "Lutheran": "The women's offering represents God's provision and the importance of biblical service.",
    "Presbyterian": "The women's offering reflects God's provision and the importance of covenantal service.",
    "Pentecostal": "The women's offering demonstrates God's provision and the need for spiritual service.",
    "Anglican": "The women's offering represents God's provision and the need for faithful service.",
    "Orthodox": "The women's offering reflects the Orthodox understanding of God's provision and the importance of sacramental service."
  },
  "27": {
    "General": "The rulers' offering reflects God's provision and the importance of leadership.",
    "Non-Denominational": "The rulers' offering demonstrates God's provision and the importance of leadership.",
    "Baptist": "The rulers' offering represents God's provision and the importance of biblical leadership.",
    "Catholic": "The rulers' offering reflects the Catholic understanding of God's provision and the importance of sacramental leadership.",
    "Methodist": "The rulers' offering demonstrates God's provision and the need for faithful leadership.",
    "Lutheran": "The rulers' offering represents God's provision and the importance of biblical leadership.",
    "Presbyterian": "The rulers' offering reflects God's provision and the importance of covenantal leadership.",
    "Pentecostal": "The rulers' offering demonstrates God's provision and the need for spiritual leadership.",
    "Anglican": "The rulers' offering represents God's provision and the need for faithful leadership.",
    "Orthodox": "The rulers' offering reflects the Orthodox understanding of God's provision and the importance of sacramental leadership."
  },
  "28": {
    "General": "The spices reflect God's beauty and the importance of worship.",
    "Non-Denominational": "The spices demonstrate God's beauty and the importance of worship.",
    "Baptist": "The spices represent God's beauty and the importance of biblical worship.",
    "Catholic": "The spices reflect the Catholic understanding of God's beauty and the importance of sacramental worship.",
    "Methodist": "The spices demonstrate God's beauty and the need for faithful worship.",
    "Lutheran": "The spices represent God's beauty and the importance of biblical worship.",
    "Presbyterian": "The spices reflect God's beauty and the importance of covenantal worship.",
    "Pentecostal": "The spices demonstrate God's beauty and the need for spiritual worship.",
    "Anglican": "The spices represent God's beauty and the need for faithful worship.",
    "Orthodox": "The spices reflect the Orthodox understanding of God's beauty and the importance of sacramental worship."
  },
  "29": {
    "General": "The people's offering reflects God's provision and the importance of generosity.",
    "Non-Denominational": "The people's offering demonstrates God's provision and the importance of generosity.",
    "Baptist": "The people's offering represents God's provision and the importance of biblical generosity.",
    "Catholic": "The people's offering reflects the Catholic understanding of God's provision and the importance of sacramental generosity.",
    "Methodist": "The people's offering demonstrates God's provision and the need for faithful generosity.",
    "Lutheran": "The people's offering represents God's provision and the importance of biblical generosity.",
    "Presbyterian": "The people's offering reflects God's provision and the importance of covenantal generosity.",
    "Pentecostal": "The people's offering demonstrates God's provision and the need for spiritual generosity.",
    "Anglican": "The people's offering represents God's provision and the need for faithful generosity.",
    "Orthodox": "The people's offering reflects the Orthodox understanding of God's provision and the importance of sacramental generosity."
  },
  "30": {
    "General": "Bezalel's calling reflects God's wisdom and the importance of craftsmanship.",
    "Non-Denominational": "Bezalel's calling demonstrates God's wisdom and the importance of craftsmanship.",
    "Baptist": "Bezalel's calling represents God's wisdom and the importance of biblical craftsmanship.",
    "Catholic": "Bezalel's calling reflects the Catholic understanding of God's wisdom and the importance of sacramental craftsmanship.",
    "Methodist": "Bezalel's calling demonstrates God's wisdom and the need for faithful craftsmanship.",
    "Lutheran": "Bezalel's calling represents God's wisdom and the importance of biblical craftsmanship.",
    "Presbyterian": "Bezalel's calling reflects God's wisdom and the importance of covenantal craftsmanship.",
    "Pentecostal": "Bezalel's calling demonstrates God's wisdom and the need for spiritual craftsmanship.",
    "Anglican": "Bezalel's calling represents God's wisdom and the need for faithful craftsmanship.",
    "Orthodox": "Bezalel's calling reflects the Orthodox understanding of God's wisdom and the importance of sacramental craftsmanship."
  },
  "31": {
    "General": "Bezalel's skill reflects God's wisdom and the importance of craftsmanship.",
    "Non-Denominational": "Bezalel's skill demonstrates God's wisdom and the importance of craftsmanship.",
    "Baptist": "Bezalel's skill represents God's wisdom and the importance of biblical craftsmanship.",
    "Catholic": "Bezalel's skill reflects the Catholic understanding of God's wisdom and the importance of sacramental craftsmanship.",
    "Methodist": "Bezalel's skill demonstrates God's wisdom and the need for faithful craftsmanship.",
    "Lutheran": "Bezalel's skill represents God's wisdom and the importance of biblical craftsmanship.",
    "Presbyterian": "Bezalel's skill reflects God's wisdom and the importance of covenantal craftsmanship.",
    "Pentecostal": "Bezalel's skill demonstrates God's wisdom and the need for spiritual craftsmanship.",
    "Anglican": "Bezalel's skill represents God's wisdom and the need for faithful craftsmanship.",
    "Orthodox": "Bezalel's skill reflects the Orthodox understanding of God's wisdom and the importance of sacramental craftsmanship."
  },
  "32": {
    "General": "Bezalel's ability reflects God's wisdom and the importance of craftsmanship.",
    "Non-Denominational": "Bezalel's ability demonstrates God's wisdom and the importance of craftsmanship.",
    "Baptist": "Bezalel's ability represents God's wisdom and the importance of biblical craftsmanship.",
    "Catholic": "Bezalel's ability reflects the Catholic understanding of God's wisdom and the importance of sacramental craftsmanship.",
    "Methodist": "Bezalel's ability demonstrates God's wisdom and the need for faithful craftsmanship.",
    "Lutheran": "Bezalel's ability represents God's wisdom and the importance of biblical craftsmanship.",
    "Presbyterian": "Bezalel's ability reflects God's wisdom and the importance of covenantal craftsmanship.",
    "Pentecostal": "Bezalel's ability demonstrates God's wisdom and the need for spiritual craftsmanship.",
    "Anglican": "Bezalel's ability represents God's wisdom and the need for faithful craftsmanship.",
    "Orthodox": "Bezalel's ability reflects the Orthodox understanding of God's wisdom and the importance of sacramental craftsmanship."
  },
  "33": {
    "General": "Bezalel's skill reflects God's wisdom and the importance of craftsmanship.",
    "Non-Denominational": "Bezalel's skill demonstrates God's wisdom and the importance of craftsmanship.",
    "Baptist": "Bezalel's skill represents God's wisdom and the importance of biblical craftsmanship.",
    "Catholic": "Bezalel's skill reflects the Catholic understanding of God's wisdom and the importance of sacramental craftsmanship.",
    "Methodist": "Bezalel's skill demonstrates God's wisdom and the need for faithful craftsmanship.",
    "Lutheran": "Bezalel's skill represents God's wisdom and the importance of biblical craftsmanship.",
    "Presbyterian": "Bezalel's skill reflects God's wisdom and the importance of covenantal craftsmanship.",
    "Pentecostal": "Bezalel's skill demonstrates God's wisdom and the need for spiritual craftsmanship.",
    "Anglican": "Bezalel's skill represents God's wisdom and the need for faithful craftsmanship.",
    "Orthodox": "Bezalel's skill reflects the Orthodox understanding of God's wisdom and the importance of sacramental craftsmanship."
  },
  "34": {
    "General": "Bezalel's teaching reflects God's wisdom and the importance of instruction.",
    "Non-Denominational": "Bezalel's teaching demonstrates God's wisdom and the importance of instruction.",
    "Baptist": "Bezalel's teaching represents God's wisdom and the importance of biblical instruction.",
    "Catholic": "Bezalel's teaching reflects the Catholic understanding of God's wisdom and the importance of sacramental instruction.",
    "Methodist": "Bezalel's teaching demonstrates God's wisdom and the need for faithful instruction.",
    "Lutheran": "Bezalel's teaching represents God's wisdom and the importance of biblical instruction.",
    "Presbyterian": "Bezalel's teaching reflects God's wisdom and the importance of covenantal instruction.",
    "Pentecostal": "Bezalel's teaching demonstrates God's wisdom and the need for spiritual instruction.",
    "Anglican": "Bezalel's teaching represents God's wisdom and the need for faithful instruction.",
    "Orthodox": "Bezalel's teaching reflects the Orthodox understanding of God's wisdom and the importance of sacramental instruction."
  },
  "35": {
    "General": "The craftsmen's work reflects God's wisdom and the importance of craftsmanship.",
    "Non-Denominational": "The craftsmen's work demonstrates God's wisdom and the importance of craftsmanship.",
    "Baptist": "The craftsmen's work represents God's wisdom and the importance of biblical craftsmanship.",
    "Catholic": "The craftsmen's work reflects the Catholic understanding of God's wisdom and the importance of sacramental craftsmanship.",
    "Methodist": "The craftsmen's work demonstrates God's wisdom and the need for faithful craftsmanship.",
    "Lutheran": "The craftsmen's work represents God's wisdom and the importance of biblical craftsmanship.",
    "Presbyterian": "The craftsmen's work reflects God's wisdom and the importance of covenantal craftsmanship.",
    "Pentecostal": "The craftsmen's work demonstrates God's wisdom and the need for spiritual craftsmanship.",
    "Anglican": "The craftsmen's work represents God's wisdom and the need for faithful craftsmanship.",
    "Orthodox": "The craftsmen's work reflects the Orthodox understanding of God's wisdom and the importance of sacramental craftsmanship."
  }
} 