{
  "chapterSummary": {
    "General": "Exodus 36 describes the construction of the tabernacle. The chapter emphasizes God's wisdom, the importance of craftsmanship, and the people's generous contributions to the work.",
    "Non-Denominational": "Exodus 36 presents the construction of the tabernacle. This demonstrates God's wisdom, the importance of craftsmanship, and the people's generous contributions to the work.",
    "Baptist": "Exodus 36 recounts the construction of the tabernacle. This reveals God's wisdom, the importance of craftsmanship, and the people's generous contributions to biblical worship.",
    "Catholic": "Exodus 36 contains the construction of the tabernacle. The Catholic interpretation emphasizes God's wisdom, the importance of craftsmanship, and the people's generous contributions to sacramental worship.",
    "Methodist": "Exodus 36 presents the construction of the tabernacle. This shows God's wisdom, the importance of craftsmanship, and the people's generous contributions to faithful worship.",
    "Lutheran": "Exodus 36 recounts the construction of the tabernacle. This reveals God's wisdom, the importance of craftsmanship, and the people's generous contributions to biblical worship.",
    "Presbyterian": "Exodus 36 contains the construction of the tabernacle. This establishes God's wisdom, the importance of craftsmanship, and the people's generous contributions to covenantal worship.",
    "Pentecostal": "Exodus 36 presents the construction of the tabernacle. This teaches about God's wisdom, the importance of craftsmanship, and the people's generous contributions to spiritual worship.",
    "Anglican": "Exodus 36 recounts the construction of the tabernacle. This demonstrates God's wisdom, the importance of craftsmanship, and the people's generous contributions to faithful worship.",
    "Orthodox": "Exodus 36 contains the construction of the tabernacle. The Orthodox Church interprets this as showing God's wisdom, the importance of craftsmanship, and the people's generous contributions to sacramental worship."
  },
  "1": {
    "General": "Bezalel and Oholiab's work reflects God's wisdom and the importance of craftsmanship.",
    "Non-Denominational": "Bezalel and Oholiab's work demonstrates God's wisdom and the importance of craftsmanship.",
    "Baptist": "Bezalel and Oholiab's work represents God's wisdom and the importance of biblical craftsmanship.",
    "Catholic": "Bezalel and Oholiab's work reflects the Catholic understanding of God's wisdom and the importance of sacramental craftsmanship.",
    "Methodist": "Bezalel and Oholiab's work demonstrates God's wisdom and the need for faithful craftsmanship.",
    "Lutheran": "Bezalel and Oholiab's work represents God's wisdom and the importance of biblical craftsmanship.",
    "Presbyterian": "Bezalel and Oholiab's work reflects God's wisdom and the importance of covenantal craftsmanship.",
    "Pentecostal": "Bezalel and Oholiab's work demonstrates God's wisdom and the need for spiritual craftsmanship.",
    "Anglican": "Bezalel and Oholiab's work represents God's wisdom and the need for faithful craftsmanship.",
    "Orthodox": "Bezalel and Oholiab's work reflects the Orthodox understanding of God's wisdom and the importance of sacramental craftsmanship."
  },
  "2": {
    "General": "Moses' call reflects God's authority and the importance of leadership.",
    "Non-Denominational": "Moses' call demonstrates God's authority and the importance of leadership.",
    "Baptist": "Moses' call represents God's authority and the importance of biblical leadership.",
    "Catholic": "Moses' call reflects the Catholic understanding of God's authority and the importance of sacramental leadership.",
    "Methodist": "Moses' call demonstrates God's authority and the need for faithful leadership.",
    "Lutheran": "Moses' call represents God's authority and the importance of biblical leadership.",
    "Presbyterian": "Moses' call reflects God's authority and the importance of covenantal leadership.",
    "Pentecostal": "Moses' call demonstrates God's authority and the need for spiritual leadership.",
    "Anglican": "Moses' call represents God's authority and the need for faithful leadership.",
    "Orthodox": "Moses' call reflects the Orthodox understanding of God's authority and the importance of sacramental leadership."
  },
  "3": {
    "General": "The people's offering reflects God's provision and the importance of generosity.",
    "Non-Denominational": "The people's offering demonstrates God's provision and the importance of generosity.",
    "Baptist": "The people's offering represents God's provision and the importance of biblical generosity.",
    "Catholic": "The people's offering reflects the Catholic understanding of God's provision and the importance of sacramental generosity.",
    "Methodist": "The people's offering demonstrates God's provision and the need for faithful generosity.",
    "Lutheran": "The people's offering represents God's provision and the importance of biblical generosity.",
    "Presbyterian": "The people's offering reflects God's provision and the importance of covenantal generosity.",
    "Pentecostal": "The people's offering demonstrates God's provision and the need for spiritual generosity.",
    "Anglican": "The people's offering represents God's provision and the need for faithful generosity.",
    "Orthodox": "The people's offering reflects the Orthodox understanding of God's provision and the importance of sacramental generosity."
  },
  "4": {
    "General": "The craftsmen's work reflects God's wisdom and the importance of craftsmanship.",
    "Non-Denominational": "The craftsmen's work demonstrates God's wisdom and the importance of craftsmanship.",
    "Baptist": "The craftsmen's work represents God's wisdom and the importance of biblical craftsmanship.",
    "Catholic": "The craftsmen's work reflects the Catholic understanding of God's wisdom and the importance of sacramental craftsmanship.",
    "Methodist": "The craftsmen's work demonstrates God's wisdom and the need for faithful craftsmanship.",
    "Lutheran": "The craftsmen's work represents God's wisdom and the importance of biblical craftsmanship.",
    "Presbyterian": "The craftsmen's work reflects God's wisdom and the importance of covenantal craftsmanship.",
    "Pentecostal": "The craftsmen's work demonstrates God's wisdom and the need for spiritual craftsmanship.",
    "Anglican": "The craftsmen's work represents God's wisdom and the need for faithful craftsmanship.",
    "Orthodox": "The craftsmen's work reflects the Orthodox understanding of God's wisdom and the importance of sacramental craftsmanship."
  },
  "5": {
    "General": "The people's generosity reflects God's provision and the importance of giving.",
    "Non-Denominational": "The people's generosity demonstrates God's provision and the importance of giving.",
    "Baptist": "The people's generosity represents God's provision and the importance of biblical giving.",
    "Catholic": "The people's generosity reflects the Catholic understanding of God's provision and the importance of sacramental giving.",
    "Methodist": "The people's generosity demonstrates God's provision and the need for faithful giving.",
    "Lutheran": "The people's generosity represents God's provision and the importance of biblical giving.",
    "Presbyterian": "The people's generosity reflects God's provision and the importance of covenantal giving.",
    "Pentecostal": "The people's generosity demonstrates God's provision and the need for spiritual giving.",
    "Anglican": "The people's generosity represents God's provision and the need for faithful giving.",
    "Orthodox": "The people's generosity reflects the Orthodox understanding of God's provision and the importance of sacramental giving."
  },
  "6": {
    "General": "Moses' command reflects God's authority and the importance of obedience.",
    "Non-Denominational": "Moses' command demonstrates God's authority and the importance of obedience.",
    "Baptist": "Moses' command represents God's authority and the importance of biblical obedience.",
    "Catholic": "Moses' command reflects the Catholic understanding of God's authority and the importance of sacramental obedience.",
    "Methodist": "Moses' command demonstrates God's authority and the need for faithful obedience.",
    "Lutheran": "Moses' command represents God's authority and the importance of biblical obedience.",
    "Presbyterian": "Moses' command reflects God's authority and the importance of covenantal obedience.",
    "Pentecostal": "Moses' command demonstrates God's authority and the need for spiritual obedience.",
    "Anglican": "Moses' command represents God's authority and the need for faithful obedience.",
    "Orthodox": "Moses' command reflects the Orthodox understanding of God's authority and the importance of sacramental obedience."
  },
  "7": {
    "General": "The materials reflect God's provision and the importance of excellence.",
    "Non-Denominational": "The materials demonstrate God's provision and the importance of excellence.",
    "Baptist": "The materials represent God's provision and the importance of biblical excellence.",
    "Catholic": "The materials reflect the Catholic understanding of God's provision and the importance of sacramental excellence.",
    "Methodist": "The materials demonstrate God's provision and the need for faithful excellence.",
    "Lutheran": "The materials represent God's provision and the importance of biblical excellence.",
    "Presbyterian": "The materials reflect God's provision and the importance of covenantal excellence.",
    "Pentecostal": "The materials demonstrate God's provision and the need for spiritual excellence.",
    "Anglican": "The materials represent God's provision and the need for faithful excellence.",
    "Orthodox": "The materials reflect the Orthodox understanding of God's provision and the importance of sacramental excellence."
  },
  "8": {
    "General": "The curtains reflect God's beauty and the importance of covering.",
    "Non-Denominational": "The curtains demonstrate God's beauty and the importance of covering.",
    "Baptist": "The curtains represent God's beauty and the importance of biblical covering.",
    "Catholic": "The curtains reflect the Catholic understanding of God's beauty and the importance of sacramental covering.",
    "Methodist": "The curtains demonstrate God's beauty and the need for faithful covering.",
    "Lutheran": "The curtains represent God's beauty and the importance of biblical covering.",
    "Presbyterian": "The curtains reflect God's beauty and the importance of covenantal covering.",
    "Pentecostal": "The curtains demonstrate God's beauty and the need for spiritual covering.",
    "Anglican": "The curtains represent God's beauty and the need for faithful covering.",
    "Orthodox": "The curtains reflect the Orthodox understanding of God's beauty and the importance of sacramental covering."
  },
  "9": {
    "General": "The length reflects God's perfection and the importance of proportion.",
    "Non-Denominational": "The length demonstrates God's perfection and the importance of proportion.",
    "Baptist": "The length represents God's perfection and the importance of biblical proportion.",
    "Catholic": "The length reflects the Catholic understanding of God's perfection and the importance of sacramental proportion.",
    "Methodist": "The length demonstrates God's perfection and the need for faithful proportion.",
    "Lutheran": "The length represents God's perfection and the importance of biblical proportion.",
    "Presbyterian": "The length reflects God's perfection and the importance of covenantal proportion.",
    "Pentecostal": "The length demonstrates God's perfection and the need for spiritual proportion.",
    "Anglican": "The length represents God's perfection and the need for faithful proportion.",
    "Orthodox": "The length reflects the Orthodox understanding of God's perfection and the importance of sacramental proportion."
  },
  "10": {
    "General": "The loops reflect God's wisdom and the importance of connection.",
    "Non-Denominational": "The loops demonstrate God's wisdom and the importance of connection.",
    "Baptist": "The loops represent God's wisdom and the importance of biblical connection.",
    "Catholic": "The loops reflect the Catholic understanding of God's wisdom and the importance of sacramental connection.",
    "Methodist": "The loops demonstrate God's wisdom and the need for faithful connection.",
    "Lutheran": "The loops represent God's wisdom and the importance of biblical connection.",
    "Presbyterian": "The loops reflect God's wisdom and the importance of covenantal connection.",
    "Pentecostal": "The loops demonstrate God's wisdom and the need for spiritual connection.",
    "Anglican": "The loops represent God's wisdom and the need for faithful connection.",
    "Orthodox": "The loops reflect the Orthodox understanding of God's wisdom and the importance of sacramental connection."
  },
  "11": {
    "General": "The clasps reflect God's wisdom and the importance of unity.",
    "Non-Denominational": "The clasps demonstrate God's wisdom and the importance of unity.",
    "Baptist": "The clasps represent God's wisdom and the importance of biblical unity.",
    "Catholic": "The clasps reflect the Catholic understanding of God's wisdom and the importance of sacramental unity.",
    "Methodist": "The clasps demonstrate God's wisdom and the need for faithful unity.",
    "Lutheran": "The clasps represent God's wisdom and the importance of biblical unity.",
    "Presbyterian": "The clasps reflect God's wisdom and the importance of covenantal unity.",
    "Pentecostal": "The clasps demonstrate God's wisdom and the need for spiritual unity.",
    "Anglican": "The clasps represent God's wisdom and the need for faithful unity.",
    "Orthodox": "The clasps reflect the Orthodox understanding of God's wisdom and the importance of sacramental unity."
  },
  "12": {
    "General": "The curtains reflect God's beauty and the importance of covering.",
    "Non-Denominational": "The curtains demonstrate God's beauty and the importance of covering.",
    "Baptist": "The curtains represent God's beauty and the importance of biblical covering.",
    "Catholic": "The curtains reflect the Catholic understanding of God's beauty and the importance of sacramental covering.",
    "Methodist": "The curtains demonstrate God's beauty and the need for faithful covering.",
    "Lutheran": "The curtains represent God's beauty and the importance of biblical covering.",
    "Presbyterian": "The curtains reflect God's beauty and the importance of covenantal covering.",
    "Pentecostal": "The curtains demonstrate God's beauty and the need for spiritual covering.",
    "Anglican": "The curtains represent God's beauty and the need for faithful covering.",
    "Orthodox": "The curtains reflect the Orthodox understanding of God's beauty and the importance of sacramental covering."
  },
  "13": {
    "General": "The clasps reflect God's wisdom and the importance of unity.",
    "Non-Denominational": "The clasps demonstrate God's wisdom and the importance of unity.",
    "Baptist": "The clasps represent God's wisdom and the importance of biblical unity.",
    "Catholic": "The clasps reflect the Catholic understanding of God's wisdom and the importance of sacramental unity.",
    "Methodist": "The clasps demonstrate God's wisdom and the need for faithful unity.",
    "Lutheran": "The clasps represent God's wisdom and the importance of biblical unity.",
    "Presbyterian": "The clasps reflect God's wisdom and the importance of covenantal unity.",
    "Pentecostal": "The clasps demonstrate God's wisdom and the need for spiritual unity.",
    "Anglican": "The clasps represent God's wisdom and the need for faithful unity.",
    "Orthodox": "The clasps reflect the Orthodox understanding of God's wisdom and the importance of sacramental unity."
  },
  "14": {
    "General": "The covering reflects God's protection and the importance of shelter.",
    "Non-Denominational": "The covering demonstrates God's protection and the importance of shelter.",
    "Baptist": "The covering represents God's protection and the importance of biblical shelter.",
    "Catholic": "The covering reflects the Catholic understanding of God's protection and the importance of sacramental shelter.",
    "Methodist": "The covering demonstrates God's protection and the need for faithful shelter.",
    "Lutheran": "The covering represents God's protection and the importance of biblical shelter.",
    "Presbyterian": "The covering reflects God's protection and the importance of covenantal shelter.",
    "Pentecostal": "The covering demonstrates God's protection and the need for spiritual shelter.",
    "Anglican": "The covering represents God's protection and the need for faithful shelter.",
    "Orthodox": "The covering reflects the Orthodox understanding of God's protection and the importance of sacramental shelter."
  },
  "15": {
    "General": "The boards reflect God's stability and the importance of foundation.",
    "Non-Denominational": "The boards demonstrate God's stability and the importance of foundation.",
    "Baptist": "The boards represent God's stability and the importance of biblical foundation.",
    "Catholic": "The boards reflect the Catholic understanding of God's stability and the importance of sacramental foundation.",
    "Methodist": "The boards demonstrate God's stability and the need for faithful foundation.",
    "Lutheran": "The boards represent God's stability and the importance of biblical foundation.",
    "Presbyterian": "The boards reflect God's stability and the importance of covenantal foundation.",
    "Pentecostal": "The boards demonstrate God's stability and the need for spiritual foundation.",
    "Anglican": "The boards represent God's stability and the need for faithful foundation.",
    "Orthodox": "The boards reflect the Orthodox understanding of God's stability and the importance of sacramental foundation."
  },
  "16": {
    "General": "The length reflects God's perfection and the importance of proportion.",
    "Non-Denominational": "The length demonstrates God's perfection and the importance of proportion.",
    "Baptist": "The length represents God's perfection and the importance of biblical proportion.",
    "Catholic": "The length reflects the Catholic understanding of God's perfection and the importance of sacramental proportion.",
    "Methodist": "The length demonstrates God's perfection and the need for faithful proportion.",
    "Lutheran": "The length represents God's perfection and the importance of biblical proportion.",
    "Presbyterian": "The length reflects God's perfection and the importance of covenantal proportion.",
    "Pentecostal": "The length demonstrates God's perfection and the need for spiritual proportion.",
    "Anglican": "The length represents God's perfection and the need for faithful proportion.",
    "Orthodox": "The length reflects the Orthodox understanding of God's perfection and the importance of sacramental proportion."
  },
  "17": {
    "General": "The tenons reflect God's wisdom and the importance of connection.",
    "Non-Denominational": "The tenons demonstrate God's wisdom and the importance of connection.",
    "Baptist": "The tenons represent God's wisdom and the importance of biblical connection.",
    "Catholic": "The tenons reflect the Catholic understanding of God's wisdom and the importance of sacramental connection.",
    "Methodist": "The tenons demonstrate God's wisdom and the need for faithful connection.",
    "Lutheran": "The tenons represent God's wisdom and the importance of biblical connection.",
    "Presbyterian": "The tenons reflect God's wisdom and the importance of covenantal connection.",
    "Pentecostal": "The tenons demonstrate God's wisdom and the need for spiritual connection.",
    "Anglican": "The tenons represent God's wisdom and the need for faithful connection.",
    "Orthodox": "The tenons reflect the Orthodox understanding of God's wisdom and the importance of sacramental connection."
  },
  "18": {
    "General": "The boards reflect God's stability and the importance of foundation.",
    "Non-Denominational": "The boards demonstrate God's stability and the importance of foundation.",
    "Baptist": "The boards represent God's stability and the importance of biblical foundation.",
    "Catholic": "The boards reflect the Catholic understanding of God's stability and the importance of sacramental foundation.",
    "Methodist": "The boards demonstrate God's stability and the need for faithful foundation.",
    "Lutheran": "The boards represent God's stability and the importance of biblical foundation.",
    "Presbyterian": "The boards reflect God's stability and the importance of covenantal foundation.",
    "Pentecostal": "The boards demonstrate God's stability and the need for spiritual foundation.",
    "Anglican": "The boards represent God's stability and the need for faithful foundation.",
    "Orthodox": "The boards reflect the Orthodox understanding of God's stability and the importance of sacramental foundation."
  },
  "19": {
    "General": "The covering reflects God's protection and the importance of shelter.",
    "Non-Denominational": "The covering demonstrates God's protection and the importance of shelter.",
    "Baptist": "The covering represents God's protection and the importance of biblical shelter.",
    "Catholic": "The covering reflects the Catholic understanding of God's protection and the importance of sacramental shelter.",
    "Methodist": "The covering demonstrates God's protection and the need for faithful shelter.",
    "Lutheran": "The covering represents God's protection and the importance of biblical shelter.",
    "Presbyterian": "The covering reflects God's protection and the importance of covenantal shelter.",
    "Pentecostal": "The covering demonstrates God's protection and the need for spiritual shelter.",
    "Anglican": "The covering represents God's protection and the need for faithful shelter.",
    "Orthodox": "The covering reflects the Orthodox understanding of God's protection and the importance of sacramental shelter."
  },
  "20": {
    "General": "The boards reflect God's stability and the importance of foundation.",
    "Non-Denominational": "The boards demonstrate God's stability and the importance of foundation.",
    "Baptist": "The boards represent God's stability and the importance of biblical foundation.",
    "Catholic": "The boards reflect the Catholic understanding of God's stability and the importance of sacramental foundation.",
    "Methodist": "The boards demonstrate God's stability and the need for faithful foundation.",
    "Lutheran": "The boards represent God's stability and the importance of biblical foundation.",
    "Presbyterian": "The boards reflect God's stability and the importance of covenantal foundation.",
    "Pentecostal": "The boards demonstrate God's stability and the need for spiritual foundation.",
    "Anglican": "The boards represent God's stability and the need for faithful foundation.",
    "Orthodox": "The boards reflect the Orthodox understanding of God's stability and the importance of sacramental foundation."
  }
} 