{
  "Summary": {
    "General": "Chapter 10 details the instructions for making and using two silver trumpets for signaling the assembly, coordinating the camps' movements, sounding alarms for war, and announcing festivals. It then narrates the Israelites' departure from Mount Sinai, led by the cloud and the Ark, following a specific marching order by tribe. Moses urges his brother-in-law Hobab to accompany them, and concludes with prayers uttered when the Ark set out and when it rested.",
    "Non-Denominational": "Focuses on God providing clear communication tools (trumpets) for order and worship, the beginning of the journey towards the Promised Land under God's direct guidance (cloud, Ark), the importance of community order, seeking human guidance (Hobab), and invoking God's presence and power for the journey.",
    "Baptist": "Emphasizes God's specific commands for signaling (trumpets), the commencement of the journey in obedience to God's word, the ordained order of the tribes, the reliance on God's presence (Ark, cloud) and prayer for progress and rest, and the practical wisdom in seeking helpful companions (Hobab).",
    "Catholic": "Highlights the liturgical use of trumpets for assembly, movement, and feasts, the priestly role (sons of Aaron) in sounding them, the departure from Sinai under divine signs (cloud, Ark), the structured march reflecting hierarchical order, Moses' invitation to Hobab, and the invocations for God's active presence and protection.",
    "Methodist": "Stresses God's provision for orderly community life (trumpets), the step of faith in leaving Sinai, the importance of following divine leading (cloud, Ark) and established order, the value of fellowship and guidance (Hobab), and dependence on God expressed through prayer (Moses' invocations).",
    "Lutheran": "Underscores God's commands establishing order through the trumpets (for assembly, travel, war, worship), the departure from Sinai as commanded, the journey guided by God's presence (cloud, Ark), the specific order of the tribes, and the prayers invoking God's power against enemies and His peaceful presence among His people."
  },
  "Verses": {
    "1": {
      "General": "The Lord speaks to Moses, initiating the instructions for the silver trumpets.",
      "Non-Denominational": "God directly communicates His will to Moses regarding the trumpets.",
      "Baptist": "Highlights the divine origin of the command for making the trumpets.",
      "Catholic": "Notes the divine instruction given to Moses concerning the sacred instruments (trumpets).",
      "Methodist": "Emphasizes God initiating the plan for the trumpets through revelation to Moses.",
      "Lutheran": "Points to God's direct word to Moses as the basis for the trumpet instructions."
    },
    "2": {
      "General": "Moses is commanded to make two trumpets of hammered silver for summoning the community and signaling the camps to move.",
      "Non-Denominational": "God provides practical tools (silver trumpets) for communication and organization within the large community.",
      "Baptist": "Specifies the materials and purpose of the trumpets: calling the assembly and directing movement.",
      "Catholic": "Details the divine mandate to craft two silver trumpets for specific liturgical and practical functions: assembly and decampment.",
      "Methodist": "Shows God providing tangible means for community coordination and signaling necessary actions.",
      "Lutheran": "God commands the creation of specific instruments (two hammered silver trumpets) for designated purposes related to community order."
    },
    "3": {
      "General": "When both trumpets are sounded together, the entire community is to gather at the entrance of the Tent of Meeting.",
      "Non-Denominational": "Establishes a clear signal (both trumpets) for the whole community to assemble for corporate gathering before God.",
      "Baptist": "Defines the signal for a full assembly of the congregation at the central place of worship.",
      "Catholic": "Specifies the signal (both trumpets) for convening the entire liturgical assembly at the Tabernacle entrance.",
      "Methodist": "Sets forth the signal for calling the whole community together for worship or important announcements.",
      "Lutheran": "Assigns a specific signal (both trumpets blown) to summon the entire congregation to the Tent of Meeting."
    },
    "4": {
      "General": "If only one trumpet is sounded, only the leaders (heads of the Israelite clans) are to assemble before Moses.",
      "Non-Denominational": "Provides a distinct signal (one trumpet) to call the leadership for consultation or instruction.",
      "Baptist": "Defines the signal specifically for summoning the tribal leaders, indicating a separate call for leadership.",
      "Catholic": "Specifies the signal (one trumpet) for convening only the leaders (princes) of the tribes.",
      "Methodist": "Shows a differentiated signal intended solely for gathering the appointed leaders of the community.",
      "Lutheran": "Assigns a different signal (one trumpet blown) to summon only the tribal chiefs."
    },
    "5": {
      "General": "When a specific trumpet blast (an alarm) is sounded, the tribes camped on the east side are to begin their journey.",
      "Non-Denominational": "Institutes a specific signal (alarm blast) to initiate movement, starting with the eastern camps.",
      "Baptist": "Defines the signal ('alarm') for the eastern divisions (Judah, Issachar, Zebulun) to break camp and move.",
      "Catholic": "Prescribes the specific signal (alarm) for the mobilization of the eastern camps, initiating the ordered march.",
      "Methodist": "Establishes the auditory cue for the eastern tribes to commence their part of the journey.",
      "Lutheran": "Assigns a specific signal (alarm) to command the eastern section of the camp to begin marching."
    },
    "6": {
      "General": "When a second alarm is sounded, the camps on the south side are to set out; this distinct blast is the signal for moving.",
      "Non-Denominational": "Establishes a sequential signaling process for orderly movement, with the southern camps moving on the second signal.",
      "Baptist": "Defines the second alarm signal for the southern divisions (Reuben, Simeon, Gad) to move, emphasizing the specific nature of the signal for departure.",
      "Catholic": "Prescribes the second signal (second alarm) for the mobilization of the southern camps, continuing the ordered departure.",
      "Methodist": "Details the sequential signal for the southern tribes to move, ensuring an orderly progression.",
      "Lutheran": "Assigns the second alarm signal to command the southern section to march, confirming the alarm as the specific signal for departure."
    },
    "7": {
      "General": "To gather the assembly (as in verse 3), the trumpets should be blown, but not with the short, sharp blasts used for signaling movement (the alarm).",
      "Non-Denominational": "Distinguishes between the signal for assembly (longer, sustained notes implied) and the signal for moving (alarm blasts), ensuring clarity.",
      "Baptist": "Clarifies the difference between the trumpet sound for gathering the people versus the sound for commanding movement.",
      "Catholic": "Differentiates the trumpet sound for convocation (implied steady blast) from the distinct alarm signal used for mobilization.",
      "Methodist": "Instructs on using a different type of trumpet sound for gathering versus marching, preventing confusion.",
      "Lutheran": "Specifies that the signal to assemble is different from the alarm signal used for breaking camp, requiring distinct sounds."
    },
    "8": {
      "General": "Aaron's sons, the priests, are designated to blow the trumpets; this is a permanent regulation for future generations.",
      "Non-Denominational": "Assigns the responsibility of signaling to the priests, establishing this as a lasting practice within Israel's worship and community life.",
      "Baptist": "Restricts the duty of blowing the trumpets to the priesthood (Aaron's sons), making it a perpetual ordinance.",
      "Catholic": "Confirms the priestly duty (sons of Aaron) of sounding the trumpets as a perpetual statute for Israel's liturgical and community life.",
      "Methodist": "Designates the priests as those responsible for sounding the trumpets, establishing it as an enduring ordinance.",
      "Lutheran": "Mandates that only the priests (sons of Aaron) are to blow the trumpets, establishing this as a permanent statute."
    },
    "9": {
      "General": "When going into battle in their own land against an oppressor, the Israelites are to sound the alarm on the trumpets, and the Lord will remember and rescue them.",
      "Non-Denominational": "Instructs the use of the trumpets as a call to God for help in battle, linking the signal with divine remembrance and deliverance.",
      "Baptist": "Commands the sounding of the alarm in times of war as an appeal for God's intervention, remembrance, and salvation from enemies.",
      "Catholic": "Prescribes the sounding of the trumpet alarm during warfare as a liturgical act invoking God's remembrance and aid against oppressors.",
      "Methodist": "Connects the sounding of the trumpets in battle with seeking God's help, trusting in His remembrance and power to save.",
      "Lutheran": "Commands the use of the trumpet alarm in defensive war, promising God's remembrance and deliverance as a result."
    },
    "10": {
      "General": "During times of celebration, appointed festivals, and New Moon feasts, the trumpets are to be sounded over burnt offerings and fellowship offerings as a memorial before God, who declares His identity as their Lord.",
      "Non-Denominational": "Incorporates the trumpets into joyful worship and appointed feasts, serving as a reminder of God's presence and covenant during offerings.",
      "Baptist": "Commands the use of trumpets during specific times of worship (feasts, New Moons, celebrations) accompanying sacrifices, as a memorial before God.",
      "Catholic": "Mandates the liturgical use of trumpets during festivals, New Moons, and joyous occasions, sounding over sacrifices as a memorial before God, concluding with God's self-declaration.",
      "Methodist": "Highlights the role of trumpets in enhancing worship during joyous occasions and festivals, reminding the people and God of their relationship during sacrifices.",
      "Lutheran": "Commands the sounding of trumpets during designated holy days and celebrations over the sacrifices, serving as a reminder before God, who affirms His covenant relationship."
    },
    "11": {
      "General": "On the twentieth day of the second month in the second year after leaving Egypt, the guiding cloud lifted from the Tabernacle of the Covenant Law.",
      "Non-Denominational": "Marks the specific date when God signaled the time to leave Sinai, nearly a year after arriving, by lifting the cloud.",
      "Baptist": "Records the precise timing of the cloud lifting, indicating the divinely appointed moment for Israel to depart from Sinai.",
      "Catholic": "Notes the exact date marking the end of the encampment at Sinai, signaled by the lifting of the cloud from the Tabernacle.",
      "Methodist": "Highlights the specific historical moment when God's visible guidance indicated the next stage of the journey was beginning.",
      "Lutheran": "Pinpoints the date when the divine signal (the cloud lifting) indicated the command to leave Sinai."
    },
    "12": {
      "General": "The Israelites then began their journey from the Sinai Desert, traveling in stages until the cloud settled in the Desert of Paran.",
      "Non-Denominational": "Describes the beginning of the journey toward Canaan, moving from Sinai to Paran under the cloud's guidance.",
      "Baptist": "Narrates the departure from Sinai and the subsequent journey by stages, guided by the cloud to the wilderness of Paran.",
      "Catholic": "Records the departure from the Sinai wilderness and the subsequent travel in stages, directed by the cloud to the Paran wilderness.",
      "Methodist": "Depicts the Israelites embarking on their journey from Sinai, moving as directed by the cloud until it rested in Paran.",
      "Lutheran": "Describes the commencement of the journey from Sinai, proceeding in stages as the cloud led them to the Wilderness of Paran."
    },
    "13": {
      "General": "This was the first time they set out according to the Lord's command given through Moses (referring to the specific marching orders).",
      "Non-Denominational": "Highlights that this departure followed the specific, divinely ordered plan previously established through Moses.",
      "Baptist": "Emphasizes that this initial departure was executed precisely according to God's command via Moses, following the established order.",
      "Catholic": "Notes that this first stage of the journey was undertaken in obedience to the divine command given through Moses, following the prescribed order.",
      "Methodist": "Underscores that the journey began in accordance with the Lord's instructions, previously revealed to Moses.",
      "Lutheran": "States that this first departure implemented the marching orders previously commanded by God through Moses."
    },
    "14": {
      "General": "The divisions of Judah's camp, led by Nahshon son of Amminadab, marched first under their standard.",
      "Non-Denominational": "Details the beginning of the marching order, with Judah's tribe, under its appointed leader, taking the lead position.",
      "Baptist": "Specifies Judah as the leading tribe in the march, identifying its commander Nahshon.",
      "Catholic": "Begins the description of the ordered march, with the standard of Judah, under Nahshon, leading the procession.",
      "Methodist": "Identifies the tribe of Judah, led by Nahshon, as the first group to move out, following the ordained structure.",
      "Lutheran": "Names Judah, under Nahshon, as the first division to march, according to the commanded order."
    },
    "15": {
      "General": "Nethanel son of Zuar commanded the division of the tribe of Issachar (part of Judah's group).",
      "Non-Denominational": "Names the leader of Issachar's division, which marched alongside Judah.",
      "Baptist": "Identifies Nethanel as the commander of the tribe of Issachar, marching with Judah.",
      "Catholic": "Names Nethanel as the commander of the contingent of Issachar, marching with the first division.",
      "Methodist": "Specifies Nethanel as the leader for the tribe of Issachar within the first marching group.",
      "Lutheran": "Identifies Nethanel as commander of Issachar's division within the leading group (Judah)."
    },
    "16": {
      "General": "Eliab son of Helon commanded the division of the tribe of Zebulun (also part of Judah's group).",
      "Non-Denominational": "Names the leader of Zebulun's division, completing the first marching group.",
      "Baptist": "Identifies Eliab as the commander of the tribe of Zebulun, completing Judah's lead division.",
      "Catholic": "Names Eliab as the commander of the contingent of Zebulun, concluding the first division under Judah's standard.",
      "Methodist": "Specifies Eliab as the leader for the tribe of Zebulun, completing the first marching group.",
      "Lutheran": "Identifies Eliab as commander of Zebulun's division, the third tribe in the leading group."
    },
    "17": {
      "General": "After the first group departed, the tabernacle was dismantled, and the Gershonite and Merarite Levites, responsible for carrying it, set out.",
      "Non-Denominational": "Describes the next step: the dismantling and transport of the tabernacle structure by the designated Levitical families.",
      "Baptist": "Details the dismantling of the tabernacle and the departure of the Gershonites and Merarites carrying its components.",
      "Catholic": "Narrates the taking down of the Tabernacle and the departure of the Gershonite and Merarite Levites carrying its structural elements.",
      "Methodist": "Shows the methodical process: after the lead group moved, the tabernacle was packed and transported by the assigned Levites.",
      "Lutheran": "Describes the next stage: the tabernacle structure being taken down and carried by the Gershonite and Merarite clans."
    },
    "18": {
      "General": "The divisions of Reuben's camp, led by Elizur son of Shedeur, marched next under their standard.",
      "Non-Denominational": "Details the second major marching group, led by the tribe of Reuben under its commander.",
      "Baptist": "Specifies Reuben's division as the second group to march, identifying its commander Elizur.",
      "Catholic": "Describes the departure of the second division, led by the standard of Reuben under Elizur.",
      "Methodist": "Identifies Reuben's tribe, led by Elizur, as the next major section in the marching order.",
      "Lutheran": "Names Reuben, under Elizur, as the leader of the second major marching division."
    },
    "19": {
      "General": "Shelumiel son of Zurishaddai commanded the division of the tribe of Simeon (part of Reuben's group).",
      "Non-Denominational": "Names the leader of Simeon's division, marching alongside Reuben.",
      "Baptist": "Identifies Shelumiel as the commander of the tribe of Simeon, marching with Reuben.",
      "Catholic": "Names Shelumiel as the commander of the contingent of Simeon, marching with the second division.",
      "Methodist": "Specifies Shelumiel as the leader for the tribe of Simeon within the second marching group.",
      "Lutheran": "Identifies Shelumiel as commander of Simeon's division within the second group (Reuben)."
    },
    "20": {
      "General": "Eliasaph son of Deuel commanded the division of the tribe of Gad (also part of Reuben's group).",
      "Non-Denominational": "Names the leader of Gad's division, completing the second marching group.",
      "Baptist": "Identifies Eliasaph as the commander of the tribe of Gad, completing Reuben's division.",
      "Catholic": "Names Eliasaph as the commander of the contingent of Gad, concluding the second division under Reuben's standard.",
      "Methodist": "Specifies Eliasaph as the leader for the tribe of Gad, completing the second marching group.",
      "Lutheran": "Identifies Eliasaph as commander of Gad's division, the third tribe in the second group."
    },
    "21": {
      "General": "Then the Kohathite Levites set out, carrying the sacred objects (from inside the tabernacle); the tabernacle structure was to be set up at the next camp before they arrived.",
      "Non-Denominational": "Describes the Kohathites' crucial role: transporting the most holy items, timed so the outer tabernacle would be ready upon their arrival.",
      "Baptist": "Details the departure of the Kohathites carrying the holy furnishings, highlighting the coordination needed for setting up the tabernacle.",
      "Catholic": "Narrates the departure of the Kohathites carrying the sacred liturgical vessels, emphasizing the logistical coordination required for reassembling the Tabernacle.",
      "Methodist": "Shows the specific duty of the Kohathites (carrying holy objects) and the practical planning involved in their arrival at the pre-prepared tabernacle structure.",
      "Lutheran": "Describes the Kohathites marching with the sacred objects, coordinating with the Gershonites and Merarites who set up the structure ahead of them."
    },
    "22": {
      "General": "The divisions of Ephraim's camp, led by Elishama son of Ammihud, marched next under their standard.",
      "Non-Denominational": "Details the third major marching group, led by the tribe of Ephraim under its commander.",
      "Baptist": "Specifies Ephraim's division as the third group to march, identifying its commander Elishama.",
      "Catholic": "Describes the departure of the third division, led by the standard of Ephraim under Elishama.",
      "Methodist": "Identifies Ephraim's tribe, led by Elishama, as the next major section in the marching order.",
      "Lutheran": "Names Ephraim, under Elishama, as the leader of the third major marching division."
    },
    "23": {
      "General": "Gamaliel son of Pedahzur commanded the division of the tribe of Manasseh (part of Ephraim's group).",
      "Non-Denominational": "Names the leader of Manasseh's division, marching alongside Ephraim.",
      "Baptist": "Identifies Gamaliel as the commander of the tribe of Manasseh, marching with Ephraim.",
      "Catholic": "Names Gamaliel as the commander of the contingent of Manasseh, marching with the third division.",
      "Methodist": "Specifies Gamaliel as the leader for the tribe of Manasseh within the third marching group.",
      "Lutheran": "Identifies Gamaliel as commander of Manasseh's division within the third group (Ephraim)."
    },
    "24": {
      "General": "Abidan son of Gideoni commanded the division of the tribe of Benjamin (also part of Ephraim's group).",
      "Non-Denominational": "Names the leader of Benjamin's division, completing the third marching group.",
      "Baptist": "Identifies Abidan as the commander of the tribe of Benjamin, completing Ephraim's division.",
      "Catholic": "Names Abidan as the commander of the contingent of Benjamin, concluding the third division under Ephraim's standard.",
      "Methodist": "Specifies Abidan as the leader for the tribe of Benjamin, completing the third marching group.",
      "Lutheran": "Identifies Abidan as commander of Benjamin's division, the third tribe in the third group."
    },
    "25": {
      "General": "Finally, the divisions of Dan's camp, serving as the rear guard for all units, marched last under their standard, commanded by Ahiezer son of Ammishaddai.",
      "Non-Denominational": "Details the final marching group, led by Dan, functioning as the protective rear guard, under its commander.",
      "Baptist": "Specifies Dan's division as the final group and rear guard, identifying its commander Ahiezer.",
      "Catholic": "Describes the departure of the fourth and final division, the rear guard, led by the standard of Dan under Ahiezer.",
      "Methodist": "Identifies Dan's tribe, led by Ahiezer, as the last group and the rear guard, completing the marching formation.",
      "Lutheran": "Names Dan, under Ahiezer, as the leader of the final division, serving as the rear guard for the entire camp."
    },
    "26": {
      "General": "Pagiel son of Okran commanded the division of the tribe of Asher (part of Dan's group).",
      "Non-Denominational": "Names the leader of Asher's division, marching within the rear guard.",
      "Baptist": "Identifies Pagiel as the commander of the tribe of Asher, marching with Dan.",
      "Catholic": "Names Pagiel as the commander of the contingent of Asher, marching with the fourth division (rear guard).",
      "Methodist": "Specifies Pagiel as the leader for the tribe of Asher within the final marching group.",
      "Lutheran": "Identifies Pagiel as commander of Asher's division within the rear guard group (Dan)."
    },
    "27": {
      "General": "Ahira son of Enan commanded the division of the tribe of Naphtali (also part of Dan's group).",
      "Non-Denominational": "Names the leader of Naphtali's division, completing the final marching group and rear guard.",
      "Baptist": "Identifies Ahira as the commander of the tribe of Naphtali, completing Dan's division.",
      "Catholic": "Names Ahira as the commander of the contingent of Naphtali, concluding the fourth division under Dan's standard.",
      "Methodist": "Specifies Ahira as the leader for the tribe of Naphtali, completing the final marching group.",
      "Lutheran": "Identifies Ahira as commander of Naphtali's division, the third tribe in the rear guard group."
    },
    "28": {
      "General": "This describes the established order of march for the Israelite divisions when they set out.",
      "Non-Denominational": "Summarizes that the preceding verses detail the specific, ordered arrangement for Israel's movements.",
      "Baptist": "Confirms that the detailed listing represents the divinely commanded marching order for the tribes.",
      "Catholic": "Concludes the description of the prescribed marching order for the Israelite divisions.",
      "Methodist": "Reiterates that the structure described was the designated way Israel was to travel.",
      "Lutheran": "Affirms that the preceding description outlines the commanded marching order for the Israelites."
    },
    "29": {
      "General": "Moses invites Hobab son of Reuel the Midianite (Moses' father-in-law or brother-in-law) to join the Israelites on their journey to the promised land, promising to treat him well because God has promised good things to Israel.",
      "Non-Denominational": "Shows Moses extending an invitation to his relative Hobab, based on God's promises to Israel, offering shared blessing.",
      "Baptist": "Illustrates Moses' desire for his relative Hobab to join them and share in the blessings God promised to Israel.",
      "Catholic": "Depicts Moses inviting his kinsman Hobab to join the journey towards the promised inheritance, offering him participation in God's blessings.",
      "Methodist": "Highlights Moses' evangelistic impulse, inviting Hobab to share in the journey and God's promised blessings.",
      "Lutheran": "Shows Moses inviting Hobab to accompany Israel to the promised land, citing God's promise of good as the basis for blessing him."
    },
    "30": {
      "General": "Hobab declines, stating his intention to return to his own homeland and people.",
      "Non-Denominational": "Records Hobab's initial refusal, expressing loyalty to his own land and family ties.",
      "Baptist": "Notes Hobab's polite refusal, prioritizing his connection to his native land and kindred.",
      "Catholic": "Records Hobab's declination of the invitation, expressing his desire to return to his homeland.",
      "Methodist": "Shows Hobab's initial reluctance, drawn by ties to his homeland and people.",
      "Lutheran": "Hobab refuses Moses' invitation, stating his desire to return to his own country and relatives."
    },
    "31": {
      "General": "Moses pleads with Hobab not to leave, emphasizing Hobab's valuable knowledge of the wilderness camping spots and asking him to be their 'eyes' (guide).",
      "Non-Denominational": "Moses appeals again, highlighting Hobab's practical skills and wilderness experience as beneficial to the Israelites, seeking human wisdom alongside divine guidance.",
      "Baptist": "Illustrates Moses' practical wisdom in recognizing Hobab's valuable skills as a guide in the wilderness, urging him to stay.",
      "Catholic": "Moses insists, appealing to Hobab's practical knowledge of the desert terrain and routes, asking him to serve as a guide.",
      "Methodist": "Shows Moses persisting in his invitation, valuing Hobab's practical expertise and potential contribution as a guide ('eyes') for the journey.",
      "Lutheran": "Moses presses his request, appealing to Hobab's experience of the wilderness as a valuable asset for finding suitable campsites."
    },
    "32": {
      "General": "Moses promises Hobab that if he comes with them, they will share whatever good things the Lord gives to Israel.",
      "Non-Denominational": "Moses reiterates the offer of shared blessing, promising Hobab participation in the good fortune God grants Israel.",
      "Baptist": "Moses repeats the promise to share God's blessings with Hobab if he accompanies them.",
      "Catholic": "Moses reaffirms the promise to share the divine blessings bestowed upon Israel with Hobab if he joins them.",
      "Methodist": "Moses sweetens the invitation with a promise of sharing in the prosperity and blessings God provides.",
      "Lutheran": "Moses promises to share all the good that God grants Israel with Hobab if he joins them."
    },
    "33": {
      "General": "The Israelites set out from Sinai, the mountain of the Lord, and traveled for three days, with the Ark of the Covenant going ahead of them to find a resting place.",
      "Non-Denominational": "Describes the Ark, symbolizing God's presence, leading the way to seek out a suitable place for the camp to rest.",
      "Baptist": "Narrates the departure from Sinai (the Lord's mountain), with the Ark leading the three-day journey to find a resting place.",
      "Catholic": "Records the departure from Mount Sinai, with the Ark of the Covenant preceding the people to identify a suitable place for encampment.",
      "Methodist": "Depicts the Ark of the Covenant, representing God's presence and guidance, going before the people to prepare their resting place.",
      "Lutheran": "Describes the Ark of the Covenant leading the Israelites on the first leg of the journey from Sinai, seeking out a place to rest."
    },
    "34": {
      "General": "The cloud of the Lord was over the Israelites by day as they traveled from the camp.",
      "Non-Denominational": "Reiterates the continuous daytime presence of the guiding and protective cloud as they journeyed.",
      "Baptist": "Mentions the continued presence of the cloud providing guidance and protection during their daytime travel.",
      "Catholic": "Notes the constant daytime presence of the Lord's cloud accompanying the Israelites as they traveled.",
      "Methodist": "Highlights the visible sign of God's presence (the cloud) accompanying them during their daytime travels.",
      "Lutheran": "Affirms the presence of the Lord's cloud over the people during the day as they marched."
    },
    "35": {
      "General": "Whenever the Ark set out, Moses would pray: \"Rise up, Lord! May your enemies be scattered; may your foes flee before you.\"",
      "Non-Denominational": "Records Moses' prayer invoking God's active power and intervention against enemies as they began each stage of the journey, led by the Ark.",
      "Baptist": "Quotes Moses' prayer at the start of each journey, calling on God to act powerfully, scattering His enemies.",
      "Catholic": "Transcribes Moses' liturgical invocation upon the Ark's departure, calling for God's powerful action against His adversaries.",
      "Methodist": "Shows Moses initiating movement with prayer, calling upon God's power to overcome opposition and clear the path.",
      "Lutheran": "Records Moses' prayer when the Ark moved, invoking God's militant power to defeat and scatter His enemies."
    },
    "36": {
      "General": "Whenever the Ark came to rest, Moses would pray: \"Return, Lord, to the countless thousands of Israel.\"",
      "Non-Denominational": "Records Moses' prayer inviting God's peaceful, resting presence back among the assembled multitude of Israel when the Ark stopped.",
      "Baptist": "Quotes Moses' prayer when the Ark rested, inviting the Lord's presence to return and dwell among the vast numbers of His people.",
      "Catholic": "Transcribes Moses' liturgical invocation upon the Ark's resting, inviting the Lord's peaceful presence back to the assembled community (the 'myriads of thousands').",
      "Methodist": "Shows Moses concluding movement with prayer, inviting God's abiding, peaceful presence among the encamped people.",
      "Lutheran": "Records Moses' prayer when the Ark rested, inviting the Lord to return and dwell peacefully among the myriads of Israel."
    }
  }
}
