{
  "Summary": {
    "General": "Chapter 11 recounts two instances of Israelite discontent. First, the people complain about general hardships, resulting in a fire from the Lord (Taberah). Second, the \"rabble\" and Israelites crave meat, despising the manna. Moses, overwhelmed, complains to God about the burden of leadership. God responds by appointing seventy elders, sharing His Spirit upon them to assist Moses. God also promises meat (quail) in abundance but warns it will become loathsome due to their rejection of Him. The Spirit rests on the elders, including Eldad and Medad in the camp, causing them to prophesy. Moses affirms this widespread work of the Spirit. God sends quail, but a plague strikes the people while eating, leading to the name Kibroth Hattaavah (graves of craving).",
    "Non-Denominational": "Highlights the dangers of complaining against God's provision and leadership. It shows God's judgment (fire, plague) but also His grace in providing help for Moses (elders, Spirit) and meeting the people's desires (quail), albeit with consequences for their sinful attitude. It affirms the sovereign work of the Spirit beyond expected boundaries (Eldad and Medad) and Moses' desire for all God's people to be Spirit-filled.",
    "Baptist": "Emphasizes the sinfulness of complaining and lusting against God's provision (manna). It underscores God's righteous anger and judgment, Moses' intercession and burden, God's gracious provision of helpers (elders) empowered by the Spirit, the fulfillment of God's promise (quail), and the severe consequences of unchecked craving and rejection of God.",
    "Catholic": "Focuses on the people's sins of murmuring and gluttony, leading to divine chastisement. It notes Moses' plea and the subsequent divine institution of the seventy elders (a prefigurement of collaborative ministry) through the impartation of the Spirit. It recounts the miraculous provision of quail, followed by punishment for their disordered desires, and the recognition of the Spirit's work even outside the main assembly.",
    "Methodist": "Stresses the destructive nature of complaining and ingratitude. It highlights God's judgment but also His responsive grace in providing support for Moses (elders, Spirit) and meeting the people's physical desires (quail). It affirms the work of the Holy Spirit upon the elders, including those in the camp, and Moses' generous spirit wishing all were prophets. It warns against letting desires turn into sinful cravings leading to judgment.",
    "Lutheran": "Underscores the sin of complaining against God's fatherly provision (manna) and the subsequent divine wrath (fire, plague). It details God's provision for governance through the Spirit-filled elders and His response to the people's sinful demands (quail), demonstrating both His power and judgment on their rejection and ingratitude. Moses' intercession, burden, and desire for the Spirit upon all are also key points."
  },
  "Verses": {
    "1": {
      "General": "The people complain about their difficulties, provoking the Lord's anger; fire from the Lord burns among them, consuming the camp's edges.",
      "Non-Denominational": "Shows the danger of complaining about hardships; God hears and judges the negative attitude, sending fire as discipline.",
      "Baptist": "Records the people's sin of complaining, God's righteous anger in response, and the resulting judgment by fire.",
      "Catholic": "Narrates the people's murmuring against hardships, which incites divine wrath manifested as a consuming fire on the camp's periphery.",
      "Methodist": "Highlights the Israelites' complaining spirit regarding their struggles, which displeases God and brings fiery judgment.",
      "Lutheran": "Describes the people complaining about hardship, God's resulting anger, and the judgment of fire consuming the outskirts of the camp."
    },
    "2": {
      "General": "The people cry out to Moses, who prays to the Lord, and the fire subsides.",
      "Non-Denominational": "Demonstrates the effectiveness of intercessory prayer; Moses appeals to God on behalf of the people, and the judgment stops.",
      "Baptist": "Shows the people turning to Moses in distress, his intercession before the Lord, and God's mercy in stopping the fire.",
      "Catholic": "Depicts the people seeking Moses' mediation; his prayer to the Lord results in the cessation of the divine punishment.",
      "Methodist": "Illustrates the people seeking help through Moses, whose intercession leads to God's mercy and the end of the judgment.",
      "Lutheran": "The people cry to Moses, who intercedes through prayer, and God relents, causing the fire to die down."
    },
    "3": {
      "General": "The place was named Taberah (meaning \"burning\") because the Lord's fire had burned among them.",
      "Non-Denominational": "The location is named as a lasting reminder of the consequences of complaining against God.",
      "Baptist": "The naming of Taberah serves as a memorial to God's fiery judgment against the people's sin of complaining.",
      "Catholic": "The site is named Taberah ('conflagration') commemorating the divine judgment by fire experienced there.",
      "Methodist": "The place name, Taberah, becomes a permanent reminder of the incident and God's response to complaining.",
      "Lutheran": "Taberah is named as a memorial of the event, signifying the place where God's fire burned due to their complaints."
    },
    "4": {
      "General": "The non-Israelite \"rabble\" among them crave other food, influencing the Israelites to also wail for meat.",
      "Non-Denominational": "Shows how negative influences (the rabble's craving) can spread discontent within the community, leading them away from gratitude.",
      "Baptist": "Identifies the mixed multitude as the instigators of craving, which spreads to the Israelites, leading to widespread complaining for meat.",
      "Catholic": "Attributes the initial craving for meat to the 'mixed multitude,' whose discontent then infects the Israelites, causing them to lament.",
      "Methodist": "Highlights the negative influence of the 'rabble,' whose dissatisfaction sparks a broader complaint among the Israelites longing for meat.",
      "Lutheran": "The craving begins with the mixed multitude and spreads to the Israelites, who join in wailing for meat instead of manna."
    },
    "5": {
      "General": "They nostalgically recall the free fish, cucumbers, melons, leeks, onions, and garlic they ate in Egypt.",
      "Non-Denominational": "Illustrates selective memory, romanticizing past comforts (foods of Egypt) while forgetting the hardship of slavery.",
      "Baptist": "Shows the people's sinful longing for Egyptian food, demonstrating dissatisfaction with God's provision by fondly remembering past variety.",
      "Catholic": "Depicts the people's lament, idealizing the diverse food available in Egypt while conveniently forgetting the cost of their bondage.",
      "Methodist": "Reveals the people's discontent through their idealized memories of Egyptian food, ignoring the reality of their former slavery.",
      "Lutheran": "The people complain by comparing the manna unfavorably with the variety of foods they remember eating freely in Egypt."
    },
    "6": {
      "General": "They complain about losing their appetite, seeing nothing but manna.",
      "Non-Denominational": "Shows their ingratitude and boredom with God's miraculous daily provision, focusing only on the lack of variety.",
      "Baptist": "Expresses the people's utter disdain for God's provision, complaining that the constant sight of manna has killed their appetite.",
      "Catholic": "The people express their disgust with the monotony of the manna, claiming it has caused them to lose all appetite.",
      "Methodist": "Highlights their lack of appreciation for the miracle of manna, complaining about its predictability and sameness.",
      "Lutheran": "They express complete dissatisfaction with the manna, complaining it's all they ever see and has ruined their desire to eat."
    },
    "7": {
      "General": "A description of the manna: it was like coriander seed and had the appearance of resin (bdellium).",
      "Non-Denominational": "Provides details about the manna, perhaps to contrast its actual nature with the people's contemptuous attitude.",
      "Baptist": "Describes the physical appearance of the manna (like coriander seed, color like bdellium), emphasizing its unique nature.",
      "Catholic": "Offers a parenthetical description of the manna's appearance, comparing it to coriander seed and bdellium.",
      "Methodist": "Includes a description of the manna, possibly to underscore its unique, God-given quality despite the complaints.",
      "Lutheran": "Describes the manna's appearance (like coriander seed, resembling bdellium), detailing God's provision."
    },
    "8": {
      "General": "The people gathered, ground, crushed, cooked, and baked the manna, which tasted like cakes made with olive oil.",
      "Non-Denominational": "Shows the process of preparing manna and describes its pleasant taste, further highlighting the unreasonableness of the complaints.",
      "Baptist": "Details the preparation methods for manna and its agreeable taste (like pastry with oil), countering the people's complaints.",
      "Catholic": "Describes how the manna was gathered and prepared (ground, pounded, boiled, baked) and its taste (like rich pastry).",
      "Methodist": "Illustrates the versatility in preparing manna and its pleasant flavor, contrasting with the people's dissatisfaction.",
      "Lutheran": "Describes the preparation (gathering, grinding/crushing, cooking/baking) and pleasant taste (like pastry with oil) of the manna."
    },
    "9": {
      "General": "The manna appeared on the camp each night when the dew settled.",
      "Non-Denominational": "Emphasizes the reliable, miraculous, daily provision of manna by God, appearing fresh each morning with the dew.",
      "Baptist": "Reiterates the miraculous and consistent provision of manna, appearing faithfully each night with the dew.",
      "Catholic": "Notes the timing of the manna's appearance, miraculously provided each night along with the dew.",
      "Methodist": "Underscores the faithfulness of God's provision, with manna appearing reliably every night.",
      "Lutheran": "Describes the consistent miracle: manna appearing on the ground each night as the dew fell."
    },
    "10": {
      "General": "Moses hears families wailing at their tent entrances; the Lord becomes very angry, and Moses is distressed.",
      "Non-Denominational": "Shows the widespread nature of the complaining, provoking God's intense anger and causing Moses deep trouble and frustration.",
      "Baptist": "Depicts the pervasive complaining, God's extreme anger at their faithlessness, and Moses' resulting distress.",
      "Catholic": "Describes the widespread lamentation among the families, which greatly angers the Lord and deeply troubles Moses.",
      "Methodist": "Highlights the escalation of the problem (family-wide wailing), God's justifiable anger, and the heavy emotional toll on Moses.",
      "Lutheran": "Moses hears the widespread wailing, which greatly angers God and troubles Moses immensely."
    },
    "11": {
      "General": "Moses questions the Lord, asking why He brought this trouble on him and why He burdened him with all these people.",
      "Non-Denominational": "Moses expresses his frustration and sense of being overwhelmed, questioning God about the immense burden of leadership.",
      "Baptist": "Reveals Moses' deep distress and complaint to God, feeling unfairly burdened with the responsibility for the complaining people.",
      "Catholic": "Moses expresses his exasperation to God, questioning the hardship placed upon him as leader of this difficult people.",
      "Methodist": "Shows Moses pouring out his heart to God, expressing the heavy weight and perceived unfairness of his leadership burden.",
      "Lutheran": "Moses complains to God, questioning why he has been given the overwhelming burden of leading such a difficult people."
    },
    "12": {
      "General": "Moses asks rhetorically if he conceived or birthed the people, questioning why God told him to carry them like a nursing mother to the promised land.",
      "Non-Denominational": "Moses uses maternal imagery to express the overwhelming personal responsibility he feels, arguing it exceeds his capacity.",
      "Baptist": "Moses uses strong metaphors (conception, birth, nursing) to argue against his personal responsibility for the people's needs and behavior.",
      "Catholic": "Moses employs maternal metaphors to express the overwhelming burden, questioning why he must care for the people like an infant on the journey.",
      "Methodist": "Moses expresses his feeling of being solely responsible, like a nurse for an infant, questioning the feasibility of his task.",
      "Lutheran": "Moses argues with God, using the analogy of a nursing mother to protest the overwhelming burden of caring for the people."
    },
    "13": {
      "General": "Moses despairs, asking where he can possibly get meat for everyone who keeps wailing for it.",
      "Non-Denominational": "Shows Moses' sense of inadequacy and impossibility in meeting the people's fleshly demands.",
      "Baptist": "Moses expresses his helplessness in the face of the people's demand for meat, highlighting the practical impossibility from his perspective.",
      "Catholic": "Moses voices his practical despair, questioning his ability to procure meat for the entire complaining multitude.",
      "Methodist": "Moses highlights the practical challenge and his own limitations in providing the meat the people are demanding.",
      "Lutheran": "Moses asks God in desperation how he is supposed to provide meat for the constantly wailing people."
    },
    "14": {
      "General": "Moses declares he cannot carry the burden of all these people alone because it is too heavy for him.",
      "Non-Denominational": "Moses honestly admits his limits and the unbearable weight of sole leadership responsibility.",
      "Baptist": "Moses confesses his inability to bear the burden of leadership alone, acknowledging it exceeds his strength.",
      "Catholic": "Moses explicitly states his inability to bear the leadership burden alone, declaring it too heavy.",
      "Methodist": "Moses clearly articulates his feeling of being overwhelmed, stating the burden of the people is beyond his individual capacity.",
      "Lutheran": "Moses plainly tells God the burden of leading the people is too heavy for him to bear alone."
    },
    "15": {
      "General": "In desperation, Moses asks God to kill him if he has found favor, rather than let him face his own ruin (presumably the failure of his leadership).",
      "Non-Denominational": "Shows the depth of Moses' despair, preferring death to perceived failure under the immense pressure.",
      "Baptist": "Reveals Moses' extreme distress, asking for death as preferable to continuing under the unbearable burden and facing ruin.",
      "Catholic": "In profound distress, Moses asks God to grant him death as a favor, rather than witness his own downfall under the weight of leadership.",
      "Methodist": "Illustrates the severity of Moses' burnout and despair, viewing death as a kinder alternative to facing inevitable failure.",
      "Lutheran": "Moses reaches a point of despair, asking God to kill him rather than force him to continue under this crushing burden and face ruin."
    },
    "16": {
      "General": "The Lord instructs Moses to gather seventy known elders and leaders of Israel to the Tent of Meeting to stand with him.",
      "Non-Denominational": "God responds to Moses' need by providing a solution: shared leadership through seventy respected elders.",
      "Baptist": "God provides a practical solution to Moses' burden by commanding him to appoint seventy elders to assist in governance.",
      "Catholic": "God addresses Moses' plight by commanding the selection of seventy elders, recognized leaders, to share the burden of governance.",
      "Methodist": "God answers Moses' plea by instructing him to gather seventy elders, establishing a structure for shared leadership.",
      "Lutheran": "God instructs Moses to select seventy known and respected elders to stand with him and share the leadership responsibility."
    },
    "17": {
      "General": "God promises to come down, speak with Moses there, and take some of the Spirit's power from Moses and put it on the elders, so they can share the burden.",
      "Non-Denominational": "God reveals His plan to empower the elders by distributing the Spirit that was on Moses, enabling them to truly share the leadership load.",
      "Baptist": "God promises to equip the elders for service by imparting to them some of the Spirit given to Moses, thus enabling shared leadership.",
      "Catholic": "God promises to descend, communicate, and impart a portion of the Spirit from Moses to the seventy elders, thereby equipping them to co-govern.",
      "Methodist": "God outlines His plan: He will empower the elders with His Spirit, taken from Moses, enabling them to effectively assist in leadership.",
      "Lutheran": "God promises to empower the seventy elders by taking some of the Spirit from Moses and placing it on them, enabling shared governance."
    },
    "18": {
      "General": "Moses is to tell the people to consecrate themselves for the next day when they will eat meat, because the Lord heard their wailing for meat and nostalgia for Egypt.",
      "Non-Denominational": "God addresses the people's complaint, acknowledging He heard their sinful desires and instructs them to prepare for receiving meat.",
      "Baptist": "God commands the people to consecrate themselves in preparation for receiving the meat they demanded, noting He heard their sinful complaints.",
      "Catholic": "God instructs Moses to have the people sanctify themselves before receiving the meat they sinfully craved, acknowledging their lament.",
      "Methodist": "God responds to the people's demands, telling them to prepare (consecrate) for the meat they wailed for, highlighting He heard their complaints.",
      "Lutheran": "God instructs the people, through Moses, to prepare themselves for receiving meat the next day, acknowledging He heard their sinful wailing."
    },
    "19": {
      "General": "God clarifies they won't eat meat for just a few days.",
      "Non-Denominational": "God begins to indicate the excessive nature of the provision, hinting it will go beyond mere satisfaction.",
      "Baptist": "God states the provision of meat will be prolonged, not just a brief indulgence.",
      "Catholic": "God specifies the duration of the meat provision will be extensive, not merely for a short period.",
      "Methodist": "God emphasizes the duration will be significant, more than just a short-term gratification.",
      "Lutheran": "God begins specifying the excessive duration of the meat provision, lasting far longer than a few days."
    },
    "20": {
      "General": "They will eat meat for a whole month until it becomes repulsive to them, because they rejected the Lord among them and wailed about leaving Egypt.",
      "Non-Denominational": "God reveals the consequence: the fulfillment of their desire will become a curse, leading to loathing, because it stemmed from rejecting Him and His provision.",
      "Baptist": "God declares the meat will be given in judgment, lasting a month until they despise it, as punishment for rejecting Him and complaining.",
      "Catholic": "God pronounces that the excessive provision of meat for a full month will lead to revulsion, serving as punishment for rejecting the Lord in their midst.",
      "Methodist": "God states the blessing will become a burden: meat for a month until sickening, because their craving represented a rejection of God Himself.",
      "Lutheran": "God declares the meat will be provided excessively for a month, until it becomes disgusting, as a judgment for rejecting Him and their faithless complaints."
    },
    "21": {
      "General": "Moses expresses doubt, questioning how God can provide meat for 600,000 men on foot for a whole month.",
      "Non-Denominational": "Shows Moses' human limitation and struggle with faith, focusing on the logistical impossibility rather than God's power.",
      "Baptist": "Reveals Moses' moment of unbelief, questioning God's ability to provide such a vast amount of meat based on human resources.",
      "Catholic": "Moses expresses disbelief, questioning the feasibility of providing sufficient meat for such a large multitude for a month.",
      "Methodist": "Highlights Moses' human frailty and doubt, focusing on the practical impossibility from a human perspective.",
      "Lutheran": "Moses expresses doubt based on the vast number of people (600,000 men) and the immense quantity of meat required for a month."
    },
    "22": {
      "General": "Moses asks if slaughtering all their flocks and herds or catching all the sea's fish would be sufficient.",
      "Non-Denominational": "Moses emphasizes the scale of the perceived problem, implying that even impossible natural resources wouldn't suffice.",
      "Baptist": "Moses uses hyperbole (all flocks/herds, all fish) to underscore his doubt about the feasibility of God's promise.",
      "Catholic": "Moses employs hyperbole regarding livestock and fish to emphasize the perceived impossibility of fulfilling the promise through natural means.",
      "Methodist": "Moses further expresses his doubt by suggesting that even the most extreme measures (slaughtering everything, catching all fish) wouldn't be enough.",
      "Lutheran": "Moses questions whether even slaughtering all livestock or catching all fish would provide enough meat, highlighting his lack of faith in God's power."
    },
    "23": {
      "General": "The Lord rebukes Moses, asking if His power (His arm) is limited, and tells Moses he will see God's word fulfilled.",
      "Non-Denominational": "God gently rebukes Moses' doubt, reminding him of His unlimited power and promising imminent proof.",
      "Baptist": "God challenges Moses' unbelief by asking rhetorically if His power is insufficient, reaffirming His promise will be demonstrably fulfilled.",
      "Catholic": "The Lord reproves Moses' lack of faith, asserting His omnipotence ('Is the Lord's arm too short?') and promising a demonstration.",
      "Methodist": "God directly confronts Moses' doubt, reminding him of His infinite power and assuring him he will witness the fulfillment of the promise.",
      "Lutheran": "God rebukes Moses' doubt by affirming His own unlimited power ('Is the Lord's arm too short?') and promising Moses will witness its effect."
    },
    "24": {
      "General": "Moses relays God's words to the people and gathers the seventy elders around the Tent.",
      "Non-Denominational": "Moses obeys, communicating God's message and assembling the chosen elders as instructed.",
      "Baptist": "Moses faithfully reports God's message and gathers the seventy elders in obedience to God's command.",
      "Catholic": "Moses communicates God's message to the people and assembles the seventy elders around the Tabernacle as directed.",
      "Methodist": "Moses acts in obedience, telling the people God's plan and gathering the seventy elders.",
      "Lutheran": "Moses communicates God's word to the people and gathers the seventy elders around the Tent as commanded."
    },
    "25": {
      "General": "The Lord descends in the cloud, speaks with Moses, and puts some of the Spirit from Moses onto the seventy elders, who then prophesy momentarily.",
      "Non-Denominational": "God visibly manifests His presence and fulfills His promise, empowering the elders with His Spirit, resulting in a temporary prophetic utterance as confirmation.",
      "Baptist": "God fulfills His word: He descends, speaks, transfers His Spirit to the elders, and they prophesy as evidence of the Spirit's presence (but only initially).",
      "Catholic": "The Lord descends in the cloud, speaks to Moses, and imparts the Spirit to the seventy elders, who then prophesy as a sign (but do not continue permanently).",
      "Methodist": "God acts as promised: descending, speaking, and distributing His Spirit, evidenced by the elders prophesying (a temporary manifestation).",
      "Lutheran": "God descends in the cloud, speaks to Moses, and transfers the Spirit to the elders, who then prophesy as a sign of their empowerment (a one-time event)."
    },
    "26": {
      "General": "Two designated elders, Eldad and Medad, remained in the camp but also received the Spirit and prophesied there.",
      "Non-Denominational": "Shows the Spirit's sovereign work is not confined to location or formal gathering; God empowers Eldad and Medad where they are.",
      "Baptist": "Highlights the sovereign move of the Spirit, resting even on Eldad and Medad who weren't at the Tabernacle, enabling them to prophesy.",
      "Catholic": "Narrates the exception: Eldad and Medad, though absent from the Tabernacle, also receive the Spirit and prophesy within the camp.",
      "Methodist": "Illustrates God's Spirit working beyond the expected place, empowering Eldad and Medad within the main camp.",
      "Lutheran": "Describes how Eldad and Medad, though remaining in the camp, also received the Spirit and prophesied there."
    },
    "27": {
      "General": "A young man reports to Moses that Eldad and Medad are prophesying in the camp.",
      "Non-Denominational": "The unusual event is reported to Moses, likely causing some surprise or concern.",
      "Baptist": "The news of Eldad and Medad prophesying outside the official gathering is brought to Moses.",
      "Catholic": "A messenger informs Moses about the prophetic activity of Eldad and Medad occurring within the camp itself.",
      "Methodist": "The report brings the unexpected activity of Eldad and Medad to Moses' attention.",
      "Lutheran": "A young man reports the irregular prophesying of Eldad and Medad in the camp to Moses."
    },
    "28": {
      "General": "Joshua, Moses' long-time aide, urges Moses to stop them.",
      "Non-Denominational": "Joshua expresses concern for order and perhaps Moses' unique authority, urging him to halt the irregular prophesying.",
      "Baptist": "Joshua, zealous for Moses' authority and established order, asks Moses to forbid Eldad and Medad from prophesying.",
      "Catholic": "Joshua, concerned for established order and perhaps Moses' singular authority, asks Moses to prohibit their prophesying.",
      "Methodist": "Joshua, loyal to Moses and concerned about potential disorder, suggests stopping Eldad and Medad.",
      "Lutheran": "Joshua, Moses' assistant, asks Moses to stop Eldad and Medad, likely concerned about preserving order or Moses' unique role."
    },
    "29": {
      "General": "Moses replies, asking if Joshua is jealous for his sake and expressing a wish that all the Lord's people were prophets upon whom the Lord would put His Spirit.",
      "Non-Denominational": "Moses shows spiritual maturity and lack of personal jealousy, desiring a widespread outpouring of the Spirit rather than guarding his own position.",
      "Baptist": "Moses rebukes Joshua's misplaced zeal, expressing a profound desire for all God's people to be Spirit-filled prophets.",
      "Catholic": "Moses corrects Joshua's zeal, disavowing jealousy and expressing the magnanimous wish that the entire community might receive the prophetic Spirit.",
      "Methodist": "Moses demonstrates humility and a focus on God's work, wishing for more, not less, Spirit-empowered activity among the people.",
      "Lutheran": "Moses corrects Joshua's concern, denying jealousy and wishing that God would put His Spirit on all His people, making them prophets."
    },
    "30": {
      "General": "Moses and the elders return to the camp.",
      "Non-Denominational": "The immediate event of the Spirit's outpouring at the Tabernacle concludes, and leadership returns to the main camp.",
      "Baptist": "Moses and the newly empowered elders rejoin the main body of the camp.",
      "Catholic": "Moses and the elders conclude their assembly at the Tabernacle and return to the camp.",
      "Methodist": "The specific gathering at the Tent concludes, and Moses and the elders return.",
      "Lutheran": "Moses and the elders return from the Tent of Meeting to the camp."
    },
    "31": {
      "General": "A wind from the Lord drives quail from the sea, scattering them thickly (about two cubits deep) all around the camp for a day's journey in every direction.",
      "Non-Denominational": "God fulfills His promise supernaturally, sending a wind that brings an overwhelming abundance of quail covering a vast area.",
      "Baptist": "God miraculously provides quail via a wind, in immense quantity, covering the ground deeply around the camp.",
      "Catholic": "God sends a wind that miraculously drives vast quantities of quail from the sea, depositing them in immense numbers around the camp.",
      "Methodist": "God acts dramatically, using a wind to bring an extraordinary, almost unbelievable, amount of quail to the camp.",
      "Lutheran": "God sends a wind that brings an enormous quantity of quail, burying the ground around the camp about two cubits deep for miles."
    },
    "32": {
      "General": "The people gather quail continuously for two days and a night; the minimum gathered was ten homers (a very large amount), and they spread them out.",
      "Non-Denominational": "Shows the people's greedy response to the abundance, gathering excessively and hoarding the quail.",
      "Baptist": "Depicts the people's intense effort in gathering the quail over 36 hours, accumulating huge quantities (minimum ten homers) per person.",
      "Catholic": "Narrates the people's frenzied gathering of quail over a day and a half, amassing enormous quantities, which they then spread out.",
      "Methodist": "Illustrates the people's obsessive gathering of the quail, working tirelessly to collect vast, excessive amounts.",
      "Lutheran": "The people spend a day and a half greedily gathering immense quantities of quail (at least ten homers each), spreading them around."
    },
    "33": {
      "General": "While the meat was still in their mouths, before they finished eating, the Lord's anger burned, and He struck them with a severe plague.",
      "Non-Denominational": "God's judgment falls swiftly while the people are indulging their craving, showing His displeasure with their underlying attitude, not just the eating.",
      "Baptist": "God's wrath strikes while the meat is still being eaten, demonstrating judgment not on the provision itself, but on the lust and rejection that demanded it.",
      "Catholic": "Divine wrath erupts while the meat is still being consumed; the Lord strikes the people with a severe plague as punishment for their sinful craving.",
      "Methodist": "Judgment comes suddenly during the act of eating, indicating God's anger was directed at the spirit of craving and rejection, not the meat itself.",
      "Lutheran": "While they were still eating the meat they craved, God's anger flared, and He struck them with a deadly plague."
    },
    "34": {
      "General": "The place was named Kibroth Hattaavah (meaning \"graves of craving\") because they buried the people there who had craved other food.",
      "Non-Denominational": "The location is named as a grim reminder of the fatal consequences of unchecked, God-dishonoring craving.",
      "Baptist": "The naming of Kibroth Hattaavah serves as a memorial to the deadly result of lustful craving against God's will.",
      "Catholic": "The site is named Kibroth Hattaavah ('graves of craving') commemorating the burial of those struck down for their sinful desires.",
      "Methodist": "The place name, Kibroth Hattaavah, becomes a sobering monument to the deadly outcome of yielding to sinful craving.",
      "Lutheran": "Kibroth Hattaavah is named as a memorial, signifying the graves of those who died because of their sinful craving."
    },
    "35": {
      "General": "The people traveled from Kibroth Hattaavah to Hazeroth and stayed there.",
      "Non-Denominational": "Records the next stage of the journey, moving on from the place of judgment.",
      "Baptist": "Narrates the departure from the site of the plague to the next encampment at Hazeroth.",
      "Catholic": "Records the movement of the people from Kibroth Hattaavah to their next encampment at Hazeroth.",
      "Methodist": "Shows the journey continuing after the judgment, moving from Kibroth Hattaavah to Hazeroth.",
      "Lutheran": "The Israelites move from Kibroth Hattaavah and camp at Hazeroth."
    }
  }
}
