{
  "Summary": {
    "General": "The Lord commands Moses to send twelve spies, one leader from each tribe, to survey the land of Canaan. Moses instructs them to assess the land's quality, its inhabitants' strength, their cities, and resources, and to bring back fruit. The spies explore from Zin to Rehob, reaching Hebron and the brook Eshcol, where they cut a massive cluster of grapes. After forty days, they return to Kadesh. They report the land flows with milk and honey, showing the fruit as evidence. However, ten spies emphasize the strength of the people, the walled cities, and the presence of giants (children of Anak), instilling fear. Caleb alone urges the people to trust God and take the land immediately, confident in their ability to conquer it. The ten spies counter Caleb, spreading an 'evil report' that exaggerates the dangers, claiming the land devours its inhabitants and that the Israelites appeared as grasshoppers compared to the giants.",
    "Non-Denominational": "Focuses on the mission of reconnaissance initiated by God's command but ultimately revealing the heart of the people. Contrasts the abundant evidence of God's promise (fruit, fertile land) with the fear and lack of faith displayed by the majority of the spies. Highlights Caleb's faith-filled perspective versus the majority's fear-based report, setting the stage for the subsequent rebellion. Emphasizes the danger of focusing on obstacles instead of God's power and promises.",
    "Baptist": "Emphasizes God's faithfulness in directing the spies to the promised land He intends to give. Contrasts the objective report of the land's goodness with the unbelieving, fearful interpretation of the majority. Highlights Caleb's faithful testimony as a model of trusting God's promises despite obstacles. Underscores the sinfulness of the 'evil report' which slandered God's gift and discouraged the people, demonstrating the consequences of unbelief.",
    "Catholic": "Views the sending of the spies as a prudent, divinely sanctioned act of gathering information before entering Canaan. Notes the objective goodness of the land ('milk and honey,' fruit) fulfilling God's promise. Contrasts the virtue of faith and courage (Caleb) with the vice of fear and lack of trust (ten spies). Sees the 'evil report' as a slander not only against the land but implicitly against God's providence. The giants (Nephilim lineage) represent formidable obstacles requiring divine aid.",
    "Methodist": "Highlights the tension between God's promise and human fear. God commands the spying mission, revealing His intention to give the land. The spies see evidence of God's blessing (fruitfulness) but ten succumb to fear of the inhabitants. Caleb represents the response of faith, trusting in God's power. The 'evil report' is seen as a failure of faith, prioritizing human perception of strength over God's assured victory, leading to discouragement.",
    "Lutheran": "Focuses on God's command and promise regarding Canaan. The spies are sent to see the land God *is giving* them. The report confirms the land's goodness (objective reality) but ten spies interpret the challenges through the lens of unbelief and fear, contradicting God's promise. Caleb's confession ('Let us go up at once') represents true faith trusting God's Word over human sight. The 'evil report' is a direct result of failing to trust God's power and promise."
  },
  "Verses": {
    "1": {
      "General": "The Lord initiates the reconnaissance mission, speaking directly to Moses.",
      "Non-Denominational": "God directs Moses, setting the stage for the critical test of faith regarding the Promised Land.",
      "Baptist": "Records God's direct command to Moses, initiating the mission to spy out Canaan.",
      "Catholic": "The narrative begins with a divine command to Moses, authorizing the mission to scout the land of Canaan.",
      "Methodist": "God speaks to Moses, commissioning the sending of spies, an important step towards entering the promised land.",
      "Lutheran": "The Lord Himself commands Moses to initiate the spying mission into Canaan."
    },
    "2": {
      "General": "God instructs Moses to send one leader ('ruler') from each ancestral tribe to search the land He is giving them.",
      "Non-Denominational": "God specifies the selection process (leaders from each tribe) for the mission to explore the land He has promised to Israel.",
      "Baptist": "God instructs the selection of twelve leaders, one per tribe, to spy out the land He is giving as an inheritance, emphasizing its divine designation.",
      "Catholic": "Divine instruction specifies sending tribal leaders to explore Canaan, the land designated by God for Israel.",
      "Methodist": "God directs that a leader from each tribe be chosen to represent their people in scouting the land God intends for them.",
      "Lutheran": "God commands representative leaders from each tribe to search Canaan, emphasizing it is the land He *gives* to Israel."
    },
    "3": {
      "General": "Moses obeys God's command, sending the chosen leaders from the Wilderness of Paran.",
      "Non-Denominational": "Moses acts in obedience to God, dispatching the tribal heads from their current location in Paran.",
      "Baptist": "Moses faithfully executes God's commandment, sending the twelve heads of Israel from Paran.",
      "Catholic": "In obedience to the divine command, Moses sends the tribal leaders from the Wilderness of Paran.",
      "Methodist": "Moses promptly obeys God's instruction, sending the selected leaders on their mission from Paran.",
      "Lutheran": "Moses acts according to God's command, sending the leaders (heads of the children of Israel) from Paran."
    },
    "4": {
      "General": "The name of the spy from the tribe of Reuben is given: Shammua son of Zaccur.",
      "Non-Denominational": "Lists the representative leader chosen from the tribe of Reuben.",
      "Baptist": "Identifies the specific leader chosen from Reuben for the spying mission.",
      "Catholic": "Begins the official roster of the spies, naming the representative from the tribe of Reuben.",
      "Methodist": "Names the spy selected from the tribe of Reuben.",
      "Lutheran": "Records the name of the spy representing the tribe of Reuben."
    },
    "5": {
      "General": "The name of the spy from the tribe of Simeon is given: Shaphat son of Hori.",
      "Non-Denominational": "Lists the representative leader chosen from the tribe of Simeon.",
      "Baptist": "Identifies the specific leader chosen from Simeon for the spying mission.",
      "Catholic": "Continues the roster, naming the representative from the tribe of Simeon.",
      "Methodist": "Names the spy selected from the tribe of Simeon.",
      "Lutheran": "Records the name of the spy representing the tribe of Simeon."
    },
    "6": {
      "General": "The name of the spy from the tribe of Judah is given: Caleb son of Jephunneh.",
      "Non-Denominational": "Lists the representative leader chosen from Judah, a key figure later in the narrative.",
      "Baptist": "Identifies Caleb, the faithful leader chosen from Judah.",
      "Catholic": "Names the representative from Judah, Caleb, who will later stand out for his faith.",
      "Methodist": "Names the spy selected from Judah, Caleb, noted for his subsequent faithfulness.",
      "Lutheran": "Records the name of Caleb, the spy representing the tribe of Judah, who demonstrated faith."
    },
    "7": {
      "General": "The name of the spy from the tribe of Issachar is given: Igal son of Joseph.",
      "Non-Denominational": "Lists the representative leader chosen from the tribe of Issachar.",
      "Baptist": "Identifies the specific leader chosen from Issachar for the spying mission.",
      "Catholic": "Continues the roster, naming the representative from the tribe of Issachar.",
      "Methodist": "Names the spy selected from the tribe of Issachar.",
      "Lutheran": "Records the name of the spy representing the tribe of Issachar."
    },
    "8": {
      "General": "The name of the spy from the tribe of Ephraim is given: Oshea son of Nun.",
      "Non-Denominational": "Lists the representative leader chosen from Ephraim, initially named Oshea.",
      "Baptist": "Identifies Oshea (later Joshua), the leader chosen from Ephraim.",
      "Catholic": "Names the representative from Ephraim, Oshea, later renamed Joshua by Moses.",
      "Methodist": "Names the spy selected from Ephraim, Oshea, who will become a central figure.",
      "Lutheran": "Records the name of Oshea, the spy representing the tribe of Ephraim."
    },
    "9": {
      "General": "The name of the spy from the tribe of Benjamin is given: Palti son of Raphu.",
      "Non-Denominational": "Lists the representative leader chosen from the tribe of Benjamin.",
      "Baptist": "Identifies the specific leader chosen from Benjamin for the spying mission.",
      "Catholic": "Continues the roster, naming the representative from the tribe of Benjamin.",
      "Methodist": "Names the spy selected from the tribe of Benjamin.",
      "Lutheran": "Records the name of the spy representing the tribe of Benjamin."
    },
    "10": {
      "General": "The name of the spy from the tribe of Zebulun is given: Gaddiel son of Sodi.",
      "Non-Denominational": "Lists the representative leader chosen from the tribe of Zebulun.",
      "Baptist": "Identifies the specific leader chosen from Zebulun for the spying mission.",
      "Catholic": "Continues the roster, naming the representative from the tribe of Zebulun.",
      "Methodist": "Names the spy selected from the tribe of Zebulun.",
      "Lutheran": "Records the name of the spy representing the tribe of Zebulun."
    },
    "11": {
      "General": "The name of the spy from the tribe of Manasseh (representing Joseph) is given: Gaddi son of Susi.",
      "Non-Denominational": "Lists the representative leader chosen from Manasseh (one half of Joseph's tribe).",
      "Baptist": "Identifies the specific leader chosen from Manasseh for the spying mission.",
      "Catholic": "Names the representative from the tribe of Manasseh (part of the house of Joseph).",
      "Methodist": "Names the spy selected from the tribe of Manasseh.",
      "Lutheran": "Records the name of the spy representing the tribe of Manasseh."
    },
    "12": {
      "General": "The name of the spy from the tribe of Dan is given: Ammiel son of Gemalli.",
      "Non-Denominational": "Lists the representative leader chosen from the tribe of Dan.",
      "Baptist": "Identifies the specific leader chosen from Dan for the spying mission.",
      "Catholic": "Continues the roster, naming the representative from the tribe of Dan.",
      "Methodist": "Names the spy selected from the tribe of Dan.",
      "Lutheran": "Records the name of the spy representing the tribe of Dan."
    },
    "13": {
      "General": "The name of the spy from the tribe of Asher is given: Sethur son of Michael.",
      "Non-Denominational": "Lists the representative leader chosen from the tribe of Asher.",
      "Baptist": "Identifies the specific leader chosen from Asher for the spying mission.",
      "Catholic": "Continues the roster, naming the representative from the tribe of Asher.",
      "Methodist": "Names the spy selected from the tribe of Asher.",
      "Lutheran": "Records the name of the spy representing the tribe of Asher."
    },
    "14": {
      "General": "The name of the spy from the tribe of Naphtali is given: Nahbi son of Vophsi.",
      "Non-Denominational": "Lists the representative leader chosen from the tribe of Naphtali.",
      "Baptist": "Identifies the specific leader chosen from Naphtali for the spying mission.",
      "Catholic": "Continues the roster, naming the representative from the tribe of Naphtali.",
      "Methodist": "Names the spy selected from the tribe of Naphtali.",
      "Lutheran": "Records the name of the spy representing the tribe of Naphtali."
    },
    "15": {
      "General": "The name of the spy from the tribe of Gad is given: Geuel son of Machi.",
      "Non-Denominational": "Lists the representative leader chosen from the tribe of Gad, completing the list of twelve.",
      "Baptist": "Identifies the specific leader chosen from Gad, completing the list of spies.",
      "Catholic": "Completes the roster, naming the representative from the tribe of Gad.",
      "Methodist": "Names the final spy selected, from the tribe of Gad.",
      "Lutheran": "Records the name of the spy representing the tribe of Gad."
    },
    "16": {
      "General": "The narrative confirms these are the names of the spies, adding that Moses renamed Oshea (Hosea) to Jehoshua (Joshua).",
      "Non-Denominational": "Summarizes the list and notes the significant name change from Oshea ('salvation') to Joshua ('Yahweh is salvation'), indicating his future role.",
      "Baptist": "Confirms the list and highlights Moses changing Oshea's name to Joshua, prophetically signifying his role under God's saving power.",
      "Catholic": "Reiterates these are the spies' names and notes Moses changing Oshea's name to Joshua, meaning 'The Lord saves,' foreshadowing his leadership.",
      "Methodist": "Confirms the list of spies and highlights the pivotal moment Moses renames Oshea to Joshua, signifying divine help and leadership.",
      "Lutheran": "States these were the spies' names and records Moses renaming Oshea to Joshua, adding the divine name ('Jeho') signifying God's role in salvation."
    },
    "17": {
      "General": "Moses commissions the spies, instructing them to enter Canaan via the south (Negev) and proceed into the hill country.",
      "Non-Denominational": "Moses gives specific instructions for the route, starting south and moving into the mountainous region.",
      "Baptist": "Records Moses' specific instructions for the spies' route into Canaan, beginning from the south.",
      "Catholic": "Moses formally sends the spies with instructions for their route, beginning in the Negev and proceeding to the highlands.",
      "Methodist": "Moses directs the spies on their mission path, instructing them to go south first, then into the hill country.",
      "Lutheran": "Moses gives the spies their specific travel orders for entering and exploring Canaan."
    },
    "18": {
      "General": "Moses instructs the spies to assess the land itself and its inhabitants: their strength, number (few or many).",
      "Non-Denominational": "The mission includes evaluating both the land's potential and the nature of the opposition (people's strength and population size).",
      "Baptist": "Moses directs the spies to gather intelligence on the land and its people, specifically their strength and population.",
      "Catholic": "Part of the spies' mandate is to evaluate the land and its current inhabitants, assessing their strength and numbers.",
      "Methodist": "Moses tasks the spies with observing the land and analyzing the inhabitants, focusing on their military capacity and size.",
      "Lutheran": "The spies are instructed to evaluate the land and, crucially, the people dwelling there – their strength and numbers."
    },
    "19": {
      "General": "Moses further instructs them to evaluate the land's quality (good or bad) and the nature of the cities (open camps or fortified strongholds).",
      "Non-Denominational": "The assessment continues, focusing on the land's habitability and the level of fortification of the settlements.",
      "Baptist": "Moses instructs assessment of the land's quality and the type of settlements, whether temporary camps or fortified cities.",
      "Catholic": "The spies are to report on the land's quality (fertile or barren) and the nature of the cities (unwalled or fortified).",
      "Methodist": "Instructions include judging the land's quality and the security of the inhabitants' cities (camps or fortifications).",
      "Lutheran": "Moses instructs the spies to determine the land's quality (good/bad) and the nature of its cities (tents/strongholds)."
    },
    "20": {
      "General": "Moses asks them to determine the land's fertility ('fat or lean'), availability of timber, and encourages them to be courageous and bring back samples of its fruit, noting it was grape season.",
      "Non-Denominational": "Final instructions cover resources (soil richness, forests), a call for courage, and a request for tangible proof of the land's produce (fruit), timed with the grape harvest.",
      "Baptist": "Moses asks about the land's fertility and resources (wood), commands courage, and requests physical evidence (fruit), noting the season.",
      "Catholic": "Instructions conclude with assessing soil fertility and timber resources, an exhortation to courage, and a command to bring back fruit samples during the grape harvest.",
      "Methodist": "Moses asks about the land's richness and timber, urges bravery, and specifically requests bringing back fruit as evidence, noting the grape season.",
      "Lutheran": "Moses instructs assessment of the land's fertility ('fat or lean') and forests, calls for courage ('good courage'), and requires bringing back fruit."
    },
    "21": {
      "General": "The spies obeyed, exploring the land extensively from the Wilderness of Zin in the south to Rehob near Hamath in the north.",
      "Non-Denominational": "Describes the execution of the mission, covering a significant portion of the land from its southern to northern extremities.",
      "Baptist": "Records the spies carrying out their mission, searching the land across its breadth from Zin to Rehob.",
      "Catholic": "Narrates the spies' journey, covering the land extensively from the southern desert of Zin up to Rehob near the northern border.",
      "Methodist": "The spies fulfill their instructions, conducting a thorough reconnaissance of the land from south to north.",
      "Lutheran": "The spies execute their mission, searching the designated territory from Zin in the south to Rehob near Hamath."
    },
    "22": {
      "General": "They traveled north through the south region and reached Hebron, noting the presence of Anakim giants (Ahiman, Sheshai, Talmai) and Hebron's ancient history compared to Zoan (Tanis) in Egypt.",
      "Non-Denominational": "Highlights their journey to Hebron, the encounter with the fearsome Anakim, and a historical note comparing Hebron's age to a major Egyptian city.",
      "Baptist": "Records their arrival at Hebron, mentioning the giant descendants of Anak residing there and a historical comparison to Zoan in Egypt.",
      "Catholic": "Details their journey to Hebron, noting the presence of the Anakim (giants) and adding a historical detail about Hebron's antiquity relative to Egypt's Zoan.",
      "Methodist": "Describes their arrival in Hebron, the significant encounter with the Anakim, and the historical context provided about Hebron's age.",
      "Lutheran": "Narrates the spies reaching Hebron in the south, where they encountered the Anakim (giants), with a parenthetical note on Hebron's founding."
    },
    "23": {
      "General": "They reached the Valley (brook) of Eshcol, cut down a branch with a single, massive cluster of grapes requiring two men to carry, and also gathered pomegranates and figs.",
      "Non-Denominational": "Illustrates the extraordinary fertility of the land with the giant grape cluster needing two men, along with other representative fruits.",
      "Baptist": "Describes their arrival at Eshcol and the gathering of the enormous grape cluster and other fruits, tangible proof of the land's abundance.",
      "Catholic": "Details the discovery at the Valley of Eshcol: a huge grape cluster requiring two men to carry, plus pomegranates and figs, demonstrating the land's fertility.",
      "Methodist": "Highlights the incredible bounty of the land found at Eshcol, symbolized by the giant grape cluster and other fruits gathered.",
      "Lutheran": "Records the spies reaching Eshcol, cutting down the famous large grape cluster requiring two men, and gathering other fruits as evidence."
    },
    "24": {
      "General": "The place was named the Brook (Valley) of Eshcol, meaning 'cluster,' because of the grape cluster the Israelites cut there.",
      "Non-Denominational": "Explains the naming of the location based on the memorable, enormous cluster of grapes found there.",
      "Baptist": "Records the naming of the location 'Eshcol' (cluster) as a memorial of the remarkable fruitfulness found there.",
      "Catholic": "Explains the etymology of the place name 'Eshcol' (cluster), derived from the significant grape cluster found by the spies.",
      "Methodist": "Notes the naming of the valley Eshcol, forever associated with the impressive cluster of grapes discovered there.",
      "Lutheran": "The place is named Eshcol ('cluster') commemorating the event of finding the large grape cluster."
    },
    "25": {
      "General": "The spies completed their reconnaissance mission and returned after forty days.",
      "Non-Denominational": "Marks the end of the forty-day spying mission.",
      "Baptist": "States the duration of the spying mission was forty days, after which they returned.",
      "Catholic": "Records the conclusion of the forty-day reconnaissance period.",
      "Methodist": "Specifies the length of the mission (forty days) before the spies returned.",
      "Lutheran": "The spies return after completing their forty-day search of the land."
    },
    "26": {
      "General": "They returned to Moses, Aaron, and the entire congregation at Kadesh in the Wilderness of Paran, delivering their report and displaying the fruit.",
      "Non-Denominational": "Describes the spies' return to the assembly at Kadesh, presenting their findings and the physical evidence (fruit).",
      "Baptist": "Records the spies' return to the leadership and congregation at Kadesh, bringing their report and showing the fruit.",
      "Catholic": "Narrates the spies' return to the Israelite camp at Kadesh, reporting to the leaders and congregation and displaying the collected fruit.",
      "Methodist": "Shows the spies reporting back to Moses, Aaron, and all the people at Kadesh, presenting the fruit as proof.",
      "Lutheran": "The spies return to the congregation at Kadesh in Paran, reporting back and showing the fruit of the land."
    },
    "27": {
      "General": "They began their report confirming the land's richness ('flows with milk and honey') and presented the fruit as proof.",
      "Non-Denominational": "The initial report affirms the positive aspects, confirming God's description of the land's abundance with visual evidence.",
      "Baptist": "The spies confirm the truth of God's description ('flows with milk and honey') and show the fruit as evidence.",
      "Catholic": "The spies initially confirm the land's extraordinary fertility, using the traditional phrase 'flows with milk and honey' and showing the fruit.",
      "Methodist": "The report starts positively, confirming the land's fertility ('milk and honey') and backing it up with the fruit sample.",
      "Lutheran": "The spies truthfully report the land's richness ('floweth with milk and honey'), presenting the fruit as evidence."
    },
    "28": {
      "General": "However ('Nevertheless'), they immediately introduced negative aspects: strong inhabitants, large fortified cities, and the presence of the Anakim giants.",
      "Non-Denominational": "The report quickly pivots to focus on the obstacles: powerful people, fortified cities, and the intimidating Anakim, shifting the tone to fear.",
      "Baptist": "Despite the land's goodness, the majority report emphasizes the strength of the inhabitants, the fortifications, and the fearsome Anakim, revealing their unbelief.",
      "Catholic": "The report shifts ('Nevertheless') to highlight the formidable challenges: strong inhabitants, large walled cities, and the presence of the Anakim (giants).",
      "Methodist": "The positive report is immediately qualified by emphasizing the significant challenges: strong people, fortified cities, and giants.",
      "Lutheran": "The word 'Nevertheless' signals the shift from the land's goodness to the perceived insurmountable obstacles: strong people, fortified cities, and Anakim."
    },
    "29": {
      "General": "They detailed the location of various powerful peoples inhabiting the land: Amalekites (south), Hittites, Jebusites, Amorites (mountains), Canaanites (coast/Jordan).",
      "Non-Denominational": "Provides a strategic overview of the different powerful groups occupying various regions of the land, adding to the sense of difficulty.",
      "Baptist": "Details the geographical distribution of various powerful pagan nations throughout the land, further emphasizing the perceived difficulty of conquest.",
      "Catholic": "Offers a geopolitical assessment, identifying the locations of various formidable peoples inhabiting different regions of Canaan.",
      "Methodist": "The spies elaborate on the inhabitants, mapping out the locations of different powerful groups across the land.",
      "Lutheran": "The report specifies the location of various strong nations within Canaan, adding detail to the perceived military challenge."
    },
    "30": {
      "General": "Caleb interrupted the negative report, silencing the people before Moses and urging immediate action: 'Let us go up at once, and possess it; for we are well able to overcome it.'",
      "Non-Denominational": "Caleb provides a contrasting voice of faith, attempting to counteract the fear by urging immediate conquest based on confidence in their ability (implicitly, with God's help).",
      "Baptist": "Caleb boldly counters the fearful report, silencing the people and expressing strong faith in God's power to give them victory ('we are well able').",
      "Catholic": "Caleb intervenes to quell the rising fear, exhorting the people to advance immediately in faith, confident in their God-given ability to conquer.",
      "Methodist": "Caleb represents the response of faith, silencing the fear-mongering and urging immediate, confident action to possess the land.",
      "Lutheran": "Caleb interrupts the fearful report with a bold confession of faith, urging immediate occupation based on the certainty of their ability (through God) to overcome."
    },
    "31": {
      "General": "But the other ten spies who went with Caleb contradicted him, insisting they were unable to conquer the people because the inhabitants were stronger.",
      "Non-Denominational": "The majority immediately refutes Caleb's faith, reverting to fear and focusing solely on the human disparity in strength.",
      "Baptist": "The ten unbelieving spies directly contradict Caleb's faith-filled exhortation, insisting on their own inability due to the enemy's superior strength.",
      "Catholic": "The other ten spies oppose Caleb, asserting their inability to overcome the inhabitants based on a purely human assessment of strength.",
      "Methodist": "The majority of spies reject Caleb's call to faith, reiterating their fear-based assessment that the inhabitants are too strong.",
      "Lutheran": "The ten spies counter Caleb's faith with unbelief, focusing on the perceived human impossibility of victory due to the enemy's strength."
    },
    "32": {
      "General": "They spread a slanderous ('evil') report, claiming the land 'eats up' its inhabitants and that all the people they saw were of great stature.",
      "Non-Denominational": "The report devolves into slander, exaggerating the dangers ('land eats inhabitants') and generalizing about the people's size to maximize fear.",
      "Baptist": "The ten spies deliberately bring a slanderous, evil report, falsely portraying the land as deadly and exaggerating the size of all its inhabitants.",
      "Catholic": "The ten spies disseminate a defamatory ('evil') report, falsely characterizing the land as consuming its people and exaggerating the stature of its inhabitants.",
      "Methodist": "The majority report becomes an 'evil report,' a slanderous exaggeration painting the land as inherently deadly and all its people as giants.",
      "Lutheran": "The ten spies actively spread an 'evil report' (slander), misrepresenting the land as deadly and exaggerating the size of the inhabitants to incite fear."
    },
    "33": {
      "General": "They specifically mention seeing giants (Nephilim, sons of Anak) and describe their own self-perception as 'grasshoppers' in comparison, claiming the giants saw them the same way.",
      "Non-Denominational": "The report culminates in the ultimate expression of fear and insignificance, comparing themselves to grasshoppers before the giants, projecting their fear onto the enemy's perception.",
      "Baptist": "They emphasize the presence of giants (Nephilim/Anakim) and express their utter terror and self-perceived insignificance ('grasshoppers'), demonstrating a complete lack of faith in God.",
      "Catholic": "They highlight the presence of giants (descendants of Anak/Nephilim) and convey their extreme fear and diminished self-worth by comparing themselves to grasshoppers, projecting this view onto the giants.",
      "Methodist": "The fearful spies focus on the giants, expressing their own feelings of powerlessness ('grasshoppers') and assuming the giants viewed them with similar contempt.",
      "Lutheran": "The evil report climaxes with the mention of giants (Nephilim/Anakim) and the spies' fearful self-assessment as 'grasshoppers,' both in their own eyes and supposedly in the giants' eyes, showing complete failure of faith."
    }
  }
}
