{
  "chapterSummary": {
    "General": "Numbers 14 describes the Israelites' rebellion after the spies' report and God's judgment, emphasizing the consequences of unbelief and disobedience.",
    "Non-Denominational": "This chapter highlights the consequences of unbelief and disobedience.",
    "Baptist": "The chapter emphasizes the consequences of unbelief and disobedience in God's work.",
    "Catholic": "Numbers 14 illustrates the Church's understanding of unbelief and disobedience.",
    "Methodist": "This chapter shows the consequences of unbelief and disobedience in the community.",
    "Lutheran": "The chapter demonstrates God's order and the consequences of unbelief.",
    "Presbyterian": "This chapter reflects God's covenant faithfulness and the consequences of unbelief.",
    "Pentecostal": "Numbers 14 shows the importance of spiritual belief and obedience in God's kingdom.",
    "Anglican": "The chapter demonstrates the consequences of unbelief and disobedience in the Church.",
    "Orthodox": "This chapter reveals the sacred nature of belief and obedience."
  },
  "1": {
    "General": "That night all the members of the community raised their voices and wept aloud.",
    "Non-Denominational": "The weeping highlights the consequences of fear and unbelief.",
    "Baptist": "The verse emphasizes the consequences of fear and unbelief in God's work.",
    "Catholic": "The weeping reflects the consequences of fear and unbelief in the Church.",
    "Methodist": "This verse shows the consequences of fear and unbelief in the community.",
    "Lutheran": "The weeping highlights the consequences of fear.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the consequences of fear.",
    "Pentecostal": "The weeping emphasizes the consequences of fear and unbelief.",
    "Anglican": "The account highlights the consequences of fear and unbelief in His plan.",
    "Orthodox": "This verse reveals the consequences of fear and unbelief in His plan."
  },
  "2": {
    "General": "All the Israelites grumbled against Moses and Aaron, and the whole assembly said to them, 'If only we had died in Egypt! Or in this wilderness!'
    "Non-Denominational": "The grumbling highlights the dangers of discontent and rebellion.",
    "Baptist": "The verse emphasizes the dangers of discontent and rebellion in God's work.",
    "Catholic": "The grumbling reflects the dangers of discontent and rebellion in the Church.",
    "Methodist": "This verse shows the dangers of discontent and rebellion in the community.",
    "Lutheran": "The grumbling highlights the dangers of discontent.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the dangers of discontent.",
    "Pentecostal": "The grumbling emphasizes the dangers of discontent and rebellion.",
    "Anglican": "The account highlights the dangers of discontent and rebellion in His plan.",
    "Orthodox": "This verse reveals the dangers of discontent and rebellion in His plan."
  },
  "3": {
    "General": "Why is the Lord bringing us to this land only to let us fall by the sword? Our wives and children will be taken as plunder. Wouldn't it be better for us to go back to Egypt?'
    "Non-Denominational": "The questioning highlights the dangers of doubt and lack of trust.",
    "Baptist": "The verse emphasizes the dangers of doubt and lack of trust in God's work.",
    "Catholic": "The questioning reflects the dangers of doubt and lack of trust in the Church.",
    "Methodist": "This verse shows the dangers of doubt and lack of trust in the community.",
    "Lutheran": "The questioning highlights the dangers of doubt.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the dangers of doubt.",
    "Pentecostal": "The questioning emphasizes the dangers of doubt and lack of trust.",
    "Anglican": "The account highlights the dangers of doubt and lack of trust in His plan.",
    "Orthodox": "This verse reveals the dangers of doubt and lack of trust in His plan."
  },
  "4": {
    "General": "And they said to each other, 'We should choose a leader and go back to Egypt.'
    "Non-Denominational": "The desire to return highlights the dangers of rebellion and lack of faith.",
    "Baptist": "The verse emphasizes the dangers of rebellion and lack of faith in God's work.",
    "Catholic": "The desire to return reflects the dangers of rebellion and lack of faith in the Church.",
    "Methodist": "This verse shows the dangers of rebellion and lack of faith in the community.",
    "Lutheran": "The desire to return highlights the dangers of rebellion.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the dangers of rebellion.",
    "Pentecostal": "The desire to return emphasizes the dangers of rebellion and lack of faith.",
    "Anglican": "The account highlights the dangers of rebellion and lack of faith in His plan.",
    "Orthodox": "This verse reveals the dangers of rebellion and lack of faith in His plan."
  },
  "5": {
    "General": "Then Moses and Aaron fell facedown in front of the whole Israelite assembly gathered there.",
    "Non-Denominational": "Moses and Aaron's response highlights the importance of humility and intercession.",
    "Baptist": "The verse emphasizes the importance of humility and intercession in God's work.",
    "Catholic": "Moses and Aaron's response reflects the importance of humility and intercession in the Church.",
    "Methodist": "This verse shows the importance of humility and intercession in the community.",
    "Lutheran": "Moses and Aaron's response highlights the importance of humility.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of humility.",
    "Pentecostal": "Moses and Aaron's response emphasizes the importance of humility and intercession.",
    "Anglican": "The account highlights the importance of humility and intercession in His plan.",
    "Orthodox": "This verse reveals the importance of humility and intercession in His plan."
  }
} 