{
  "Summary": {
    "General": "Reacting to the spies' evil report, the entire congregation weeps and murmurs against Moses and Aaron, wishing they had died in Egypt or the wilderness. They question God bringing them to Canaan only to die and propose appointing a new captain to return to Egypt. Moses and Aaron fall prostrate, while Joshua and Caleb tear their clothes, reaffirming the land's goodness and urging the people not to rebel or fear, assuring them God is with them and the Canaanites are defenseless. The congregation threatens to stone them, but the glory of the Lord appears. God expresses His anger at the people's persistent unbelief despite His signs, threatening to destroy them with pestilence and raise a greater nation from Moses. Moses intercedes, pleading based on God's reputation among the nations and His character (longsuffering, merciful). God pardons but decrees that the rebellious adult generation (20 years and older) will die in the wilderness and never see the promised land, except for Caleb and Joshua. Their children, however, will inherit the land after wandering for 40 years (a year for each day the spies searched), bearing the consequences of their parents' unfaithfulness ('whoredoms'). The ten unfaithful spies die immediately by plague. The people mourn upon hearing the judgment but then presumptuously try to enter the land against God's command and Moses' warning. They are defeated by the Amalekites and Canaanites at Hormah because the Lord was not with them.",
    "Non-Denominational": "Focuses on the people's full-blown rebellion stemming from unbelief fueled by the evil report. Highlights the contrast between the congregation's fear and desire to return to slavery, and the faith of Joshua and Caleb. Emphasizes Moses' powerful intercession appealing to God's glory and character. Underscores God's judgment on unbelief (forty years wandering, death of the generation) but also His faithfulness to His promise through the next generation. Shows the folly of presumptuous action taken without God's presence or command (defeat at Hormah).",
    "Baptist": "Emphasizes the grievous sin of the congregation's murmuring, unbelief, and rebellion against God and His appointed leaders. Highlights the faithfulness of Joshua and Caleb amidst widespread apostasy. Underscores the severity of God's righteous judgment upon the unbelieving generation, fulfilling their death wish in the wilderness. Accents Moses' intercession as a type of Christ's, appealing to God's mercy and glory. Notes the immediate judgment on the ten evil spies and the consequence of presumptuous sin in the defeat at Hormah.",
    "Catholic": "Views the people's outcry as a grave sin of despair and rebellion against God's plan and providence. Contrasts the faithful witness of Joshua and Caleb with the congregation's infidelity. Moses' intercession exemplifies pleading for mercy based on God's attributes and honor. God's judgment, tempered by mercy due to Moses' plea, involves the forty-year penance in the wilderness, excluding the rebellious generation (except the faithful two) from the Promised Land. The subsequent failed invasion attempt is seen as a sin of presumption, acting against God's declared will.",
    "Methodist": "Stresses the tragic consequences of yielding to fear and unbelief, leading to open rebellion against God. Highlights the courage and faith of Joshua and Caleb. Emphasizes Moses' role as intercessor, appealing to God's character (longsuffering, mercy). Shows God's justice in punishing the rebellious generation while upholding His covenant promise through their children. The forty years represent a period of discipline and consequence. The defeat at Hormah illustrates the failure of human effort apart from God's guidance and presence.",
    "Lutheran": "Focuses on the congregation's rejection of God's Word and promise, manifested in weeping, murmuring, and desiring to return to Egypt. Contrasts this unbelief with the faith of Joshua and Caleb who trusted God's promise. Highlights God's righteous wrath against sin and unbelief, justly condemning the generation. Moses' intercession appeals to God's declared character (longsuffering, merciful). God's judgment (forty years wandering) is a direct consequence of rejecting His promise, while His grace is shown in preserving the next generation. The defeat at Hormah demonstrates the futility of works righteousness/presumption apart from faith."
  },
  "Verses": {
    "1": {
      "General": "Following the spies' report, the entire congregation cries out loud and weeps all night.",
      "Non-Denominational": "The people react to the negative report with communal despair and grief, setting the stage for rebellion.",
      "Baptist": "Records the immediate, widespread emotional response of weeping and crying, demonstrating the impact of the evil report and their lack of faith.",
      "Catholic": "Narrates the congregation's collective lamentation throughout the night, a response of despair to the spies' fearful report.",
      "Methodist": "Shows the immediate, negative emotional reaction of the entire community, weeping in fear and disappointment.",
      "Lutheran": "The congregation responds to the evil report not with faith, but with weeping and crying, rejecting God's promise."
    },
    "2": {
      "General": "All the Israelites murmur against Moses and Aaron, expressing the wish they had died in Egypt or the wilderness.",
      "Non-Denominational": "The grief turns to murmuring against leadership, revealing a desire for death over facing the perceived challenges of God's plan.",
      "Baptist": "Records the sin of murmuring against God's appointed leaders, expressing a death wish rooted in unbelief and fear.",
      "Catholic": "The people's despair turns into sinful murmuring against Moses and Aaron, expressing a preference for death over entering Canaan.",
      "Methodist": "Highlights the escalation from weeping to actively murmuring against leadership, wishing for death rather than trusting God.",
      "Lutheran": "The Israelites murmur against Moses and Aaron, wishing for death in Egypt or the wilderness, explicitly rejecting God's leading."
    },
    "3": {
      "General": "They accuse the Lord of bringing them to Canaan to be killed, fearing their wives and children will become plunder, and question if returning to Egypt is better.",
      "Non-Denominational": "They directly question God's motives, projecting their fear onto His intentions and openly considering returning to bondage as preferable.",
      "Baptist": "Records their blasphemous accusation against God, attributing evil motives to Him and expressing preference for Egyptian bondage over God's promise.",
      "Catholic": "They question God's intentions, accusing Him of leading them to slaughter and expressing the desire to return to Egypt, rejecting the divine plan.",
      "Methodist": "Shows the depth of their rebellion, questioning God's goodness, fearing for their families, and contemplating a return to Egypt.",
      "Lutheran": "They directly accuse God of bringing them to Canaan to die, demonstrating complete distrust and preferring Egypt over God's promise."
    },
    "4": {
      "General": "They conspire amongst themselves to appoint a new leader and return to Egypt.",
      "Non-Denominational": "The rebellion solidifies into a plan for organized mutiny, rejecting God's leadership (through Moses) and seeking to reverse the Exodus.",
      "Baptist": "Records their overt act of rebellion: plotting to replace Moses and return to Egyptian slavery, rejecting God's deliverance.",
      "Catholic": "Narrates their seditious proposal to appoint a new leader and return to Egypt, an act of outright rebellion against God and Moses.",
      "Methodist": "Highlights the peak of their rebellion: actively planning to choose a new leader and return to Egypt.",
      "Lutheran": "They propose appointing a new leader to take them back to Egypt, a complete rejection of God's authority and deliverance."
    },
    "5": {
      "General": "In response to this open rebellion, Moses and Aaron fall on their faces before the entire assembly.",
      "Non-Denominational": "Moses and Aaron respond with humility and intercession, prostrating themselves before God in the face of the people's defiance.",
      "Baptist": "Shows Moses and Aaron's response of humility, grief, and intercession, falling on their faces before God and the rebellious assembly.",
      "Catholic": "Moses and Aaron react with profound humility and supplication, prostrating themselves before the rebellious congregation.",
      "Methodist": "Illustrates the leaders' response to the crisis: falling on their faces in dismay, humility, and likely prayer.",
      "Lutheran": "Moses and Aaron fall on their faces in humility and supplication before the assembly, acknowledging the severity of the rebellion."
    },
    "6": {
      "General": "Joshua and Caleb, two of the spies, tear their clothes in distress and disagreement.",
      "Non-Denominational": "Joshua and Caleb express their grief and strong disagreement with the people's rebellion by tearing their garments, a traditional sign of mourning and distress.",
      "Baptist": "Records the reaction of the two faithful spies, Joshua and Caleb, tearing their clothes in righteous grief over the people's sinful rebellion.",
      "Catholic": "Joshua and Caleb, the faithful spies, demonstrate their anguish and rejection of the rebellion by rending their garments.",
      "Methodist": "Shows the contrasting reaction of the faithful spies, tearing their clothes as a sign of deep sorrow and protest against the rebellion.",
      "Lutheran": "Joshua and Caleb, who held to faith, tear their clothes in mourning and protest against the congregation's unbelief."
    },
    "7": {
      "General": "They address the congregation, strongly affirming that the land they searched is exceedingly good.",
      "Non-Denominational": "Joshua and Caleb counter the negative report by emphatically restating the positive truth about the land's quality.",
      "Baptist": "The faithful spies boldly declare to the congregation the truth about the land: it is exceedingly good, contradicting the evil report.",
      "Catholic": "Joshua and Caleb speak to the assembly, forcefully reaffirming the exceptional goodness of the land they explored.",
      "Methodist": "They appeal to the people, reiterating the positive reality of the land they scouted, calling it 'exceeding good'.",
      "Lutheran": "Joshua and Caleb testify to the congregation about the land's outstanding quality, directly refuting the slanderous report."
    },
    "8": {
      "General": "They express confidence that if the Lord is pleased with them, He will bring them into the land flowing with milk and honey and give it to them.",
      "Non-Denominational": "Their confidence is rooted in God's favor ('if the Lord delight in us'), linking God's pleasure with His power to fulfill His promise.",
      "Baptist": "They declare that entry into the promised land depends on God's delight in them, expressing faith in His power to give them the abundant land.",
      "Catholic": "They condition the reception of the promised land on God's favor ('If the Lord delight in us'), affirming His power to grant them possession.",
      "Methodist": "They connect possessing the land to God's favor, expressing faith that His delight ensures He will fulfill His promise.",
      "Lutheran": "They state the condition for receiving the land: God's delight in them, affirming His ability and willingness to give them the good land."
    },
    "9": {
      "General": "They plead with the people not to rebel against the Lord or fear the Canaanites, assuring them the inhabitants are 'bread for us' (easily consumed), their protection is gone, and the Lord is with Israel.",
      "Non-Denominational": "Urges against rebellion and fear, reframing the enemy as vulnerable ('bread') because their divine protection is removed and God is present with Israel.",
      "Baptist": "Exhorts the people to avoid the sin of rebellion and fear, assuring them of victory because the enemy's defense is gone and God is with Israel.",
      "Catholic": "They implore the people not to rebel against God nor fear the inhabitants, whom they describe as vulnerable ('bread') because their supernatural protection ('defence'/shadow) has departed and God is with Israel.",
      "Methodist": "Makes a passionate plea against rebellion and fear, assuring the people of victory by describing the enemy as easily conquerable ('bread') due to God's presence with Israel.",
      "Lutheran": "They command the people not to rebel or fear, declaring the Canaanites are 'bread' (easily defeated) because God is with Israel and the enemy's protection is gone."
    },
    "10": {
      "General": "Despite their plea, the congregation commands that Joshua and Caleb be stoned. At that moment, the glory of the Lord appears at the tabernacle before everyone.",
      "Non-Denominational": "The rebellion escalates to murderous intent against the voices of faith. God intervenes dramatically with a visible manifestation of His glory.",
      "Baptist": "Records the congregation's wicked response: intending to stone the faithful witnesses. God dramatically intervenes, revealing His glory to halt the execution.",
      "Catholic": "The congregation rejects the plea for faith and commands the stoning of Joshua and Caleb. Divine intervention occurs as the glory of the Lord manifests at the Tabernacle.",
      "Methodist": "Shows the depth of the people's rejection of faith, ordering the stoning of Joshua and Caleb. God's glory appears, intervening decisively.",
      "Lutheran": "The congregation responds to the call for faith by demanding Joshua and Caleb be stoned. God intervenes visibly, His glory appearing at the Tabernacle."
    },
    "11": {
      "General": "The Lord questions Moses about how long the people will provoke Him and refuse to believe despite all the signs He has performed.",
      "Non-Denominational": "God expresses His frustration and grief over the people's persistent unbelief and provocation, highlighting their rejection despite overwhelming evidence (signs).",
      "Baptist": "God confronts Moses with the people's ongoing sin of provoking Him through unbelief, despite the multitude of miracles they witnessed.",
      "Catholic": "The Lord laments to Moses the people's persistent lack of faith and provocation, despite the numerous miracles performed among them.",
      "Methodist": "God questions Moses, expressing deep disappointment at the people's continued disbelief and provocation, even after seeing His mighty works.",
      "Lutheran": "God questions Moses, highlighting the people's persistent sin of provoking Him and refusing to believe (trust) despite the many signs."
    },
    "12": {
      "General": "God declares His intention to strike the people with pestilence, disinherit them, and make a greater and mightier nation from Moses himself.",
      "Non-Denominational": "God proposes a judgment: wiping out the rebellious nation and starting anew with Moses, fulfilling His covenant through him differently.",
      "Baptist": "God declares His righteous judgment: to destroy the rebellious nation by plague and fulfill His promise through Moses, making him a greater nation.",
      "Catholic": "God threatens total destruction of the Israelites via pestilence and proposes creating a new, greater nation descended from Moses.",
      "Methodist": "God expresses His righteous anger, threatening to destroy the current generation and make a mightier nation through Moses.",
      "Lutheran": "God declares His judgment: He will strike them with plague, disinherit them, and make a greater nation from Moses."
    },
    "13": {
      "General": "Moses begins his intercession, arguing that the Egyptians will hear of Israel's destruction.",
      "Non-Denominational": "Moses starts his appeal by focusing on the external consequences: how God's actions will be perceived by Egypt.",
      "Baptist": "Moses begins his intercession by appealing to God's reputation among the Egyptians, who witnessed His power in the Exodus.",
      "Catholic": "Moses initiates his intercessory plea, arguing that the destruction of Israel would be known to the Egyptians.",
      "Methodist": "Moses starts his plea by appealing to God's reputation, pointing out that the Egyptians would hear of this judgment.",
      "Lutheran": "Moses begins interceding, arguing that the Egyptians, who saw God's power, will hear of Israel's destruction."
    },
    "14": {
      "General": "Moses continues, saying the Egyptians will tell the inhabitants of Canaan, who know the Lord is uniquely present with Israel (seen face to face, guided by cloud and fire).",
      "Non-Denominational": "Moses argues that God's unique, visible presence with Israel is known, and destroying them would undermine His reputation among the Canaanites.",
      "Baptist": "Moses reasons that the Canaanites, who know of God's intimate presence with Israel (face to face, cloud, fire), will hear from the Egyptians.",
      "Catholic": "Moses argues that Canaan's inhabitants know of God's intimate presence with Israel (manifested face to face, cloud, fire), and news of their destruction would spread.",
      "Methodist": "Moses points out that the surrounding nations are aware of God's special relationship with Israel, evidenced by His visible presence.",
      "Lutheran": "Moses argues that the Canaanites have heard of God's unique presence with Israel (face to face, cloud, fire pillar) and will be told of their demise."
    },
    "15": {
      "General": "Moses states that if God kills all the Israelites as one man, the nations who heard of His fame will talk.",
      "Non-Denominational": "Moses highlights the potential damage to God's global reputation if He were to destroy the entire nation at once.",
      "Baptist": "Moses appeals to God's glory, arguing that destroying Israel wholesale would lead the nations to question His power and faithfulness.",
      "Catholic": "Moses contends that the wholesale destruction of Israel would lead the surrounding nations, aware of God's fame, to draw negative conclusions.",
      "Methodist": "Moses continues his appeal based on God's reputation, warning how the nations would interpret the destruction of Israel.",
      "Lutheran": "Moses argues that if God destroys Israel completely, the nations who know His fame will inevitably gossip and draw wrong conclusions."
    },
    "16": {
      "General": "Moses anticipates the nations' conclusion: that the Lord was unable to bring Israel into the promised land He swore to give them, so He killed them in the wilderness.",
      "Non-Denominational": "Moses voices the specific slander that would damage God's reputation: perceived inability or failure to fulfill His sworn promise.",
      "Baptist": "Moses articulates the blasphemous conclusion the nations would draw: that God lacked the power to fulfill His oath, hence their destruction.",
      "Catholic": "Moses explicitly states the potential slander: the nations would conclude God lacked the power to fulfill His sworn promise to bring Israel into Canaan.",
      "Methodist": "Moses spells out the damaging conclusion the nations might reach: attributing Israel's destruction to God's lack of power rather than Israel's sin.",
      "Lutheran": "Moses argues the nations would conclude God killed Israel because He was unable (lacked power) to fulfill His promise to give them the land."
    },
    "17": {
      "General": "Moses pleads for the Lord's power to be shown great, in accordance with God's own declarations about His character.",
      "Non-Denominational": "Moses shifts his appeal, asking God to demonstrate His power not in destruction, but through the greatness of His declared character (mercy, patience).",
      "Baptist": "Moses appeals for God to magnify His power through mercy and forgiveness, consistent with God's own self-revelation.",
      "Catholic": "Moses implores God to manifest His power through mercy, recalling God's own revelation of His divine attributes.",
      "Methodist": "Moses pleads for God to demonstrate His greatness through His proclaimed character traits, shifting from wrath to mercy.",
      "Lutheran": "Moses appeals for God's power to be displayed in accordance with His revealed character, specifically His mercy."
    },
    "18": {
      "General": "Moses quotes God's self-description: longsuffering, abundant in mercy, forgiving iniquity and transgression, yet not clearing the guilty, visiting consequences on subsequent generations.",
      "Non-Denominational": "Moses reminds God of His own balanced character: immense mercy and forgiveness, yet also justice that ensures sin has consequences.",
      "Baptist": "Moses quotes God's revelation of His character (Exodus 34:6-7): emphasizing His longsuffering, mercy, and forgiveness, while acknowledging His justice.",
      "Catholic": "Moses explicitly recalls God's revelation of His attributes: patience, abundant mercy, forgiveness, but also justice that holds transgressors accountable across generations.",
      "Methodist": "Moses appeals directly to God's revealed nature: patient, merciful, forgiving, yet just in dealing with sin and its effects.",
      "Lutheran": "Moses quotes God's own words describing Himself as longsuffering, merciful, forgiving sin, but also just, not clearing the guilty and allowing consequences."
    },
    "19": {
      "General": "Based on God's great mercy, Moses pleads for God to pardon the people's iniquity, just as He had forgiven them repeatedly since Egypt.",
      "Non-Denominational": "Moses directly asks for pardon, appealing to the greatness of God's mercy already demonstrated throughout their journey from Egypt.",
      "Baptist": "Moses pleads for pardon based on God's abundant mercy and His past record of forgiving Israel's persistent sinfulness since the Exodus.",
      "Catholic": "Moses implores God to pardon Israel's sin according to His great mercy, citing God's consistent forgiveness from Egypt until that moment.",
      "Methodist": "Moses bases his plea for pardon on God's great mercy, pointing to God's history of forgiving this same people repeatedly.",
      "Lutheran": "Moses asks God to pardon Israel's sin based on His great mercy, reminding God of His consistent forgiveness since Egypt."
    },
    "20": {
      "General": "The Lord responds to Moses' intercession, stating, 'I have pardoned according to thy word.'",
      "Non-Denominational": "God grants Moses' request, agreeing to pardon the people and not destroy them wholesale as initially threatened.",
      "Baptist": "God responds affirmatively to Moses' intercession, granting pardon based on Moses' plea, demonstrating the effectiveness of intercessory prayer.",
      "Catholic": "The Lord grants Moses' request, pardoning the people as Moses asked, demonstrating the power of intercessory prayer.",
      "Methodist": "God answers Moses' prayer, agreeing to pardon the people according to his plea, showing mercy prevailed over immediate destruction.",
      "Lutheran": "God answers Moses' intercession, declaring He has pardoned according to Moses' word, showing His mercy."
    },
    "21": {
      "General": "However, God makes a solemn oath ('as truly as I live') that His glory will fill the entire earth.",
      "Non-Denominational": "Despite the pardon, God swears an oath affirming His ultimate purpose: His glory will be universally manifest, implying judgment will still occur to uphold it.",
      "Baptist": "God qualifies the pardon with an oath affirming His sovereignty and purpose: His glory will ultimately fill the earth, necessitating judgment on persistent unbelief.",
      "Catholic": "Despite the pardon, God affirms with an oath His unwavering resolve that His glory will ultimately be revealed throughout the earth, implying judgment is still necessary.",
      "Methodist": "God tempers the pardon with a solemn oath, declaring His glory will fill the earth, suggesting the pardon doesn't negate all consequences.",
      "Lutheran": "God swears by His own life that His glory will fill the earth, indicating that while He pardons from annihilation, judgment upholding His glory will follow."
    },
    "22": {
      "General": "God specifies that the men who saw His glory and miracles in Egypt and the wilderness, yet repeatedly tested Him ('ten times') and disobeyed, will face consequences.",
      "Non-Denominational": "God identifies the specific group subject to judgment: the adult generation who witnessed His power but consistently chose unbelief and disobedience ('tested me ten times').",
      "Baptist": "God delineates the specific guilt of the generation that witnessed His glory and miracles yet tempted Him repeatedly ('ten times') and disobeyed.",
      "Catholic": "God identifies the culpable generation: those men who witnessed His glory and miracles but repeatedly tested His patience ('ten times') and disobeyed.",
      "Methodist": "God clarifies who faces judgment: the generation that saw His glory and miracles but still repeatedly tested Him ('ten times') through disobedience.",
      "Lutheran": "God specifies the reason for judgment: this generation saw His glory and signs yet tested Him repeatedly ('ten times') and disobeyed His voice."
    },
    "23": {
      "General": "God decrees that this rebellious generation ('surely they shall not see the land') which provoked Him will not enter the land He promised to their ancestors.",
      "Non-Denominational": "The specific judgment is pronounced: the generation that refused to believe will be excluded from entering the Promised Land.",
      "Baptist": "God declares the sentence: the unbelieving generation that provoked Him is barred from entering the land sworn to their fathers.",
      "Catholic": "The divine sentence is decreed: the rebellious generation that provoked God will absolutely not enter the land promised under oath to their forefathers.",
      "Methodist": "God pronounces the judgment: the generation marked by provocation and unbelief will forfeit their entry into the Promised Land.",
      "Lutheran": "God decrees the consequence of their unbelief: this generation, having provoked God, will certainly not see the promised land."
    },
    "24": {
      "General": "God makes an exception for Caleb, praising him for having a different spirit and following Him fully, promising to bring him into the land and give it to his descendants.",
      "Non-Denominational": "Caleb is singled out for his faithfulness ('another spirit,' 'followed me fully') and rewarded with the promise of entering and possessing the land.",
      "Baptist": "God explicitly commends Caleb for his faithfulness ('another spirit,' 'followed me fully') and promises him entry and inheritance in the land.",
      "Catholic": "God explicitly exempts Caleb due to his different, faithful spirit and complete obedience, promising him entry into Canaan and inheritance for his descendants.",
      "Methodist": "God contrasts Caleb's faithfulness ('different spirit,' 'followed me fully') with the others, rewarding him with the promise of entering and possessing the land.",
      "Lutheran": "God makes an exception for Caleb, praising his different spirit and full obedience, promising him entry and inheritance."
    },
    "25": {
      "General": "God notes the presence of Amalekites and Canaanites in the valley and instructs the Israelites to turn back towards the wilderness via the Red Sea route the next day.",
      "Non-Denominational": "Acknowledging the current inhabitants, God redirects Israel away from Canaan, back towards the wilderness route they previously traveled.",
      "Baptist": "Noting the presence of enemies, God commands Israel to retreat from Canaan's border and return to the wilderness towards the Red Sea.",
      "Catholic": "Mentioning the hostile inhabitants, God commands the Israelites to turn back from Canaan and journey into the wilderness toward the Red Sea.",
      "Methodist": "Referencing the local inhabitants, God redirects the Israelites' path away from the promised land, back towards the Red Sea wilderness.",
      "Lutheran": "God acknowledges the enemy presence and commands Israel to turn back into the wilderness by way of the Red Sea."
    },
    "26": {
      "General": "The Lord speaks further instructions to both Moses and Aaron.",
      "Non-Denominational": "A preface indicating that the following message is a divine command directed to both leaders.",
      "Baptist": "Records God addressing both Moses and Aaron with the subsequent judgment.",
      "Catholic": "Introduces a further divine communication addressed jointly to Moses and Aaron.",
      "Methodist": "Indicates God continues speaking, now addressing both Moses and Aaron together.",
      "Lutheran": "God speaks again, addressing both Moses and Aaron with the detailed judgment."
    },
    "27": {
      "General": "God expresses His impatience with the 'evil congregation' and their constant murmuring, stating He has heard their complaints.",
      "Non-Denominational": "God reiterates His frustration with the people's wickedness and persistent complaining, emphasizing His awareness of their words.",
      "Baptist": "God questions how long He must endure the people's evil murmuring, affirming He has heard their sinful complaints.",
      "Catholic": "God expresses His weariness with the rebellious congregation's constant murmuring, stating He has heard their complaints.",
      "Methodist": "God voices His exasperation with the people's evil attitude and complaining, confirming He has heard their murmurings.",
      "Lutheran": "God asks how long He must tolerate this evil, murmuring congregation, stating He has heard their complaints."
    },
    "28": {
      "General": "God instructs Moses and Aaron to tell the people: As surely as He lives, what they spoke in His hearing (wishing to die in the wilderness) is exactly what He will do to them.",
      "Non-Denominational": "God declares under oath that He will give the people exactly what they asked for in their rebellious complaints: death in the wilderness.",
      "Baptist": "God swears an oath ('As truly as I live') to fulfill the people's sinful death wish, giving them the judgment their words invited.",
      "Catholic": "God instructs the leaders to relay His sworn decree: He will grant the people's wish, expressed in their murmuring, to die in the wilderness.",
      "Methodist": "God solemnly swears to give the people the outcome they spoke of in their murmuring - death in the wilderness.",
      "Lutheran": "God swears by His life ('As truly as I live') that He will do to them exactly what they spoke in their unbelief: they will die in the wilderness."
    },
    "29": {
      "General": "God specifies that the carcasses of all those numbered aged twenty and older who murmured against Him will fall in the wilderness.",
      "Non-Denominational": "The judgment is defined: all adults (20+) counted in the census who participated in the murmuring will die in the wilderness.",
      "Baptist": "God details the judgment: the bodies of the murmuring generation, aged twenty and up, will fall in the wilderness.",
      "Catholic": "The sentence is specified: the corpses of all Israelites aged twenty years or more who murmured against God will litter the wilderness.",
      "Methodist": "God clarifies the scope of the judgment: all the numbered men twenty years and older who murmured will die there.",
      "Lutheran": "God specifies the judgment: the corpses of all the numbered men (20+) who murmured will fall in the wilderness."
    },
    "30": {
      "General": "God emphatically states that none of that generation will enter the land He swore to give them, except Caleb and Joshua.",
      "Non-Denominational": "Reiterates the exclusion of the rebellious generation from the promised land, explicitly naming the only two exceptions: Caleb and Joshua.",
      "Baptist": "God confirms the exclusion of the entire murmuring generation from Canaan, explicitly exempting only the two faithful spies, Caleb and Joshua.",
      "Catholic": "God solemnly affirms that none of the rebellious generation will enter the promised land, with the explicit exception of the faithful Caleb and Joshua.",
      "Methodist": "God strongly declares that the murmuring generation is barred from the land, except for the two faithful spies, Caleb and Joshua.",
      "Lutheran": "God firmly decrees ('Doubtless ye shall not come...') the exclusion of the rebellious generation, saving only Caleb and Joshua."
    },
    "31": {
      "General": "God declares that their children ('little ones'), whom they feared would become prey, will instead enter and experience the land the parents despised.",
      "Non-Denominational": "God reverses the parents' fearful prediction: the children will inherit the promise, experiencing the good land their parents rejected through unbelief.",
      "Baptist": "God promises that the children, feared for by their parents, will enter and possess the land the parents despised, demonstrating God's faithfulness despite Israel's sin.",
      "Catholic": "God declares that the children, whom the parents feared would perish, will be brought into Canaan and will know the land their parents scorned.",
      "Methodist": "God contrasts the fate of the children with their parents: the children will enter and know the land the parents rejected in fear.",
      "Lutheran": "God states that the children, contrary to the parents' fears, will enter and know the good land which the unbelieving parents despised."
    },
    "32": {
      "General": "God reiterates the fate of the rebellious adults: their carcasses will fall in the wilderness.",
      "Non-Denominational": "Repeats the sentence for emphasis: the current adult generation will die outside the promised land.",
      "Baptist": "God repeats the judgment upon the murmuring generation for emphasis: their bodies will fall in the wilderness.",
      "Catholic": "The sentence upon the rebellious adults is reiterated: their corpses will fall in the wilderness.",
      "Methodist": "God reaffirms the judgment on the parents: they will die in the wilderness.",
      "Lutheran": "God repeats the judgment on the adult generation: their carcasses will fall in this wilderness."
    },
    "33": {
      "General": "Their children will wander as shepherds in the wilderness for forty years, bearing the consequences of their parents' unfaithfulness ('whoredoms') until that generation dies off.",
      "Non-Denominational": "The next generation faces a consequence: forty years of nomadic life, suffering for their parents' spiritual infidelity until the guilty generation perishes.",
      "Baptist": "Pronounces the sentence on the children: forty years of wandering, bearing the shame and consequence of their parents' spiritual adultery (unfaithfulness) until that generation is gone.",
      "Catholic": "Decrees that the children will wander nomadically for forty years, bearing the consequences of their parents' infidelity ('whoredoms') until the sinful generation dies.",
      "Methodist": "Specifies the consequence for the children: forty years of wandering, suffering because of their parents' unfaithfulness ('whoredoms'), until the older generation dies.",
      "Lutheran": "The children are sentenced to wander for forty years, bearing the consequences of their parents' spiritual unfaithfulness ('whoredoms'), until the older generation is dead."
    },
    "34": {
      "General": "God connects the forty years of wandering directly to the forty days the spies searched the land (a year for each day), stating they will bear their iniquities and know His 'breach of promise' (or opposition/displeasure).",
      "Non-Denominational": "Explains the duration of the punishment (40 years = 40 days), linking it directly to the spying mission. They will experience the consequences of their sin and God's resulting displeasure/turning away.",
      "Baptist": "Establishes the symbolic link between the forty days of spying and the forty years of punishment, during which they will bear their sins and experience God's judgment ('breach of promise'/alienation).",
      "Catholic": "Specifies the duration (forty years) corresponds to the forty days of exploration, a period for bearing their sins and understanding God's alienation due to their infidelity.",
      "Methodist": "Connects the forty years directly to the forty days of spying, indicating a period of bearing sin's consequences and experiencing God's displeasure ('breach of promise').",
      "Lutheran": "God explicitly links the forty years of punishment to the forty days of searching (day for a year), a time to bear their iniquity and know His consequent opposition/displeasure ('breach of promise')."
    },
    "35": {
      "General": "The Lord solemnly affirms He will surely carry out this judgment upon the entire evil congregation gathered against Him; they will be consumed and die in the wilderness.",
      "Non-Denominational": "God emphatically confirms His decree: the judgment pronounced upon this rebellious generation will certainly be executed in the wilderness.",
      "Baptist": "God solemnly reaffirms His unalterable decree of judgment upon the rebellious congregation: they will perish in the wilderness.",
      "Catholic": "The Lord resolutely confirms His sentence upon the entire rebellious assembly: they will meet their end and die in the wilderness.",
      "Methodist": "God makes a final, decisive declaration that His judgment upon this evil congregation will stand; they will perish there.",
      "Lutheran": "God confirms His determined judgment ('I the LORD have said, I will surely do it') upon this evil congregation: consumption and death in the wilderness."
    },
    "36": {
      "General": "The narrative returns to the ten spies who initiated the murmuring by bringing back a slanderous report about the land.",
      "Non-Denominational": "Identifies the specific men (the ten spies) whose actions directly led to the congregation's rebellion through their slanderous report.",
      "Baptist": "Specifically points to the ten spies who returned and incited the congregation to murmur by slandering the land.",
      "Catholic": "Focuses on the culpability of the ten spies who returned and caused the congregation to murmur by disseminating a slanderous report.",
      "Methodist": "Highlights the responsibility of the ten spies who caused the rebellion by returning with a slanderous report.",
      "Lutheran": "Identifies the ten spies who caused the congregation to murmur by returning and slandering the land."
    },
    "37": {
      "General": "These men, who brought the evil report, died immediately by a plague before the Lord.",
      "Non-Denominational": "Shows the swift and specific judgment upon the instigators: the ten unfaithful spies die by plague as a direct consequence of their sin.",
      "Baptist": "Records the immediate divine judgment upon the ten spies who brought the evil report: death by plague before the Lord.",
      "Catholic": "Narrates the immediate divine retribution: the ten spies responsible for the evil report die by a plague inflicted by God.",
      "Methodist": "Illustrates God's swift justice upon the leaders of the rebellion: the ten spies who gave the evil report die by plague.",
      "Lutheran": "God executes immediate judgment upon the ten spies who brought the evil report; they died by plague before Him."
    },
    "38": {
      "General": "However, Joshua and Caleb, who were also among the spies, survived.",
      "Non-Denominational": "Contrasts the fate of the faithful spies, Joshua and Caleb, who were spared from the plague that killed the other ten.",
      "Baptist": "Notes the survival of Joshua and Caleb, explicitly contrasting their preservation with the judgment on the ten unfaithful spies.",
      "Catholic": "Explicitly states that Joshua and Caleb, the faithful spies, were spared from the plague that struck down the other ten.",
      "Methodist": "Highlights the exception: Joshua and Caleb, the faithful spies, remained alive, spared from the judgment.",
      "Lutheran": "Joshua and Caleb, the two faithful spies, were preserved and did not die with the other ten."
    },
    "39": {
      "General": "Moses reported God's judgments to all the Israelites, and the people mourned greatly.",
      "Non-Denominational": "Moses communicates the divine sentence, leading to great mourning among the people as they realize the consequences of their rebellion.",
      "Baptist": "Records Moses relaying God's judgment to the Israelites, resulting in intense (but likely remorseful, not repentant) mourning.",
      "Catholic": "Moses communicates God's decrees to the Israelites, prompting profound mourning among the people.",
      "Methodist": "Shows Moses delivering the bad news of God's judgment, causing the people to mourn greatly over their fate.",
      "Lutheran": "Moses reports God's words of judgment, and the people respond with great mourning (sorrow, but not necessarily true repentance)."
    },
    "40": {
      "General": "Despite the judgment, the people rose early, went to the mountaintop, declared their intention to go up to the promised place, acknowledging they had sinned.",
      "Non-Denominational": "Shows a presumptuous reaction: attempting to obey now on their own terms, acknowledging sin but acting outside God's timing and command.",
      "Baptist": "Records the people's presumptuous attempt to enter the land, motivated by remorse rather than true repentance and faith, acting against God's command.",
      "Catholic": "Depicts the people's rash and presumptuous attempt to ascend the mountain pass into Canaan, confessing sin but acting against God's explicit prohibition.",
      "Methodist": "Illustrates a false repentance: acknowledging sin but presumptuously trying to achieve God's promise through their own effort and timing.",
      "Lutheran": "The people rise early and presumptuously attempt to go up, confessing sin but acting in self-will against God's explicit command to turn back."
    },
    "41": {
      "General": "Moses questioned why they were now transgressing the Lord's commandment (to turn back), warning their effort would not succeed.",
      "Non-Denominational": "Moses confronts their disobedience, highlighting that this action is also transgression, and predicting its failure.",
      "Baptist": "Moses rebukes their current act of transgression against God's command (to turn back) and warns them it will fail.",
      "Catholic": "Moses questions their renewed disobedience to God's command (to retreat) and warns them that their presumptuous effort will not succeed.",
      "Methodist": "Moses challenges their action as another transgression of God's command and warns them of the inevitable failure.",
      "Lutheran": "Moses confronts their presumption, asking why they are transgressing God's command (to return to the wilderness) and warning it won't prosper."
    },
    "42": {
      "General": "Moses explicitly warned them not to go up, because the Lord was not among them, and they would be defeated by their enemies.",
      "Non-Denominational": "Moses gives a clear warning: do not proceed because God's presence is withdrawn, ensuring their defeat.",
      "Baptist": "Moses explicitly forbids them from going up, stating God is not with them, which guarantees defeat before their enemies.",
      "Catholic": "Moses issues a direct prohibition against ascending, stating God is not with them and they will consequently be defeated by their foes.",
      "Methodist": "Moses strongly warns against going up, emphasizing God's absence from their endeavor guarantees their defeat.",
      "Lutheran": "Moses commands them not to go up because God is not among them, warning they will be struck down by their enemies."
    },
    "43": {
      "General": "He reminded them that the Amalekites and Canaanites were there, and they would fall by the sword because they turned away from following the Lord, resulting in His absence.",
      "Non-Denominational": "Moses reinforces the warning by naming the specific enemies and linking their inevitable defeat to their turning away from God, which caused His withdrawal.",
      "Baptist": "Moses reiterates the danger (Amalekites, Canaanites) and the reason for guaranteed defeat: their turning away from God means He will not be with them.",
      "Catholic": "Moses specifies the enemies present (Amalekites, Canaanites) and explains their defeat is certain because their turning from God ensures His absence.",
      "Methodist": "Moses reminds them of the enemies and clearly states the reason for failure: their rejection of God means God is not with them.",
      "Lutheran": "Moses reminds them of the specific enemies and the reason for defeat: because they turned from the Lord, He will not be with them."
    },
    "44": {
      "General": "Despite Moses' warnings, they presumed to go up the hill top anyway, but the Ark of the Covenant and Moses remained in the camp.",
      "Non-Denominational": "Shows their utter presumption and disobedience, proceeding without the symbols of God's presence (Ark) and leadership (Moses).",
      "Baptist": "Records their willful presumption in ascending the mountain against clear warning, notably without the Ark (God's presence) or Moses.",
      "Catholic": "Narrates their obstinate presumption in attempting the ascent despite warnings, significantly leaving behind the Ark (symbol of God's presence) and Moses.",
      "Methodist": "Highlights their defiant presumption, going up despite warnings and without the essential Ark of the Covenant or Moses.",
      "Lutheran": "They act presumptuously, going up despite the warning, while the Ark and Moses (representing God's presence and guidance) remain behind."
    },
    "45": {
      "General": "As warned, the Amalekites and Canaanites living in that hill country attacked, defeated, and pursued the Israelites as far as Hormah.",
      "Non-Denominational": "The predicted consequence occurs: the enemies attack and inflict a decisive defeat on the presumptuous Israelites.",
      "Baptist": "Records the fulfillment of Moses' warning: the Amalekites and Canaanites defeat the Israelites, pursuing them to Hormah, because God was not with them.",
      "Catholic": "The warning is fulfilled: the Amalekites and Canaanites descend from the hills, defeat the Israelites, and pursue them relentlessly to Hormah.",
      "Methodist": "Shows the outcome of their presumption: defeat at the hands of the Amalekites and Canaanites, just as Moses warned.",
      "Lutheran": "The Amalekites and Canaanites attack and defeat the presumptuous Israelites, striking them down as far as Hormah, fulfilling Moses' warning."
    }
  }
}
