{
  "Summary": {
    "General": "Following the decree of wilderness wandering, the Lord gives laws intended for when Israel eventually enters Canaan. These include regulations for various offerings (burnt, sacrifice, vow, freewill, feast) specifying required grain and drink offerings proportionate to the animal (lamb, ram, bullock). Crucially, these laws apply equally to native-born Israelites and foreigners (strangers) living among them. Instructions are given for a heave offering from the first dough made in the land. Laws concerning unintentional sins (errors committed through ignorance) are detailed, providing atonement procedures for both the congregation and individuals, again emphasizing equality for native-born and stranger. However, intentional, defiant sin ('presumptuous' sin, despising God's word) carries the severe penalty of being 'cut off' (excommunication or death). An illustrative case follows: a man found gathering sticks on the Sabbath during the wilderness period is executed by stoning under God's direct command, demonstrating the seriousness of willful disobedience. Finally, God commands Israelites to attach fringes (tzitzit) with a blue thread to their garments as a constant visual reminder to remember and obey all His commandments, avoid straying after their own desires ('whoring'), and be holy.",
    "Non-Denominational": "Focuses on God providing forward-looking instructions for worship and community life in the promised land, despite the current sentence of wandering. Highlights the principles of proportionate giving in offerings, the inclusivity of God's law (applying to strangers), grace for unintentional sin through atonement, the severity of willful rebellion against God's known commands (presumptuous sin), and the importance of tangible reminders (fringes) to prompt obedience and guard against spiritual waywardness.",
    "Baptist": "Emphasizes God's unchanging standards for worship and holiness, given in anticipation of entering Canaan. Underlines the specific requirements for sacrifices, pointing towards the ultimate sufficiency of Christ's sacrifice. Stresses the distinction between sins of ignorance, for which atonement is provided, and high-handed, presumptuous sin which constitutes rebellion and incurs severe judgment (exemplified by the Sabbath-breaker). Views the fringes as a means ordained by God to aid remembrance and obedience to His specific commands, guarding against idolatry and sinful desires.",
    "Catholic": "Sees these laws as preparation for liturgical life in the Promised Land, specifying ritual requirements for various sacrifices offered to God. Notes the universal applicability of key laws (offerings, atonement for ignorance, punishment for presumption) to both Israelites and resident aliens, reflecting a principle of justice. Interprets the distinction between unintentional and presumptuous sin in terms of culpability. The Sabbath-breaker narrative illustrates the gravity of violating divine commands. Views the fringes (tzitzit) as a sacramental, a visible sign reminding the wearer of God's commandments and the call to holiness.",
    "Methodist": "Highlights God's provision of laws for future life in Canaan, demonstrating His continued plan despite the people's failure. Emphasizes the detailed instructions for offerings reflecting due worship. Notes the important distinction between sins of ignorance (covered by atonement) and defiant, presumptuous sin (leading to being cut off), illustrated by the Sabbath-breaker. Sees the law regarding fringes as a practical means of grace, designed to help people remember God's commands, resist temptation ('heart and eyes'), and pursue holiness.",
    "Lutheran": "Focuses on God graciously providing instruction for life under His rule, even after judgment. The offering regulations point to the need for atonement. Highlights the critical distinction between sins of weakness/ignorance, covered by God's provision (atonement foreshadowing Christ), and presumptuous sin, which is a defiant rejection of God's Word and authority, deserving death (Sabbath-breaker). The law applies equally to Israelites and strangers. The fringes serve as a tangible reminder of God's Law, necessary because of human sinfulness and tendency to forget and stray."
  },
  "Verses": {
    "1": {
      "General": "The Lord communicates further instructions to Moses.",
      "Non-Denominational": "God initiates a new set of instructions for Moses to relay.",
      "Baptist": "Records God speaking directly to Moses with new commandments.",
      "Catholic": "The narrative indicates further divine revelation given to Moses.",
      "Methodist": "God continues His communication with Moses, providing more laws.",
      "Lutheran": "The Lord speaks again to Moses, giving further commands."
    },
    "2": {
      "General": "These instructions are specifically for when the Israelites eventually enter the land God is giving them.",
      "Non-Denominational": "Specifies the context for these laws: future life in the Promised Land.",
      "Baptist": "God directs these laws towards their future settlement in the promised land of Canaan.",
      "Catholic": "These regulations pertain to the future, upon entry into the land designated by God for them.",
      "Methodist": "Sets the context for the following laws, applying to when they inhabit the land God promised.",
      "Lutheran": "God gives laws applicable specifically upon entering the land He is giving them."
    },
    "3": {
      "General": "Regulations are given for various offerings made by fire (burnt offering, sacrifice for vows, freewill offering, festival offerings) from the herd or flock, intended as a pleasing aroma to the Lord.",
      "Non-Denominational": "Outlines the types of fire offerings these regulations will apply to, emphasizing their purpose as a 'sweet savour' to God.",
      "Baptist": "Details the specific offerings (burnt, vow, freewill, feast) requiring supplementary grain/drink offerings, focusing on the pleasing aroma aspect.",
      "Catholic": "Specifies the types of sacrifices (burnt offerings, votive, voluntary, festival) from herd or flock, offered by fire as a 'sweet savour'.",
      "Methodist": "Lists the occasions for fire offerings (burnt, vow, freewill, feast) that require the following additions, noting their pleasing nature to God.",
      "Lutheran": "Specifies the offerings (burnt, vow, freewill, feast day) from herd or flock to which the subsequent grain/drink offerings must be added."
    },
    "4": {
      "General": "When offering, one must also bring a grain ('meat') offering: a tenth deal (about 2 quarts/liters) of fine flour mixed with a quarter hin (about 1 quart/liter) of oil.",
      "Non-Denominational": "Specifies the required accompanying grain offering for certain sacrifices: flour mixed with oil.",
      "Baptist": "Details the required grain offering (flour and oil) to accompany certain animal sacrifices.",
      "Catholic": "Mandates an accompanying cereal offering ('meat offering') of flour mixed with oil for specified sacrifices.",
      "Methodist": "Prescribes the specific grain offering (flour and oil quantities) required with certain animal sacrifices.",
      "Lutheran": "Requires a supplementary grain offering (flour mixed with oil) to be brought with the primary sacrifice."
    },
    "5": {
      "General": "Additionally, a quarter hin of wine is required as a drink offering with the burnt offering or sacrifice of a single lamb.",
      "Non-Denominational": "Adds the requirement of a drink offering (wine) for sacrifices involving a lamb.",
      "Baptist": "Specifies the required drink offering (wine) accompanying a lamb sacrifice.",
      "Catholic": "Mandates an accompanying libation (drink offering) of wine for sacrifices involving a lamb.",
      "Methodist": "Prescribes the specific drink offering (wine quantity) required with a lamb sacrifice.",
      "Lutheran": "Requires a specific amount of wine as a drink offering to accompany a lamb sacrifice."
    },
    "6": {
      "General": "For a ram sacrifice, the grain offering increases to two tenth deals of flour mixed with a third hin (about 1.3 quarts/liters) of oil.",
      "Non-Denominational": "Specifies increased quantities for the grain offering when a ram is sacrificed.",
      "Baptist": "Details the larger grain offering required when sacrificing a ram.",
      "Catholic": "Prescribes a larger cereal offering (flour and oil) for sacrifices involving a ram.",
      "Methodist": "Specifies the larger grain offering (flour and oil quantities) required with a ram sacrifice.",
      "Lutheran": "Requires a larger grain offering (flour and oil) for a ram sacrifice."
    },
    "7": {
      "General": "The accompanying drink offering for a ram is a third hin of wine, as a sweet savour to the Lord.",
      "Non-Denominational": "Specifies the increased wine quantity for the drink offering accompanying a ram.",
      "Baptist": "Details the larger drink offering (wine) required with a ram sacrifice.",
      "Catholic": "Prescribes a larger libation of wine for sacrifices involving a ram, noting its pleasing aroma to God.",
      "Methodist": "Specifies the larger drink offering (wine quantity) required with a ram sacrifice.",
      "Lutheran": "Requires a larger wine offering for a ram sacrifice, described as a sweet savour."
    },
    "8": {
      "General": "When preparing a bullock for a burnt offering, a sacrifice fulfilling a vow, or a peace offering.",
      "Non-Denominational": "Introduces the requirements for sacrifices involving a bullock (burnt, vow, or peace offerings).",
      "Baptist": "Specifies the regulations when offering a bullock for various types of sacrifices.",
      "Catholic": "Sets the context for regulations concerning sacrifices of a bullock (burnt offering, votive, or communion/peace offering).",
      "Methodist": "Outlines the conditions (burnt, vow, peace offerings) for the following requirements when sacrificing a bullock.",
      "Lutheran": "States the regulations applying when a bullock is offered (burnt, vow, peace offering)."
    },
    "9": {
      "General": "With the bullock, a grain offering of three tenth deals of flour mixed with half a hin (about 2 quarts/liters) of oil is required.",
      "Non-Denominational": "Specifies the largest quantity for the grain offering, accompanying a bullock sacrifice.",
      "Baptist": "Details the substantial grain offering (flour and oil) required when sacrificing a bullock.",
      "Catholic": "Prescribes the largest cereal offering (flour and oil) for sacrifices involving a bullock.",
      "Methodist": "Specifies the largest grain offering (flour and oil quantities) required with a bullock sacrifice.",
      "Lutheran": "Requires the largest grain offering (flour and oil) for a bullock sacrifice."
    },
    "10": {
      "General": "The drink offering with a bullock is half a hin of wine, an offering made by fire, a sweet savour to the Lord.",
      "Non-Denominational": "Specifies the largest wine quantity for the drink offering accompanying a bullock, emphasizing its pleasing nature to God.",
      "Baptist": "Details the substantial drink offering (wine) required with a bullock sacrifice, noting it as a pleasing fire offering.",
      "Catholic": "Prescribes the largest libation of wine for sacrifices involving a bullock, classifying it as a pleasing fire offering.",
      "Methodist": "Specifies the largest drink offering (wine quantity) required with a bullock sacrifice, reiterating its pleasing nature.",
      "Lutheran": "Requires the largest wine offering for a bullock sacrifice, part of the fire offering as a sweet savour."
    },
    "11": {
      "General": "These procedures (grain and drink offerings) apply respectively to each bullock, ram, lamb, or kid offered.",
      "Non-Denominational": "Summarizes that the specific quantities outlined apply depending on the type of animal sacrificed.",
      "Baptist": "Confirms these proportionate regulations apply to sacrifices of bullocks, rams, lambs, or kids.",
      "Catholic": "Reiterates that these accompanying offerings are required for each type of animal sacrificed.",
      "Methodist": "Confirms the preceding instructions apply based on the specific animal offered.",
      "Lutheran": "Summarizes the rule: the prescribed supplementary offerings correspond to the type of animal sacrificed."
    },
    "12": {
      "General": "The requirements must be followed for every individual animal offered, according to the total number sacrificed.",
      "Non-Denominational": "Clarifies that the requirements apply per animal, regardless of the total number being offered.",
      "Baptist": "Emphasizes that the requirements apply to each animal individually within a larger offering.",
      "Catholic": "Specifies that the regulations apply individually to each animal sacrificed, proportionate to the total number.",
      "Methodist": "Stresses that the procedure must be followed for each animal according to the number offered.",
      "Lutheran": "The supplementary offerings must be provided for each animal according to the total number sacrificed."
    },
    "13": {
      "General": "All native-born Israelites must follow these procedures when presenting a fire offering as a sweet savour to the Lord.",
      "Non-Denominational": "States the obligation for native-born Israelites to adhere to these offering regulations.",
      "Baptist": "Confirms the binding nature of these offering laws upon all native Israelites.",
      "Catholic": "Specifies that all native-born Israelites must observe these sacrificial regulations.",
      "Methodist": "Highlights that these rules for offerings are mandatory for all native-born Israelites.",
      "Lutheran": "Applies these offering regulations specifically to the native-born Israelites."
    },
    "14": {
      "General": "If a foreigner (stranger) residing among them, temporarily or permanently, wishes to offer a fire offering as a sweet savour, they must follow the same procedures.",
      "Non-Denominational": "Extends the offering regulations to include non-Israelites living among them who wish to worship God through sacrifice.",
      "Baptist": "States that foreigners dwelling among Israel must follow the same sacrificial laws if they offer to the Lord.",
      "Catholic": "Extends the sacrificial regulations to resident aliens ('strangers') who wish to make offerings to the Lord.",
      "Methodist": "Specifies that resident foreigners wishing to offer sacrifices must adhere to the same rules as Israelites.",
      "Lutheran": "Applies the same offering regulations to the stranger (foreigner) living among them who offers to the Lord."
    },
    "15": {
      "General": "There is one standard ('ordinance') for both the congregation (native-born) and the resident stranger; this is a perpetual statute throughout their generations. Before the Lord, the stranger is equal to the native-born in this regard.",
      "Non-Denominational": "Emphasizes equality before God regarding these worship laws: one standard applies perpetually to both Israelites and resident foreigners.",
      "Baptist": "Declares a single, perpetual ordinance for both Israelites and resident foreigners regarding these offerings, stressing their equality before God in this matter.",
      "Catholic": "Establishes a single, permanent statute ('ordinance') governing sacrificial worship for both the community and resident aliens, affirming their equal standing before God in this context.",
      "Methodist": "Stresses the principle of one law for both native-born and foreigner regarding these worship practices, valid perpetually and ensuring equality before God.",
      "Lutheran": "Decrees one ordinance (statute) for both the congregation and the stranger concerning offerings, a perpetual law establishing equality before the Lord."
    },
    "16": {
      "General": "Reiterates the principle: One law and one procedure applies to both the native-born Israelite and the stranger living among them.",
      "Non-Denominational": "Repeats the principle of equal application of the law for emphasis.",
      "Baptist": "Reaffirms the principle of a single law and practice for both Israelites and resident foreigners.",
      "Catholic": "Reiterates for emphasis: a single law and custom applies equally to Israelites and resident aliens.",
      "Methodist": "Repeats for emphasis the principle of one law and standard procedure for both groups.",
      "Lutheran": "Emphatically repeats: one law and one custom shall apply to both Israelites and resident strangers."
    },
    "17": {
      "General": "The Lord gives further instructions to Moses.",
      "Non-Denominational": "God initiates another set of instructions through Moses.",
      "Baptist": "Records God speaking again to Moses.",
      "Catholic": "Indicates another divine communication to Moses.",
      "Methodist": "God continues speaking to Moses with additional commands.",
      "Lutheran": "The Lord speaks to Moses again."
    },
    "18": {
      "General": "Moses is to tell the Israelites that when they arrive in the land God is bringing them to.",
      "Non-Denominational": "Sets the context for the next command: upon entering the Promised Land.",
      "Baptist": "Directs the following command specifically to the time after entering Canaan.",
      "Catholic": "This instruction pertains to the time after their arrival in the land God is leading them to.",
      "Methodist": "Specifies the timing for the next instruction: upon entry into the land.",
      "Lutheran": "Connects the following command to their arrival in the Promised Land."
    },
    "19": {
      "General": "When they begin to eat the food ('bread') produced in the land, they must set aside a contribution ('heave offering') for the Lord.",
      "Non-Denominational": "Commands a special offering to God from the first produce consumed in the land.",
      "Baptist": "Commands the offering of a portion ('heave offering') to God from the first food eaten in the land.",
      "Catholic": "Instructs that upon eating the bread of the land, they must present a contribution ('heave offering') to the Lord.",
      "Methodist": "Requires a contribution ('heave offering') to be given to God from the first food eaten in Canaan.",
      "Lutheran": "Commands a heave offering (contribution) to the Lord from the bread eaten in the new land."
    },
    "20": {
      "General": "They are specifically to offer a cake made from the first portion of their ground meal ('dough') as a heave offering, similar to the heave offering from the threshing floor.",
      "Non-Denominational": "Details the offering: a cake from the first batch of dough, paralleling the offering from the grain harvest.",
      "Baptist": "Specifies the offering as a cake from the first dough, comparing it to the grain offering from the threshing floor.",
      "Catholic": "Specifies the offering as a cake from the first kneading ('dough'), presented like the contribution from the threshing floor.",
      "Methodist": "Clarifies the offering is a cake from the first dough, presented in the same manner as the offering from the harvest.",
      "Lutheran": "Instructs offering a cake from the first dough as a heave offering, analogous to the offering from the threshing floor."
    },
    "21": {
      "General": "This offering from the first dough is a perpetual requirement for all generations.",
      "Non-Denominational": "Establishes this first-dough offering as an ongoing practice for future generations.",
      "Baptist": "Declares this offering from the first dough a perpetual requirement throughout their generations.",
      "Catholic": "Makes this contribution from the first dough a perpetual obligation for all subsequent generations.",
      "Methodist": "Establishes the offering of the first dough as a lasting requirement for all generations.",
      "Lutheran": "This offering from the first dough is commanded as a perpetual heave offering for all generations."
    },
    "22": {
      "General": "Introduces laws concerning unintentional failure ('erred') to observe all the commandments given through Moses.",
      "Non-Denominational": "Addresses the situation of unintentional communal failure to keep God's commands.",
      "Baptist": "Begins regulations dealing with unintentional corporate sin (error) in failing to keep God's commandments.",
      "Catholic": "Introduces procedures for dealing with unintentional communal transgression ('erred') of God's commandments given via Moses.",
      "Methodist": "Addresses unintentional communal failure ('erred') to follow all of God's commands through Moses.",
      "Lutheran": "Introduces laws for dealing with unintentional communal error ('erred') in not observing God's commands."
    },
    "23": {
      "General": "This applies to any commandment given by the Lord through Moses, from the beginning and into the future generations.",
      "Non-Denominational": "Clarifies the scope: applies to any command given through Moses, past or future.",
      "Baptist": "Specifies that this covers all commandments given through Moses, from the beginning onwards.",
      "Catholic": "Clarifies this applies to the entire body of law given through Moses, from its inception onwards.",
      "Methodist": "Confirms this covers all commandments given via Moses, from the start and continuing.",
      "Lutheran": "This applies to all commandments given through Moses from the first day onwards."
    },
    "24": {
      "General": "If the error was committed unintentionally by the whole congregation ('without the knowledge of the congregation'), they must offer a young bullock for a burnt offering (sweet savour), with its prescribed grain and drink offerings, plus a male goat for a sin offering.",
      "Non-Denominational": "Prescribes the communal sacrifice for unintentional corporate sin: a bullock (burnt offering with accompaniments) and a goat (sin offering).",
      "Baptist": "Details the required sacrifices for unintentional communal sin: a bullock for burnt offering and a goat for sin offering, with associated elements.",
      "Catholic": "Specifies the sacrifices required for unintentional communal sin unknown to the assembly: a bullock for a burnt offering (with accompaniments) and a male goat for a sin offering.",
      "Methodist": "Outlines the specific sacrifices required for unintentional community-wide sin: a bullock (burnt offering) and a goat (sin offering).",
      "Lutheran": "Prescribes the sacrifices for unintentional communal sin: a bullock for burnt offering (pleasing aroma) with grain/drink offerings, and a male goat for sin offering."
    },
    "25": {
      "General": "The priest must make atonement for the entire congregation, and they will be forgiven because it was unintentional ('ignorance'). They must bring their fire offering and sin offering for this unintentional error.",
      "Non-Denominational": "The priest performs atonement, securing forgiveness for the unintentional communal sin, contingent on bringing the required offerings.",
      "Baptist": "Requires priestly atonement for the congregation's unintentional sin, leading to forgiveness upon bringing the specified offerings.",
      "Catholic": "The priest is to make atonement for the congregation's unintentional sin, resulting in forgiveness, provided the requisite offerings are made.",
      "Methodist": "Mandates priestly atonement for the community's unintentional sin, granting forgiveness when the offerings are presented.",
      "Lutheran": "The priest makes atonement for the congregation's unintentional sin ('ignorance'), securing forgiveness after they bring the required fire and sin offerings."
    },
    "26": {
      "General": "Forgiveness extends to both the congregation of Israel and the stranger living among them, recognizing the unintentional nature ('ignorance') involving everyone.",
      "Non-Denominational": "Reaffirms that forgiveness for unintentional communal sin applies equally to Israelites and resident foreigners.",
      "Baptist": "States that forgiveness for unintentional communal sin covers both Israelites and resident foreigners, as all were involved.",
      "Catholic": "Extends the forgiveness for unintentional communal sin to both Israelites and resident aliens, as the error involved the whole populace.",
      "Methodist": "Confirms forgiveness for unintentional communal sin applies equally to Israelites and resident strangers.",
      "Lutheran": "Forgiveness for unintentional communal sin is granted to both Israelites and the stranger among them, since all were in ignorance."
    },
    "27": {
      "General": "If an individual sins unintentionally ('through ignorance'), they must bring a year-old female goat for a sin offering.",
      "Non-Denominational": "Prescribes the sacrifice for an individual's unintentional sin: a female goat.",
      "Baptist": "Details the required sacrifice for an individual's unintentional sin: a year-old female goat.",
      "Catholic": "Specifies the sacrifice for an individual's unintentional sin: a year-old female goat as a sin offering.",
      "Methodist": "Outlines the specific sacrifice for unintentional sin committed by an individual: a female goat.",
      "Lutheran": "Requires a year-old female goat as a sin offering if an individual sins through ignorance."
    },
    "28": {
      "General": "The priest makes atonement before the Lord for the person who sinned unintentionally, and they will be forgiven.",
      "Non-Denominational": "The priest's atonement secures forgiveness for the individual's unintentional sin.",
      "Baptist": "Requires priestly atonement for the individual's unintentional sin before God, resulting in forgiveness.",
      "Catholic": "The priest performs atonement before the Lord for the individual who sinned unintentionally, securing their forgiveness.",
      "Methodist": "Mandates priestly atonement for the individual's unintentional sin, granting forgiveness.",
      "Lutheran": "The priest makes atonement for the person sinning ignorantly before the Lord, and they are forgiven."
    },
    "29": {
      "General": "There is one law for unintentional sin, applying equally to the native-born Israelite and the stranger living among them.",
      "Non-Denominational": "Reiterates the principle of equality: the same law for unintentional sin applies to both Israelites and resident foreigners.",
      "Baptist": "Declares a single law governing atonement for unintentional sin for both Israelites and resident foreigners.",
      "Catholic": "Establishes a single law regarding unintentional sin, applicable equally to native-born Israelites and resident aliens.",
      "Methodist": "Stresses again the principle of one law for unintentional sin, covering both native-born and stranger.",
      "Lutheran": "Decrees one law for unintentional sin ('sinneth through ignorance') applying equally to native Israelites and strangers."
    },
    "30": {
      "General": "However, anyone (native-born or stranger) who sins deliberately and defiantly ('presumptuously') blasphemes ('reproacheth') the Lord and must be cut off from their people.",
      "Non-Denominational": "Draws a sharp contrast: deliberate, defiant sin is blasphemy against God and results in separation ('cut off') from the community, applying to all.",
      "Baptist": "Addresses high-handed, presumptuous sin, identifying it as reproaching God and decreeing the severe penalty of being cut off, applicable to both Israelites and strangers.",
      "Catholic": "Addresses sins committed deliberately ('presumptuously'), characterizing them as contempt for the Lord ('reproacheth') and mandating exclusion ('cut off') from the community for both Israelites and aliens.",
      "Methodist": "Contrasts unintentional sin with deliberate, defiant ('presumptuous') sin, which insults God and leads to being cut off, regardless of origin.",
      "Lutheran": "Addresses presumptuous sin (acting defiantly, 'with a high hand'), declaring it reproaches the Lord and demands the sinner be cut off, whether native or stranger."
    },
    "31": {
      "General": "This is because they despised the Lord's word and broke His commandment; that person bears their own iniquity and will be utterly cut off.",
      "Non-Denominational": "Explains the reason for the severe penalty: despising God's word and breaking His command. The guilt remains solely on the individual.",
      "Baptist": "Explains the justification for being cut off: contempt for God's Word and disobedience. The individual bears full responsibility for their iniquity.",
      "Catholic": "Justifies the exclusion: the individual showed contempt for God's word and violated His command, thus bearing their own guilt and facing complete separation.",
      "Methodist": "Provides the rationale for being cut off: despising God's word and breaking His command. The consequence rests entirely on the individual.",
      "Lutheran": "The reason for being cut off: despising God's Word and breaking His command. Such a person bears their iniquity and must be utterly cut off."
    },
    "32": {
      "General": "Narrates an incident during the wilderness wandering: a man was found collecting firewood on the Sabbath day.",
      "Non-Denominational": "Presents a case study illustrating the principle of presumptuous sin: violating the Sabbath commandment.",
      "Baptist": "Records a specific instance of Sabbath violation during the wilderness period.",
      "Catholic": "Recounts an incident during the wilderness journey: a man was discovered gathering wood on the Sabbath.",
      "Methodist": "Provides a concrete example of breaking God's law during the wilderness time: a man gathering sticks on the Sabbath.",
      "Lutheran": "Gives an example from the wilderness wanderings: a man found gathering wood on the Sabbath."
    },
    "33": {
      "General": "Those who found him brought him to Moses, Aaron, and the entire congregation.",
      "Non-Denominational": "The community brings the offender before the leadership for judgment.",
      "Baptist": "The witnesses bring the Sabbath-breaker to Moses, Aaron, and the assembly.",
      "Catholic": "The man caught gathering wood is brought before Moses, Aaron, and the entire community.",
      "Methodist": "The man is apprehended and brought before the leaders and the community.",
      "Lutheran": "Those who found him bring him to the authorities (Moses, Aaron, congregation)."
    },
    "34": {
      "General": "They detained him because the specific penalty for this act had not yet been declared.",
      "Non-Denominational": "He is held in custody pending clarification from God on the appropriate punishment.",
      "Baptist": "He is imprisoned because the specific judgment for this transgression was not yet revealed.",
      "Catholic": "He is placed in custody because the precise penalty for this specific violation was yet undetermined.",
      "Methodist": "They place him under guard because the exact consequence for this act was unclear.",
      "Lutheran": "He is put in custody because the specific punishment had not yet been declared by God."
    },
    "35": {
      "General": "The Lord declared to Moses that the man must be executed; the entire congregation was to stone him outside the camp.",
      "Non-Denominational": "God reveals the judgment: execution by stoning carried out by the community outside the camp.",
      "Baptist": "God pronounces the death sentence by stoning, to be executed by the whole congregation outside the camp.",
      "Catholic": "The Lord decrees the death penalty for the man, specifying execution by stoning by the community outside the camp.",
      "Methodist": "God commands the man's execution by stoning, performed by the entire community outside the camp.",
      "Lutheran": "The Lord commands Moses: the man must die, stoned by the entire congregation outside the camp."
    },
    "36": {
      "General": "The congregation carried out the Lord's command, taking the man outside the camp and stoning him to death.",
      "Non-Denominational": "The community executes God's judgment as commanded.",
      "Baptist": "The congregation obeys God's command, executing the Sabbath-breaker by stoning outside the camp.",
      "Catholic": "The community executes the divine sentence, taking the man outside the camp and stoning him to death as commanded.",
      "Methodist": "The community carries out the execution by stoning outside the camp, following God's command.",
      "Lutheran": "The congregation obeys, bringing him outside the camp and stoning him to death as the Lord commanded."
    },
    "37": {
      "General": "The Lord gives another command to Moses.",
      "Non-Denominational": "God initiates a final instruction in this chapter.",
      "Baptist": "Records God speaking again to Moses.",
      "Catholic": "Indicates a further divine communication to Moses.",
      "Methodist": "God gives Moses another command.",
      "Lutheran": "The Lord speaks to Moses again."
    },
    "38": {
      "General": "Moses is to command the Israelites to make fringes (tzitzit) on the corners of their garments throughout their generations, attaching a blue cord to each fringe.",
      "Non-Denominational": "Commands the wearing of tassels (fringes) with a blue cord on their clothing as a perpetual practice.",
      "Baptist": "God commands the Israelites to perpetually wear fringes with a blue cord on the borders of their garments.",
      "Catholic": "Instructs the Israelites to perpetually attach tassels ('fringes') with a violet ('blue') thread to the corners of their garments.",
      "Methodist": "Commands the making and wearing of fringes with a blue cord on garments throughout all generations.",
      "Lutheran": "Commands the Israelites to make fringes on their garments perpetually, including a blue cord."
    },
    "39": {
      "General": "The purpose of the fringe is to be a visual reminder: when they look at it, they should remember and obey all the Lord's commandments, and not follow the lustful desires of their own hearts and eyes ('go a whoring').",
      "Non-Denominational": "Explains the purpose of the fringes: a visual cue to remember and obey God's commands, preventing them from straying after sinful desires.",
      "Baptist": "States the purpose of the fringes: a visual reminder to recall and obey God's commandments, guarding against spiritual adultery (following sinful impulses).",
      "Catholic": "Explains the function of the tassel: a visual aid to remember and fulfill all God's commandments, preventing them from pursuing illicit desires ('go a whoring').",
      "Methodist": "Defines the purpose of the fringe: to serve as a reminder to remember and follow God's commands, avoiding being led astray by personal desires ('heart and eyes').",
      "Lutheran": "The fringe serves as a reminder to look at, remember, and do God's commands, preventing them from following their own heart and eyes into spiritual unfaithfulness ('whoring')."
    },
    "40": {
      "General": "Ultimately, the fringes are to help them remember and do all God's commandments and be consecrated ('holy') to their God.",
      "Non-Denominational": "Reiterates the goal: remembering and obeying all commands, leading to holiness before God.",
      "Baptist": "Restates the purpose: remembering and obeying all commands, resulting in holiness dedicated to God.",
      "Catholic": "Summarizes the purpose: to remember and observe all commandments, thereby remaining holy unto their God.",
      "Methodist": "Summarizes the purpose: to prompt remembrance and obedience, fostering holiness.",
      "Lutheran": "The final purpose: remembering and doing all commands, leading to being holy to their God."
    },
    "41": {
      "General": "God concludes by identifying Himself as 'the Lord your God' who brought them out of Egypt specifically to be their God, reaffirming His identity and authority.",
      "Non-Denominational": "God grounds these commands in His identity as their covenant God and redeemer from Egypt.",
      "Baptist": "God asserts His identity as the covenant Lord who redeemed them from Egypt to be their God, grounding His authority.",
      "Catholic": "God identifies Himself as the Lord who redeemed them from Egypt to establish the covenant relationship, reaffirming His sovereignty.",
      "Methodist": "God concludes by reminding them of His identity as their God and Redeemer from Egypt, the basis for His commands.",
      "Lutheran": "God concludes by stating His identity ('I am the LORD your God') and His act of redemption from Egypt, establishing His right to command."
    }
  }
}
