{
  "Summary": {
    "General": "This chapter recounts the major rebellion against Moses and Aaron's God-given authority. Led by Korah (a Levite), Dathan and Abiram (Reubenites), and joined by 250 respected leaders ('princes of the assembly'), the rebels accuse Moses and Aaron of exalting themselves over the congregation, claiming all Israelites are holy. Moses challenges them to a test: Korah's group and Aaron are to offer incense before the Lord the next day to see whom God chooses. Moses rebukes Korah and the Levites for seeking the priesthood in addition to their designated duties. Dathan and Abiram refuse Moses' summons, accusing him of failing to bring them to the promised land and acting like a prince. The next day, Korah gathers the congregation. God's glory appears, and He threatens to destroy everyone, but Moses and Aaron intercede. God instructs the congregation to separate from the tents of Korah, Dathan, and Abiram. Moses declares God will vindicate his leadership through a supernatural sign. As he finishes speaking, the earth swallows Dathan, Abiram, their families, and Korah's followers (though not Korah himself initially, see v.35). Fire from the Lord then consumes the 250 men offering incense. God commands Eleazar to gather their holy censers and hammer them into plates for the altar covering, as a perpetual warning against unauthorized priestly service. Despite this dramatic judgment, the congregation murmurs against Moses and Aaron the next day, blaming them for the deaths. God's glory appears again, and a deadly plague breaks out. Moses instructs Aaron to quickly make atonement with incense. Aaron stands between the living and the dead, and the plague stops after killing 14,700 people.",
    "Non-Denominational": "Focuses on the dangers of challenging God-ordained leadership and spiritual pride. Korah's rebellion, fueled by envy and ambition, wrongly asserts universal holiness to usurp authority. God's dramatic judgment (earth swallowing, fire consuming) unequivocally validates Moses and Aaron's leadership and the seriousness of rebellion against God's chosen structure. The subsequent murmuring and plague demonstrate the people's persistent hardness of heart, yet Aaron's atonement shows God's mercy amidst judgment, highlighting the role of intercession and atonement.",
    "Baptist": "Emphasizes the sinfulness of rebellion against God's appointed leaders, Moses and Aaron. Korah's challenge is seen as a direct assault on God's authority and His specific calling for the priesthood (reserved for Aaron's line) and the Levites. The swift and terrifying judgments (earth opening, fire, plague) demonstrate God's righteous wrath against sin, particularly pride and usurpation of sacred roles. Aaron's intercession with incense, stopping the plague, prefigures Christ's role as the ultimate High Priest and intercessor.",
    "Catholic": "Interprets Korah's rebellion as a grave challenge to the divinely established hierarchy and priesthood. Korah (a Levite) and his followers sinfully aspire to the Aaronic priesthood. God's judgment dramatically reaffirms the exclusive right of Aaron and his descendants to the priesthood. The rebels' censers, though used illicitly, become hallowed by their offering before the Lord and are incorporated into the altar, signifying that even sinful acts within sacred space can have lasting consequences and serve as warnings. Aaron's atonement stopping the plague highlights the essential mediatorial role of the priesthood.",
    "Methodist": "Views the rebellion as stemming from pride, jealousy, and a rejection of God's appointed means of leadership and grace. God's decisive judgments underscore the importance of respecting divinely appointed authority and the sanctity of worship roles. The people's subsequent murmuring reveals their continued spiritual blindness. Aaron's act of atonement, standing between the living and the dead, demonstrates the power of intercession and priestly mediation to avert God's wrath, pointing towards the saving work of Christ.",
    "Lutheran": "Sees Korah's rebellion as a rejection of God's established order and His Word delivered through Moses. The rebels' claim that 'all the congregation are holy' denies the need for God's specific appointments and the unique role of the priesthood for mediation. God's judgment upholds His ordained structure and punishes the presumptuous sin of challenging His authority. The covering made from the censers serves as a perpetual reminder of God's law and judgment against usurping holy offices. Aaron's atonement highlights the necessity of mediation due to sin."
  },
  "Verses": {
    "1": {
      "General": "Introduces the key figures leading the rebellion: Korah (a Kohathite Levite), Dathan and Abiram (Reubenites), and On (a Reubenite, mentioned only here). 'Took men' implies they instigated and gathered followers.",
      "Non-Denominational": "Identifies the leaders of the uprising, highlighting the coalition between a Levite faction and Reubenites.",
      "Baptist": "Names the ringleaders: Korah (a Levite related to Moses and Aaron) and key Reubenites, showing the breadth of the conspiracy.",
      "Catholic": "Introduces the instigators of the schism: Korah (Levite), Dathan, Abiram, and On (Reubenites), noting their tribal affiliations.",
      "Methodist": "Identifies the principal figures initiating the rebellion against Moses and Aaron's leadership.",
      "Lutheran": "Names the leaders of the rebellion: Korah (Levite) and Dathan, Abiram, On (Reubenites), who took action against Moses."
    },
    "2": {
      "General": "These leaders rose up against Moses, joined by 250 prominent Israelite leaders known for their standing in the community.",
      "Non-Denominational": "Describes the scale of the rebellion, involving influential community leaders challenging Moses.",
      "Baptist": "Shows the significant support the rebels garnered: 250 respected leaders joined the challenge to Moses.",
      "Catholic": "Details the extent of the revolt: 250 prominent assembly leaders joined the challenge against Moses' authority.",
      "Methodist": "Highlights the seriousness of the challenge, as 250 well-known community leaders joined the rebellion.",
      "Lutheran": "Records the open rebellion involving 250 respected community leaders ('princes,' 'men of renown') against Moses."
    },
    "3": {
      "General": "The rebels confront Moses and Aaron, accusing them of self-exaltation and arguing that the entire congregation is holy and God is among them all, thus questioning Moses and Aaron's unique leadership role.",
      "Non-Denominational": "States the rebels' core argument: a claim of universal holiness to challenge the specific leadership roles of Moses and Aaron.",
      "Baptist": "Records the rebels' accusation, based on a twisted truth ('all are holy'), used to justify their challenge to Moses and Aaron's God-given authority.",
      "Catholic": "Details the rebels' theological challenge: asserting the holiness of the entire congregation to deny the special authority conferred on Moses and Aaron.",
      "Methodist": "Presents the rebels' charge against Moses and Aaron, using the concept of communal holiness to attack their unique positions.",
      "Lutheran": "The rebels confront Moses and Aaron, claiming universal holiness as grounds to reject their specific leadership ('lifting yourselves up')."
    },
    "4": {
      "General": "Upon hearing this challenge, Moses demonstrates humility and distress by falling on his face, likely in prayer or supplication.",
      "Non-Denominational": "Moses responds to the rebellion with humility and dependence on God, falling on his face.",
      "Baptist": "Shows Moses' immediate reaction: humility and seeking God's face in the face of rebellion.",
      "Catholic": "Moses' reaction to the challenge is profound humility and recourse to God (falling on his face).",
      "Methodist": "Moses responds not with anger but with humility and distress, turning to God.",
      "Lutheran": "Moses responds to the charge with deep humility, falling on his face before God."
    },
    "5": {
      "General": "Moses tells Korah and his followers that the next day, God Himself will reveal who belongs to Him, who is holy, and whom He has chosen to draw near (i.e., serve Him closely).",
      "Non-Denominational": "Moses defers the judgment to God, proposing a test to reveal God's chosen leader(s).",
      "Baptist": "Moses proposes a divine test for the next day to determine whom God recognizes as His chosen and holy servant(s).",
      "Catholic": "Moses proposes a divine ordeal: God will demonstrate the next day whom He has consecrated and chosen for His service.",
      "Methodist": "Moses proposes a test where God will publicly demonstrate His choice of leadership.",
      "Lutheran": "Moses states God will reveal His choice the next day, identifying the holy one He brings near."
    },
    "6": {
      "General": "Moses instructs Korah and his group to prepare censers for this test.",
      "Non-Denominational": "Moses gives instructions for the test: Korah's group is to prepare censers.",
      "Baptist": "Moses commands Korah and his followers to bring censers as part of the test.",
      "Catholic": "Moses instructs Korah and his company to procure censers for the proposed ordeal.",
      "Methodist": "Moses gives the first step for the test: Korah and his group must get censers.",
      "Lutheran": "Moses instructs Korah and his company to take censers for the test."
    },
    "7": {
      "General": "He tells them to put fire and incense in the censers before the Lord tomorrow. The man God chooses will be confirmed as holy. Moses repeats the accusation, 'You take too much upon yourselves, sons of Levi,' turning their charge back on them.",
      "Non-Denominational": "Moses details the test procedure (offering incense) and turns the rebels' accusation back on the Levites among them.",
      "Baptist": "Moses specifies the test: offering incense. He directly confronts the Levites (Korah's group) with their own excessive ambition.",
      "Catholic": "Moses details the ordeal (offering incense) and directly rebukes the Levites involved for exceeding their authority.",
      "Methodist": "Moses explains the test (offering incense) and confronts the Levites in Korah's group for their presumption.",
      "Lutheran": "Moses specifies the test: presenting incense. He accuses the Levites ('sons of Levi') of taking too much upon themselves."
    },
    "8": {
      "General": "Moses specifically addresses Korah again, urging the Levites to listen.",
      "Non-Denominational": "Moses singles out the Levites led by Korah for a specific rebuke.",
      "Baptist": "Moses directly addresses Korah and his fellow Levites.",
      "Catholic": "Moses addresses Korah and the Levites directly.",
      "Methodist": "Moses focuses his address on Korah and the Levites.",
      "Lutheran": "Moses calls for the attention of Korah and the Levites."
    },
    "9": {
      "General": "He asks if they consider it insignificant that God separated them (Levites) for the special service of the Tabernacle, bringing them near to Himself to minister.",
      "Non-Denominational": "Moses reminds the Levites of the high privilege already granted to them: serving God closely in the Tabernacle.",
      "Baptist": "Moses rebukes the Levites' discontent by reminding them of the great honor God bestowed in choosing them for Tabernacle service.",
      "Catholic": "Moses highlights the unique privilege already granted to the Levites – their separation for sacred ministry near God's presence.",
      "Methodist": "Moses points out the significant honor the Levites already possess in their divine appointment for Tabernacle service.",
      "Lutheran": "Moses confronts the Levites: is their God-given privilege of serving the Tabernacle near God a 'small thing'?"
    },
    "10": {
      "General": "Moses points out God brought Korah and his fellow Levites near, yet now they are seeking the priesthood itself (reserved for Aaron's descendants).",
      "Non-Denominational": "Moses identifies the core ambition of the Levite rebels: dissatisfaction with their role and desiring the higher office of the priesthood.",
      "Baptist": "Moses exposes Korah's true ambition: not content with the Levitical ministry, he coveted the Aaronic priesthood.",
      "Catholic": "Moses accuses Korah and the Levites of aspiring to the priesthood itself, a role divinely reserved for Aaron's line.",
      "Methodist": "Moses reveals the Levites' motivation: seeking the priesthood beyond their appointed Levitical duties.",
      "Lutheran": "Moses exposes their sin: God brought them near as Levites, but they are grasping for the priesthood as well."
    },
    "11": {
      "General": "Therefore, Moses concludes, Korah and his company are actually rebelling against the Lord, not just Aaron, whom they murmur against.",
      "Non-Denominational": "Moses reframes the rebellion: it's ultimately against God, not merely human leaders like Aaron.",
      "Baptist": "Moses clarifies that their rebellion against Aaron is fundamentally a rebellion against the Lord who appointed him.",
      "Catholic": "Moses identifies the ultimate target of the rebellion: not Aaron, but the Lord Himself, whose authority they are challenging.",
      "Methodist": "Moses declares their gathering is against the Lord Himself, making their complaints against Aaron secondary.",
      "Lutheran": "Moses identifies their assembly as fundamentally against the Lord, questioning their murmuring against Aaron who acts for God."
    },
    "12": {
      "General": "Moses summons Dathan and Abiram (the Reubenite leaders), but they defiantly refuse to come.",
      "Non-Denominational": "The Reubenite leaders, Dathan and Abiram, openly defy Moses' summons.",
      "Baptist": "Records the outright refusal and defiance of Dathan and Abiram when summoned by Moses.",
      "Catholic": "Dathan and Abiram explicitly refuse Moses' summons, showing open insubordination.",
      "Methodist": "Dathan and Abiram demonstrate open rebellion by refusing to answer Moses' call.",
      "Lutheran": "Moses summons Dathan and Abiram, but they refuse to come, showing open defiance."
    },
    "13": {
      "General": "They sarcastically ask if it's insignificant that Moses brought them out of Egypt (calling it 'a land flowing with milk and honey') only to let them die in the wilderness, accusing him of wanting to rule over them.",
      "Non-Denominational": "Dathan and Abiram twist the narrative, calling Egypt the land of promise and accusing Moses of failed leadership and autocratic ambition.",
      "Baptist": "Records Dathan and Abiram's bitter and false accusations: misrepresenting Egypt, blaming Moses for their wilderness plight, and accusing him of tyranny.",
      "Catholic": "Dathan and Abiram voice their grievances, ironically calling Egypt the land of milk and honey and accusing Moses of failed leadership and despotism.",
      "Methodist": "Dathan and Abiram express their discontent with sarcastic, false accusations against Moses' leadership and motives.",
      "Lutheran": "Dathan and Abiram bitterly accuse Moses: bringing them from Egypt ('milk and honey') to die, and seeking to rule ('make thyself a prince')."
    },
    "14": {
      "General": "They further complain that Moses hasn't fulfilled the promise of bringing them into the actual land of milk and honey with fields and vineyards. They accuse him of trying to deceive ('put out the eyes') the people and reiterate their refusal to come.",
      "Non-Denominational": "They blame Moses for the delayed entry into Canaan and accuse him of blinding the people to his failures.",
      "Baptist": "They accuse Moses of breaking promises regarding the land and attempting to deceive the people ('blind these men'), reaffirming their defiance.",
      "Catholic": "They add the charge of failing to deliver the promised land and accuse Moses of deceiving the people ('put out the eyes'), reiterating their refusal.",
      "Methodist": "They blame Moses for not yet reaching the promised land and accuse him of deception, refusing again to meet him.",
      "Lutheran": "They accuse Moses of failing to provide the promised land and trying to deceive ('blind') the people, refusing again."
    },
    "15": {
      "General": "Moses becomes very angry and appeals to God, asking Him not to accept the rebels' offering (referring to the upcoming incense test) and affirming his own integrity – he hasn't exploited or harmed anyone.",
      "Non-Denominational": "Moses, angered by the false accusations, appeals to God to reject the rebels' offering and testifies to his own just leadership.",
      "Baptist": "Moses' righteous anger leads him to pray for God to disregard the rebels' offering, while asserting his own integrity as leader.",
      "Catholic": "Incensed by their accusations, Moses prays for God to reject their offering and affirms his personal integrity and just leadership.",
      "Methodist": "Moses reacts with righteous anger, asking God to disregard the rebels' offering and defending his own conduct.",
      "Lutheran": "Moses, deeply angered, asks God to reject the rebels' offering and affirms his own integrity (taking nothing, hurting no one)."
    },
    "16": {
      "General": "Moses formally instructs Korah to appear before the Lord tomorrow with his followers and Aaron for the test.",
      "Non-Denominational": "Moses formally sets the time and place for the divine test involving Korah, his group, and Aaron.",
      "Baptist": "Moses officially summons Korah, his company, and Aaron to appear before God the next day for the decisive test.",
      "Catholic": "Moses gives Korah the official summons for the ordeal before the Lord, including Aaron.",
      "Methodist": "Moses formally summons Korah, his followers, and Aaron to the test before the Lord.",
      "Lutheran": "Moses instructs Korah: he, his company, and Aaron are to present themselves before the Lord tomorrow."
    },
    "17": {
      "General": "He repeats the instruction for each of the 250 men, plus Korah and Aaron, to bring their censers with incense.",
      "Non-Denominational": "Reinforces the instructions for the test: all participants (Korah's 250, Korah, Aaron) must bring censers with incense.",
      "Baptist": "Reiterates the command for all involved (the 250 leaders, Korah, Aaron) to bring censers and incense for the test.",
      "Catholic": "Repeats the instruction for the ordeal: all 250 rebels, plus Korah and Aaron, are to bring censers with incense.",
      "Methodist": "Restates the requirement for every participant (250 + Korah + Aaron) to bring a censer with incense.",
      "Lutheran": "Moses repeats the instruction: each man (the 250, plus Korah and Aaron) to bring his censer with incense."
    },
    "18": {
      "General": "The men obey, preparing their censers with fire and incense, and stand at the entrance of the Tabernacle alongside Moses and Aaron.",
      "Non-Denominational": "The participants prepare for the test as instructed, assembling at the Tabernacle entrance.",
      "Baptist": "Records the compliance of the rebels in preparing their censers and gathering with Moses and Aaron at the Tabernacle entrance.",
      "Catholic": "The participants assemble for the ordeal as instructed, preparing their censers and standing at the Tabernacle entrance.",
      "Methodist": "The men follow the instructions, preparing censers and gathering at the Tabernacle with Moses and Aaron.",
      "Lutheran": "They obey, each taking his censer with fire and incense, and stand at the Tabernacle entrance with Moses and Aaron."
    },
    "19": {
      "General": "Korah gathers the entire congregation to witness the confrontation at the Tabernacle entrance. Then, the glory of the Lord visibly appears to everyone present.",
      "Non-Denominational": "Korah rallies the whole community to witness the showdown, and God's manifest glory appears to all.",
      "Baptist": "Korah musters the entire congregation against Moses and Aaron, prompting a theophany: God's glory appears to all.",
      "Catholic": "Korah gathers the whole community for the confrontation, and the divine Glory manifests itself to the entire assembly.",
      "Methodist": "Korah incites the whole congregation against Moses and Aaron, leading to a visible manifestation of God's glory.",
      "Lutheran": "Korah gathers the whole congregation against Moses and Aaron, and the visible glory of the Lord appears to all."
    },
    "20": {
      "General": "The Lord speaks directly to Moses and Aaron.",
      "Non-Denominational": "God addresses Moses and Aaron directly in response to the situation.",
      "Baptist": "Records God speaking directly to Moses and Aaron amid the crisis.",
      "Catholic": "The Lord addresses Moses and Aaron directly.",
      "Methodist": "God speaks to Moses and Aaron.",
      "Lutheran": "The Lord speaks to Moses and Aaron."
    },
    "21": {
      "General": "God commands Moses and Aaron to separate themselves from the rebellious congregation so He can destroy them instantly.",
      "Non-Denominational": "God commands Moses and Aaron to withdraw, intending immediate judgment upon the rebellious congregation.",
      "Baptist": "God instructs Moses and Aaron to separate from the congregation, declaring His intent to destroy them instantly for their complicity.",
      "Catholic": "God orders Moses and Aaron to distance themselves from the assembly, announcing His intention to consume them immediately.",
      "Methodist": "God tells Moses and Aaron to separate themselves, intending swift judgment on the congregation.",
      "Lutheran": "God commands Moses and Aaron to separate from the congregation for its immediate destruction."
    },
    "22": {
      "General": "Moses and Aaron fall on their faces again, interceding for the people. They appeal to God as the God of all humanity ('spirits of all flesh'), questioning if He will punish the entire congregation for the sin of one man (implicitly Korah, the leader).",
      "Non-Denominational": "Moses and Aaron intercede, appealing to God's universal sovereignty and questioning the justice of punishing all for the sin of the leaders.",
      "Baptist": "Moses and Aaron intercede passionately, appealing to God's character and arguing against collective punishment for the leaders' sin.",
      "Catholic": "Moses and Aaron intercede, falling prostrate and appealing to God's universal fatherhood ('God of the spirits of all flesh') against punishing the entire assembly for one man's sin.",
      "Methodist": "Moses and Aaron again show humility and intercede for the people, pleading for mercy based on God's relationship with all humanity.",
      "Lutheran": "Moses and Aaron intercede, falling on their faces and appealing to God ('God of the spirits of all flesh') not to wrathfully punish the whole congregation for one man's sin."
    },
    "23": {
      "General": "The Lord responds to Moses.",
      "Non-Denominational": "God answers Moses' intercession.",
      "Baptist": "Records God responding to Moses' plea.",
      "Catholic": "The Lord replies to Moses' intercession.",
      "Methodist": "God answers Moses.",
      "Lutheran": "The Lord speaks again to Moses."
    },
    "24": {
      "General": "God instructs Moses to tell the congregation to move away from the dwellings (tabernacles/tents) of Korah, Dathan, and Abiram.",
      "Non-Denominational": "God commands the congregation to physically separate themselves from the specific tents of the main rebel leaders.",
      "Baptist": "God directs the people to separate themselves physically from the tents of the chief rebels, offering a chance to avoid judgment.",
      "Catholic": "God instructs Moses to command the assembly to withdraw from the vicinity of the dwellings of Korah, Dathan, and Abiram.",
      "Methodist": "God instructs the people to distance themselves from the tents of the rebellion's leaders.",
      "Lutheran": "God tells Moses to command the congregation to move away from the tents of Korah, Dathan, and Abiram."
    },
    "25": {
      "General": "Moses gets up and goes towards Dathan and Abiram's location, followed by the elders of Israel.",
      "Non-Denominational": "Moses, accompanied by the elders, goes to confront Dathan and Abiram directly.",
      "Baptist": "Moses goes to the location of Dathan and Abiram, supported by the elders, to deliver God's warning.",
      "Catholic": "Moses proceeds towards Dathan and Abiram, accompanied by the elders, to implement God's command.",
      "Methodist": "Moses, with the elders, goes to the area of Dathan and Abiram's tents.",
      "Lutheran": "Moses goes to Dathan and Abiram, with the elders following him."
    },
    "26": {
      "General": "Moses warns the congregation to depart from the tents of these wicked men and avoid touching anything belonging to them, lest they be destroyed along with the rebels due to their sins.",
      "Non-Denominational": "Moses publicly warns the people to completely separate from the rebels and their possessions to avoid sharing their fate.",
      "Baptist": "Moses delivers the warning: separate completely from these wicked men and their belongings to escape judgment for their sins.",
      "Catholic": "Moses relays God's warning to the assembly: depart from the tents of the wicked rebels and avoid all contact, lest they share their punishment.",
      "Methodist": "Moses urges the congregation to separate entirely from the wicked rebels to avoid being caught in their destruction.",
      "Lutheran": "Moses warns the congregation to depart from the tents of these wicked men and touch nothing of theirs, to avoid being consumed in their sins."
    },
    "27": {
      "General": "The people obey and move away. Dathan and Abiram defiantly come out and stand at their tent doors with their entire families (wives, sons, children).",
      "Non-Denominational": "The congregation separates, while Dathan and Abiram defiantly stand with their families, awaiting judgment.",
      "Baptist": "The people heed the warning and withdraw, but Dathan and Abiram remain defiant, standing outside their tents with their families.",
      "Catholic": "The assembly withdraws as commanded, while Dathan and Abiram, in a final act of defiance, stand at their tent doors with their families.",
      "Methodist": "The people separate, but Dathan and Abiram defiantly present themselves and their families at their tents.",
      "Lutheran": "The people move away, but Dathan and Abiram come out defiantly with their wives, sons, and children, standing at their tent doors."
    },
    "28": {
      "General": "Moses declares that the upcoming event will prove God sent him and that his actions are not self-motivated.",
      "Non-Denominational": "Moses declares the impending judgment will serve as undeniable proof of his divine commission.",
      "Baptist": "Moses states that the imminent judgment will vindicate his leadership as God-ordained, not self-appointed.",
      "Catholic": "Moses declares that the impending event will serve as divine validation of his mission and authority.",
      "Methodist": "Moses states that the following sign will confirm that his actions are from God, not his own will.",
      "Lutheran": "Moses declares the sign to follow will prove the Lord sent him and he hasn't acted on his own."
    },
    "29": {
      "General": "He states: If these men die a normal death like everyone else, then the Lord has not sent me.",
      "Non-Denominational": "Moses sets the condition: a natural death for the rebels would disprove his divine authority.",
      "Baptist": "Moses contrasts a normal death with the impending judgment: if they die naturally, his claim is false.",
      "Catholic": "Moses proposes the negative test: if the rebels die a natural death, it signifies God has not sent him.",
      "Methodist": "Moses outlines the negative proof: if they die normally, then God hasn't sent him.",
      "Lutheran": "Moses states the condition: if they die a common death, the Lord did not send him."
    },
    "30": {
      "General": "But, if the Lord does something unprecedented ('make a new thing') – the earth opening and swallowing them alive into Sheol ('the pit') – then everyone will understand these men have provoked (shown contempt for) the Lord.",
      "Non-Denominational": "Moses declares the positive proof: a supernatural judgment (earth swallowing them) will confirm their provocation of God and Moses' authority.",
      "Baptist": "Moses describes the specific, unprecedented judgment (earth swallowing them alive) that will prove they have provoked God.",
      "Catholic": "Moses describes the expected sign: an extraordinary act of God (the earth swallowing them alive into the abyss/pit) will demonstrate their offense against the Lord.",
      "Methodist": "Moses describes the unprecedented sign (earth swallowing them) that will prove the rebels have defied God.",
      "Lutheran": "Moses describes the sign: if God creates something new - the earth swallowing them alive into the pit (Sheol) - it proves they provoked the Lord."
    },
    "31": {
      "General": "Immediately after Moses finishes speaking, the ground beneath the rebels splits open.",
      "Non-Denominational": "As soon as Moses finishes speaking, the judgment occurs exactly as predicted: the ground splits.",
      "Baptist": "Instantaneously upon Moses' words ending, the ground beneath the rebels breaks apart.",
      "Catholic": "Immediately following Moses' declaration, the ground beneath the rebels splits open.",
      "Methodist": "The moment Moses finishes speaking, the ground beneath them splits apart.",
      "Lutheran": "As soon as Moses stopped speaking, the ground under the rebels split apart."
    },
    "32": {
      "General": "The earth opens its 'mouth' and swallows Dathan, Abiram, their households, all the men associated with Korah (likely those at the tents), and all their possessions.",
      "Non-Denominational": "The earth swallows the Reubenite leaders, their families, Korah's associates present there, and all their belongings.",
      "Baptist": "The earth swallows Dathan, Abiram, their households, Korah's followers at the scene, and all their property.",
      "Catholic": "The earth engulfs them: Dathan, Abiram, their families, Korah's associates, and all their possessions.",
      "Methodist": "The earth swallows the rebel leaders, their households, Korah's followers involved, and their possessions.",
      "Lutheran": "The earth opened and swallowed them, their houses, all Korah's men (followers), and their goods."
    },
    "33": {
      "General": "They and everything associated with them go down alive into Sheol ('the pit'), the earth closes over them, and they perish, removed from the congregation.",
      "Non-Denominational": "They descend alive into the grave ('the pit'), are sealed by the earth, and cease to exist within the community.",
      "Baptist": "Describes their terrifying end: descending alive into the pit (Sheol), covered by the earth, and perishing from Israel.",
      "Catholic": "They descend alive into Sheol ('the pit'), the earth covers them, and they are eliminated from the assembly.",
      "Methodist": "They go down alive into the pit, the earth closes over them, removing them completely from the community.",
      "Lutheran": "They went down alive into the pit (Sheol), the earth closed over them, and they perished from the congregation."
    },
    "34": {
      "General": "All the Israelites nearby flee in terror at their cries, fearing the earth might swallow them too.",
      "Non-Denominational": "The surrounding Israelites flee in panic, terrified of sharing the same fate.",
      "Baptist": "The witnessing Israelites flee in terror at the rebels' cries, fearing they might also be swallowed.",
      "Catholic": "The surrounding Israelites flee in terror at the victims' cries, fearing they too might be engulfed.",
      "Methodist": "The nearby Israelites flee in terror, fearing the same judgment upon themselves.",
      "Lutheran": "All surrounding Israel fled at their cries, fearing the earth would swallow them too."
    },
    "35": {
      "General": "Then, fire comes out from the Lord and consumes the 250 men (including Korah himself, now at the Tabernacle) who were offering incense.",
      "Non-Denominational": "A second judgment follows: fire from God consumes the 250 leaders who were illicitly offering incense.",
      "Baptist": "Divine fire consumes the 250 men (including Korah) who presumptuously offered incense, demonstrating God's judgment on usurping priestly functions.",
      "Catholic": "Divine fire then consumes the 250 men (including Korah) who were illicitly performing the priestly act of offering incense.",
      "Methodist": "Fire from God destroys the 250 men who were attempting to offer incense, judging their presumption.",
      "Lutheran": "Fire comes from the Lord and consumes the 250 men (Korah's company from v.5-7, 16-18) offering incense."
    },
    "36": {
      "General": "The Lord speaks again to Moses.",
      "Non-Denominational": "God gives further instructions to Moses following the judgments.",
      "Baptist": "Records God speaking to Moses after the judgments.",
      "Catholic": "The Lord gives further instructions to Moses.",
      "Methodist": "God speaks again to Moses.",
      "Lutheran": "The Lord speaks to Moses."
    },
    "37": {
      "General": "He instructs Moses to tell Eleazar (Aaron's son and successor priest) to collect the censers from the site of the burning, scattering the coals elsewhere, because the censers themselves have become holy.",
      "Non-Denominational": "God commands Eleazar to retrieve the censers from the aftermath, recognizing their consecrated status despite the users' sin.",
      "Baptist": "God instructs Eleazar the priest to gather the censers, now considered holy because they were used before the Lord, separating them from the profane fire.",
      "Catholic": "God commands Eleazar to collect the censers from the burning, scattering the fire, because the censers themselves are now consecrated ('hallowed').",
      "Methodist": "God instructs Eleazar to gather the censers, which have become holy through their use before God, and dispose of the fire.",
      "Lutheran": "God tells Moses to have Eleazar the priest retrieve the censers from the fire, scattering the coals, because the censers are holy."
    },
    "38": {
      "General": "These censers, belonging to men who sinned at the cost of their lives, are to be hammered into broad plates to cover the altar. Because they were presented before the Lord, they are holy and will serve as a warning sign to Israel.",
      "Non-Denominational": "The censers of the judged sinners are repurposed as an altar covering, serving as a permanent, holy sign and warning to Israel.",
      "Baptist": "God commands the censers of these sinners be made into an altar covering, serving as a holy memorial and warning against future rebellion and unauthorized worship.",
      "Catholic": "The censers, consecrated by being offered before God, are to be made into plating for the altar, serving as a perpetual, holy sign and warning to Israel.",
      "Methodist": "The censers are repurposed as an altar covering, their holiness derived from being offered to God, serving as a lasting sign and warning.",
      "Lutheran": "The censers of these sinners are to be hammered into plates for the altar covering; because offered before the Lord, they are holy and serve as a warning sign."
    },
    "39": {
      "General": "Eleazar the priest collects the bronze censers used by those consumed by fire and has them hammered into plates for the altar covering.",
      "Non-Denominational": "Eleazar carries out the command, collecting the bronze censers and having them made into the altar covering.",
      "Baptist": "Eleazar obeys, taking the bronze censers and having them fashioned into the altar covering.",
      "Catholic": "Eleazar the priest executes the command, collecting the bronze censers and having them made into plating for the altar.",
      "Methodist": "Eleazar follows the instruction, collecting the censers and repurposing them as an altar covering.",
      "Lutheran": "Eleazar collects the bronze censers from the dead rebels and they are hammered into an altar covering."
    },
    "40": {
      "General": "This altar covering serves as a permanent reminder to Israel that only descendants of Aaron (authorized priests) may approach to offer incense before the Lord, lest they suffer the fate of Korah and his company, fulfilling God's word through Moses.",
      "Non-Denominational": "Explains the purpose of the altar covering: a perpetual reminder restricting incense offering to Aaron's line, preventing a repeat of Korah's judgment.",
      "Baptist": "States the function of the altar covering: a memorial reinforcing the restriction of the priesthood to Aaron's descendants, warning against the fate of Korah.",
      "Catholic": "Defines the purpose of the altar plating: a perpetual reminder that only Aaronic priests may offer incense, preventing others from suffering Korah's fate, as God decreed through Moses.",
      "Methodist": "Specifies the covering as a memorial to restrict incense offering to Aaron's descendants, warning against Korah's fate, according to God's command via Moses.",
      "Lutheran": "The altar covering serves as a memorial: no unauthorized person (non-Aaronic) may offer incense, lest they end up like Korah, fulfilling God's command through Moses."
    },
    "41": {
      "General": "Despite the clear and terrifying judgments, the very next day the entire Israelite congregation complains against Moses and Aaron, accusing them of killing 'the Lord's people'.",
      "Non-Denominational": "Shockingly, the congregation immediately reverts to rebellion, blaming Moses and Aaron for the deaths caused by God's judgment.",
      "Baptist": "Records the appalling persistence of rebellion: the next day, the congregation murmurs, wrongly blaming Moses and Aaron for the judgment on 'the Lord's people'.",
      "Catholic": "Demonstrates the people's persistent insubordination: the following day, the entire assembly murmurs against Moses and Aaron, accusing them of killing God's people.",
      "Methodist": "Highlights the people's hardness of heart: the day after the judgment, they murmur against Moses and Aaron, blaming them for the deaths.",
      "Lutheran": "Incredibly, the next day the whole congregation murmurs against Moses and Aaron, accusing them of killing the Lord's people."
    },
    "42": {
      "General": "As the congregation gathers against Moses and Aaron, they look towards the Tabernacle, and the cloud (Shekinah glory) covers it, and the glory of the Lord appears again.",
      "Non-Denominational": "As the new rebellion forms, God's presence (cloud and glory) appears again at the Tabernacle.",
      "Baptist": "When the congregation gathers in renewed rebellion, God's presence (cloud, glory) manifests again at the Tabernacle.",
      "Catholic": "As the assembly gathers against Moses and Aaron, the divine presence (cloud, glory) appears again over the Tabernacle.",
      "Methodist": "During this further rebellion, God's presence (cloud, glory) again appears at the Tabernacle.",
      "Lutheran": "As the congregation gathered against Moses and Aaron, the cloud covered the Tabernacle and the Lord's glory appeared."
    },
    "43": {
      "General": "Moses and Aaron go to the front of the Tabernacle.",
      "Non-Denominational": "Moses and Aaron position themselves before the Tabernacle in response to God's appearance.",
      "Baptist": "Moses and Aaron approach the Tabernacle where God's glory is manifest.",
      "Catholic": "Moses and Aaron come before the Tabernacle.",
      "Methodist": "Moses and Aaron go to the Tabernacle entrance.",
      "Lutheran": "Moses and Aaron came to the front of the Tabernacle."
    },
    "44": {
      "General": "The Lord speaks to Moses.",
      "Non-Denominational": "God addresses Moses again.",
      "Baptist": "Records God speaking to Moses again.",
      "Catholic": "The Lord addresses Moses.",
      "Methodist": "God speaks to Moses.",
      "Lutheran": "The Lord speaks to Moses."
    },
    "45": {
      "General": "God again commands them to get away from the congregation so He can destroy them instantly. Once more, Moses and Aaron fall on their faces in intercession.",
      "Non-Denominational": "God repeats His threat of immediate destruction and command to separate; Moses and Aaron immediately intercede again.",
      "Baptist": "God again threatens immediate judgment on the murmuring congregation; Moses and Aaron instantly fall down to intercede.",
      "Catholic": "God again orders Moses and Aaron to withdraw before He instantly consumes the assembly; they again fall prostrate in intercession.",
      "Methodist": "God repeats His intention of immediate judgment; Moses and Aaron again fall on their faces to plead for the people.",
      "Lutheran": "God repeats the command: separate from the congregation for immediate destruction. Moses and Aaron fall on their faces."
    },
    "46": {
      "General": "Moses urgently instructs Aaron to take a censer with fire from the altar and incense, run quickly into the congregation, and make atonement because God's wrath is active and a plague has already started.",
      "Non-Denominational": "Moses directs Aaron to perform an emergency atonement ritual with the censer to stop the plague already unleashed by God's wrath.",
      "Baptist": "Moses commands Aaron to act quickly as high priest, using the censer and incense to make atonement and intervene against the plague sent by God's wrath.",
      "Catholic": "Moses instructs Aaron to perform an urgent act of priestly mediation: use the censer with fire and incense to make atonement and stop the plague resulting from divine wrath.",
      "Methodist": "Moses commands Aaron to quickly perform the priestly act of atonement with the censer to halt the plague that has begun due to God's wrath.",
      "Lutheran": "Moses tells Aaron to quickly take a censer with altar fire and incense to make atonement, because God's wrath has gone out and the plague has begun."
    },
    "47": {
      "General": "Aaron obeys, runs into the midst of the people where the plague is already active, puts on the incense, and performs the atonement ritual.",
      "Non-Denominational": "Aaron promptly obeys, running into the afflicted crowd and performing the atonement ritual amidst the plague.",
      "Baptist": "Aaron obeys Moses immediately, rushing into the plague-stricken congregation and making atonement with the incense.",
      "Catholic": "Aaron executes Moses' command, running into the assembly where the plague rages and performing the rite of atonement.",
      "Methodist": "Aaron follows Moses' command, runs into the crowd, and performs the atonement ritual while the plague is active.",
      "Lutheran": "Aaron obeys, runs into the congregation where the plague has started, and makes atonement with the incense."
    },
    "48": {
      "General": "Aaron stands physically between the dead and the living portions of the congregation, and the plague is stopped.",
      "Non-Denominational": "Aaron's intercessory act, standing between the dead and living, effectively halts the plague's progress.",
      "Baptist": "Aaron's priestly intercession, symbolized by his standing between the dead and the living, successfully stops the plague.",
      "Catholic": "Aaron's priestly mediation, positioning himself between the dead and the living, successfully arrests the plague.",
      "Methodist": "Aaron stands as mediator between the dead and the living, and through his atonement, the plague is halted.",
      "Lutheran": "Aaron stands between the dead and the living (as mediator), and the plague stops."
    },
    "49": {
      "General": "The number who died in this plague was 14,700, in addition to those who died in the Korah incident (earth swallowing, fire).",
      "Non-Denominational": "States the death toll from the plague (14,700), distinguishing it from the deaths in Korah's initial rebellion.",
      "Baptist": "Records the heavy death toll from the plague (14,700), separate from those judged earlier in Korah's rebellion.",
      "Catholic": "Specifies the number killed by the plague (14,700), distinct from those who died in the earlier judgments related to Korah.",
      "Methodist": "Gives the number killed by the plague (14,700), adding to the deaths from Korah's rebellion.",
      "Lutheran": "Records the casualties of the plague: 14,700, besides those who died in Korah's rebellion."
    },
    "50": {
      "General": "Aaron returns to Moses at the Tabernacle entrance, the plague having been stopped.",
      "Non-Denominational": "With the plague halted, Aaron returns to Moses at the Tabernacle.",
      "Baptist": "Aaron returns to Moses, his intercessory mission complete and the plague stayed.",
      "Catholic": "The plague having ceased, Aaron returns to Moses at the Tabernacle entrance.",
      "Methodist": "Aaron returns to Moses at the Tabernacle, the plague having been stopped through his atonement.",
      "Lutheran": "Aaron returns to Moses at the Tabernacle entrance after the plague was stopped."
    }
  }
}
