{
  "chapterSummary": {
    "General": "Numbers 16 describes the rebellion of Korah, Dathan, and Abiram against Moses and Aaron, emphasizing the consequences of rebellion and the affirmation of God's chosen leadership.",
    "Non-Denominational": "This chapter highlights the consequences of rebellion and the affirmation of God's chosen leadership.",
    "Baptist": "The chapter emphasizes the consequences of rebellion and the affirmation of God's chosen leadership in His work.",
    "Catholic": "Numbers 16 illustrates the Church's understanding of rebellion and God's chosen leadership.",
    "Methodist": "This chapter shows the consequences of rebellion and the affirmation of God's chosen leadership in the community.",
    "Lutheran": "The chapter demonstrates God's order and the consequences of rebellion.",
    "Presbyterian": "This chapter reflects God's covenant faithfulness and the consequences of rebellion.",
    "Pentecostal": "Numbers 16 shows the importance of spiritual submission and God's chosen leadership in His kingdom.",
    "Anglican": "The chapter demonstrates the consequences of rebellion and the affirmation of God's chosen leadership in the Church.",
    "Orthodox": "This chapter reveals the sacred nature of submission and God's chosen leadership."
  },
  "1": {
    "General": "Korah son of Izhar, the son of Kohath, the son of Levi, and certain Reubenites—Dathan and Abiram, sons of Eliab, and On son of Peleth—became insolent
    "Non-Denominational": "The rebellion highlights the dangers of pride and insubordination.",
    "Baptist": "The verse emphasizes the dangers of pride and insubordination in God's work.",
    "Catholic": "The rebellion reflects the dangers of pride and insubordination in the Church.",
    "Methodist": "This verse shows the dangers of pride and insubordination in the community.",
    "Lutheran": "The rebellion highlights the dangers of pride.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the dangers of pride.",
    "Pentecostal": "The rebellion emphasizes the dangers of pride and insubordination.",
    "Anglican": "The account highlights the dangers of pride and insubordination in His plan.",
    "Orthodox": "This verse reveals the dangers of pride and insubordination in His plan."
  },
  "2": {
    "General": "and rose up against Moses. With them were 250 Israelite men, well-known community leaders who had been appointed members of the council.",
    "Non-Denominational": "The uprising highlights the dangers of collective rebellion and disobedience.",
    "Baptist": "The verse emphasizes the dangers of collective rebellion and disobedience in God's work.",
    "Catholic": "The uprising reflects the dangers of collective rebellion and disobedience in the Church.",
    "Methodist": "This verse shows the dangers of collective rebellion and disobedience in the community.",
    "Lutheran": "The uprising highlights the dangers of rebellion.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the dangers of rebellion.",
    "Pentecostal": "The uprising emphasizes the dangers of collective rebellion and disobedience.",
    "Anglican": "The account highlights the dangers of collective rebellion and disobedience in His plan.",
    "Orthodox": "This verse reveals the dangers of collective rebellion and disobedience in His plan."
  },
  "3": {
    "General": "They came as a group to oppose Moses and Aaron and said to them, 'You have gone too far! The whole community is holy, every one of them, and the Lord is with them. Why then do you set yourselves above the Lord's assembly?'
    "Non-Denominational": "The challenge highlights the dangers of misunderstanding God's chosen leadership.",
    "Baptist": "The verse emphasizes the dangers of misunderstanding God's chosen leadership in His work.",
    "Catholic": "The challenge reflects the dangers of misunderstanding God's chosen leadership in the Church.",
    "Methodist": "This verse shows the dangers of misunderstanding God's chosen leadership in the community.",
    "Lutheran": "The challenge highlights the dangers of misunderstanding leadership.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the dangers of misunderstanding leadership.",
    "Pentecostal": "The challenge emphasizes the dangers of misunderstanding God's chosen leadership.",
    "Anglican": "The account highlights the dangers of misunderstanding God's chosen leadership in His plan.",
    "Orthodox": "This verse reveals the dangers of misunderstanding God's chosen leadership in His plan."
  },
  "4": {
    "General": "When Moses heard this, he fell facedown.",
    "Non-Denominational": "Moses' response highlights the importance of humility and seeking God's guidance.",
    "Baptist": "The verse emphasizes the importance of humility and seeking God's guidance in His work.",
    "Catholic": "Moses' response reflects the importance of humility and seeking God's guidance in the Church.",
    "Methodist": "This verse shows the importance of humility and seeking God's guidance in the community.",
    "Lutheran": "Moses' response highlights the importance of humility.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of humility.",
    "Pentecostal": "Moses' response emphasizes the importance of humility and seeking God's guidance.",
    "Anglican": "The account highlights the importance of humility and seeking God's guidance in His plan.",
    "Orthodox": "This verse reveals the importance of humility and seeking God's guidance in His plan."
  },
  "5": {
    "General": "Then he said to Korah and all his followers: 'In the morning the Lord will show who belongs to him and who is holy, and he will have that person come near him. The man he chooses he will cause to come near him.",
    "Non-Denominational": "Moses' declaration highlights the importance of divine selection and holiness.",
    "Baptist": "The verse emphasizes the importance of divine selection and holiness in God's work.",
    "Catholic": "Moses' declaration reflects the importance of divine selection and holiness in the Church.",
    "Methodist": "This verse shows the importance of divine selection and holiness in the community.",
    "Lutheran": "Moses' declaration highlights the importance of divine selection.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of divine selection.",
    "Pentecostal": "Moses' declaration emphasizes the importance of divine selection and holiness.",
    "Anglican": "The account highlights the importance of divine selection and holiness in His plan.",
    "Orthodox": "This verse reveals the importance of divine selection and holiness in His plan."
  }
} 