{
  "Summary": {
    "General": "Following the rebellion of Korah and the subsequent plague, God provides a definitive sign to establish the legitimacy of Aaron's priesthood and end the people's murmuring. The Lord instructs Moses to collect twelve rods, one from the leader ('prince') of each ancestral tribe, with each leader's name inscribed on his rod. Aaron's name is to be written on the rod representing the tribe of Levi. Moses places these rods in the Tabernacle before the Ark of the Testimony ('before the testimony'), where God meets with Moses. God declares that the rod belonging to the man He chooses will miraculously sprout ('blossom'). The next day, Moses retrieves the rods and finds that Aaron's rod alone has not only budded but has also produced blossoms and ripe almonds. Moses shows the rods to all the Israelites, and each prince reclaims his own rod. God then commands Moses to return Aaron's budded rod to its place before the Testimony as a permanent symbol ('token') and warning against future rebellion ('rebels'), aiming to stop their complaints and prevent further deaths. Moses obeys. The chapter concludes with the Israelites expressing fear and despair to Moses, lamenting that anyone who approaches the Tabernacle seems destined to die, questioning if they will all perish.",
    "Non-Denominational": "Focuses on God's miraculous confirmation of His chosen priest, Aaron, to address the people's persistent challenges and murmuring. Aaron's rod budding with life (buds, blossoms, almonds) is a clear supernatural sign validating the Aaronic priesthood, intended to bring peace and acceptance of God's established order. The rod serves as a lasting symbol against rebellion. The people's final fearful reaction highlights their continued struggle to trust God's provision and authority, even after such clear signs.",
    "Baptist": "Emphasizes God's sovereign choice and vindication of Aaron's priesthood against the backdrop of Korah's rebellion and the people's murmuring. The miraculous budding of Aaron's rod is a divine sign, supernaturally demonstrating God's exclusive appointment of the Levites, specifically Aaron's line, for priestly service. This event aims to silence dissent and establish God's authority definitively. The rod becomes a perpetual token against rebellion. The people's concluding fear underscores human frailty and the awe appropriate before God's manifest power and holiness.",
    "Catholic": "Interprets the budding rod as a divinely ordained miracle confirming the unique legitimacy of the Aaronic priesthood and the tribe of Levi's special role, definitively settling the disputes raised in the previous chapter. The rod, exhibiting life (buds, blossoms, fruit), symbolizes God's choice and conferred authority. Placing the rod before the Ark signifies its sacred purpose as a perpetual sign ('token') against schism and rebellion. The people's fear reflects their awareness of the sanctity of the Tabernacle and the consequences of unauthorized approach, underlining the need for priestly mediation.",
    "Methodist": "Views the miracle of Aaron's rod as God's gracious yet firm response to quell rebellion and confirm His chosen leadership for priestly service. The rod bringing forth life demonstrates God's power and His specific calling of Aaron. It serves as a tangible sign to end murmuring and establish order. The rod's preservation before the Testimony acts as a constant reminder against challenging God's appointments. The people's fear at the end reflects their consciousness of sin and the holiness required to approach God.",
    "Lutheran": "Sees the budding rod as God's clear, miraculous sign validating His chosen instrument, Aaron, and the Levitical priesthood, directly addressing the people's rebellious questioning of God's established order. The supernatural life appearing on the dead wood confirms God's choice and silences challenges to His authority. Aaron's rod is kept as a perpetual sign (Law) against rebellion ('rebels') and murmuring. The people's concluding fear demonstrates their terror before God's holy judgment and their recognition of their inability to approach Him directly without His ordained means."
  },
  "Verses": {
    "1": {
      "General": "The Lord speaks to Moses, initiating the next action following the plague.",
      "Non-Denominational": "God addresses Moses to give instructions aimed at resolving the leadership crisis.",
      "Baptist": "Records God speaking directly to Moses with instructions to settle the priestly dispute.",
      "Catholic": "Indicates a new divine communication to Moses, addressing the recent unrest.",
      "Methodist": "God speaks to Moses, providing a way to confirm the chosen priesthood.",
      "Lutheran": "The Lord speaks to Moses, initiating the test of the rods."
    },
    "2": {
      "General": "God instructs Moses to collect a rod (staff) from a leader ('prince') of each of the twelve ancestral tribes, writing each leader's name on his respective rod.",
      "Non-Denominational": "God commands the collection of representative rods from tribal leaders, identified by name.",
      "Baptist": "God commands Moses to gather twelve rods, one for each tribe's leader, marked with their names.",
      "Catholic": "God instructs Moses to obtain a staff from the head of each ancestral house (twelve total), inscribed with the leader's name.",
      "Methodist": "God directs Moses to take twelve rods, one representing each tribe's leader, marked with their names.",
      "Lutheran": "God commands Moses to take twelve rods, one for each tribe's leader ('prince'), with names written on them."
    },
    "3": {
      "General": "Aaron's name is specifically to be written on the rod representing the tribe of Levi, confirming one rod per tribal head.",
      "Non-Denominational": "Specifies Aaron's name for the Levi rod, highlighting Levi's unique position in this test.",
      "Baptist": "God designates Aaron's name for the rod of Levi, confirming his representation of the tribe.",
      "Catholic": "Aaron's name is to be inscribed on the staff of Levi, representing the head of that ancestral house.",
      "Methodist": "Directs Aaron's name to be put on Levi's rod, affirming his role as the tribe's representative leader.",
      "Lutheran": "Aaron's name is to be written on Levi's rod, as he is the head of that tribe's house."
    },
    "4": {
      "General": "Moses is to place these twelve rods inside the Tabernacle, specifically before the Ark of the Testimony, the place where God meets with him.",
      "Non-Denominational": "Instructs Moses to place the rods in the sacred space before the Ark, the place of God's presence.",
      "Baptist": "Commands Moses to lay the rods inside the Tabernacle before the Ark, God's meeting place.",
      "Catholic": "The rods are to be deposited within the Tabernacle, before the Ark ('testimony'), where God manifests His presence.",
      "Methodist": "Directs the placement of the rods within the Tabernacle before the Ark, where God communicates with Moses.",
      "Lutheran": "Moses is told to lay the rods in the Tabernacle before the Testimony (Ark), where God meets him."
    },
    "5": {
      "General": "God declares that the rod belonging to the man He chooses will miraculously sprout ('blossom'), and this sign will stop the Israelites' persistent complaining against Moses and Aaron.",
      "Non-Denominational": "God promises a miraculous sign (a sprouting rod) to identify His chosen leader and end the people's murmuring.",
      "Baptist": "God states the miracle: the chosen man's rod will blossom, thereby silencing the Israelites' rebellious complaints.",
      "Catholic": "God announces the sign: the staff of His chosen one will sprout, thus ending the Israelites' murmurings against their leaders.",
      "Methodist": "God declares the method of confirmation: the chosen rod will blossom, silencing the people's complaints.",
      "Lutheran": "God declares His chosen man's rod will blossom, which will cause the Israelites' murmuring against Moses and Aaron to cease."
    },
    "6": {
      "General": "Moses relays God's instructions, and each tribal leader provides a rod, totaling twelve, with Aaron's rod included among them.",
      "Non-Denominational": "Moses communicates the plan, and the tribal leaders comply, providing the twelve rods including Aaron's.",
      "Baptist": "Moses instructs the leaders, who each give him a rod (twelve total), including Aaron's rod among them.",
      "Catholic": "Moses conveys God's command, and the tribal leaders provide their staffs (twelve total), with Aaron's staff present.",
      "Methodist": "Moses follows God's instruction, collects the twelve rods from the leaders, with Aaron's rod among them.",
      "Lutheran": "Moses speaks to Israel, the princes give him twelve rods (one each), and Aaron's rod is among them."
    },
    "7": {
      "General": "Moses places the rods before the Lord within the Tabernacle of Witness (another name for the Tabernacle containing the Testimony/Ark).",
      "Non-Denominational": "Moses carries out the instruction, placing the rods in God's presence within the Tabernacle.",
      "Baptist": "Moses lays the rods before God inside the Tabernacle of Witness.",
      "Catholic": "Moses deposits the rods before the Lord within the Tabernacle of the Testimony ('witness').",
      "Methodist": "Moses places the rods before the Lord in the designated sacred space, the Tabernacle of Witness.",
      "Lutheran": "Moses lays the rods before the Lord in the Tabernacle of Witness."
    },
    "8": {
      "General": "The next day, Moses enters the Tabernacle and finds that Aaron's rod (representing Levi) has supernaturally produced buds, blossoms, and ripe almonds.",
      "Non-Denominational": "The miracle occurs overnight: Aaron's rod alone shows signs of life, bearing buds, flowers, and almonds.",
      "Baptist": "The divine sign is revealed: the next day, Aaron's rod has miraculously budded, blossomed, and produced almonds.",
      "Catholic": "The next day, the miracle is evident: Aaron's staff has sprouted, flowered, and borne ripe almonds.",
      "Methodist": "The confirmation is given: Aaron's rod miraculously buds, blossoms, and yields almonds overnight.",
      "Lutheran": "The next day, Moses finds Aaron's rod (for Levi) had budded, blossomed, and yielded almonds."
    },
    "9": {
      "General": "Moses brings all the rods out from the Lord's presence to show the Israelites; they see the miracle, and each leader retrieves his own unchanged rod.",
      "Non-Denominational": "Moses presents the evidence to the people; they observe the miracle and reclaim their lifeless rods.",
      "Baptist": "Moses displays all the rods; the people witness the sign on Aaron's rod and retrieve their own rods.",
      "Catholic": "Moses brings out all the staffs; the people observe the sign, and each leader reclaims his staff.",
      "Methodist": "Moses shows all the rods to the people; they see the proof, and the leaders take back their rods.",
      "Lutheran": "Moses brings all the rods out from before the Lord; the Israelites see, and each prince takes his rod."
    },
    "10": {
      "General": "The Lord instructs Moses to put Aaron's rod back before the Testimony to be kept as a permanent sign ('token') against rebellious people, to end their complaining and prevent their death.",
      "Non-Denominational": "God commands Aaron's living rod be preserved as a lasting symbol and warning against rebellion, intended to stop complaints and save lives.",
      "Baptist": "God commands Aaron's rod be kept before the Ark as a perpetual token against rebels, aiming to stop their deadly murmuring.",
      "Catholic": "The Lord instructs that Aaron's staff be returned before the Testimony as a permanent sign ('token') for the rebellious, to quell their complaints and prevent their destruction.",
      "Methodist": "God directs Aaron's rod to be kept as a permanent sign before the Ark, serving as a warning to rebels and a means to end their fatal complaints.",
      "Lutheran": "The Lord tells Moses to return Aaron's rod before the Testimony as a sign ('token') against the rebels, to end their murmuring and prevent their death."
    },
    "11": {
      "General": "Moses carries out God's command exactly.",
      "Non-Denominational": "Moses faithfully executes God's instructions regarding Aaron's rod.",
      "Baptist": "Records Moses' complete obedience to God's command concerning the rod.",
      "Catholic": "Moses performs the action exactly as commanded by the Lord.",
      "Methodist": "Moses demonstrates obedience by doing precisely what God commanded.",
      "Lutheran": "Moses obeys, doing exactly as the Lord commanded him."
    },
    "12": {
      "General": "The Israelites react with fear and despair, crying out to Moses that they are doomed to die and perish.",
      "Non-Denominational": "The people respond not with repentance, but with fear and hopelessness, lamenting their perceived inevitable doom.",
      "Baptist": "The Israelites express terror and despair to Moses, fearing death and destruction in light of God's manifest power.",
      "Catholic": "The Israelites express their fear and despair to Moses, lamenting their mortality and perceived destruction.",
      "Methodist": "The people react with fear and a sense of doom, exclaiming to Moses about their impending death.",
      "Lutheran": "The Israelites speak to Moses in fear and despair: 'Behold, we die, we perish, we all perish.'"
    },
    "13": {
      "General": "They conclude that anyone who even comes near the Lord's Tabernacle will die, questioning if their fate is to be utterly consumed by death.",
      "Non-Denominational": "Their fear leads to a wrong conclusion: associating nearness to God's dwelling solely with death, questioning if complete destruction is inevitable.",
      "Baptist": "They express extreme fear of God's holiness, believing that any approach to the Tabernacle results in death, questioning if they are doomed.",
      "Catholic": "They articulate their terror of approaching the sacred Tabernacle, fearing death for any proximity, and question if they are fated to be completely destroyed.",
      "Methodist": "Their fear manifests as a belief that approaching God's Tabernacle means certain death, leading them to question if they will all die.",
      "Lutheran": "They voice their terror: anyone approaching the Lord's Tabernacle dies. They question if they will be entirely consumed by death ('consumed with dying')."
    }
  }
}
