{
  "chapterSummary": {
    "General": "Numbers 18 outlines the duties and provisions for the priests and Levites, emphasizing the importance of service and support for God's chosen leaders.",
    "Non-Denominational": "This chapter highlights the importance of service and support for God's chosen leaders.",
    "Baptist": "The chapter emphasizes the importance of service and support for God's chosen leaders in His work.",
    "Catholic": "Numbers 18 illustrates the Church's understanding of service and support for God's chosen leaders.",
    "Methodist": "This chapter shows the importance of service and support for God's chosen leaders in the community.",
    "Lutheran": "The chapter demonstrates God's order and the importance of service.",
    "Presbyterian": "This chapter reflects God's covenant faithfulness and the importance of service.",
    "Pentecostal": "Numbers 18 shows the importance of spiritual service and support for God's chosen leaders in His kingdom.",
    "Anglican": "The chapter demonstrates the importance of service and support for God's chosen leaders in the Church.",
    "Orthodox": "This chapter reveals the sacred nature of service and support for God's chosen leaders."
  },
  "1": {
    "General": "The Lord said to Aaron, 'You, your sons and your family are to bear the responsibility for offenses connected with the sanctuary, and you and your sons alone are to bear the responsibility for offenses connected with the priesthood.",
    "Non-Denominational": "The responsibility highlights the importance of accountability and leadership.",
    "Baptist": "The verse emphasizes the importance of accountability and leadership in God's work.",
    "Catholic": "The responsibility reflects the importance of accountability and leadership in the Church.",
    "Methodist": "This verse shows the importance of accountability and leadership in the community.",
    "Lutheran": "The responsibility highlights the importance of accountability.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of accountability.",
    "Pentecostal": "The responsibility emphasizes the importance of accountability and leadership.",
    "Anglican": "The account highlights the importance of accountability and leadership in His plan.",
    "Orthodox": "This verse reveals the importance of accountability and leadership in His plan."
  },
  "2": {
    "General": "Bring your fellow Levites from your ancestral tribe to join you and assist you when you and your sons minister before the tent of the covenant law.",
    "Non-Denominational": "The assistance highlights the importance of teamwork and support.",
    "Baptist": "The verse emphasizes the importance of teamwork and support in God's work.",
    "Catholic": "The assistance reflects the importance of teamwork and support in the Church.",
    "Methodist": "This verse shows the importance of teamwork and support in the community.",
    "Lutheran": "The assistance highlights the importance of teamwork.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of teamwork.",
    "Pentecostal": "The assistance emphasizes the importance of teamwork and support.",
    "Anglican": "The account highlights the importance of teamwork and support in His plan.",
    "Orthodox": "This verse reveals the importance of teamwork and support in His plan."
  },
  "3": {
    "General": "They are to be responsible to you and are to perform all the duties of the tent, but they must not go near the furnishings of the sanctuary or the altar. Otherwise both they and you will die.",
    "Non-Denominational": "The boundaries highlight the importance of respect and order.",
    "Baptist": "The verse emphasizes the importance of respect and order in God's work.",
    "Catholic": "The boundaries reflect the importance of respect and order in the Church.",
    "Methodist": "This verse shows the importance of respect and order in the community.",
    "Lutheran": "The boundaries highlight the importance of respect.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of respect.",
    "Pentecostal": "The boundaries emphasize the importance of respect and order.",
    "Anglican": "The account highlights the importance of respect and order in His plan.",
    "Orthodox": "This verse reveals the importance of respect and order in His plan."
  },
  "4": {
    "General": "They are to join you and be responsible for the care of the tent of meeting—all the work at the tent—and no one else may come near where you are.",
    "Non-Denominational": "The care highlights the importance of dedication and exclusivity.",
    "Baptist": "The verse emphasizes the importance of dedication and exclusivity in God's work.",
    "Catholic": "The care reflects the importance of dedication and exclusivity in the Church.",
    "Methodist": "This verse shows the importance of dedication and exclusivity in the community.",
    "Lutheran": "The care highlights the importance of dedication.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of dedication.",
    "Pentecostal": "The care emphasizes the importance of dedication and exclusivity.",
    "Anglican": "The account highlights the importance of dedication and exclusivity in His plan.",
    "Orthodox": "This verse reveals the importance of dedication and exclusivity in His plan."
  },
  "5": {
    "General": "You are to be responsible for the care of the sanctuary and the altar, so that my wrath will not fall on the Israelites again.",
    "Non-Denominational": "The responsibility highlights the importance of stewardship and protection.",
    "Baptist": "The verse emphasizes the importance of stewardship and protection in God's work.",
    "Catholic": "The responsibility reflects the importance of stewardship and protection in the Church.",
    "Methodist": "This verse shows the importance of stewardship and protection in the community.",
    "Lutheran": "The responsibility highlights the importance of stewardship.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of stewardship.",
    "Pentecostal": "The responsibility emphasizes the importance of stewardship and protection.",
    "Anglican": "The account highlights the importance of stewardship and protection in His plan.",
    "Orthodox": "This verse reveals the importance of stewardship and protection in His plan."
  }
} 