{
  "Summary": {
    "General": "This chapter outlines the specific responsibilities and privileges assigned to the priests (Aaron and his sons) and the broader tribe of Levi concerning the sanctuary service. God establishes that the priests bear the iniquity related to the sanctuary and their priesthood, while the Levites assist them but cannot approach the holy vessels or altar. Their service is declared a gift. As compensation, since they receive no land inheritance in Israel, the priests are given specific portions of the offerings (heave offerings, wave offerings, firstfruits, etc.), and the Levites receive all the tithes collected from the Israelites. In turn, the Levites are required to offer a tithe of the tithes they receive (a 'heave offering') to the priests. This system ensures the financial support and separation of the priestly and Levitical duties, reinforcing that the Lord is their inheritance.",
    "Non-Denominational": "Focuses on God's clear delineation of roles and responsibilities within the religious structure. Priests handle the most sacred duties and bear the associated responsibility, while Levites serve in supportive roles. Their compensation through offerings and tithes, instead of land, highlights their unique calling and dependence on God and the community's faithfulness. The system ensures the function of the Tabernacle service and underscores God's provision for those dedicated wholly to His service.",
    "Baptist": "Emphasizes God's ordained structure for worship and service. The distinct roles of priests and Levites are divinely appointed, with specific responsibilities and consequences for transgression. The provision through tithes and offerings underscores the principle of supporting those in full-time ministry and the importance of the community's faithful giving. The Levites tithing their tithes demonstrates accountability and acknowledges God as the ultimate source.",
    "Catholic": "Views this chapter as establishing the hierarchical structure of the Old Testament priesthood and its support system. The priests (foreshadowing the ordained ministry) have specific liturgical functions and bear the 'iniquity of the sanctuary,' highlighting the sacredness of their role. The Levites assist in service. The provision through tithes and offerings reflects the Church's right and the faithful's duty to support the clergy and the works of the Church. The separation from land inheritance signifies dedication to sacred service.",
    "Methodist": "Highlights God's ordering of the community for worship and service, assigning specific duties to priests and Levites. It emphasizes the responsibility ('bearing iniquity') associated with sacred roles and God's provision for those set apart for ministry through tithes and offerings. This system encourages communal responsibility for supporting religious leaders and ensures the continuation of worship practices. The concept of service as a 'gift' underscores the grace involved in being called to ministry.",
    "Lutheran": "Focuses on God's institution of the priestly and Levitical offices (Law) and His provision for them. The distinct roles and the bearing of iniquity underscore the seriousness of approaching God and the need for ordained means. The system of tithes and offerings is God's way of providing for those who serve Him directly in the ministry of Word and Sacrament (prefigured here), relieving them of secular concerns. The Lord being their 'portion and inheritance' points towards Christ as the ultimate inheritance for believers."
  },
  "Verses": {
    "1": {
      "General": "The Lord tells Aaron that he, his sons (the priests), and his father's house (the Levites) will bear the responsibility for any wrongdoing ('iniquity') related to the sanctuary, the priesthood itself.",
      "Non-Denominational": "God assigns accountability for ritual purity and correctness in sanctuary service directly to Aaron and his lineage (priests and Levites).",
      "Baptist": "God explicitly assigns the burden of responsibility for any offense concerning the sanctuary and the priesthood to Aaron and his house.",
      "Catholic": "The Lord establishes that Aaron, his sons, and his ancestral house bear the responsibility ('iniquity') connected with the sanctuary and their priestly office.",
      "Methodist": "God places the responsibility for any failures or sins related to the sanctuary and priesthood upon Aaron and his family line.",
      "Lutheran": "The Lord declares Aaron, his sons, and his father's house responsible for offenses ('iniquity') related to the sanctuary and the priesthood."
    },
    "2": {
      "General": "God instructs Aaron to bring his kinsmen, the tribe of Levi, to be joined with him and assist him and his sons in their duties before the Tabernacle of Witness.",
      "Non-Denominational": "The Levites are designated as assistants to the priests (Aaron and sons) in the Tabernacle service.",
      "Baptist": "God commands Aaron to bring the Levites (his tribe) to assist him and his sons in their service before the Tabernacle.",
      "Catholic": "Aaron is instructed to associate the Levites (his tribe) with him to minister alongside him and his sons before the Tabernacle of the Testimony.",
      "Methodist": "The Levites are appointed to join and minister to Aaron and his sons (the priests) in their Tabernacle duties.",
      "Lutheran": "Aaron is instructed to bring the Levites (his tribe) to be joined to him and minister to him and his sons before the Tabernacle of Witness."
    },
    "3": {
      "General": "The Levites are to perform duties assigned by the priests and guard the Tabernacle, but they must not go near the sacred vessels or the altar, lest both they and the priests die.",
      "Non-Denominational": "Defines the Levites' role as supportive ('keep thy charge') and custodial, with strict boundaries preventing access to the holiest items.",
      "Baptist": "Specifies the Levites' duties under priestly direction and guarding the Tabernacle, strictly forbidding approach to holy vessels or the altar.",
      "Catholic": "The Levites are to attend to the priests' needs and the Tabernacle's care, but are forbidden to approach the sacred furnishings or the altar under penalty of death for all.",
      "Methodist": "Outlines the Levites' service roles and guarding duties, warning them strictly against approaching the holy items or altar.",
      "Lutheran": "The Levites are to perform service duties ('keep thy charge') and guard the Tabernacle, but must not approach the holy vessels or altar, lest all die."
    },
    "4": {
      "General": "The Levites are to be joined with Aaron and maintain the entire Tabernacle service, but no unauthorized person ('stranger') may come near.",
      "Non-Denominational": "Reinforces the Levites' role in maintaining the Tabernacle and restricts access to authorized personnel only.",
      "Baptist": "Confirms the Levites' role in Tabernacle upkeep and service, strictly prohibiting outsiders from approaching.",
      "Catholic": "The Levites are associated with Aaron for the care and service of the Tabernacle, with access forbidden to unauthorized individuals ('stranger').",
      "Methodist": "Emphasizes the Levites' partnership in Tabernacle service and the exclusion of those not authorized.",
      "Lutheran": "The Levites are joined to Aaron to maintain the Tabernacle service; unauthorized persons ('stranger') are forbidden to come near."
    },
    "5": {
      "General": "The priests (Aaron and sons) are specifically responsible for the duties of the sanctuary (the Holy Place) and the altar, to prevent God's wrath from falling on Israel again.",
      "Non-Denominational": "Assigns the core sacred duties of the Holy Place and altar exclusively to the priests to maintain divine favor and prevent judgment.",
      "Baptist": "Mandates the priests to oversee the sanctuary and altar duties to avert God's wrath upon the Israelites.",
      "Catholic": "The priests are assigned the charge of the sanctuary and the altar, ensuring proper service to prevent divine wrath against Israel.",
      "Methodist": "Specifies the priests' charge over the sanctuary and altar, emphasizing this role prevents God's wrath.",
      "Lutheran": "The priests are to keep charge of the sanctuary and the altar to prevent further wrath upon Israel."
    },
    "6": {
      "General": "God reiterates that He has chosen the Levites from among the Israelites as a gift to Aaron and his sons, dedicated ('given') to the Lord to perform the Tabernacle service.",
      "Non-Denominational": "God affirms His selection of the Levites as a dedicated group given to assist the priests in the Lord's service.",
      "Baptist": "God emphasizes His sovereign choice of the Levites, given as a gift to the priests for the service of the Tabernacle.",
      "Catholic": "God declares He has taken the Levites from Israel as a gift dedicated to the Lord, assigned to serve at the Tabernacle.",
      "Methodist": "God states He has taken the Levites as a gift for the priests, dedicated to serve the Lord at the Tabernacle.",
      "Lutheran": "God reaffirms He has taken the Levites from Israel as a gift to the priests, given to the Lord for Tabernacle service."
    },
    "7": {
      "General": "Therefore, Aaron and his sons must carefully maintain their priestly office for everything related to the altar and within the veil (the Most Holy Place); their priestly service is a gift from God, and any unauthorized person approaching will be put to death.",
      "Non-Denominational": "Restricts the highest priestly duties (altar, Holy of Holies) exclusively to Aaron's line, defining it as a gift of service with lethal consequences for unauthorized intrusion.",
      "Baptist": "Commands Aaron and sons to guard their unique priestly roles concerning the altar and the Most Holy Place, emphasizing it's a divine gift of service and trespass results in death.",
      "Catholic": "Assigns Aaron and his sons the exclusive duty of the priesthood concerning the altar and the inner sanctuary (behind the veil), calling it a gift of service and mandating death for unauthorized access.",
      "Methodist": "Directs Aaron and sons to keep their priestly charge over the altar and Holy of Holies, calling it a 'service of gift' and warning against unauthorized approach.",
      "Lutheran": "Aaron and his sons are commanded to keep their priestly office regarding the altar and within the veil; their service is a gift, and intruders ('stranger') will be killed."
    },
    "8": {
      "General": "The Lord tells Aaron that He has given him charge over the heave offerings (contributions lifted up) from all the consecrated gifts of the Israelites; these are assigned to Aaron and his sons as their perpetual share ('due') by ordinance.",
      "Non-Denominational": "God grants the priests the heave offerings from Israel's holy gifts as their designated portion.",
      "Baptist": "God allocates the heave offerings from all holy gifts of Israel to Aaron and his sons as their perpetual right.",
      "Catholic": "The Lord grants Aaron charge over the sacred contributions (heave offerings) from the Israelites' consecrated gifts, assigned perpetually to the priests.",
      "Methodist": "God gives Aaron and his sons the heave offerings from Israel's consecrated gifts as their rightful, permanent portion.",
      "Lutheran": "The Lord gives Aaron charge of the heave offerings from all Israel's hallowed things, assigned to the priests as a perpetual due."
    },
    "9": {
      "General": "From the most holy offerings (those not entirely burned), the priests are to receive the parts of the grain offerings, sin offerings, and trespass offerings; these portions are most holy for Aaron and his sons.",
      "Non-Denominational": "Specifies the priests' share from the most holy sacrifices (grain, sin, guilt offerings) not consumed by fire.",
      "Baptist": "Details the priests' portion from the most holy offerings (grain, sin, trespass), designating it as most holy for them.",
      "Catholic": "Assigns the priests the portions of the most holy offerings (grain, sin, guilt offerings) that are not burned on the altar.",
      "Methodist": "Identifies the priests' share of the most holy offerings (grain, sin, trespass offerings) reserved from the fire.",
      "Lutheran": "The priests' portion of the most holy things reserved from the fire includes parts of grain, sin, and trespass offerings."
    },
    "10": {
      "General": "These most holy portions must be eaten in the most holy place (within the sanctuary court); only the males among the priests may eat them.",
      "Non-Denominational": "Restricts consumption of the most holy portions to male priests within the sacred precincts.",
      "Baptist": "Mandates that these most holy portions be eaten in the holy place by the male priests only.",
      "Catholic": "Stipulates that these most holy portions must be eaten in a most holy place, and only by the males of the priestly line.",
      "Methodist": "Specifies that the most holy portions are to be eaten in the holy place by the male priests.",
      "Lutheran": "These portions must be eaten in the most holy place; every male priest shall eat it."
    },
    "11": {
      "General": "Additionally, the priests receive the heave offering from the Israelites' gift offerings and all their wave offerings; these are given to Aaron, his sons, and his daughters as a perpetual statute. Anyone in the priestly household who is ritually clean may eat these.",
      "Non-Denominational": "Grants the priests the heave and wave offerings, allowing ritually clean members of their households (including females) to eat them.",
      "Baptist": "Assigns the heave and wave offerings to the priests and their families (sons and daughters) perpetually, provided they are clean.",
      "Catholic": "Also assigns the heave and wave offerings to the priests, allowing their entire clean household (sons and daughters) to partake.",
      "Methodist": "Gives the heave and wave offerings to the priests and their families (sons and daughters), requiring ritual cleanness to eat.",
      "Lutheran": "The heave and wave offerings are given to the priests and their households (sons and daughters) perpetually; clean family members may eat."
    },
    "12": {
      "General": "God gives the priests the best ('fat') of the firstfruits of oil, wine, and wheat that the Israelites offer to the Lord.",
      "Non-Denominational": "Assigns the finest quality of the firstfruit offerings (oil, wine, wheat) to the priests.",
      "Baptist": "Allocates the best of the firstfruits (oil, wine, wheat) offered by Israel to the priests.",
      "Catholic": "Grants the priests the best parts (firstfruits) of the oil, wine, and grain offered to the Lord.",
      "Methodist": "Gives the priests the prime firstfruit offerings of oil, wine, and wheat.",
      "Lutheran": "All the best ('fat') of the oil, wine, and wheat (firstfruits) offered to the Lord are given to the priests."
    },
    "13": {
      "General": "The very first ripe produce ('firstripe things') of the land brought to the Lord also belongs to the priests; anyone in their household who is clean may eat it.",
      "Non-Denominational": "The earliest ripe produce offered belongs to the priests and can be eaten by clean members of their household.",
      "Baptist": "Assigns the first ripe fruits brought to the Lord to the priests, consumable by their clean family members.",
      "Catholic": "The first ripe fruits of the land presented to the Lord are given to the priests, to be eaten by the clean members of their household.",
      "Methodist": "Gives the first ripe produce offered to the Lord to the priests, permitting clean household members to eat.",
      "Lutheran": "The first ripe produce of the land brought to the Lord belongs to the priests; clean household members may eat it."
    },
    "14": {
      "General": "Everything in Israel that is irrevocably devoted ('devoted thing', Hebrew: cherem) to the Lord belongs to the priests.",
      "Non-Denominational": "All items completely devoted to God under the ban (cherem) are assigned to the priests.",
      "Baptist": "Specifies that everything permanently devoted to the Lord in Israel belongs to the priests.",
      "Catholic": "Assigns everything 'devoted' (cherem - set apart usually for destruction or sacred use) in Israel to the priests.",
      "Methodist": "Gives everything 'devoted' (permanently dedicated) to the Lord in Israel to the priests.",
      "Lutheran": "Everything devoted (cherem) in Israel belongs to the priests."
    },
    "15": {
      "General": "The firstborn of all creatures, human and animal, offered to the Lord belongs to the priests. However, the firstborn humans and the firstborn of unclean animals must be redeemed (bought back).",
      "Non-Denominational": "Assigns all firstborn to the priests, but mandates redemption for human firstborn and those of unclean animals.",
      "Baptist": "Gives the firstborn of all flesh (man and beast) to the priests, but requires redemption for human firstborn and unclean animals.",
      "Catholic": "Assigns the firstborn of humans and animals to the priests, but requires the redemption of human firstborn and the firstborn of unclean animals.",
      "Methodist": "Specifies the priests receive all firstborn, but human firstborn and unclean animal firstborn must be redeemed.",
      "Lutheran": "Every firstborn (human and animal) belongs to the priests, but firstborn humans and unclean animals must be redeemed."
    },
    "16": {
      "General": "The redemption price for a firstborn human (from one month old) is set at five shekels of silver, according to the sanctuary shekel standard (twenty gerahs).",
      "Non-Denominational": "Sets the redemption price for a firstborn human at five sanctuary shekels.",
      "Baptist": "Establishes the redemption price for a firstborn human (one month or older) at five silver shekels (sanctuary standard).",
      "Catholic": "Fixes the redemption price for a human firstborn (from one month old) at five silver shekels, using the sanctuary weight standard.",
      "Methodist": "Sets the redemption payment for a human firstborn at five shekels of silver (sanctuary standard).",
      "Lutheran": "The redemption price for a human firstborn (from one month old) is five silver shekels (sanctuary standard)."
    },
    "17": {
      "General": "However, the firstborn of clean animals (cow, sheep, goat) are not to be redeemed; they are holy. Their blood must be sprinkled on the altar, and their fat burned as a pleasing offering to the Lord.",
      "Non-Denominational": "Specifies that firstborn clean animals are sacrificed, not redeemed; their blood and fat are offered to God.",
      "Baptist": "Forbids redemption for firstborn clean animals; they are holy and must be sacrificed (blood sprinkled, fat burned).",
      "Catholic": "Stipulates that firstborn clean animals (cow, sheep, goat) are not redeemed but sacrificed; their blood is dashed against the altar and fat burned.",
      "Methodist": "Requires firstborn clean animals to be sacrificed (blood sprinkled, fat burned) and not redeemed.",
      "Lutheran": "Firstborn of clean animals (cow, sheep, goat) are not redeemed but are holy; their blood is sprinkled on the altar and fat burned as an offering."
    },
    "18": {
      "General": "The meat ('flesh') of these sacrificed firstborn clean animals belongs to the priests, just like the wave breast and the right thigh ('shoulder') from other offerings.",
      "Non-Denominational": "Assigns the meat of the firstborn clean animal sacrifices to the priests, similar to other designated priestly portions.",
      "Baptist": "Gives the meat of these firstborn sacrifices to the priests, like the wave breast and heave thigh.",
      "Catholic": "Assigns the flesh of these firstborn animals to the priests, comparable to the breast of the wave offering and the right thigh.",
      "Methodist": "Grants the meat from these sacrifices to the priests, equated with the wave breast and right thigh portions.",
      "Lutheran": "The meat of these firstborn animals belongs to the priests, like the wave breast and right heave thigh."
    },
    "19": {
      "General": "God confirms that all the holy contributions (heave offerings) the Israelites set apart for the Lord are given perpetually to Aaron, his sons, and his daughters. This is an everlasting 'covenant of salt' before the Lord.",
      "Non-Denominational": "Reaffirms the perpetual grant of holy contributions to the priestly families, sealing it with the enduring 'covenant of salt'.",
      "Baptist": "Confirms the perpetual gift of all heave offerings to the priests and their families, establishing it as an unbreakable 'covenant of salt'.",
      "Catholic": "Reiterates the perpetual assignment of all sacred contributions to the priests and their families, designating it an everlasting 'covenant of salt' before the Lord.",
      "Methodist": "Confirms the permanent assignment of holy contributions to the priests and their families, calling it an enduring 'covenant of salt'.",
      "Lutheran": "All heave offerings of holy things are given perpetually to the priests and their households; it is an everlasting 'covenant of salt' before the Lord."
    },
    "20": {
      "General": "The Lord tells Aaron that the priests will have no land inheritance among the Israelites because the Lord Himself is their portion and inheritance.",
      "Non-Denominational": "God declares that priests will not own land; their inheritance is their relationship with and provision from God.",
      "Baptist": "God explicitly states priests receive no land inheritance; God Himself is their share and inheritance.",
      "Catholic": "The Lord decrees that priests will have no territorial inheritance in Israel, for the Lord Himself is their portion and heritage.",
      "Methodist": "God informs Aaron the priests won't inherit land; their inheritance and portion is the Lord Himself.",
      "Lutheran": "The Lord tells Aaron the priests get no land inheritance; the Lord is their portion and inheritance."
    },
    "21": {
      "General": "God gives all the tithes (tenth part) collected in Israel to the Levites as their inheritance in return for the service they perform at the Tabernacle.",
      "Non-Denominational": "Assigns the national tithe to the Levites as compensation for their Tabernacle service.",
      "Baptist": "God grants all tithes from Israel to the Levites as their inheritance, compensating their Tabernacle work.",
      "Catholic": "God assigns all the tithes of Israel to the Levites as their inheritance, in return for their service at the Tent of Meeting.",
      "Methodist": "God gives the Levites all the tithes in Israel as their inheritance for their service at the Tabernacle.",
      "Lutheran": "God gives all the tithes in Israel to the Levites as their inheritance for their Tabernacle service."
    },
    "22": {
      "General": "From now on, ordinary Israelites must not come near the Tabernacle itself, lest they bear sin and die (reinforcing the Levites' intermediary role).",
      "Non-Denominational": "Restricts access to the Tabernacle precinct to prevent sin and death among the general populace.",
      "Baptist": "Forbids ordinary Israelites from approaching the Tabernacle directly, lest they incur guilt and die.",
      "Catholic": "Warns the Israelites against approaching the Tent of Meeting directly, lest they incur sin and die.",
      "Methodist": "Prohibits ordinary Israelites from nearing the Tabernacle to avoid sin and death.",
      "Lutheran": "The Israelites shall not come near the Tabernacle, lest they bear sin and die."
    },
    "23": {
      "General": "Only the Levites shall perform the service of the Tabernacle, and they will bear the responsibility ('iniquity') associated with their role. This is a perpetual statute: Levites will have no land inheritance among the Israelites.",
      "Non-Denominational": "Confirms the Levites' exclusive role in Tabernacle service, their accountability, and their lack of land inheritance as a permanent rule.",
      "Baptist": "Assigns Tabernacle service exclusively to Levites, making them responsible for related offenses, and reiterates their lack of land inheritance perpetually.",
      "Catholic": "Mandates that only Levites perform the Tabernacle service and bear the associated responsibility ('iniquity'), confirming permanently that they receive no land inheritance.",
      "Methodist": "Assigns Tabernacle service solely to Levites, stating they bear the associated iniquity, and confirms permanently they have no land inheritance.",
      "Lutheran": "The Levites shall do the Tabernacle service and bear their iniquity; it is a perpetual statute that they have no land inheritance."
    },
    "24": {
      "General": "God explains that He has given the Levites the Israelites' tithes as their inheritance, which is why they receive no land among them.",
      "Non-Denominational": "Justifies the Levites' lack of land by stating their inheritance is the tithes given by the Israelites.",
      "Baptist": "Clarifies that the tithes given to the Levites constitute their inheritance instead of land.",
      "Catholic": "Explains the Levites' lack of land inheritance is because God has assigned them the Israelites' tithes.",
      "Methodist": "States the reason for no land inheritance for Levites: their inheritance is the tithes from Israel.",
      "Lutheran": "Because the Israelites' tithes are given to the Levites as inheritance, God decreed they get no land inheritance."
    },
    "25": {
      "General": "The Lord instructs Moses to speak to the Levites.",
      "Non-Denominational": "God directs Moses to relay further instructions specifically to the Levites.",
      "Baptist": "Records God commanding Moses to address the Levites.",
      "Catholic": "The Lord commands Moses to instruct the Levites.",
      "Methodist": "God directs Moses to speak to the Levites.",
      "Lutheran": "The Lord instructs Moses to speak to the Levites."
    },
    "26": {
      "General": "When the Levites receive the tithe from the Israelites, they must set apart a tenth of that tithe ('a tithe of the tithe') as a heave offering to the Lord.",
      "Non-Denominational": "Requires the Levites to tithe from the tithes they receive, offering a tenth part back to the Lord.",
      "Baptist": "Commands the Levites to offer a tithe (a tenth) of the tithes they receive from Israel as a heave offering to God.",
      "Catholic": "Instructs the Levites, upon receiving the tithe from Israel, to set aside a tenth of it as a contribution (heave offering) to the Lord.",
      "Methodist": "Directs the Levites to give a tithe of the tithes they receive as a heave offering to the Lord.",
      "Lutheran": "The Levites, upon receiving the tithe from Israel, must offer a tithe of that tithe as a heave offering to the Lord."
    },
    "27": {
      "General": "This offering from the Levites will be credited ('reckoned') to them as if it were grain from the threshing floor or juice ('fulness') from the winepress (like the Israelites' primary offerings).",
      "Non-Denominational": "God considers the Levites' tithe-of-tithes equivalent to the agricultural offerings of landed Israelites.",
      "Baptist": "States that the Levites' heave offering (tithe of the tithe) will be counted as their primary contribution, like grain or wine.",
      "Catholic": "This offering from the Levites will be accredited to them as though it were produce from the threshing floor or winepress.",
      "Methodist": "Specifies that this Levite offering will be regarded as their contribution, comparable to grain or wine.",
      "Lutheran": "This heave offering from the Levites is reckoned to them as equivalent to grain from the threshing floor and juice from the winepress."
    },
    "28": {
      "General": "Thus, the Levites must also present a heave offering to the Lord from all the tithes they receive from the Israelites, and they must give this specific heave offering (the Lord's portion) to Aaron the priest.",
      "Non-Denominational": "Mandates the Levites give the Lord's heave offering (the tenth of their tithes) to the priests (Aaron).",
      "Baptist": "Directs the Levites to give the Lord's heave offering (from the tithes they receive) to Aaron the priest.",
      "Catholic": "Thus the Levites are also to set aside the Lord's contribution from the tithes they receive, giving this contribution to Aaron the priest.",
      "Methodist": "Requires the Levites to present the Lord's heave offering from their tithes, giving it specifically to Aaron the priest.",
      "Lutheran": "The Levites must offer a heave offering to the Lord from all the tithes received, giving the Lord's portion to Aaron the priest."
    },
    "29": {
      "General": "From all the gifts (tithes) they receive, the Levites must present the Lord's full heave offering, selecting the best part ('the fat of it') as the holy portion.",
      "Non-Denominational": "Instructs Levites to offer the required heave offering from all tithes received, ensuring the best portion is dedicated.",
      "Baptist": "Commands Levites to present the complete heave offering due to the Lord from all gifts received, setting aside the best part as holy.",
      "Catholic": "From all the gifts they receive, the Levites must set aside the full contribution due to the Lord, dedicating the best part ('hallowed part') of it.",
      "Methodist": "Directs Levites to give the Lord's full heave offering from all their receipts, dedicating the best ('fat') part.",
      "Lutheran": "From all the gifts received, the Levites must offer the Lord's heave offering, the best ('fat') part being the hallowed portion."
    },
    "30": {
      "General": "God tells Moses to inform the Levites that once they have offered the best part ('the fat thereof'), the remainder will be credited to them like the produce of the threshing floor and winepress (usable for their own needs).",
      "Non-Denominational": "After offering the best part, the rest of the tithe belongs to the Levites for their use, considered their earned income.",
      "Baptist": "Once the Levites offer the best part, the rest is reckoned as theirs, like agricultural produce for their own sustenance.",
      "Catholic": "After the Levites have set aside the best part, the remainder is reckoned as their own, like produce from the threshing floor or winepress.",
      "Methodist": "After offering the best part, the remainder of the tithe is credited to the Levites for their own use, like farm produce.",
      "Lutheran": "After the Levites lift up the best part ('the fat'), the remainder is counted as theirs, like the increase of the threshing floor and winepress."
    },
    "31": {
      "General": "The Levites and their households may eat the remainder anywhere, as it is their payment ('reward') for their service in the Tabernacle.",
      "Non-Denominational": "Permits Levites and their families to consume the remaining nine-tenths of the tithe freely as payment for their service.",
      "Baptist": "Allows Levites and their families to eat the remainder anywhere, designating it as their wages for Tabernacle service.",
      "Catholic": "The Levites and their households may eat the remainder in any place, as it is their compensation for service at the Tent of Meeting.",
      "Methodist": "Permits Levites and their households to eat the remaining tithe anywhere; it's their reward for Tabernacle service.",
      "Lutheran": "The Levites and their households may eat the remainder anywhere, for it is their reward for service in the Tabernacle."
    },
    "32": {
      "General": "By offering the best part ('the fat of it') first, the Levites will avoid sinning concerning the holy things of the Israelites and will not profane them, thus ensuring they do not die.",
      "Non-Denominational": "Emphasizes that correctly tithing their tithe (offering the best part) prevents the Levites from sinning and profaning holy things, ensuring their safety.",
      "Baptist": "Warns that offering the best part first ensures the Levites avoid sin and profaning holy gifts, preventing death.",
      "Catholic": "By setting aside the best part first, the Levites will not incur sin nor profane the holy offerings of the Israelites, and thus avoid death.",
      "Methodist": "States that offering the best part prevents the Levites from incurring sin and profaning holy things, thus avoiding death.",
      "Lutheran": "By lifting up the best part ('the fat') first, the Levites will bear no sin and not profane Israel's holy things, thus avoiding death."
    }
  }
}
