{
  "Summary": {
    "General": "This chapter details the unique ordinance for purification from defilement caused by contact with death. The Lord commands Moses and Aaron to instruct the Israelites to bring a perfect, unblemished red heifer that has never been yoked. Eleazar the priest takes it outside the camp, where it is slaughtered. Eleazar sprinkles its blood seven times towards the Tabernacle. The entire heifer (skin, flesh, blood, dung) is then burned. Cedar wood, hyssop, and scarlet yarn are thrown into the fire. The priest (Eleazar) and the man who burns the heifer must wash themselves and remain unclean until evening. A clean man gathers the ashes and stores them outside the camp in a clean place. These ashes are mixed with running water to create the 'water of separation' (or water for purification from sin/impurity). Anyone who touches a dead body, human bone, grave, or is in a tent with a dead person becomes unclean for seven days. They must be sprinkled with this water on the third and seventh days to become clean. Failure to purify results in being cut off from the congregation for defiling the sanctuary. The person sprinkling the water also becomes unclean until evening, as does anyone touching the water itself.",
    "Non-Denominational": "Focuses on God's provision of a specific means for dealing with the profound ritual impurity associated with death. The red heifer ritual, performed outside the camp, symbolizes the removal of impurity. The ashes mixed with water provide a continuous source for purification, necessary for maintaining fellowship within the community and access to worship. It underscores the seriousness of death-related defilement and the necessity of God's prescribed remedy.",
    "Baptist": "Emphasizes the statute concerning purification from death, highlighting human mortality and the contaminating effect of sin (symbolized by death). The red heifer sacrifice, performed outside the camp (potentially foreshadowing Christ's sacrifice outside Jerusalem), provides the means (ashes mixed with water) for cleansing. This ritual underscores the need for divine cleansing from defilement to maintain fellowship with God and His people. Strict adherence to the purification process is required.",
    "Catholic": "Interprets the red heifer ritual as a specific sacramental provision under the Old Law for purification from the severe uncleanness contracted through contact with death, which represents the ultimate consequence of sin. The elements (red heifer, cedar, hyssop, scarlet, ashes, water) hold symbolic significance related to purification and sacrifice. The necessity of this purification points to the need for grace (later fulfilled in Christ) to overcome the spiritual effects of sin and death and restore communion with God.",
    "Methodist": "Views the ordinance of the red heifer as God's specific instruction for addressing the ritual defilement caused by death, emphasizing God's concern for holiness within the community. The ritual provides a means of grace for cleansing and restoration. The process highlights the pervasive nature of defilement from death and the importance of following God's prescribed methods for purification to maintain spiritual well-being and participation in the community's worship life.",
    "Lutheran": "Sees the red heifer law primarily as part of the Old Testament ceremonial Law, demonstrating the gravity of sin (whose wage is death) and the impossibility of approaching God while defiled. The elaborate ritual and the resulting 'water of separation' point to the need for an external cleansing agent provided by God. This foreshadows the ultimate purification from sin and death through the sacrifice of Christ, whose blood cleanses believers completely, fulfilling the purpose prefigured in this ordinance."
  },
  "Verses": {
    "1": {
      "General": "The Lord speaks to both Moses and Aaron, giving them instructions.",
      "Non-Denominational": "God addresses Moses and Aaron together to establish this important purification ordinance.",
      "Baptist": "Records God speaking directly to Moses and Aaron to institute the law of the red heifer.",
      "Catholic": "Indicates divine communication to both Moses and Aaron regarding a specific statute.",
      "Methodist": "God speaks to Moses and Aaron, providing the details for the purification ritual.",
      "Lutheran": "The Lord speaks to Moses and Aaron, initiating the ordinance of the red heifer."
    },
    "2": {
      "General": "This is the specific legal requirement ('ordinance of the law') the Lord commands: Israel must bring a flawless red heifer, without blemish, which has never been subjected to a yoke (used for work).",
      "Non-Denominational": "Specifies the requirement for a perfect, unused red heifer for this unique purification ritual.",
      "Baptist": "Details the required animal: a perfect red heifer, unblemished and never yoked, symbolizing purity and uniqueness.",
      "Catholic": "This is the statute: requires a red heifer, perfect, unblemished, and never yoked, signifying its special sacrificial nature.",
      "Methodist": "Outlines the specific characteristics of the required heifer: red, flawless, and never worked.",
      "Lutheran": "This is the ordinance: Israel must provide a red heifer, perfect, unblemished, and never yoked."
    },
    "3": {
      "General": "The heifer is to be given to Eleazar the priest (Aaron's son and successor), who will take it outside the camp, and it will be slaughtered in his presence.",
      "Non-Denominational": "Assigns the priestly oversight (Eleazar) and specifies the location (outside the camp) and manner (slaughtered before him) of the sacrifice.",
      "Baptist": "Commands the heifer be given to Eleazar the priest, taken outside the camp, and killed under his supervision.",
      "Catholic": "The heifer is entrusted to Eleazar the priest, taken outside the camp, and slaughtered in his presence, indicating a specific type of sacrifice.",
      "Methodist": "Directs that Eleazar the priest oversees the heifer being taken outside the camp and slaughtered.",
      "Lutheran": "The heifer is given to Eleazar the priest, brought outside the camp, and slaughtered before him."
    },
    "4": {
      "General": "Eleazar the priest must take some of its blood on his finger and sprinkle it directly towards the front of the Tabernacle seven times.",
      "Non-Denominational": "Details the ritual use of the blood: sprinkled seven times towards the Tabernacle by the priest, signifying atonement/purification directed towards God's dwelling.",
      "Baptist": "Eleazar sprinkles the blood seven times towards the Tabernacle, applying the sacrificial blood symbolically for purification.",
      "Catholic": "Eleazar performs a ritual sprinkling of the blood seven times facing the Tent of Meeting, linking the sacrifice to the sanctuary.",
      "Methodist": "Specifies the priestly action: sprinkling the blood seven times towards the Tabernacle.",
      "Lutheran": "Eleazar takes some blood and sprinkles it towards the Tabernacle seven times."
    },
    "5": {
      "General": "The entire heifer must then be burned in his sight – its skin, flesh, blood, and dung.",
      "Non-Denominational": "Commands the complete incineration of the heifer, including parts normally separated, emphasizing total consumption.",
      "Baptist": "Requires the complete burning of the heifer (skin, flesh, blood, dung) under the priest's observation.",
      "Catholic": "The entire heifer is to be consumed by fire in the priest's sight: skin, flesh, blood, and dung.",
      "Methodist": "Directs the complete burning of the heifer in the priest's presence.",
      "Lutheran": "The heifer is entirely burned in his sight: skin, flesh, blood, and dung."
    },
    "6": {
      "General": "The priest must take cedar wood, hyssop, and scarlet yarn and throw them into the midst of the burning heifer.",
      "Non-Denominational": "Specifies adding cedar wood, hyssop, and scarlet material to the fire, elements often associated with purification rituals.",
      "Baptist": "Requires the priest to add cedar wood, hyssop, and scarlet to the burning heifer, symbolic elements in purification rites.",
      "Catholic": "The priest adds cedar wood, hyssop, and scarlet material to the fire, symbolic items used in cleansing ceremonies.",
      "Methodist": "Instructs the priest to add cedar wood, hyssop, and scarlet yarn to the burning heifer.",
      "Lutheran": "The priest takes cedar wood, hyssop, and scarlet, casting them into the fire burning the heifer."
    },
    "7": {
      "General": "Then the priest must wash his clothes and bathe his body in water, after which he may enter the camp, but he remains ceremonially unclean until evening.",
      "Non-Denominational": "Details the purification required for the priest involved, highlighting that even handling sacred purification elements incurs temporary uncleanness.",
      "Baptist": "Requires the officiating priest to wash himself and his clothes, remaining unclean until evening despite performing the rite.",
      "Catholic": "The priest must purify himself (wash clothes, bathe) after the ritual but remains unclean until evening.",
      "Methodist": "Specifies the priest's need for personal cleansing after the ceremony, remaining unclean until evening.",
      "Lutheran": "The priest must wash his clothes and bathe, then may enter the camp, but remains unclean until evening."
    },
    "8": {
      "General": "The man who burns the heifer must also wash his clothes and bathe his body in water, and he too remains unclean until evening.",
      "Non-Denominational": "Extends the requirement for purification and temporary uncleanness to the layperson assisting with the burning.",
      "Baptist": "Requires the same washing procedure and period of uncleanness for the one who burns the heifer.",
      "Catholic": "The one who burns the heifer must also wash his clothes and bathe, and remains unclean until evening.",
      "Methodist": "Mandates the same cleansing process and uncleanness period for the person who burns the heifer.",
      "Lutheran": "The one who burns the heifer must also wash his clothes and bathe, remaining unclean until evening."
    },
    "9": {
      "General": "A man who is ceremonially clean shall gather up the ashes of the heifer and deposit them outside the camp in a clean place. These ashes are to be kept by the Israelite community for preparing the water of separation (or purification); it is a purification for sin.",
      "Non-Denominational": "Assigns a clean person to collect and store the ashes, designating them for the community's use in the 'water of separation' for purification from sin/defilement.",
      "Baptist": "A clean man gathers and stores the ashes outside the camp; they are for the congregation's use in the water of purification for sin.",
      "Catholic": "A clean man gathers the heifer's ashes and stores them outside the camp in a clean place for the community, to be used in the water for ritual impurity; it is a purification offering.",
      "Methodist": "A clean man collects the ashes and stores them outside the camp for the community's 'water of separation,' a purification rite.",
      "Lutheran": "A clean man gathers the heifer's ashes, storing them outside the camp in a clean place for Israel, for the water of separation; it is a purification for sin."
    },
    "10": {
      "General": "The man who gathers the ashes must also wash his clothes and remain unclean until evening. This shall be a permanent statute for the Israelites and for any foreigner residing among them.",
      "Non-Denominational": "Even the clean man handling the ashes becomes temporarily unclean, requiring washing. This whole process is a lasting ordinance for all in the community.",
      "Baptist": "The one gathering the ashes also becomes unclean until evening and must wash; this law is permanent for Israelites and resident aliens.",
      "Catholic": "The one gathering the ashes must wash his clothes and is unclean until evening. This is a perpetual statute for Israelites and resident aliens.",
      "Methodist": "Requires washing and uncleanness until evening for the ash gatherer; this is a perpetual law for Israelites and foreigners.",
      "Lutheran": "The ash gatherer must wash his clothes and be unclean until evening. This is a perpetual statute for Israel and resident aliens."
    },
    "11": {
      "General": "Anyone who touches a dead human body will be unclean for seven days.",
      "Non-Denominational": "States the basic principle: contact with a human corpse results in a seven-day period of ritual uncleanness.",
      "Baptist": "Defines the consequence of touching a dead body: seven days of uncleanness.",
      "Catholic": "Establishes that touching a human corpse causes seven days of ritual impurity.",
      "Methodist": "Declares a seven-day uncleanness period for anyone touching a dead human body.",
      "Lutheran": "Whoever touches any dead person's body shall be unclean for seven days."
    },
    "12": {
      "General": "That person must purify himself with the water (of separation) on the third day and on the seventh day; then he will be clean. But if he does not purify himself on the third and seventh days, he will not become clean.",
      "Non-Denominational": "Specifies the purification procedure: application of the water on days three and seven is necessary for cleansing.",
      "Baptist": "Mandates purification with the water on the third and seventh days for cleansing; failure to do so prevents purification.",
      "Catholic": "Requires purification with the water on the third and seventh day to become clean; omitting this process means remaining unclean.",
      "Methodist": "Dictates purification with the water on the third and seventh days for cleansing; skipping this invalidates the process.",
      "Lutheran": "He must purify himself with the water on the third and seventh days to be clean; otherwise, he remains unclean."
    },
    "13": {
      "General": "Anyone who touches a dead body and fails to purify himself defiles the Lord's Tabernacle. That person must be cut off from Israel because the water of separation was not sprinkled on him; he remains unclean, his uncleanness is still upon him.",
      "Non-Denominational": "Warns that neglecting purification after contact with death defiles God's sanctuary and results in excommunication, as the uncleanness persists.",
      "Baptist": "States the severe consequence of neglecting purification: defiling the Tabernacle and being cut off from Israel because the cleansing water wasn't applied.",
      "Catholic": "Warns that anyone touching a corpse who fails to purify himself defiles the Lord's Dwelling and shall be cut off from Israel for not receiving the water for impurity.",
      "Methodist": "Declares that failing to purify after touching a dead body defiles the Tabernacle, leading to exclusion from the community.",
      "Lutheran": "Touching a corpse and failing to purify defiles the Tabernacle; that person shall be cut off from Israel because the water wasn't sprinkled; his uncleanness remains."
    },
    "14": {
      "General": "This is the law for when a person dies in a tent: Everyone who enters the tent and everything that is in the tent becomes unclean for seven days.",
      "Non-Denominational": "Extends the seven-day uncleanness to anyone entering a dwelling where a death occurred and to all contents within.",
      "Baptist": "Specifies the law for death in a tent: all who enter and all contents become unclean for seven days.",
      "Catholic": "This is the law concerning death in a tent: anyone entering and anything inside becomes unclean for seven days.",
      "Methodist": "States the rule for death in a tent: entry or presence renders persons and objects unclean for seven days.",
      "Lutheran": "This is the law when someone dies in a tent: everyone entering and everything in the tent is unclean for seven days."
    },
    "15": {
      "General": "Every open vessel in the tent that has no covering fastened on it is also unclean.",
      "Non-Denominational": "Includes open, unsealed containers within the sphere of contamination in a tent where death occurred.",
      "Baptist": "Declares open, uncovered vessels in the tent also become unclean.",
      "Catholic": "Any open vessel in the tent without a secured lid is also rendered unclean.",
      "Methodist": "Specifies that open, unsealed vessels within the tent also become unclean.",
      "Lutheran": "Every open vessel in the tent without a fastened cover is unclean."
    },
    "16": {
      "General": "Anyone in the open field who touches someone slain by a sword, someone who died naturally, a human bone, or a grave becomes unclean for seven days.",
      "Non-Denominational": "Broadens the scope of death defilement to include touching corpses, bones, or graves found outdoors, resulting in seven days of uncleanness.",
      "Baptist": "Extends the seven-day uncleanness rule to touching a slain person, a corpse, a bone, or a grave in an open field.",
      "Catholic": "Declares unclean for seven days anyone in the open who touches someone killed, someone who died naturally, a human bone, or a grave.",
      "Methodist": "States that touching a slain person, a corpse, a bone, or a grave in the open also causes seven days of uncleanness.",
      "Lutheran": "Anyone in the open field touching one slain, one who died naturally, a human bone, or a grave is unclean for seven days."
    },
    "17": {
      "General": "For the unclean person, they shall take some of the ashes of the burnt sin offering (the heifer) and mix it with running (living) water in a vessel.",
      "Non-Denominational": "Prescribes the preparation of the purification water: mixing the ashes of the burnt heifer with fresh running water.",
      "Baptist": "Details the preparation of the cleansing agent: ashes from the burnt purification offering mixed with running water.",
      "Catholic": "For the unclean person, some ashes from the purification offering are mixed with fresh running water in a vessel.",
      "Methodist": "Instructs taking ashes from the burnt offering and adding running water for the purification mixture.",
      "Lutheran": "For the unclean person, they take ashes from the burnt purification offering and mix it with running water."
    },
    "18": {
      "General": "A clean person must take hyssop, dip it in the water, and sprinkle it on the tent, all the vessels, and the people who were there, or on the one who touched the bone, the slain, the dead, or the grave.",
      "Non-Denominational": "Describes the application: a clean person uses hyssop to sprinkle the water onto the defiled tent, objects, and people.",
      "Baptist": "Mandates a clean person use hyssop dipped in the water to sprinkle the defiled tent, vessels, people, or those who touched death sources.",
      "Catholic": "A clean person uses hyssop dipped in the water to sprinkle the tent, furnishings, persons present, or whoever touched a bone, corpse, or grave.",
      "Methodist": "Requires a clean person to use hyssop to apply the water to the contaminated tent, items, and individuals.",
      "Lutheran": "A clean person takes hyssop, dips it in the water, and sprinkles the tent, vessels, people present, or the one who touched a bone, slain, dead, or grave."
    },
    "19": {
      "General": "The clean person shall sprinkle the unclean person on the third day and on the seventh day. On the seventh day, the person being purified must wash their clothes and bathe in water, and they will become clean at evening.",
      "Non-Denominational": "Reiterates the sprinkling schedule (days three and seven) and adds the requirement for the person being purified to wash themselves and their clothes on day seven for complete cleansing by evening.",
      "Baptist": "Specifies the clean person sprinkles the unclean on the third and seventh days; the unclean person must then wash themselves and their clothes on day seven to be clean by evening.",
      "Catholic": "The clean person sprinkles the unclean on the third and seventh days; on the seventh day, the one being purified washes their clothes and bathes, becoming clean at evening.",
      "Methodist": "Outlines the process: sprinkling on days three and seven, followed by washing by the unclean person on day seven, resulting in cleanness by evening.",
      "Lutheran": "The clean person sprinkles the unclean on the third and seventh days; on the seventh day, the purified person washes clothes and bathes, becoming clean at evening."
    },
    "20": {
      "General": "But the man who is unclean and does not purify himself shall be cut off from the congregation, because he has defiled the sanctuary of the Lord. The water of separation has not been sprinkled on him; he is unclean.",
      "Non-Denominational": "Repeats the warning: failure to undergo purification results in excommunication for defiling the sanctuary, as the uncleanness persists without the water's application.",
      "Baptist": "Reiterates the consequence for neglecting purification: being cut off for defiling God's sanctuary, as the required sprinkling was not performed.",
      "Catholic": "Warns again: the unclean person who fails to purify himself defiles the Lord's sanctuary and shall be cut off from the community because the water for impurity was not applied.",
      "Methodist": "Restates the penalty for failing to purify: exclusion from the assembly for defiling the sanctuary, remaining unclean without the sprinkling.",
      "Lutheran": "The man who is unclean and does not purify himself shall be cut off from the assembly; he has defiled the Lord's sanctuary; the water of separation wasn't sprinkled; he is unclean."
    },
    "21": {
      "General": "This shall be a permanent statute for them: the person who sprinkles the water of separation must wash his clothes, and anyone who touches the water of separation shall be unclean until evening.",
      "Non-Denominational": "Makes the ordinance permanent and adds that the clean person performing the sprinkling, and anyone merely touching the water, also become temporarily unclean until evening.",
      "Baptist": "Establishes this as a perpetual law, adding that the sprinkler must wash, and anyone touching the water becomes unclean until evening.",
      "Catholic": "This is a perpetual statute: the one sprinkling the water must wash his clothes, and whoever touches the water is unclean until evening.",
      "Methodist": "Declares this a permanent statute, requiring the sprinkler to wash, and making anyone touching the water unclean until evening.",
      "Lutheran": "This is a perpetual statute: the sprinkler of the water must wash his clothes, and whoever touches the water is unclean until evening."
    },
    "22": {
      "General": "Furthermore, whatever the unclean person touches becomes unclean, and any person who touches that contaminated object or person becomes unclean until evening.",
      "Non-Denominational": "Explains the contagious nature of this severe uncleanness: objects touched by the defiled person become unclean, and touching those objects transfers temporary uncleanness (until evening) to others.",
      "Baptist": "States that anything touched by the unclean person becomes unclean, and anyone touching that secondary source becomes unclean until evening.",
      "Catholic": "Anything the unclean person touches becomes unclean, and anyone touching that secondary contamination becomes unclean until evening.",
      "Methodist": "Specifies that contact with the unclean person contaminates objects, and touching those objects makes another person unclean until evening.",
      "Lutheran": "Whatever the unclean person touches becomes unclean, and whoever touches it becomes unclean until evening."
    }
  }
}
