{
  "Summary": {
    "General": "The Israelites arrive at Kadesh in the wilderness of Zin, where Miriam dies and is buried. Facing a lack of water, the people again complain bitterly against Moses and Aaron, recalling Egypt favorably. God instructs Moses to take his rod, assemble the people, and speak to the rock before them, promising it will yield water. However, Moses, addressing the people as 'rebels,' strikes the rock twice with his rod instead of speaking to it. Water gushes out abundantly, but God rebukes Moses and Aaron for their lack of faith and failure to sanctify Him before the people, decreeing they will not lead Israel into the Promised Land. Later, Moses sends messengers requesting passage through Edom, promising peaceful transit, but the King of Edom refuses, backing up his refusal with a show of force. Finally, following God's command, Moses, Aaron, and Eleazar ascend Mount Hor. There, Moses strips Aaron of his priestly garments and puts them on Eleazar. Aaron dies on the mountain, and the Israelites mourn him for thirty days.",
    "Non-Denominational": "Focuses on the significant events marking the end of the wilderness generation's journey. Miriam's death, the people's renewed complaints, and Moses' act of disobedience at the rock (striking instead of speaking) highlight ongoing struggles with faith and obedience. Moses' failure, despite providing water, results in divine judgment barring him and Aaron from Canaan. Edom's refusal illustrates external opposition. Aaron's death and the transfer of priesthood to Eleazar signify leadership transition and God's continuing plan despite individual failures.",
    "Baptist": "Emphasizes key moments of human failure and divine judgment alongside God's faithfulness. Miriam's death marks a loss. The people's murmuring reveals persistent unbelief. Moses' disobedience at Meribah (striking the rock in anger/unbelief instead of speaking in faith) is a serious failure to honor God, leading to his exclusion from Canaan, demonstrating God's holiness and judgment even on His chosen leaders. Edom's hostility reflects worldly opposition. Aaron's death and Eleazar's succession show the continuity of God's ordained priesthood.",
    "Catholic": "Highlights Miriam's death, the people's lack of faith leading to complaint, and the sin of Moses and Aaron at the waters of Meribah (strife). Moses' act of striking the rock, contrary to God's command to speak, is seen as a failure in trust and obedience, possibly involving anger and presumption, which dishonored God publicly. This sin prevents them from entering the Promised Land. The refusal of passage by Edom and Aaron's death on Mount Hor, with the solemn transfer of priestly vestments to Eleazar, underscore themes of consequence, transition, and the continuation of the sacred priesthood.",
    "Methodist": "Focuses on the themes of leadership, obedience, consequence, and transition. Miriam's death is noted. The people's complaining tests leadership. Moses' reaction at the rock, striking it twice possibly out of frustration or lack of faith in God's word alone, fails to sanctify God before Israel and results in the severe consequence of being barred from the Promised Land. This shows the high standard required of leaders. Edom's refusal presents a challenge. Aaron's peaceful death and the orderly succession of the priesthood to Eleazar demonstrate God's ongoing guidance and provision for His people.",
    "Lutheran": "Sees Miriam's death as part of the old generation passing away. The people's murmuring exemplifies sinful humanity's distrust of God's provision. Moses' sin at Meribah is crucial: failing to trust God's command (Word) and relying on his own action (striking), thereby not upholding God's holiness (Law). The resulting judgment (exclusion from Canaan) demonstrates God's righteousness and the consequences of disobedience, even for leaders. Edom's refusal shows earthly opposition. Aaron's death and Eleazar's investiture illustrate the transfer of the office of the priesthood according to God's ordinance."
  },
  "Verses": {
    "1": {
      "General": "The entire Israelite community arrives in the Desert of Zin in the first month and stays at Kadesh. There, Miriam dies and is buried.",
      "Non-Denominational": "Marks the arrival at Kadesh and records the significant event of Miriam's death and burial.",
      "Baptist": "Records the arrival at Kadesh in Zin during the first month and the death and burial of Miriam, Moses' sister.",
      "Catholic": "Notes the arrival of the whole community at Kadesh in the wilderness of Zin in the first month, and the death and burial of Miriam there.",
      "Methodist": "Describes the congregation reaching Kadesh in Zin and the passing and burial of Miriam.",
      "Lutheran": "The Israelites come to the wilderness of Zin in the first month, stay at Kadesh, and Miriam dies and is buried there."
    },
    "2": {
      "General": "With no water available for the community, the people gather together in opposition against Moses and Aaron.",
      "Non-Denominational": "Highlights the recurring problem of lack of water leading to the people assembling against their leaders.",
      "Baptist": "Describes the lack of water leading the people to gather in opposition against Moses and Aaron, showing their discontent.",
      "Catholic": "The absence of water causes the assembly to gather against Moses and Aaron, indicating renewed strife.",
      "Methodist": "Records the lack of water causing the community to gather against Moses and Aaron in protest.",
      "Lutheran": "There being no water, the people gather against Moses and Aaron."
    },
    "3": {
      "General": "The people argue ('chode') with Moses, expressing regret they hadn't died along with their brethren (likely referring to Korah's rebellion or other plagues) before the Lord.",
      "Non-Denominational": "The people quarrel with Moses, wishing they had perished earlier rather than face thirst.",
      "Baptist": "Records the people arguing sharply with Moses, wishing for death like those previously judged by God.",
      "Catholic": "The people contend with Moses, lamenting that they did not die when their kinsmen perished before the Lord.",
      "Methodist": "Details the people arguing with Moses, expressing a death wish, preferring to have died in previous judgments.",
      "Lutheran": "The people argue ('chode') with Moses, wishing they had died when their brethren died before the Lord."
    },
    "4": {
      "General": "They accuse Moses and Aaron of bringing the Lord's congregation into the wilderness only to die there, both them and their livestock.",
      "Non-Denominational": "They blame Moses and Aaron for leading them into the desert to perish from lack of resources.",
      "Baptist": "They accuse Moses of leading them into the wilderness specifically to cause their death and that of their animals.",
      "Catholic": "They accuse Moses of bringing the Lord's assembly into the wilderness to die, along with their cattle.",
      "Methodist": "They charge Moses with bringing them into the wilderness solely for them and their livestock to die.",
      "Lutheran": "They ask why Moses brought the Lord's congregation into the wilderness for them and their cattle to die."
    },
    "5": {
      "General": "They further complain about being brought out of Egypt into this terrible place, which lacks grain, figs, vines, pomegranates, and water.",
      "Non-Denominational": "They contrast the harsh wilderness conditions with the (remembered) abundance of Egypt, lamenting the lack of basic sustenance.",
      "Baptist": "They complain about leaving Egypt for a desolate place lacking the agricultural abundance they desired, including water.",
      "Catholic": "They lament being brought from Egypt to this wretched place lacking fertile ground, fruit trees, and water.",
      "Methodist": "They criticize leaving Egypt for this 'evil place' lacking food staples, fruit, and essential water.",
      "Lutheran": "They complain about being brought out of Egypt to this 'evil place' with no seed, figs, vines, pomegranates, or water."
    },
    "6": {
      "General": "Moses and Aaron leave the assembly and go to the entrance of the Tabernacle, where they fall facedown. The glory of the Lord appears to them.",
      "Non-Denominational": "Moses and Aaron seek God's presence at the Tabernacle in response to the crisis, and God's glory manifests.",
      "Baptist": "Moses and Aaron retreat from the rebellious assembly to the Tabernacle entrance, humbling themselves (falling facedown), and God's glory appears.",
      "Catholic": "Moses and Aaron withdraw to the entrance of the Tent of Meeting, fall prostrate, and the glory of the Lord appears to them.",
      "Methodist": "In response, Moses and Aaron go to the Tabernacle entrance, fall on their faces, and experience the appearance of God's glory.",
      "Lutheran": "Moses and Aaron go from the assembly to the Tabernacle entrance, fall on their faces, and the glory of the Lord appears."
    },
    "7": {
      "General": "The Lord speaks to Moses.",
      "Non-Denominational": "God gives specific instructions to Moses to resolve the water crisis.",
      "Baptist": "Records God speaking directly to Moses with instructions.",
      "Catholic": "The Lord communicates His instructions to Moses.",
      "Methodist": "God speaks to Moses, providing the solution.",
      "Lutheran": "The Lord speaks to Moses, giving him commands."
    },
    "8": {
      "General": "God tells Moses to take the rod (likely Aaron's rod that budded, or Moses' staff), gather the assembly (including Aaron), and speak to the rock before their eyes, promising it will produce water for the community and their livestock.",
      "Non-Denominational": "God commands Moses to use the rod as a symbol, gather the people, and *speak* to the rock to miraculously provide water.",
      "Baptist": "God instructs Moses to take the rod, gather the people with Aaron, and *speak* to the rock, promising a miraculous provision of water.",
      "Catholic": "God instructs Moses to take the staff, assemble the community with Aaron, and *command* the rock in their sight to yield water for the people and their animals.",
      "Methodist": "God directs Moses to take the rod, assemble the people, and simply *speak* to the rock to bring forth water.",
      "Lutheran": "God tells Moses to take the rod, gather the assembly with Aaron, and *speak* to the rock before them, promising it will give water for them and their beasts."
    },
    "9": {
      "General": "Moses takes the rod from before the Lord (from the Tabernacle), as commanded.",
      "Non-Denominational": "Moses obeys the first part of the command, retrieving the designated rod.",
      "Baptist": "Moses retrieves the rod from God's presence (Tabernacle) according to the command.",
      "Catholic": "Moses takes the staff from before the Lord, as instructed.",
      "Methodist": "Moses complies by taking the rod from the Lord's presence.",
      "Lutheran": "Moses takes the rod from before the Lord, as commanded."
    },
    "10": {
      "General": "Moses and Aaron gather the congregation together in front of the rock. Moses addresses them, saying, 'Listen now, you rebels; must we fetch you water out of this rock?'",
      "Non-Denominational": "Moses gathers the people but addresses them harshly ('rebels') and questions their need in a way that takes credit ('must we').",
      "Baptist": "Moses and Aaron assemble the people, but Moses speaks angrily, calling them 'rebels' and implying he and Aaron are the source of the water ('must we').",
      "Catholic": "Moses and Aaron convene the assembly before the rock, and Moses addresses them contentiously: 'Listen, you rebels! Are we to bring water for you out of this rock?'",
      "Methodist": "Moses and Aaron gather the people, but Moses speaks rashly, calling them 'rebels' and questioning if 'we' must provide the water.",
      "Lutheran": "Moses and Aaron gather the congregation before the rock, and Moses calls them 'rebels,' asking if 'we' must bring water from the rock."
    },
    "11": {
      "General": "Moses lifts his hand and strikes the rock twice with his rod. Water flows out abundantly, and the community and their livestock drink.",
      "Non-Denominational": "Moses disobeys by striking the rock twice instead of speaking; nevertheless, God provides abundant water.",
      "Baptist": "Moses strikes the rock twice with his rod in disobedience to God's command to speak; God still provides water plentifully.",
      "Catholic": "Moses strikes the rock twice with his staff, contrary to the command. Abundant water comes forth, and the community and their animals drink.",
      "Methodist": "Moses disobeys, striking the rock twice with the rod; God graciously provides abundant water despite the disobedience.",
      "Lutheran": "Moses lifts his hand and strikes the rock twice with his rod; abundant water comes out, and the people and animals drink."
    },
    "12": {
      "General": "But the Lord says to Moses and Aaron, 'Because you did not believe me enough to honor me (sanctify me) as holy in the sight of the Israelites, you will not bring this community into the land I give them.'",
      "Non-Denominational": "God pronounces judgment: Moses and Aaron's lack of faith and failure to represent God's holiness correctly disqualify them from leading Israel into Canaan.",
      "Baptist": "God rebukes Moses and Aaron for their unbelief ('ye believed me not') and failure to sanctify Him before Israel, resulting in their exclusion from the Promised Land.",
      "Catholic": "The Lord judges Moses and Aaron for their lack of faith ('did not believe in me') and failure to manifest His holiness ('sanctify me') to Israel, barring them from entering the Promised Land.",
      "Methodist": "God holds Moses and Aaron accountable for their disbelief and failure to honor Him publicly, declaring they will not lead the people into the land.",
      "Lutheran": "The Lord tells Moses and Aaron that because they did not believe Him enough to sanctify Him before Israel, they will not bring the congregation into the promised land."
    },
    "13": {
      "General": "These are the waters of Meribah (meaning 'strife' or 'contention'), where the Israelites contended with the Lord, and where He was sanctified among them (demonstrated His holiness, possibly through judgment and provision).",
      "Non-Denominational": "Names the location Meribah ('strife') due to the people's contention, noting God's holiness was demonstrated there.",
      "Baptist": "Identifies the place as Meribah ('strife') because Israel strove with God, and God demonstrated His holiness there (both in providing water and judging Moses/Aaron).",
      "Catholic": "Names the place Meribah ('contention'), because the Israelites contended with the Lord, and He vindicated His holiness among them.",
      "Methodist": "Calls the place Meribah ('strife') because of the Israelites' quarrel with God, where God's holiness was ultimately shown.",
      "Lutheran": "These are the waters of Meribah ('strife') where Israel strove with the Lord, and He was sanctified (showed Himself holy) among them."
    },
    "14": {
      "General": "From Kadesh, Moses sends messengers to the king of Edom, addressing him as a brother (descendants of Esau, Jacob's brother) and recounting Israel's hardships in Egypt and their deliverance.",
      "Non-Denominational": "Moses initiates diplomacy with Edom, appealing to their kinship and summarizing Israel's history to request passage.",
      "Baptist": "Moses sends envoys from Kadesh to Edom, appealing based on kinship ('brother Israel') and recounting their history of suffering and deliverance.",
      "Catholic": "Moses dispatches messengers from Kadesh to the king of Edom, invoking their fraternal relationship and briefly outlining Israel's history since Egypt.",
      "Methodist": "Moses sends messengers to Edom from Kadesh, appealing to their shared ancestry and explaining Israel's journey and divine deliverance.",
      "Lutheran": "Moses sends messengers from Kadesh to the king of Edom, reminding him of their kinship and Israel's troubles and deliverance."
    },
    "15": {
      "General": "He explains how their ancestors went to Egypt, stayed long, were mistreated, and cried out to the Lord Who heard them and sent an angel to bring them out.",
      "Non-Denominational": "Summarizes the Egyptian sojourn, oppression, cry for help, and God's angelic intervention leading to the Exodus.",
      "Baptist": "Recounts the history: Israel's time in Egypt, oppression, prayer, and God's deliverance via an angel.",
      "Catholic": "Details their ancestors' descent into Egypt, long stay, oppression, cry to the Lord, and deliverance led by an angel.",
      "Methodist": "Explains their history: descent into Egypt, suffering, prayer, and God's deliverance through an angel.",
      "Lutheran": "Recounts how their fathers went to Egypt, were afflicted, cried to the Lord Who heard and sent an angel to bring them out."
    },
    "16": {
      "General": "Moses states that they are now at Kadesh, a town on the edge of Edomite territory.",
      "Non-Denominational": "Identifies their current location at the border of Edom.",
      "Baptist": "Specifies their current location: Kadesh, on the border of Edom.",
      "Catholic": "States their present location at Kadesh, a town on Edom's frontier.",
      "Methodist": "Points out their location at Kadesh, on the edge of Edom's territory.",
      "Lutheran": "States they are now in Kadesh, a city at Edom's border."
    },
    "17": {
      "General": "He requests permission to pass through Edom's land, promising not to travel through fields or vineyards, nor drink well water, but to stick strictly to the king's highway without turning aside.",
      "Non-Denominational": "Makes a formal request for passage, assuring minimal disruption by staying on the main road and not using local resources.",
      "Baptist": "Requests passage, promising to stay on the main highway ('king's high way'), avoid fields/vineyards, and not drink local water.",
      "Catholic": "Asks permission to cross Edomite land, pledging to use only the royal road, avoid cultivated land, and not drink water.",
      "Methodist": "Politely requests passage, guaranteeing they will stay on the main road ('king's highway') and not trespass or use resources.",
      "Lutheran": "Requests passage through Edom, promising to stay on the king's highway, not pass through fields/vineyards, or drink well water."
    },
    "18": {
      "General": "But the king of Edom refuses passage, threatening to attack Israel with the sword if they try.",
      "Non-Denominational": "Edom flatly rejects the request and threatens military action against Israel.",
      "Baptist": "Edom denies passage and threatens military force ('lest I come out against thee with the sword').",
      "Catholic": "Edom refuses passage and threatens to confront Israel with military force ('with the sword').",
      "Methodist": "Edom denies the request and threatens to come out against Israel with the sword.",
      "Lutheran": "Edom refuses passage, threatening to attack with the sword."
    },
    "19": {
      "General": "The Israelites reiterate their promise to stay on the highway and offer to pay for any water they or their livestock drink, emphasizing it's just a matter of passing through on foot.",
      "Non-Denominational": "Israel repeats the assurance of using only the highway and offers compensation for water, minimizing the request.",
      "Baptist": "Israel repeats the promise to stay on the highway, offering payment for water, emphasizing it's only a brief passage.",
      "Catholic": "The Israelites reassure they will use the highway, pay for water, and only desire to pass through on foot.",
      "Methodist": "Israel repeats its peaceful intentions, offers payment for water, and stresses the simplicity of just passing through.",
      "Lutheran": "Israel promises again to stay on the highway, pay for water, and merely pass through on foot."
    },
    "20": {
      "General": "Edom again refuses, saying 'You shall not go through.' Then Edom comes out against Israel with a large and powerful army.",
      "Non-Denominational": "Edom firmly refuses again and mobilizes a strong military force to block Israel's path.",
      "Baptist": "Edom emphatically denies passage again and backs up the refusal with a large, heavily armed force.",
      "Catholic": "Edom reiterates the refusal ('You shall not pass through!') and musters a large, strong force to oppose Israel.",
      "Methodist": "Edom repeats the refusal and confronts Israel with a substantial and powerful army.",
      "Lutheran": "Edom again refuses passage and comes out against Israel with many people and a strong military ('strong hand')."
    },
    "21": {
      "General": "Thus, because Edom refused passage, Israel is forced to turn away and find another route.",
      "Non-Denominational": "Faced with Edom's refusal and military threat, Israel changes its route.",
      "Baptist": "Edom's refusal forces Israel to detour and avoid conflict.",
      "Catholic": "Since Edom denied passage, Israel detours away from their territory.",
      "Methodist": "Edom's refusal compels Israel to turn away and seek an alternative path.",
      "Lutheran": "Because Edom refused passage, Israel turns away from them."
    },
    "22": {
      "General": "The entire Israelite community journeys from Kadesh and arrives at Mount Hor.",
      "Non-Denominational": "Records the next stage of the journey, moving from Kadesh to Mount Hor.",
      "Baptist": "Documents the movement of the whole congregation from Kadesh to Mount Hor.",
      "Catholic": "The entire Israelite community travels from Kadesh to Mount Hor.",
      "Methodist": "Describes the community's journey from Kadesh, arriving at Mount Hor.",
      "Lutheran": "The whole congregation journeys from Kadesh to Mount Hor."
    },
    "23": {
      "General": "At Mount Hor, near the border of Edom, the Lord speaks to Moses and Aaron.",
      "Non-Denominational": "God addresses Moses and Aaron again at this location near Edom's border.",
      "Baptist": "Records God speaking to Moses and Aaron at Mount Hor, near Edom's border.",
      "Catholic": "The Lord speaks to Moses and Aaron at Mount Hor, on the Edomite border.",
      "Methodist": "God communicates with Moses and Aaron at Mount Hor, near Edom.",
      "Lutheran": "The Lord speaks to Moses and Aaron at Mount Hor, by the border of Edom."
    },
    "24": {
      "General": "The Lord declares that Aaron is about to die ('be gathered unto his people') and will not enter the Promised Land because both he and Moses rebelled against God's command at the waters of Meribah.",
      "Non-Denominational": "God announces Aaron's impending death, reiterating the reason: their disobedience at Meribah preventing entry into Canaan.",
      "Baptist": "God declares Aaron's impending death, explicitly linking it to their rebellion ('ye rebelled against my word') at Meribah and consequent exclusion from the land.",
      "Catholic": "The Lord announces Aaron's imminent death ('gathered to his people'), stating he won't enter the land due to their rebellion against God's command at Meribah.",
      "Methodist": "God informs them Aaron will die soon and not enter the land, citing their rebellion against His command at Meribah.",
      "Lutheran": "God states Aaron will be gathered to his people (die) and not enter the land, because they rebelled against His word at Meribah."
    },
    "25": {
      "General": "God instructs Moses to take Aaron and his son Eleazar up Mount Hor.",
      "Non-Denominational": "God gives instructions for Aaron's final ascent up Mount Hor with Moses and Eleazar.",
      "Baptist": "God commands Moses to bring Aaron and Eleazar up Mount Hor.",
      "Catholic": "God directs Moses to take Aaron and Eleazar up Mount Hor.",
      "Methodist": "God tells Moses to take Aaron and his son Eleazar up Mount Hor.",
      "Lutheran": "God instructs Moses to take Aaron and Eleazar up Mount Hor."
    },
    "26": {
      "General": "There, Moses is to remove Aaron's priestly garments and put them on Eleazar. Aaron will die there.",
      "Non-Denominational": "Details the transfer of priestly office: Moses removes Aaron's vestments and clothes Eleazar with them before Aaron's death on the mountain.",
      "Baptist": "Commands Moses to strip Aaron's priestly garments and put them on Eleazar, signifying the transfer of the high priesthood before Aaron dies there.",
      "Catholic": "Instructs Moses to divest Aaron of his priestly robes and invest Eleazar with them, symbolizing the succession before Aaron's death on the mountain.",
      "Methodist": "Directs Moses to remove Aaron's garments, put them on Eleazar, signifying the transfer of office, after which Aaron will die.",
      "Lutheran": "Moses is commanded to strip Aaron of his garments, put them on Eleazar, and Aaron shall be gathered [unto his people] and die there."
    },
    "27": {
      "General": "Moses obeys the Lord's command; the three of them ascend Mount Hor in sight of the whole community.",
      "Non-Denominational": "Moses carries out the command, ascending the mountain with Aaron and Eleazar publicly.",
      "Baptist": "Moses obeys God, and they ascend Mount Hor visibly before the entire congregation.",
      "Catholic": "Moses obeys the Lord; they ascend Mount Hor in view of the whole community.",
      "Methodist": "Moses does as commanded, ascending the mountain with Aaron and Eleazar in the sight of all the people.",
      "Lutheran": "Moses obeys, and they go up Mount Hor in the sight of all the congregation."
    },
    "28": {
      "General": "Moses removes Aaron's garments and puts them on Eleazar. Aaron dies there on the top of the mountain. Moses and Eleazar then come down.",
      "Non-Denominational": "Moses performs the transfer of garments, Aaron dies as prophesied, and Moses and the newly invested High Priest Eleazar descend.",
      "Baptist": "Moses transfers the priestly garments to Eleazar, Aaron dies on the mountaintop, and Moses and Eleazar descend.",
      "Catholic": "Moses removes Aaron's robes, puts them on Eleazar, and Aaron dies on the mountaintop. Moses and Eleazar then descend.",
      "Methodist": "Moses transfers the garments to Eleazar, Aaron dies on the mountain, and Moses and Eleazar come down.",
      "Lutheran": "Moses strips Aaron's garments, puts them on Eleazar; Aaron dies there on the mountaintop. Moses and Eleazar come down."
    },
    "29": {
      "General": "When the whole community sees that Aaron is dead, the entire house of Israel mourns for him for thirty days.",
      "Non-Denominational": "The community understands Aaron has died and observes a thirty-day mourning period for their first High Priest.",
      "Baptist": "The congregation realizes Aaron is dead and mourns him for a full month (thirty days).",
      "Catholic": "Upon realizing Aaron has died, the whole community (the house of Israel) mourns him for thirty days.",
      "Methodist": "When the people see Aaron is dead, the entire house of Israel mourns him for thirty days.",
      "Lutheran": "When the congregation sees Aaron is dead, all the house of Israel mourns for Aaron for thirty days."
    }
  }
}
