{
  "Summary": {
    "General": "Continuing their journey, Israel is attacked by the Canaanite king of Arad. Israel makes a vow to the Lord, promising to utterly destroy the Canaanite cities if victorious. God grants them victory, and they fulfill their vow, naming the place Hormah (destruction). Journeying around Edom, the people become discouraged and complain against God and Moses about the lack of bread and water, calling the manna 'light' (worthless) bread. In response, God sends venomous ('fiery') serpents, and many Israelites die. The people repent and ask Moses to pray for them. God instructs Moses to make a bronze serpent, set it on a pole, and have anyone bitten look at it to live. Moses does so, and it proves effective. Israel continues traveling, stopping at various locations. They find water at Beer (well), prompting a song. Israel sends messengers to Sihon, king of the Amorites, requesting passage, but he refuses and attacks. Israel defeats Sihon, captures his land (from Arnon to Jabbok), and occupies his cities, including Heshbon. They then turn towards Bashan, where Og, the king, attacks them. God assures Moses of victory, and Israel defeats Og and his forces, taking possession of his land as well.",
    "Non-Denominational": "Focuses on Israel's journey marked by conflict, complaint, judgment, and divine intervention. The victory over Arad follows a vow, showing reliance on God. Renewed complaints lead to judgment (serpents), followed by repentance and God's provision of a unique remedy (bronze serpent) requiring faith (looking). The journey continues with God providing water and granting significant military victories over powerful Amorite kings (Sihon and Og), securing territory east of the Jordan as they approach the Promised Land.",
    "Baptist": "Highlights cycles of sin, judgment, repentance, and grace. Victory over Arad is conditional on a vow to God. Subsequent complaining against God and His provision (manna) results in judgment (fiery serpents). Repentance leads to God providing the bronze serpent – a picture of salvation through faith (looking to God's provision), often seen as foreshadowing Christ lifted up (John 3:14-15). Victories over Sihon and Og demonstrate God's power fulfilling His promise to give them land, despite their earlier failures.",
    "Catholic": "Observes Israel's struggles and progress. The vow against Arad leads to victory (Hormah). The people's impatience and murmuring against God and manna bring punishment (serpents). Their repentance prompts God's mercy through the bronze serpent, a symbol requiring faith and prefiguring the salvific elevation of Christ on the cross. The miraculous provision of water (Beer) and the decisive victories over Sihon and Og demonstrate God's power and faithfulness in granting Israel possession of lands as they near Canaan.",
    "Methodist": "Emphasizes the dynamics of faith, complaint, divine discipline, and deliverance. The victory over Arad shows faith expressed through a vow. Impatience leads to complaining against God's provision, resulting in divine chastisement (serpents). Repentance and intercession lead to God's gracious remedy (bronze serpent), requiring an act of looking in faith for healing. God's continued guidance is seen in providing water and granting crucial victories over Sihon and Og, demonstrating His power to overcome obstacles on the path to the promise.",
    "Lutheran": "Focuses on Law and Gospel themes. Israel's vow against Arad and subsequent victory show God honoring commitments made under His Law. The complaining against God and manna reveals sinful hearts rejecting God's provision. The fiery serpents represent God's wrath (Law) against sin. The bronze serpent, lifted up for healing through looking (faith), is a clear type (Gospel foreshadowing) of Christ lifted up on the cross for salvation from sin and death (John 3:14-15). Victories over Sihon and Og show God defeating enemies and giving His people inheritance according to His promise."
  },
  "Verses": {
    "1": {
      "General": "When the Canaanite king of Arad, living in the south (Negev), hears that Israel is approaching via the way of the spies (or Atharim), he attacks Israel and captures some prisoners.",
      "Non-Denominational": "An opposing king (Arad) initiates conflict upon hearing of Israel's approach, achieving some initial success.",
      "Baptist": "The Canaanite king of Arad attacks Israel preemptively after hearing of their approach, taking some captives.",
      "Catholic": "The Canaanite king of Arad attacks Israel upon learning they are coming by the route of Atharim, taking some prisoners.",
      "Methodist": "The king of Arad, hearing of Israel's advance, attacks them and takes some prisoners.",
      "Lutheran": "The Canaanite king of Arad attacks Israel when he hears they are coming by the way of the spies, taking some prisoners."
    },
    "2": {
      "General": "Israel makes a vow to the Lord: If God delivers this people into their hands, they will utterly destroy their cities.",
      "Non-Denominational": "In response to the attack, Israel makes a conditional vow to God, promising complete destruction of the enemy cities upon victory.",
      "Baptist": "Israel vows to the Lord that if He grants victory, they will completely destroy ('utterly destroy') the Canaanite cities.",
      "Catholic": "Israel makes a vow to the Lord, promising to put the cities under the ban (utter destruction) if God delivers the enemy into their power.",
      "Methodist": "Israel makes a vow to God, pledging to utterly destroy the enemy cities if He grants them victory.",
      "Lutheran": "Israel vows to the Lord that if He delivers this people into their hand, they will utterly destroy their cities."
    },
    "3": {
      "General": "The Lord listens to Israel's vow and delivers the Canaanites into their hands. Israel utterly destroys them and their cities, naming the place Hormah (meaning 'destruction' or 'devotion to destruction').",
      "Non-Denominational": "God honors the vow, grants victory, and Israel fulfills its promise, naming the site Hormah to commemorate the destruction.",
      "Baptist": "God hears Israel's vow, gives them victory over the Canaanites, and they fulfill the vow of destruction, naming the place Hormah.",
      "Catholic": "The Lord heeds Israel's vow, delivers the Canaanites, and Israel places them and their cities under the ban (Hormah). The place is named Hormah.",
      "Methodist": "God responds to Israel's vow, gives them victory, and they carry out the promised destruction, naming the place Hormah.",
      "Lutheran": "The Lord hears Israel, delivers up the Canaanites; Israel utterly destroys them and their cities, calling the place Hormah (destruction)."
    },
    "4": {
      "General": "They travel from Mount Hor by the route to the Red Sea to go around the land of Edom. The people become very discouraged ('much discouraged') because of the difficult journey.",
      "Non-Denominational": "The necessary detour around Edom proves difficult, leading to discouragement among the people.",
      "Baptist": "Journeying from Mount Hor to bypass Edom via the Red Sea route, the people become disheartened ('soul was much discouraged') by the journey.",
      "Catholic": "They journey from Mount Hor via the Red Sea route to bypass Edom, but the people become impatient ('soul...was much discouraged') on the way.",
      "Methodist": "Traveling from Mount Hor around Edom towards the Red Sea, the people grow very discouraged by the arduous journey.",
      "Lutheran": "They journey from Mount Hor by way of the Red Sea to go around Edom, and the people become discouraged ('soul...much discouraged') because of the way."
    },
    "5": {
      "General": "The people speak out against God and against Moses, complaining: 'Why did you bring us up out of Egypt to die in the wilderness? There's no bread, no water, and we detest this miserable ('light') bread (manna)!'",
      "Non-Denominational": "Discouragement leads to renewed complaining against God and Moses, specifically targeting the lack of variety in food (manna) and water.",
      "Baptist": "The people complain directly against God and Moses, questioning the Exodus and despising God's provision of manna ('loatheth this light bread').",
      "Catholic": "The people murmur against God and Moses, questioning the Exodus, complaining about lack of food and water, and despising the manna ('this worthless food').",
      "Methodist": "The people complain against God and Moses, asking why they left Egypt to die, citing lack of bread/water and loathing the manna.",
      "Lutheran": "The people speak against God and Moses, asking why they were brought from Egypt to die in the wilderness, complaining of no bread or water and loathing the 'light' (worthless) manna."
    },
    "6": {
      "General": "In response, the Lord sends venomous ('fiery') serpents among the people. They bite the Israelites, and many people die.",
      "Non-Denominational": "God sends judgment for their complaint in the form of deadly serpents, resulting in many deaths.",
      "Baptist": "God sends fiery (venomous) serpents as judgment for their rebellion and complaining; many Israelites die from the bites.",
      "Catholic": "The Lord sends venomous (fiery) serpents among the people as punishment; they bite the people, and many Israelites die.",
      "Methodist": "As a consequence of their complaining, God sends fiery serpents, which bite the people, causing many deaths.",
      "Lutheran": "The Lord sends fiery (venomous) serpents among the people as judgment; they bite the people, and many Israelites die."
    },
    "7": {
      "General": "The people come to Moses and confess, 'We have sinned, for we spoke against the Lord and against you. Pray to the Lord to take the serpents away from us.' So Moses prays for the people.",
      "Non-Denominational": "Facing death, the people acknowledge their sin against God and Moses, asking for intercession. Moses prays for them.",
      "Baptist": "The people repent, confessing their sin against God and Moses, and ask Moses to intercede. Moses prays for the people.",
      "Catholic": "The people approach Moses, confess their sin of murmuring against God and him, and ask him to pray for the removal of the serpents. Moses intercedes for them.",
      "Methodist": "The people come to Moses, admit their sin against God and him, and request his prayers for removing the serpents. Moses prays.",
      "Lutheran": "The people come to Moses, confessing they sinned by speaking against the Lord and Moses, and ask him to pray for the serpents' removal. Moses prays for them."
    },
    "8": {
      "General": "The Lord tells Moses, 'Make a fiery serpent (or a serpent of bronze) and set it on a pole. Anyone who is bitten, when he looks at it, shall live.'",
      "Non-Denominational": "God provides the remedy: a bronze serpent on a pole; looking at it in faith brings healing from the snakebites.",
      "Baptist": "God instructs Moses to make a bronze serpent and lift it on a pole, promising life to bitten Israelites who look at it (requiring an act of faith).",
      "Catholic": "The Lord instructs Moses to make a bronze serpent (seraph), mount it on a pole, and promises life to any bitten person who looks at it.",
      "Methodist": "God tells Moses to create a bronze serpent, place it on a pole, and instructs that looking at it will heal those bitten.",
      "Lutheran": "The Lord tells Moses to make a fiery (bronze) serpent, set it on a pole, and promises that anyone bitten who looks at it shall live."
    },
    "9": {
      "General": "So Moses makes a bronze serpent and puts it on a pole. Then, if a serpent had bitten anyone, when they looked at the bronze serpent, they lived.",
      "Non-Denominational": "Moses obeys, creates the bronze serpent, and the promised healing occurs for those who look at it after being bitten.",
      "Baptist": "Moses makes the bronze serpent as commanded, and those bitten who looked upon it were healed, demonstrating God's prescribed way of deliverance.",
      "Catholic": "Moses makes the bronze serpent and mounts it on the pole; when anyone bitten looked at the bronze serpent, they recovered.",
      "Methodist": "Moses follows the instructions, making the bronze serpent, and those bitten who looked upon it were healed.",
      "Lutheran": "Moses makes a bronze serpent, puts it on a pole, and when a bitten person looked at the bronze serpent, they lived."
    },
    "10": {
      "General": "The Israelites move on and camp at Oboth.",
      "Non-Denominational": "Records the next stage of their journey, camping at Oboth.",
      "Baptist": "Documents the Israelites traveling and camping at Oboth.",
      "Catholic": "The Israelites continue their journey and encamp at Oboth.",
      "Methodist": "Notes the Israelites moved on and camped at Oboth.",
      "Lutheran": "The Israelites journey and camp at Oboth."
    },
    "11": {
      "General": "They journey from Oboth and camp at Iye-abarim, in the wilderness facing Moab, towards the sunrise (east).",
      "Non-Denominational": "Records the move from Oboth to Iye-abarim, locating it east of Moab.",
      "Baptist": "Documents the journey from Oboth to Iye-abarim, on the eastern border of Moab's wilderness.",
      "Catholic": "They travel from Oboth and encamp at Iye-abarim, in the wilderness east of Moab.",
      "Methodist": "Describes their journey from Oboth to Iye-abarim, in the wilderness east of Moab.",
      "Lutheran": "They journey from Oboth and camp at Iye-abarim, in the wilderness east of Moab."
    },
    "12": {
      "General": "From there, they move and camp in the Valley of Zered.",
      "Non-Denominational": "Records the move to encamp in the Zered Valley.",
      "Baptist": "Documents their movement and encampment in the Zered Valley.",
      "Catholic": "From there they travel and encamp in the Wadi Zered.",
      "Methodist": "Notes their subsequent move and encampment in the Valley of Zered.",
      "Lutheran": "From there they journey and camp in the valley of Zered."
    },
    "13": {
      "General": "From there, they move and camp on the other side of the Arnon River, which is in the wilderness extending from the territory of the Amorites. The Arnon serves as the border between Moab and the Amorites.",
      "Non-Denominational": "Records their encampment across the Arnon River, identifying it as the Amorite border with Moab.",
      "Baptist": "Documents their move across the Arnon, noting it marks the border between Moab and the Amorites.",
      "Catholic": "They travel from there and encamp across the Arnon river, which is on the edge of the Amorite territory; the Arnon is the border between Moab and the Amorites.",
      "Methodist": "Describes their move across the Arnon, locating it in the wilderness bordering Amorite territory and defining the Moab-Amorite border.",
      "Lutheran": "They journey from there and camp on the other side of the Arnon, in the wilderness bordering the Amorites; Arnon is the border between Moab and the Amorites."
    },
    "14": {
      "General": "Therefore, it is mentioned in the Book of the Wars of the Lord, 'Waheb in Suphah, and the valleys of the Arnon,'",
      "Non-Denominational": "Quotes from an ancient source, the 'Book of the Wars of the Lord,' referencing locations near the Arnon.",
      "Baptist": "Cites the 'Book of the Wars of the Lord' mentioning locations near the Arnon river valley.",
      "Catholic": "Quotes the 'Book of the Wars of the Lord,' mentioning Waheb in Suphah and the ravines of the Arnon.",
      "Methodist": "References the 'Book of the Wars of the Lord' regarding locations near the Arnon valley.",
      "Lutheran": "Quotes the 'Book of the Wars of the Lord,' mentioning 'Waheb in Suphah, and the brooks of Arnon.'"
    },
    "15": {
      "General": "'And the slope of the valleys that stretches toward the settlement of Ar and leans toward the border of Moab.'",
      "Non-Denominational": "Continues the quote, describing the terrain near the Moabite border town of Ar.",
      "Baptist": "Continues the citation, describing the stream/valley leading towards Ar on the Moabite border.",
      "Catholic": "Continues the quote referring to the ravine slope extending towards Ar and the border of Moab.",
      "Methodist": "Continues the quote describing the valley slope near Ar and the Moabite border.",
      "Lutheran": "Continues the quote: 'And the stream of the brooks that goeth down to the dwelling of Ar, and lieth upon the border of Moab.'"
    },
    "16": {
      "General": "From there they continued to Beer (meaning 'well'); this is the well where the Lord told Moses, 'Gather the people together, and I will give them water.'",
      "Non-Denominational": "Identifies their next stop as Beer, recalling God's promise to provide water there.",
      "Baptist": "Documents their arrival at Beer ('well'), recalling God's specific promise to provide water there.",
      "Catholic": "From there they went to Beer, the well where the Lord had told Moses to gather the people for water.",
      "Methodist": "Notes their arrival at Beer ('well'), reminding of God's earlier promise to give them water there.",
      "Lutheran": "From there they went to Beer, the well where the Lord told Moses He would give the people water."
    },
    "17": {
      "General": "Then Israel sang this song: 'Spring up, O well!—Sing to it!'",
      "Non-Denominational": "Records Israel singing a song of anticipation or celebration for the promised water from the well.",
      "Baptist": "Records Israel singing a song addressed to the well, calling for it to produce water.",
      "Catholic": "Israel sings a song to the well, urging it to spring forth.",
      "Methodist": "Israel sings a song, calling upon the well to spring up.",
      "Lutheran": "Then Israel sang this song, 'Spring up, O well; sing ye unto it.'"
    },
    "18": {
      "General": "'The well that the princes dug, that the nobles of the people hollowed out with the scepter and with their staffs.' Then they went from the wilderness to Mattanah.",
      "Non-Denominational": "The song attributes the well's creation (or uncovering) to the leaders using their symbols of authority. Records the next stage of travel.",
      "Baptist": "The song credits the leaders ('princes', 'nobles') with digging the well using their scepters and staffs. Notes their departure towards Mattanah.",
      "Catholic": "The song attributes the digging of the well to the princes and nobles using their scepters and staffs. Notes the journey continuing to Mattanah.",
      "Methodist": "The song credits the leaders ('princes', 'nobles') with digging the well with their official staffs. Records their journey continuing.",
      "Lutheran": "The song credits the princes and nobles for digging the well with the lawgiver's scepter and their staffs. Then notes travel from the wilderness to Mattanah."
    },
    "19": {
      "General": "From Mattanah they went to Nahaliel, and from Nahaliel to Bamoth,",
      "Non-Denominational": "Lists subsequent stages of the journey: Mattanah to Nahaliel, Nahaliel to Bamoth.",
      "Baptist": "Documents further stages of the journey: Mattanah to Nahaliel, then to Bamoth.",
      "Catholic": "Records the journey stages from Mattanah to Nahaliel, and from Nahaliel to Bamoth.",
      "Methodist": "Notes the continued journey from Mattanah to Nahaliel, and then to Bamoth.",
      "Lutheran": "Lists subsequent camps: from Mattanah to Nahaliel, and from Nahaliel to Bamoth."
    },
    "20": {
      "General": "and from Bamoth to the valley in the territory of Moab, near the top of Pisgah, which overlooks the wasteland (Jeshimon).",
      "Non-Denominational": "Records the final stage mentioned here: from Bamoth to a valley in Moab overlooking the wilderness from the vicinity of Mount Pisgah.",
      "Baptist": "Documents the final leg of this travelogue: from Bamoth to the valley in Moab near Pisgah's peak, overlooking the desert.",
      "Catholic": "Records travel from Bamoth to the valley in Moabite country near the summit of Pisgah, overlooking the wasteland.",
      "Methodist": "Describes the journey from Bamoth to the valley in Moab, near the top of Pisgah overlooking the desert.",
      "Lutheran": "Lists the final stage: from Bamoth to the valley in Moab, to the top of Pisgah overlooking Jeshimon (the wasteland)."
    },
    "21": {
      "General": "Israel sends messengers to Sihon, king of the Amorites, with a request.",
      "Non-Denominational": "Israel initiates diplomatic contact with Sihon, king of the Amorites.",
      "Baptist": "Israel sends envoys to the Amorite king Sihon with a specific request.",
      "Catholic": "Israel dispatches messengers to Sihon, the Amorite king.",
      "Methodist": "Israel sends messengers to Sihon, the Amorite king, with a request.",
      "Lutheran": "Israel sends messengers to Sihon, king of the Amorites."
    },
    "22": {
      "General": "'Let me pass through your land. We will not turn aside into fields or vineyards; we will not drink water from wells. We will go by the king's highway until we have passed through your territory.'",
      "Non-Denominational": "Repeats the same request made to Edom: permission for peaceful passage via the main road without using local resources.",
      "Baptist": "Makes the same request for passage as made to Edom, promising to stay on the highway and not use resources.",
      "Catholic": "Requests passage through Sihon's land, pledging to use only the royal road, avoid fields/vineyards, and not drink well water.",
      "Methodist": "Politely requests passage, guaranteeing they will stay on the main road ('king's highway') and not trespass or use resources, mirroring the request to Edom.",
      "Lutheran": "Requests passage through Sihon's land, promising to stay on the king's highway, avoid fields/vineyards, and not drink well water."
    },
    "23": {
      "General": "But Sihon would not allow Israel to pass through his territory. He gathered all his people together and marched out into the wilderness to attack Israel at Jahaz.",
      "Non-Denominational": "Sihon refuses passage and preemptively attacks Israel in the wilderness at Jahaz.",
      "Baptist": "Sihon refuses passage, musters his entire army, and marches out to attack Israel at Jahaz.",
      "Catholic": "Sihon refuses passage, gathers his forces, and marches out to engage Israel in battle at Jahaz in the wilderness.",
      "Methodist": "Sihon denies passage, gathers his army, and goes out to fight Israel at Jahaz.",
      "Lutheran": "Sihon refuses passage, gathers his army, and goes out into the wilderness to fight Israel at Jahaz."
    },
    "24": {
      "General": "Israel defeats him with the sword and takes possession of his land from the Arnon River to the Jabbok River, as far as the Ammonite border, which was strong (fortified).",
      "Non-Denominational": "Israel achieves a decisive military victory, conquering Sihon's territory up to the fortified Ammonite border.",
      "Baptist": "Israel soundly defeats Sihon in battle ('smote him with the edge of the sword') and seizes his land between the Arnon and Jabbok rivers, up to the strong Ammonite border.",
      "Catholic": "Israel defeats Sihon by the sword and occupies his land from the Arnon to the Jabbok, up to the Ammonite border, which was fortified.",
      "Methodist": "Israel defeats Sihon with the sword, takes possession of his land from the Arnon to the Jabbok, reaching the strong border of the Ammonites.",
      "Lutheran": "Israel defeats Sihon with the sword and possesses his land from the Arnon to the Jabbok, as far as the Ammonite border, which was strong."
    },
    "25": {
      "General": "Israel captures all these Amorite cities, including Heshbon (Sihon's capital) and all its surrounding villages, and settles in them.",
      "Non-Denominational": "Israel occupies the conquered Amorite cities and settlements, including the capital, Heshbon.",
      "Baptist": "Israel takes control of all the Amorite cities, including Heshbon and its dependent villages, and lives there.",
      "Catholic": "Israel captures all the Amorite cities, including Heshbon and its surrounding towns, and occupies them.",
      "Methodist": "Israel captures all these Amorite cities, including Heshbon and its villages, and settles in them.",
      "Lutheran": "Israel takes all these Amorite cities and dwells in them, including Heshbon and its villages."
    },
    "26": {
      "General": "Heshbon had been the city of Sihon king of the Amorites, who had previously fought against the former king of Moab and captured all his land as far as the Arnon.",
      "Non-Denominational": "Provides historical context: Heshbon was Sihon's capital, taken previously from Moab.",
      "Baptist": "Gives background: Sihon had conquered Heshbon and surrounding land from a previous Moabite king.",
      "Catholic": "Explains Heshbon was Sihon's capital, which he had captured from the previous Moabite king along with territory up to the Arnon.",
      "Methodist": "Notes Heshbon was Sihon's city, which he had taken in a previous war against Moab.",
      "Lutheran": "Provides background: Heshbon was Sihon's capital, previously captured from the former king of Moab."
    },
    "27": {
      "General": "Therefore, those who speak in proverbs (poets or balladeers) say: 'Come to Heshbon, let it be built! Let the city of Sihon be established!'",
      "Non-Denominational": "Quotes a proverbial saying or song, likely originally celebrating Sihon's conquest and building of Heshbon.",
      "Baptist": "Cites a proverbial saying, perhaps originally Amorite, celebrating the establishment of Sihon's city, Heshbon.",
      "Catholic": "Quotes a satirical poem or proverb: 'Come to Heshbon! Let it be rebuilt, the city of Sihon established!'",
      "Methodist": "Quotes a proverbial saying inviting people to Heshbon, celebrating its establishment under Sihon.",
      "Lutheran": "Quotes those who speak in proverbs: 'Come into Heshbon, let the city of Sihon be built and prepared.'"
    },
    "28": {
      "General": "'For fire went out from Heshbon, a flame from the city of Sihon. It consumed Ar of Moab, the lords of the high places of Arnon.'",
      "Non-Denominational": "Continues the quote, describing the destructive power emanating from Sihon's Heshbon, consuming Moabite territory (Ar, Arnon heights).",
      "Baptist": "Continues the proverb, describing Heshbon's destructive military power ('fire', 'flame') consuming Moabite cities and leaders.",
      "Catholic": "Continues the quote: 'For fire went forth from Heshbon, flame from Sihon's city; it devoured Ar of Moab, the lords of Arnon's heights.'",
      "Methodist": "Continues the quote depicting Heshbon's destructive conquest ('fire', 'flame') over Moabite territory and leadership.",
      "Lutheran": "Continues the proverb: 'For fire went out of Heshbon, a flame from Sihon's city: it consumed Ar of Moab, and the lords of Arnon's high places.'"
    },
    "29": {
      "General": "'Woe to you, O Moab! You are undone, O people of Chemosh (Moabite god)! He has given his sons as fugitives and his daughters into captivity to Sihon king of the Amorites.'",
      "Non-Denominational": "The quote pronounces woe on Moab, attributing their defeat and the capture of their people to the failure of their god Chemosh against Sihon.",
      "Baptist": "The proverb laments Moab's destruction, attributing it to the failure of their god Chemosh, whose followers became captives of Sihon.",
      "Catholic": "The quote laments Moab's fate: 'Woe to you, Moab! You are ruined, O people of Chemosh! He has given up his sons as fugitives, his daughters as captives to Sihon.'",
      "Methodist": "The quote expresses woe upon Moab, blaming their god Chemosh for letting his people become captives to Sihon.",
      "Lutheran": "The proverb laments: 'Woe to thee, Moab! thou art undone, O people of Chemosh: he hath given his sons as fugitives, and his daughters into captivity unto Sihon.'"
    },
    "30": {
      "General": "'But we have shot them down (or overthrown them); Heshbon is ruined as far as Dibon. We have laid them waste as far as Nophah, which reaches to Medeba.'",
      "Non-Denominational": "The quote (now perhaps adapted by Israel or simply recording the extent of Sihon's prior victory) boasts of complete devastation over a wide area (Heshbon to Dibon, Nophah to Medeba).",
      "Baptist": "The proverb concludes (perhaps now from Israel's perspective applying Sihon's fate to him?) boasting of complete destruction from Heshbon to Dibon and Nophah/Medeba.",
      "Catholic": "The quote concludes describing the devastation: 'We have shot them down; Heshbon is destroyed as far as Dibon. We have laid waste as far as Nophah; fire has reached Medeba.'",
      "Methodist": "The quote concludes by describing the extent of the destruction inflicted, ruining territory from Heshbon to Dibon and Nophah/Medeba.",
      "Lutheran": "The proverb ends: 'We have shot at them; Heshbon is perished even unto Dibon, and we have laid them waste even unto Nophah, which reacheth unto Medeba.'"
    },
    "31": {
      "General": "Thus Israel settled in the land of the Amorites.",
      "Non-Denominational": "Summarizes the outcome: Israel successfully occupied the conquered Amorite territory.",
      "Baptist": "States the result: Israel occupied and lived in the former Amorite land.",
      "Catholic": "Summarizes the result: Israel occupied the Amorite land.",
      "Methodist": "Concludes that Israel settled in the land previously held by the Amorites.",
      "Lutheran": "Thus Israel dwelt in the land of the Amorites."
    },
    "32": {
      "General": "Moses sent spies to Jazer, and the Israelites captured its surrounding settlements and drove out the Amorites who were there.",
      "Non-Denominational": "Describes a further military action: scouting and capturing Jazer and its villages, expelling the Amorites.",
      "Baptist": "Moses sends spies to Jazer; Israel captures it and its villages, driving out the Amorite inhabitants.",
      "Catholic": "Moses sends scouts to Jazer; they capture its dependent towns and dispossess the Amorites there.",
      "Methodist": "Moses scouts Jazer; Israel captures it and its villages, driving out the Amorites.",
      "Lutheran": "Moses sends spies to Jazer; they capture its villages and drive out the Amorites there."
    },
    "33": {
      "General": "Then they turned and went up the road to Bashan. Og, king of Bashan, marched out against them with his entire army for battle at Edrei.",
      "Non-Denominational": "Israel moves north towards Bashan; King Og confronts them with his entire army at Edrei.",
      "Baptist": "Israel turns north towards Bashan; King Og and his entire army come out for battle at Edrei.",
      "Catholic": "They turn and advance toward Bashan; Og king of Bashan marches out with all his forces to meet them in battle at Edrei.",
      "Methodist": "Israel turns towards Bashan; King Og meets them with his whole army for battle at Edrei.",
      "Lutheran": "They turn and go up the way to Bashan; Og king of Bashan comes out against them with all his people for battle at Edrei."
    },
    "34": {
      "General": "The Lord tells Moses, 'Do not fear him, for I have delivered him, his whole army, and his land into your hand. Do to him as you did to Sihon king of the Amorites, who lived in Heshbon.'",
      "Non-Denominational": "God reassures Moses, promising victory over Og just as He granted victory over Sihon.",
      "Baptist": "God encourages Moses not to fear Og, promising complete victory over him, his army, and land, just like the victory over Sihon.",
      "Catholic": "The Lord assures Moses not to fear Og, promising to deliver him, his army, and land into Israel's power, instructing Moses to treat him like Sihon.",
      "Methodist": "God tells Moses not to fear Og, promising his defeat and the capture of his land, instructing a repeat of the victory over Sihon.",
      "Lutheran": "The Lord tells Moses not to fear Og, promising He has delivered Og, his people, and land into Moses' hand, to be treated like Sihon."
    },
    "35": {
      "General": "So Israel struck down Og, his sons, and his entire army, leaving no survivors, and they took possession of his land.",
      "Non-Denominational": "Israel achieves another total victory, defeating Og's forces completely and occupying the land of Bashan.",
      "Baptist": "Israel defeats Og, his sons, and his entire army, leaving no survivors, and takes possession of his land, fulfilling God's promise.",
      "Catholic": "Israel defeats Og, his sons, and all his forces, leaving no survivor, and takes possession of his land.",
      "Methodist": "Israel defeats Og, his sons, and all his people, leaving no survivors, and takes possession of his land as promised.",
      "Lutheran": "So they defeat Og, his sons, and all his people, leaving none remaining, and possess his land."
    }
  }
}
