{
  "Summary": {
    "General": "The Israelites camp in the plains of Moab across the Jordan from Jericho. Balak, king of Moab, seeing Israel's numbers and victories over the Amorites, is filled with dread. He consults with Midianite elders and decides to hire Balaam son of Beor, a diviner from Pethor, to curse Israel, believing this will enable Moab to defeat them. Balak sends Moabite and Midianite princes with divination fees to Balaam. Balaam consults God, Who tells him not to go or curse Israel, for they are blessed. Balaam relays this refusal. Balak sends a larger, more prestigious delegation with greater promises. Balaam asks them to wait while he consults God again. This time, God permits Balaam to go but instructs him to only do what He commands. Balaam departs with the princes. God's anger is kindled because he went (perhaps sensing Balaam's underlying desire for reward), and the Angel of the Lord stands in the road to oppose him. Balaam, riding his donkey, does not see the Angel, but the donkey does, turning aside three times. Balaam strikes the donkey each time. Finally, the Lord opens the donkey's mouth to rebuke Balaam. Then, God opens Balaam's eyes to see the Angel with a drawn sword. Balaam falls down, confesses his sin, and offers to turn back. The Angel permits him to continue but strictly commands him to speak only the word God gives him. Balaam proceeds and meets Balak, who questions his initial reluctance. Balaam reiterates he can only speak what God puts in his mouth.",
    "Non-Denominational": "Focuses on the conflict between Balak's fear-driven plan to curse Israel using Balaam, and God's sovereign protection over His blessed people. It highlights Balaam's initial obedience followed by his questionable motives (seeking honor/reward) when revisited by Balak's princes. The episode with the donkey supernaturally reveals God's opposition and Balaam's spiritual blindness, forcefully reminding him of his obligation to speak only God's word. Despite Balaam's flawed character, God uses the situation to ultimately bless Israel.",
    "Baptist": "Emphasizes God's sovereignty over curses and blessings, protecting His chosen people Israel. Balak's fear leads him to seek pagan divination against Israel. Balaam, though aware of God's will, demonstrates greed and a desire for worldly honor, leading him towards disobedience. The talking donkey incident is a divine intervention exposing Balaam's sin and spiritual blindness, reinforcing God's absolute command to speak only His message. It underscores that human schemes and even flawed instruments cannot thwart God's purposes.",
    "Catholic": "Views the narrative as demonstrating God's protective providence over Israel, thwarting Balak's hostile intentions. Balaam is presented as a seer, potentially possessing some genuine connection to the divine but morally compromised by avarice. God's initial refusal and subsequent permission (with strict conditions) test Balaam. The miracle of the talking donkey serves as a dramatic rebuke and a revelation of the spiritual battle, emphasizing God's control over nature and His direct intervention. Balaam's final submission highlights God's power to compel even reluctant agents to declare His truth.",
    "Methodist": "Highlights the themes of fear versus faith, human ambition versus divine will, and God's use of extraordinary means. Balak acts out of fear. Balaam struggles between obedience and the allure of wealth and prestige. God's intervention with the donkey is a vivid lesson against spiritual blindness and stubbornness, correcting Balaam and redirecting him to God's specific command. It shows God's sovereignty in ensuring His blessing on Israel prevails over attempted curses, even using a flawed messenger.",
    "Lutheran": "Focuses on God's preservation of His people (Israel, prefiguring the Church) against hostile powers (Balak/Moab). Balaam represents a conflict: he knows God's command (Law) but is tempted by worldly gain. God's permission for him to go, despite His anger, demonstrates how God can work through complex situations. The donkey incident is a miraculous manifestation of Law (rebuke/warning) delivered through creation itself, exposing Balaam's sin. God ultimately overrules Balaam's intent, ensuring His Word of blessing, not cursing, is proclaimed (Gospel undertone of God's faithfulness despite human failing)."
  },
  "Verses": {
    "1": {
      "General": "The Israelites journey and set up camp in the plains of Moab, on the east side of the Jordan River across from Jericho.",
      "Non-Denominational": "Marks Israel's arrival and encampment in the strategic plains of Moab, near Jericho.",
      "Baptist": "Records Israel's arrival and encampment in the plains of Moab, across the Jordan from Jericho, nearing Canaan.",
      "Catholic": "The Israelites continue their journey and encamp in the plains of Moab, across the Jordan from Jericho.",
      "Methodist": "Notes Israel's journey ending with their camp setup in the plains of Moab, opposite Jericho.",
      "Lutheran": "Israel journeys and camps in the plains of Moab across the Jordan from Jericho."
    },
    "2": {
      "General": "Balak son of Zippor, the king of Moab, sees all that Israel has done to the Amorites (defeating Sihon and Og).",
      "Non-Denominational": "Balak, Moab's king, observes Israel's recent military successes against the Amorites.",
      "Baptist": "King Balak of Moab witnesses Israel's destruction of the Amorite kingdoms.",
      "Catholic": "Balak son of Zippor observes all that Israel had done to the Amorites.",
      "Methodist": "Balak, Moab's king, sees the extent of Israel's victories over the Amorites.",
      "Lutheran": "Balak son of Zippor sees all that Israel had done to the Amorites."
    },
    "3": {
      "General": "Moab is terrified ('sore afraid') of the Israelites because they are so numerous, and Moab feels dread ('distressed') because of them.",
      "Non-Denominational": "Moab experiences extreme fear and distress due to Israel's large population and perceived threat.",
      "Baptist": "Moab becomes terrified ('sore afraid') and distressed by the sheer number of Israelites.",
      "Catholic": "Moab becomes deeply fearful and distressed because of the vast numbers of Israelites.",
      "Methodist": "Moab is overcome with fear and distress at the sight of the numerous Israelites.",
      "Lutheran": "Moab is terrified ('sore afraid') and distressed because of Israel's great numbers."
    },
    "4": {
      "General": "The Moabites say to the elders of Midian, 'This horde (company) will lick up everything around us, like an ox licks up the grass.' So Balak son of Zippor, king of Moab at that time, devises a plan.",
      "Non-Denominational": "Moab expresses its fear to Midianite leaders, comparing Israel's consuming power to an ox, prompting King Balak to act.",
      "Baptist": "Moab consults with Midian, expressing fear that Israel will consume everything, leading King Balak to seek a solution.",
      "Catholic": "Moab expresses anxiety to the Midianite elders, comparing Israel to an ox consuming everything, prompting King Balak to take action.",
      "Methodist": "Moab shares its fear with Midian's elders, likening Israel's potential consumption to an ox, leading King Balak to strategize.",
      "Lutheran": "Moab tells the Midianite elders they fear Israel will consume everything like an ox, prompting King Balak to act."
    },
    "5": {
      "General": "He sends messengers to Balaam son of Beor at Pethor, near the Euphrates River in his native land, summoning him: 'A people has come out of Egypt; they cover the face of the earth and have settled next to me.'",
      "Non-Denominational": "Balak sends for Balaam, a diviner from Mesopotamia, describing Israel's origin, vastness, and proximity.",
      "Baptist": "Balak sends messengers to summon Balaam from Pethor near the Euphrates, identifying Israel as the people from Egypt who now cover the land near Moab.",
      "Catholic": "Balak sends messengers to Balaam son of Beor at Pethor on the Euphrates, describing Israel as a vast people from Egypt encamped nearby.",
      "Methodist": "Balak sends messengers to Balaam near the Euphrates, explaining that a numerous people from Egypt are now settled near Moab.",
      "Lutheran": "Balak sends messengers to Balaam son of Beor at Pethor by the river (Euphrates) in his homeland, describing Israel as a people from Egypt covering the earth nearby."
    },
    "6": {
      "General": "'Please come at once and curse this people for me, because they are too powerful for me. Perhaps then I will be able to defeat them and drive them out of the land. For I know that whoever you bless is blessed, and whoever you curse is cursed.'",
      "Non-Denominational": "Balak requests Balaam curse Israel, acknowledging their superior strength and Balaam's reputed power to bless and curse effectively.",
      "Baptist": "Balak urgently requests Balaam curse Israel, admitting their strength and expressing faith in Balaam's power to determine outcomes through blessings or curses.",
      "Catholic": "Balak implores Balaam to come and curse Israel, acknowledging their might and Balaam's renowned ability to effectively bless or curse.",
      "Methodist": "Balak pleads for Balaam to come curse the powerful Israelites, believing Balaam's words hold the key to blessing or cursing, thus enabling Moab's victory.",
      "Lutheran": "Balak asks Balaam to come curse Israel, admitting they are too mighty, hoping then to defeat them, acknowledging Balaam's reputed power: whom he blesses is blessed, whom he curses is cursed."
    },
    "7": {
      "General": "The elders of Moab and Midian depart with the fees for divination in their hands. They come to Balaam and deliver Balak's message.",
      "Non-Denominational": "The joint delegation travels to Balaam, carrying payment for his services, and presents Balak's request.",
      "Baptist": "The elders of Moab and Midian go to Balaam with payment ('rewards of divination') and relay Balak's message.",
      "Catholic": "The elders of Moab and Midian go to Balaam with divination fees and convey Balak's words.",
      "Methodist": "The elders of Moab and Midian travel to Balaam with payment for divination and deliver Balak's message.",
      "Lutheran": "The elders of Moab and Midian go with divination fees ('rewards of divination') to Balaam and speak Balak's words."
    },
    "8": {
      "General": "Balaam tells them, 'Spend the night here, and I will bring back word to you as the Lord speaks to me.' So the Moabite princes stay with Balaam.",
      "Non-Denominational": "Balaam asks the messengers to wait overnight while he consults the Lord (YHWH) for guidance.",
      "Baptist": "Balaam instructs them to stay the night so he can inquire of the Lord (YHWH) and report back; the Moabite princes comply.",
      "Catholic": "Balaam invites them to stay overnight while he consults the Lord (YHWH) for an answer. The Moabite princes remain.",
      "Methodist": "Balaam requests they stay overnight, promising to relay whatever the Lord (YHWH) tells him.",
      "Lutheran": "Balaam tells them to stay the night so he can ascertain what the Lord (YHWH) will say. The Moabite princes stay."
    },
    "9": {
      "General": "God comes to Balaam and asks, 'Who are these men with you?'",
      "Non-Denominational": "God engages Balaam in dialogue, inquiring about his visitors.",
      "Baptist": "God comes to Balaam and inquires about the identity of his guests.",
      "Catholic": "God comes to Balaam and asks about the identity of the men with him.",
      "Methodist": "God comes to Balaam and asks him to identify the men staying with him.",
      "Lutheran": "God comes to Balaam and asks, 'Who are these men with thee?'"
    },
    "10": {
      "General": "Balaam explains to God, 'Balak son of Zippor, king of Moab, sent them to me with this message:'",
      "Non-Denominational": "Balaam identifies the messengers and their origin, attributing the message to King Balak.",
      "Baptist": "Balaam identifies the messengers as being sent by King Balak of Moab.",
      "Catholic": "Balaam explains they were sent by Balak, king of Moab.",
      "Methodist": "Balaam answers God, identifying the messengers as envoys from Balak, king of Moab.",
      "Lutheran": "Balaam tells God that Balak king of Moab sent the men."
    },
    "11": {
      "General": "'Behold, the people who came out of Egypt cover the face of the earth. Now come and curse them for me; perhaps I will be able to fight against them and drive them out.'",
      "Non-Denominational": "Balaam relays Balak's message: describing Israel's overwhelming presence and the request for a curse to enable Moab's military success.",
      "Baptist": "Balaam repeats Balak's message to God: identifying Israel, requesting a curse, and stating the hope of defeating them.",
      "Catholic": "Balaam relays Balak's message: identifying the people from Egypt covering the land and Balak's request for a curse to enable him to fight and expel them.",
      "Methodist": "Balaam conveys Balak's message to God: noting the people from Egypt covering the land and the request to curse them for military advantage.",
      "Lutheran": "Balaam relays Balak's message: Israel covers the earth, asking Balaam to curse them so Balak might fight and drive them out."
    },
    "12": {
      "General": "But God tells Balaam, 'Do not go with them. You shall not curse the people, for they are blessed.'",
      "Non-Denominational": "God gives Balaam a clear command: refuse the journey and the curse, because Israel is divinely blessed.",
      "Baptist": "God explicitly forbids Balaam from going with them or cursing Israel, stating the reason: 'they are blessed.'",
      "Catholic": "God explicitly forbids Balaam to go with the men or curse the people, declaring them blessed.",
      "Methodist": "God clearly instructs Balaam not to go with them or curse the people, affirming that Israel is blessed.",
      "Lutheran": "God commands Balaam: 'Thou shalt not go with them; thou shalt not curse the people: for they are blessed.'"
    },
    "13": {
      "General": "The next morning, Balaam gets up and tells Balak's princes, 'Go back to your own land, for the Lord has refused to let me go with you.'",
      "Non-Denominational": "Balaam obeys, informing the princes that the Lord has denied permission for him to accompany them.",
      "Baptist": "Balaam communicates God's refusal to the princes, stating the Lord prevents him from going with them.",
      "Catholic": "In the morning, Balaam informs Balak's princes that the Lord forbids him to accompany them.",
      "Methodist": "Balaam rises and tells the princes to return home, relaying that the Lord refused him permission to go.",
      "Lutheran": "Balaam rises in the morning and tells Balak's princes the Lord refuses to let him go with them."
    },
    "14": {
      "General": "So the Moabite princes return to Balak and report, 'Balaam refused to come with us.'",
      "Non-Denominational": "The princes return and report Balaam's refusal to Balak.",
      "Baptist": "The Moabite princes return to Balak, reporting Balaam's refusal to accompany them.",
      "Catholic": "The Moabite princes return to Balak and report Balaam's refusal.",
      "Methodist": "The Moabite princes go back to Balak, reporting that Balaam refused to come.",
      "Lutheran": "The Moabite princes return to Balak and report that Balaam refused to come."
    },
    "15": {
      "General": "Balak sends princes again, more numerous and more distinguished than the first delegation.",
      "Non-Denominational": "Balak persists, sending a larger, higher-ranking delegation to persuade Balaam.",
      "Baptist": "Balak sends a second, larger, and more honorable delegation of princes to Balaam.",
      "Catholic": "Balak sends another delegation of princes, more numerous and prestigious than the first.",
      "Methodist": "Balak persists, sending more princes of higher rank than the first group.",
      "Lutheran": "Balak sends more princes, more numerous and honorable than the first group."
    },
    "16": {
      "General": "They come to Balaam and deliver Balak's message: 'Please do not let anything hinder you from coming to me.'",
      "Non-Denominational": "The second delegation delivers Balak's urgent plea for Balaam to come without hindrance.",
      "Baptist": "They present Balak's intensified plea: urging Balaam not to refuse but to come immediately.",
      "Catholic": "They deliver Balak's plea to Balaam: 'Let nothing prevent you from coming to me.'",
      "Methodist": "They convey Balak's urgent message, asking Balaam not to let anything stop him from coming.",
      "Lutheran": "They come to Balaam with Balak's message: 'Let nothing hinder thee from coming unto me.'"
    },
    "17": {
      "General": "'For I will surely reward you richly (give you great honor) and do whatever you say. Please come and curse this people for me.'",
      "Non-Denominational": "Balak significantly increases the offer, promising great honor and compliance with Balaam's demands in exchange for the curse.",
      "Baptist": "Balak offers immense honor ('promote thee unto very great honour') and promises to fulfill any request if Balaam will come and curse Israel.",
      "Catholic": "Balak promises great honor and obedience to Balaam's requests if he will only come and curse Israel.",
      "Methodist": "Balak promises extravagant rewards and obedience to Balaam's commands, urging him to come and curse Israel.",
      "Lutheran": "Balak promises great honor and obedience ('whatsoever thou sayest unto me'), pleading for Balaam to come curse Israel."
    },
    "18": {
      "General": "But Balaam answers Balak's servants, 'Even if Balak were to give me his palace full of silver and gold, I could not disobey the command of the Lord my God to do anything small or great (go beyond the word).'",
      "Non-Denominational": "Balaam verbally affirms his commitment to obey God above any earthly reward, stating he cannot transgress God's command in any way.",
      "Baptist": "Balaam professes loyalty to God, stating that even a palace full of wealth cannot make him disobey the command ('word') of the Lord his God.",
      "Catholic": "Balaam replies that even a palace full of silver and gold could not make him transgress the command of the Lord his God in any matter.",
      "Methodist": "Balaam declares to Balak's servants that even immense wealth wouldn't make him disobey the Lord his God, small or great.",
      "Lutheran": "Balaam answers Balak's servants that even a house full of silver and gold could not make him go beyond the word of the Lord his God."
    },
    "19": {
      "General": "'Now please stay here tonight as well, so that I may find out what else the Lord will say to me.'",
      "Non-Denominational": "Despite his profession, Balaam asks the second delegation to stay, indicating a desire to consult God again, perhaps hoping for a different answer.",
      "Baptist": "Despite his declaration, Balaam asks the new delegation to stay so he can inquire of the Lord again, revealing lingering desire or uncertainty.",
      "Catholic": "Balaam asks this second delegation also to stay the night, so he can learn what more the Lord might say.",
      "Methodist": "Nevertheless, Balaam asks them to stay the night also, wanting to see if God has further instructions for him.",
      "Lutheran": "Balaam asks them to stay the night also, so he can know what more the Lord will say."
    },
    "20": {
      "General": "That night God comes to Balaam and says, 'Since these men have come to summon you, rise and go with them, but do only what I tell you.'",
      "Non-Denominational": "God permits Balaam to go with the men but reiterates the strict condition: absolute obedience to His specific instructions.",
      "Baptist": "God permits Balaam to go since the men persisted, but strictly commands him again: 'only the word which I shall say unto thee, that shalt thou do.'",
      "Catholic": "God comes to Balaam at night and permits him to go if the men insist, but strictly commands him to do only what He tells him.",
      "Methodist": "God permits Balaam to go with the men who came for him, but repeats the command to only do what God tells him.",
      "Lutheran": "God comes to Balaam at night and says if the men came to call him, he may go, but must only do what God tells him."
    },
    "21": {
      "General": "Balaam gets up in the morning, saddles his donkey, and goes with the princes of Moab.",
      "Non-Denominational": "Balaam prepares and departs with the Moabite princes as permitted.",
      "Baptist": "Balaam gets up, saddles his donkey, and departs with the Moabite princes.",
      "Catholic": "Balaam rises in the morning, saddles his donkey, and leaves with the Moabite princes.",
      "Methodist": "Balaam gets up, saddles his donkey, and goes with the princes of Moab.",
      "Lutheran": "Balaam rises, saddles his donkey, and goes with the princes of Moab."
    },
    "22": {
      "General": "But God's anger burns because he is going, and the Angel of the Lord stands in the road as an adversary against him. Balaam is riding his donkey, accompanied by his two servants.",
      "Non-Denominational": "Despite granting permission, God is angry with Balaam's attitude or underlying motive, and the Angel of the Lord intercepts him.",
      "Baptist": "God's anger is kindled because Balaam went (likely due to his heart attitude/greed), and the Angel of the Lord stands in the way to oppose him.",
      "Catholic": "God's anger flares because Balaam is going, and the Angel of the Lord positions himself on the road to block him.",
      "Methodist": "God's anger is aroused because Balaam went, and the Angel of the Lord stands in the path to oppose him.",
      "Lutheran": "God's anger is kindled because Balaam went, and the Angel of the Lord stands in the way as an adversary."
    },
    "23": {
      "General": "The donkey sees the Angel of the Lord standing in the road with a drawn sword in his hand. The donkey turns off the road into a field. Balaam strikes the donkey to get it back on the road.",
      "Non-Denominational": "The donkey sees the Angel (whom Balaam cannot see) and turns aside to avoid danger, prompting Balaam to strike it.",
      "Baptist": "The donkey sees the Angel with a drawn sword and turns off the road; Balaam, not seeing the Angel, strikes the donkey.",
      "Catholic": "The donkey sees the Angel with drawn sword and turns off the road into the field; Balaam strikes the donkey to turn it back.",
      "Methodist": "The donkey sees the Angel with a drawn sword and turns off the road; Balaam, unaware, strikes the donkey to redirect it.",
      "Lutheran": "The donkey sees the Angel with a drawn sword, turns aside into a field; Balaam strikes the donkey to turn it back to the road."
    },
    "24": {
      "General": "Then the Angel of the Lord stands in a narrow path between two vineyards, with walls on both sides.",
      "Non-Denominational": "The Angel repositions himself in a narrow path where the donkey cannot easily turn aside.",
      "Baptist": "The Angel moves to a narrow path between vineyard walls, restricting movement.",
      "Catholic": "The Angel then stands in a narrow lane between vineyards, walled on both sides.",
      "Methodist": "The Angel stands in a narrow path with walls on either side, blocking the way.",
      "Lutheran": "The Angel stands in a narrow path between vineyards, with a wall on each side."
    },
    "25": {
      "General": "When the donkey sees the Angel of the Lord, it presses close to the wall, crushing Balaam's foot against it. So he strikes the donkey again.",
      "Non-Denominational": "Seeing the Angel again, the donkey presses against the wall, injuring Balaam's foot, causing Balaam to strike it again.",
      "Baptist": "The donkey sees the Angel and presses against the wall, crushing Balaam's foot; Balaam strikes it again.",
      "Catholic": "The donkey sees the Angel, scrapes against the wall crushing Balaam's foot, and Balaam strikes it again.",
      "Methodist": "The donkey, seeing the Angel, presses against the wall, crushing Balaam's foot, leading Balaam to strike it once more.",
      "Lutheran": "The donkey sees the Angel, thrusts itself against the wall crushing Balaam's foot; Balaam strikes it again."
    },
    "26": {
      "General": "The Angel of the Lord moves ahead again and stands in a narrow place where there is no room to turn, either to the right or to the left.",
      "Non-Denominational": "The Angel moves to a third position, an extremely narrow spot allowing no room to bypass.",
      "Baptist": "The Angel moves again to a very narrow place with no room to turn aside at all.",
      "Catholic": "The Angel moves further and stands in a place so narrow there is no room to turn right or left.",
      "Methodist": "The Angel moves again, standing in a narrow place with absolutely no room to pass.",
      "Lutheran": "The Angel moves further and stands in a narrow place with no room to turn right or left."
    },
    "27": {
      "General": "When the donkey sees the Angel of the Lord, it lies down under Balaam. Balaam becomes furious ('anger was kindled') and strikes the donkey with his staff.",
      "Non-Denominational": "Seeing the Angel and having nowhere to go, the donkey lies down. Balaam, still unaware, becomes angry and beats it with his staff.",
      "Baptist": "The donkey sees the Angel and lies down; Balaam, furious, beats the donkey with his staff.",
      "Catholic": "The donkey sees the Angel and lies down under Balaam; Balaam, enraged, beats the donkey with his staff.",
      "Methodist": "The donkey, seeing the Angel, lies down under Balaam, who becomes angry and hits it with his staff.",
      "Lutheran": "The donkey sees the Angel and lies down under Balaam; Balaam's anger is kindled, and he strikes the donkey with his staff."
    },
    "28": {
      "General": "Then the Lord opens the donkey's mouth, and it says to Balaam, 'What have I done to you that you have struck me these three times?'",
      "Non-Denominational": "God miraculously enables the donkey to speak, questioning Balaam about the repeated beatings.",
      "Baptist": "The Lord miraculously opens the donkey's mouth, and it questions Balaam's reason for striking it three times.",
      "Catholic": "The Lord opens the donkey's mouth, and it asks Balaam why he struck it three times.",
      "Methodist": "The Lord miraculously opens the donkey's mouth to speak, asking Balaam what it did to deserve three beatings.",
      "Lutheran": "The Lord opens the donkey's mouth, and it asks Balaam why he has struck it three times."
    },
    "29": {
      "General": "Balaam replies to the donkey, 'You have made a fool of me! If I had a sword in my hand, I would kill you right now!'",
      "Non-Denominational": "Balaam, incredibly, argues with the donkey, accusing it of mockery and expressing murderous intent.",
      "Baptist": "Balaam, in his anger, argues back with the donkey, accusing it of mocking him and wishing he could kill it.",
      "Catholic": "Balaam replies to the donkey, accusing it of making a fool of him and wishing he had a sword to kill it.",
      "Methodist": "Balaam answers the donkey, saying it mocked him and expressing a wish to kill it immediately.",
      "Lutheran": "Balaam tells the donkey it has mocked him and says he would have killed it if he had a sword."
    },
    "30": {
      "General": "The donkey says to Balaam, 'Am I not your own donkey, which you have always ridden, to this day? Have I ever been in the habit of doing this to you?' 'No,' he replies.",
      "Non-Denominational": "The donkey reasons with Balaam, appealing to its long history of faithful service and asking if this behavior is typical. Balaam acknowledges it is not.",
      "Baptist": "The donkey reminds Balaam of its lifelong faithful service and asks if it has ever behaved this way before; Balaam admits it hasn't.",
      "Catholic": "The donkey reminds Balaam of its consistent service and asks if it habitually acted this way. Balaam concedes, 'No.'",
      "Methodist": "The donkey appeals to its history of faithfulness, asking if it ever acted like this before. Balaam admits, 'No.'",
      "Lutheran": "The donkey asks Balaam if it isn't his longtime donkey and if it has ever done this before. Balaam replies, 'Nay.'"
    },
    "31": {
      "General": "Then the Lord opens Balaam's eyes, and he sees the Angel of the Lord standing in the road with his sword drawn. Balaam bows low and falls facedown.",
      "Non-Denominational": "God reveals the Angel to Balaam, who now sees the cause of the donkey's behavior and responds with fear and reverence.",
      "Baptist": "The Lord opens Balaam's eyes to see the Angel with drawn sword; Balaam immediately bows down in reverence and fear.",
      "Catholic": "The Lord opens Balaam's eyes to see the Angel with drawn sword; Balaam bows low, prostrating himself.",
      "Methodist": "Then God opens Balaam's eyes to see the Angel with the drawn sword, causing Balaam to bow down low.",
      "Lutheran": "The Lord opens Balaam's eyes; he sees the Angel with drawn sword, bows his head, and falls flat on his face."
    },
    "32": {
      "General": "The Angel of the Lord asks him, 'Why have you struck your donkey these three times? Behold, I have come out to oppose you because your way is perverse (reckless or rash) before me.'",
      "Non-Denominational": "The Angel confronts Balaam, questioning the beatings and revealing the reason for the opposition: Balaam's path was wrong in God's sight.",
      "Baptist": "The Angel questions Balaam about striking the donkey and declares he came to oppose Balaam because his path ('way') was perverse before God.",
      "Catholic": "The Angel asks why Balaam struck the donkey three times, explaining he came to block Balaam because his way was reckless ('perverse') before him.",
      "Methodist": "The Angel asks Balaam why he struck the donkey, stating he came to oppose him because his way was perverse.",
      "Lutheran": "The Angel asks why Balaam struck the donkey three times, stating he came to withstand him because his way was perverse before the Angel."
    },
    "33": {
      "General": "'The donkey saw me and turned away from me these three times. If it had not turned away, I would surely have killed you by now, but I would have spared it.'",
      "Non-Denominational": "The Angel explains the donkey saved Balaam's life by turning aside, as the Angel intended to kill Balaam but spare the donkey.",
      "Baptist": "The Angel reveals the donkey saw him and turned aside three times, saving Balaam's life, for the Angel would have killed him but spared the donkey.",
      "Catholic": "The Angel explains the donkey saw him and turned aside three times; otherwise, the Angel would have killed Balaam and spared the donkey.",
      "Methodist": "The Angel clarifies that the donkey saw him and turned aside, saving Balaam's life, as the Angel would have killed him but spared the animal.",
      "Lutheran": "The Angel states the donkey saw him and turned aside three times; if it hadn't, the Angel would have killed Balaam but saved the donkey."
    },
    "34": {
      "General": "Balaam says to the Angel of the Lord, 'I have sinned. I did not realize you were standing in the road against me. Now if you are displeased, I will go back.'",
      "Non-Denominational": "Balaam confesses his sin of ignorance and offers to return if his journey displeases the Angel (God).",
      "Baptist": "Balaam confesses his sin, admitting ignorance of the Angel's presence, and offers to turn back if the journey is wrong.",
      "Catholic": "Balaam confesses his sin to the Angel, admitting he didn't know the Angel was blocking the path, and offers to return if the journey is displeasing.",
      "Methodist": "Balaam admits his sin, pleads ignorance of the Angel's presence, and offers to go back if it displeases the Angel.",
      "Lutheran": "Balaam confesses to the Angel, 'I have sinned; for I knew not that thou stoodest in the way against me: now therefore, if it displease thee, I will get me back again.'"
    },
    "35": {
      "General": "The Angel of the Lord tells Balaam, 'Go with the men, but speak only the word that I shall speak to you.' So Balaam goes on with the princes of Balak.",
      "Non-Denominational": "The Angel reaffirms the permission to proceed but emphatically repeats the condition: speak only God's exact words. Balaam continues his journey.",
      "Baptist": "The Angel permits Balaam to continue with the men but reiterates the absolute command: speak only what God tells him. Balaam proceeds with Balak's princes.",
      "Catholic": "The Angel permits Balaam to continue with the men but commands him strictly to speak only the words God gives him. Balaam proceeds with Balak's princes.",
      "Methodist": "The Angel allows Balaam to go with the men but stresses again that he must only speak the words God gives him. Balaam continues.",
      "Lutheran": "The Angel tells Balaam, 'Go with the men: but only the word that I shall speak unto thee, that thou shalt speak.' So Balaam continues with Balak's princes."
    },
    "36": {
      "General": "When Balak hears that Balaam is coming, he goes out to meet him at a Moabite city on the Arnon border, at the edge of his territory.",
      "Non-Denominational": "Balak hears of Balaam's approach and goes to the border of Moab to personally welcome him.",
      "Baptist": "Upon hearing Balaam is coming, Balak travels to the border city on the Arnon to meet him.",
      "Catholic": "Hearing Balaam is coming, Balak goes to meet him at Ir-moab, on the Arnon border.",
      "Methodist": "Balak, hearing Balaam is near, goes out to meet him at a city on the Arnon border.",
      "Lutheran": "When Balak hears Balaam is coming, he goes out to meet him at a Moabite city on the Arnon border."
    },
    "37": {
      "General": "Balak says to Balaam, 'Did I not send messengers urgently summon you? Why didn't you come to me? Am I really not able to reward you (give you honor)?'",
      "Non-Denominational": "Balak expresses impatience at Balaam's delay and questions if Balaam doubted Balak's ability or willingness to reward him handsomely.",
      "Baptist": "Balak questions Balaam's delay, asking why he didn't come sooner and implying offense, questioning if Balaam thought Balak couldn't provide sufficient honor.",
      "Catholic": "Balak asks Balaam why he didn't come when first summoned, questioning if Balaam doubted Balak's ability to honor him.",
      "Methodist": "Balak asks Balaam why he didn't come immediately, questioning his hesitation and asserting his own ability to bestow honor.",
      "Lutheran": "Balak asks Balaam why he didn't come when first summoned, questioning, 'Am I not able indeed to promote thee to honour?'"
    },
    "38": {
      "General": "Balaam replies to Balak, 'Well, I have come to you now. But can I say just anything? I must speak only the word that God puts in my mouth.'",
      "Non-Denominational": "Balaam confirms his arrival but immediately reminds Balak of the divine restriction: he lacks the power to say anything other than what God commands.",
      "Baptist": "Balaam affirms his arrival but immediately declares his limitation: he has no power ('have I now any power at all to say any thing?') but must speak only God's word.",
      "Catholic": "Balaam replies he has come, but questions his own ability to speak freely, stating he can only utter the word God puts in his mouth.",
      "Methodist": "Balaam confirms he has arrived but immediately limits expectations, stating he can only speak the word God gives him.",
      "Lutheran": "Balaam tells Balak he has come, but asks if he has power to say anything: 'the word that God putteth in my mouth, that shall I speak.'"
    },
    "39": {
      "General": "Then Balaam goes with Balak, and they come to Kiriath-huzoth (City of Streets).",
      "Non-Denominational": "Balaam accompanies Balak to Kiriath-huzoth.",
      "Baptist": "Balaam goes with Balak to the city of Kiriath-huzoth.",
      "Catholic": "Balaam accompanies Balak to Kiriath-huzoth.",
      "Methodist": "Balaam goes with Balak to Kiriath-huzoth.",
      "Lutheran": "Balaam goes with Balak to Kiriath-huzoth."
    },
    "40": {
      "General": "Balak sacrifices cattle and sheep and sends portions to Balaam and the princes who are with him.",
      "Non-Denominational": "Balak offers sacrifices and shares the sacrificial meal with Balaam and the accompanying princes, likely as part of the welcoming or preparation ritual.",
      "Baptist": "Balak sacrifices oxen and sheep, sharing the meat with Balaam and the princes, likely initiating the process to seek the curse.",
      "Catholic": "Balak sacrifices cattle and sheep, sending portions to Balaam and the princes with him.",
      "Methodist": "Balak sacrifices cattle and sheep, sending some to Balaam and the princes with him.",
      "Lutheran": "Balak sacrifices oxen and sheep, sending portions to Balaam and the princes."
    },
    "41": {
      "General": "The next morning, Balak takes Balaam up to Bamoth-baal (High Places of Baal), and from there Balaam sees a portion of the Israelite camp.",
      "Non-Denominational": "Balak takes Balaam to a high place dedicated to Baal worship, providing a vantage point to view part of the Israelite encampment, setting the stage for the curse.",
      "Baptist": "Balak takes Balaam to the high places of Baal, a pagan worship site, allowing him to see the edge of the Israelite camp to begin the cursing ritual.",
      "Catholic": "In the morning, Balak takes Balaam up to Bamoth-baal, from where he can see the edge of the Israelite camp.",
      "Methodist": "The next morning, Balak takes Balaam to the high places of Baal, from which Balaam sees the outskirts of the Israelite camp.",
      "Lutheran": "In the morning, Balak takes Balaam up to the high places of Baal, from where he sees the edge of the Israelite camp."
    }
  }
}
