{
  "Summary": {
    "General": "Balaam instructs Balak to build seven altars and prepare seven bulls and seven rams for sacrifice at Bamoth-baal. After the sacrifices, Balaam goes aside to seek a word from the Lord. God meets Balaam and gives him a message. Balaam returns to Balak and the Moabite princes and delivers his first oracle: He cannot curse whom God has not cursed. He describes Israel as a people dwelling apart, not reckoned among the nations, and declares their immense population ('Who can count the dust of Jacob?'). He concludes by wishing his own end might be like that of the righteous Israelites. Balak complains that Balaam has blessed Israel instead of cursing them. Balaam reminds him he must speak what the Lord provides. Balak then takes Balaam to the field of Zophim on Mount Pisgah, builds another seven altars, and offers sacrifices. Balaam again seeks the Lord. God meets him and puts another word in his mouth. Balaam delivers his second oracle: God is not human that He should lie or change His mind; He has blessed Israel, and Balaam cannot reverse it. He declares there is no misfortune or trouble ('iniquity' or 'perverseness') seen in Israel by God (in the sense of allowing a curse), that the Lord their God is with them, acclaimed as King. God brought them from Egypt with strength like a wild ox. He states definitively that no sorcery ('enchantment') or divination can prevail against Israel, and marvels at what God has wrought for them. He prophesies Israel's lion-like strength, consuming its enemies. Balak tells Balaam to stop – neither curse nor bless them at all. Balaam again reiterates he can only speak what the Lord says.",
    "Non-Denominational": "Focuses on God's overruling power, turning Balaam's intended curse into powerful blessings for Israel. Despite Balak's pagan rituals and repeated attempts from different locations, God dictates Balaam's words. The oracles highlight Israel's divine blessing, separation, vastness, God's faithfulness, His presence with them, their invincibility against sorcery, and their ultimate triumph. Balaam, though hired to curse, becomes an instrument proclaiming God's unchangeable purpose for His people.",
    "Baptist": "Emphasizes God's sovereign determination to bless Israel, thwarting Balak's efforts and Balaam's probable desire for reward. The pagan sacrifices are ineffective against God's will. Balaam's oracles powerfully declare God's unchanging nature ('God is not a man, that he should lie'), His irreversible blessing upon Israel, His presence as their King, their protection from demonic powers ('enchantment'), and their future strength. The story demonstrates God's faithfulness to His covenant people despite opposition.",
    "Catholic": "Highlights the futility of Balak's attempts to manipulate supernatural forces against God's chosen people. The sacrifices offered are pagan rites. God directly intervenes, giving Balaam specific pronouncements (oracles) that bless Israel. These oracles emphasize God's fidelity ('God is not human that he should lie'), His unique relationship with Israel (dwelling apart, God with them), their protection from occult powers, and their divine destiny. Balaam acts as a prophet compelled by God to speak truth, demonstrating God's sovereignty over prophecy and divination.",
    "Methodist": "Focuses on God's unwavering commitment to bless Israel, overriding human schemes and even the prophet's own inclinations. Balak's rituals fail to produce the desired curse. God gives Balaam words of blessing instead, emphasizing Israel's unique status, God's steadfastness ('He hath blessed, and I cannot reverse it'), His protective presence, and their immunity to sorcery. This demonstrates God's sovereign grace and power working through prophecy to affirm His positive intentions for His people.",
    "Lutheran": "Sees God's Word triumphing over human attempts at manipulation and cursing. Balak's works-based approach (sacrifices) is useless against God's declared blessing (Gospel). Balaam is constrained by God's Word. The oracles declare key truths: God's faithfulness and immutability, His gracious election and blessing of Israel (prefiguring the Church), His presence ('shout of a king'), and protection from evil forces ('no enchantment'). This reveals God's sovereign grace and power to preserve His people and ensure His promises prevail."
  },
  "Verses": {
    "1": {
      "General": "Balaam tells Balak, 'Build me seven altars here, and prepare seven bulls and seven rams for me.'",
      "Non-Denominational": "Balaam directs Balak to prepare a specific sacrificial setup (seven altars, bulls, rams) before attempting divination.",
      "Baptist": "Balaam instructs Balak to set up seven altars and prepare specific sacrifices (seven bulls, seven rams), initiating the ritual process.",
      "Catholic": "Balaam instructs Balak to build seven altars and prepare seven bulls and seven rams, likely mimicking some Israelite practices or following pagan ritual.",
      "Methodist": "Balaam instructs Balak on the ritual preparations needed: seven altars, seven bulls, seven rams.",
      "Lutheran": "Balaam tells Balak to build seven altars and prepare seven bulls and seven rams."
    },
    "2": {
      "General": "Balak does as Balaam instructs and offers a bull and a ram on each altar, together with Balaam.",
      "Non-Denominational": "Balak complies, and they jointly perform the sacrifices on the seven altars.",
      "Baptist": "Balak obeys Balaam, and together they offer the sacrifices (bull and ram) on each of the seven altars.",
      "Catholic": "Balak follows Balaam's instructions, and they jointly offer a bull and a ram on each altar.",
      "Methodist": "Balak does as instructed, and he and Balaam offer a bull and ram on every altar.",
      "Lutheran": "Balak obeys Balaam, and Balak and Balaam offer a bull and a ram on each altar."
    },
    "3": {
      "General": "Balaam tells Balak, 'Stand here by your burnt offering while I go; perhaps the Lord will come to meet me. Whatever He shows me, I will tell you.' Then Balaam goes off to a barren height.",
      "Non-Denominational": "Balaam instructs Balak to wait by the sacrifice while he goes alone to seek a divine revelation from the Lord (YHWH).",
      "Baptist": "Balaam tells Balak to wait while he goes apart to seek a meeting with the Lord (YHWH), promising to report whatever God reveals.",
      "Catholic": "Balaam instructs Balak to wait by the offering while he seeks an encounter with the Lord (YHWH), promising to report any revelation. He goes to a bare height.",
      "Methodist": "Balaam directs Balak to stay by the offering while he goes to see if the Lord (YHWH) will meet him, promising to report back.",
      "Lutheran": "Balaam tells Balak to stand by the offering while he goes, hoping the Lord (YHWH) will meet him, promising to report what God shows him. He goes to a high place."
    },
    "4": {
      "General": "God meets Balaam, and Balaam says to Him, 'I have prepared the seven altars and offered a bull and a ram on each altar.'",
      "Non-Denominational": "God indeed meets Balaam, who reports the completion of the sacrificial preparations.",
      "Baptist": "God meets Balaam, and Balaam informs Him about the seven altars and sacrifices prepared.",
      "Catholic": "God meets Balaam, who informs Him of the seven altars prepared and the sacrifices offered.",
      "Methodist": "God meets Balaam, and Balaam reports that he has prepared the seven altars and sacrifices.",
      "Lutheran": "God meets Balaam, who reports, 'I have prepared seven altars, and offered a bull and ram on every altar.'"
    },
    "5": {
      "General": "The Lord puts a message (word) in Balaam's mouth and tells him, 'Return to Balak and speak this message.'",
      "Non-Denominational": "God gives Balaam the specific message to deliver and instructs him to return and speak it to Balak.",
      "Baptist": "The Lord gives Balaam the exact words to speak and commands him to return to Balak and deliver that message.",
      "Catholic": "The Lord puts a message in Balaam's mouth and instructs him to return to Balak and deliver it.",
      "Methodist": "God puts the message directly into Balaam's mouth and tells him to return to Balak and speak it.",
      "Lutheran": "The Lord puts a word in Balaam's mouth and tells him to return to Balak and speak thus."
    },
    "6": {
      "General": "So Balaam returns to Balak, finding him standing by his burnt offering with all the princes of Moab.",
      "Non-Denominational": "Balaam returns and finds Balak and the Moabite princes waiting by the sacrifice as instructed.",
      "Baptist": "Balaam returns to Balak, who is waiting beside the offering along with the Moabite princes.",
      "Catholic": "Balaam returns to Balak, finding him standing beside his offering with all the Moabite princes.",
      "Methodist": "Balaam goes back to Balak, finding him and the Moabite princes standing by the offering.",
      "Lutheran": "Balaam returns to Balak, who is standing by his burnt offering with all the princes of Moab."
    },
    "7": {
      "General": "Then Balaam speaks his oracle (parable/prophetic utterance): 'Balak brought me from Aram, the king of Moab from the eastern mountains, saying, \"Come, curse Jacob for me; Come, denounce Israel!\"'",
      "Non-Denominational": "Balaam begins his first oracle, recounting Balak's summons from Aram to curse Jacob/Israel.",
      "Baptist": "Balaam delivers his first oracle (parable), stating Balak summoned him from Aram to curse Jacob and denounce Israel.",
      "Catholic": "Balaam delivers his first oracle, stating Balak summoned him from Aram to curse Jacob and denounce Israel.",
      "Methodist": "Balaam begins his prophetic utterance, stating Balak brought him from the east to curse Jacob and denounce Israel.",
      "Lutheran": "Balaam delivers his first oracle (parable), stating Balak brought him from Aram/eastern mountains to curse Jacob and defy Israel."
    },
    "8": {
      "General": "'How can I curse whom God has not cursed? How can I denounce whom the Lord has not denounced?'",
      "Non-Denominational": "Balaam declares his inability to curse Israel because God Himself has not cursed them.",
      "Baptist": "Balaam declares his powerlessness: he cannot curse those whom God has not cursed or denounce those God has not denounced.",
      "Catholic": "Balaam asks rhetorically how he can curse those God hasn't cursed or denounce those the Lord hasn't denounced.",
      "Methodist": "Balaam questions his ability to curse, stating he cannot curse whom God hasn't cursed or denounce whom the Lord hasn't denounced.",
      "Lutheran": "Balaam asks, 'How shall I curse, whom God hath not cursed? or how shall I defy, whom the Lord hath not defied?'"
    },
    "9": {
      "General": "'From the rocky peaks I see them, from the heights I view them. Behold, a people dwelling alone, not reckoning itself among the nations!'",
      "Non-Denominational": "From his vantage point, Balaam sees Israel as a distinct people, set apart and not counted among the other nations.",
      "Baptist": "Balaam describes Israel as a unique people dwelling apart, distinct from and not numbered among the other nations.",
      "Catholic": "Balaam observes Israel from the heights, describing them as a people dwelling apart, not counted among the nations.",
      "Methodist": "Balaam describes Israel as a people living apart, distinct and separate from other nations.",
      "Lutheran": "Balaam sees Israel from the heights as a people dwelling alone, not reckoned among the nations."
    },
    "10": {
      "General": "'Who can count the dust of Jacob, or number the fourth part (or multitude) of Israel? Let me die the death of the righteous, and may my final end be like theirs!'",
      "Non-Denominational": "Balaam marvels at Israel's immense population and expresses a desire to share their blessed destiny, dying as one of the righteous.",
      "Baptist": "Balaam exclaims over Israel's vast numbers ('dust of Jacob') and wishes his own death could be like that of the righteous Israelites.",
      "Catholic": "Balaam marvels at Israel's vast population ('dust of Jacob') and expresses a wish to die the death of the upright (righteous) Israelites.",
      "Methodist": "Balaam is amazed at Israel's vast numbers ('dust of Jacob') and wishes his own end could be like that of these righteous people.",
      "Lutheran": "Balaam asks who can count Israel's multitudes ('dust of Jacob', 'fourth part of Israel') and wishes, 'Let me die the death of the righteous, and let my last end be like his!'"
    },
    "11": {
      "General": "Balak says to Balaam, 'What have you done to me? I brought you to curse my enemies, but behold, you have done nothing but bless them!'",
      "Non-Denominational": "Balak expresses frustration and anger, accusing Balaam of completely reversing the intended outcome by blessing instead of cursing.",
      "Baptist": "Balak confronts Balaam angrily, accusing him of blessing his enemies instead of cursing them as requested.",
      "Catholic": "Balak reproaches Balaam, stating he brought him to curse enemies, but Balaam has only blessed them.",
      "Methodist": "Balak questions Balaam, complaining that he brought him to curse enemies, but Balaam has instead blessed them entirely.",
      "Lutheran": "Balak asks Balaam what he has done, complaining he brought him to curse his enemies, but Balaam has blessed them."
    },
    "12": {
      "General": "Balaam replies, 'Must I not take care to speak what the Lord puts in my mouth?'",
      "Non-Denominational": "Balaam defends himself by reiterating his divine obligation to speak only the words given to him by the Lord.",
      "Baptist": "Balaam justifies his words by asking rhetorically if he isn't obligated to speak only what the Lord puts in his mouth.",
      "Catholic": "Balaam replies, asking if he must not be careful to speak only what the Lord puts in his mouth.",
      "Methodist": "Balaam responds by asking if he isn't required to speak exactly what the Lord puts in his mouth.",
      "Lutheran": "Balaam answers, 'Must I not take heed to speak that which the Lord hath put in my mouth?'"
    },
    "13": {
      "General": "Balak says to him, 'Please come with me to another place from which you can see them; you will see only the outskirts of their camp and not all of them. Curse them for me from there.'",
      "Non-Denominational": "Balak, undeterred, suggests moving to a different vantage point, hoping a partial view of Israel might allow for a curse.",
      "Baptist": "Balak proposes trying again from a different location, hoping that seeing only a part of Israel might enable Balaam to curse them.",
      "Catholic": "Balak asks Balaam to come to another place where he can see only the edge of the camp, hoping he can curse them from there.",
      "Methodist": "Balak suggests moving to another spot where only a part of Israel is visible, hoping Balaam can curse them from there.",
      "Lutheran": "Balak suggests moving to another place to see only the edge of the camp, hoping Balaam can curse them from there."
    },
    "14": {
      "General": "So Balak takes Balaam to the field of Zophim (Field of Watchmen) on the top of Mount Pisgah. He builds seven altars and offers a bull and a ram on each altar.",
      "Non-Denominational": "Balak leads Balaam to Mount Pisgah, repeats the sacrificial ritual with seven altars, bulls, and rams.",
      "Baptist": "Balak takes Balaam to the field of Zophim atop Mount Pisgah and repeats the construction of seven altars and the sacrifices.",
      "Catholic": "Balak takes Balaam to the Field of Watchmen on Mount Pisgah, builds seven altars, and offers a bull and ram on each.",
      "Methodist": "Balak brings Balaam to the field of Zophim on Pisgah, builds seven altars again, and offers the sacrifices.",
      "Lutheran": "Balak takes Balaam to the field of Zophim, atop Pisgah, builds seven altars, and offers a bull and ram on each."
    },
    "15": {
      "General": "Balaam tells Balak, 'Stand here by your burnt offering while I go over there to meet the Lord.'",
      "Non-Denominational": "Again, Balaam instructs Balak to wait by the sacrifices while he seeks a divine encounter.",
      "Baptist": "Balaam again tells Balak to wait by the offering while he goes to seek the Lord.",
      "Catholic": "Balaam tells Balak to wait by the offering while he goes to seek an encounter.",
      "Methodist": "Balaam again tells Balak to stand by the offering while he goes to meet the Lord.",
      "Lutheran": "Balaam tells Balak to stand by the offering while he meets [the Lord] yonder."
    },
    "16": {
      "General": "The Lord meets Balaam and puts a message in his mouth, saying, 'Return to Balak and speak this message.'",
      "Non-Denominational": "God meets Balaam again, provides the second message, and instructs him to deliver it to Balak.",
      "Baptist": "The Lord meets Balaam again, gives him the words to speak, and commands him to return to Balak.",
      "Catholic": "The Lord meets Balaam, puts a message in his mouth, and tells him to return to Balak and speak.",
      "Methodist": "God meets Balaam, puts a message in his mouth, and instructs him to return and speak to Balak.",
      "Lutheran": "The Lord meets Balaam, puts a word in his mouth, and tells him to return to Balak and speak thus."
    },
    "17": {
      "General": "When Balaam comes to him, he finds Balak standing by his burnt offering with the princes of Moab. Balak asks him, 'What has the Lord said?'",
      "Non-Denominational": "Balaam returns to find Balak and the princes waiting; Balak eagerly asks for the Lord's message.",
      "Baptist": "Balaam finds Balak and the princes waiting; Balak immediately asks what the Lord has spoken.",
      "Catholic": "Balaam returns to find Balak and the princes by the offering; Balak asks what the Lord has said.",
      "Methodist": "Balaam comes back to Balak and the princes by the offering, and Balak asks what the Lord said.",
      "Lutheran": "Balaam comes to Balak, finds him by the offering with the princes, and Balak asks, 'What hath the Lord spoken?'"
    },
    "18": {
      "General": "Then Balaam speaks his oracle: 'Rise up, Balak, and listen! Hear me, son of Zippor!'",
      "Non-Denominational": "Balaam begins his second oracle, commanding Balak's full attention.",
      "Baptist": "Balaam delivers his second oracle, calling for Balak's attention.",
      "Catholic": "Balaam delivers his second oracle, demanding Balak's attention.",
      "Methodist": "Balaam starts his second prophetic utterance, calling Balak to rise and listen.",
      "Lutheran": "Balaam delivers his second oracle (parable): 'Rise up, Balak, and hear; hearken unto me, thou son of Zippor.'"
    },
    "19": {
      "General": "'God is not a man, that He should lie, nor a son of man, that He should change His mind. Does He speak and then not act? Does He promise and not fulfill?'",
      "Non-Denominational": "Declares God's absolute truthfulness and immutability, contrasting Him with fallible humans; His words and promises are certain.",
      "Baptist": "Contrasts God's perfect character with human fallibility: God does not lie or change His mind ('repent'); His promises are always fulfilled.",
      "Catholic": "Asserts God's immutability and faithfulness: He is not human to lie or change His mind; His promises are always fulfilled.",
      "Methodist": "Emphasizes God's unchanging nature and reliability: unlike humans, God does not lie or change His mind; He fulfills His promises.",
      "Lutheran": "Declares God's faithfulness: 'God is not a man, that he should lie; neither the son of man, that he should repent: hath he said, and shall he not do it? or hath he spoken, and shall he not make it good?'"
    },
    "20": {
      "General": "'Behold, I have received a command to bless; He has blessed, and I cannot revoke it.'",
      "Non-Denominational": "Balaam explicitly states his divine commission is to bless Israel, and God's blessing is irreversible.",
      "Baptist": "Balaam states he received a command to bless, and since God has blessed, Balaam cannot reverse it.",
      "Catholic": "Balaam states he has been commanded to bless, and since God has blessed, Balaam cannot revoke it.",
      "Methodist": "Balaam confirms his command is to bless, and God's blessing is unchangeable by him.",
      "Lutheran": "Balaam states, 'Behold, I have received commandment to bless: and he hath blessed; and I cannot reverse it.'"
    },
    "21": {
      "General": "'No misfortune (iniquity/idolatry) is observed in Jacob, nor is trouble (perverseness/misery) seen in Israel. The Lord their God is with them; the shout of a King is among them.'",
      "Non-Denominational": "Declares Israel's divinely protected state (no effective curse/misfortune can take hold), God's presence with them, and their acclamation of Him as King.",
      "Baptist": "States God sees no iniquity or perverseness in Israel (in a way that warrants cursing), affirms the Lord's presence, and declares the 'shout of a king' (God's kingship/triumph) is among them.",
      "Catholic": "Declares God perceives no iniquity or trouble in Jacob/Israel (rendering them immune to curses); the Lord their God is with them, acclaimed as their King.",
      "Methodist": "States no misfortune or trouble is seen in Israel (from God's perspective regarding curses), affirms God's presence, and the joyful 'shout of a King' among them.",
      "Lutheran": "Declares God has not beheld iniquity/perverseness in Jacob/Israel; the Lord their God is with them, and the shout of a king is among them."
    },
    "22": {
      "General": "'God brought them out of Egypt; they have the strength like that of a wild ox.'",
      "Non-Denominational": "Recalls the Exodus and attributes immense, untamable strength (like a wild ox) to Israel because of God's power.",
      "Baptist": "Reminds of the Exodus and describes Israel's God-given strength as being like that of a powerful wild ox ('unicorn' in KJV).",
      "Catholic": "Recalls God bringing Israel from Egypt, possessing strength comparable to a wild ox.",
      "Methodist": "Highlights the Exodus and Israel's God-given strength, likened to that of a wild ox.",
      "Lutheran": "States God brought them from Egypt, possessing strength like a wild ox ('unicorn' KJV)."
    },
    "23": {
      "General": "'Surely there is no enchantment against Jacob, nor any divination against Israel. Now it will be said of Jacob and Israel, \"See what God has done!\"'",
      "Non-Denominational": "Declares the futility of sorcery or divination against Israel, prophesying that observers will marvel at God's work on their behalf.",
      "Baptist": "Asserts the complete ineffectiveness of sorcery ('enchantment') or divination against God's people; instead, people will marvel at God's actions for Israel.",
      "Catholic": "Declares that no omen or divination works against Jacob/Israel; rather, people will remark on God's wondrous deeds for them.",
      "Methodist": "States definitively that no enchantment or divination can succeed against Israel; people will instead remark on God's mighty deeds for them.",
      "Lutheran": "Declares, 'Surely there is no enchantment against Jacob, neither is there any divination against Israel:' It shall be said of them, 'What hath God wrought!'"
    },
    "24": {
      "General": "'Behold, the people rise like a lioness; they rouse themselves like a lion! They will not lie down until they consume the prey and drink the blood of the slain.'",
      "Non-Denominational": "Compares Israel to a powerful lion/lioness that rises, conquers its enemies completely, and rests only after total victory.",
      "Baptist": "Likens Israel to a lion/lioness rising powerfully, not resting until it has devoured its prey (conquered its enemies).",
      "Catholic": "Compares Israel to a lion/lioness rising for the prey, not resting until it has devoured it and drunk the blood of the slain (total victory).",
      "Methodist": "Likens the people to a lion and lioness rising, who won't rest until they have consumed their prey and drunk the blood of the slain.",
      "Lutheran": "Compares the people to a great lion/lioness that will not rest until it eats the prey and drinks the blood of the slain."
    },
    "25": {
      "General": "Then Balak says to Balaam, 'Neither curse them at all nor bless them at all!'",
      "Non-Denominational": "Frustrated, Balak tells Balaam to simply say nothing – neither curse nor bless.",
      "Baptist": "In exasperation, Balak tells Balaam to cease entirely – neither curse nor bless them.",
      "Catholic": "Balak tells Balaam to refrain completely – neither curse nor bless them.",
      "Methodist": "Balak tells Balaam to do neither – don't curse them, but also don't bless them.",
      "Lutheran": "Balak tells Balaam, 'Neither curse them at all, nor bless them at all.'"
    },
    "26": {
      "General": "But Balaam answers Balak, 'Did I not tell you, \"All that the Lord speaks, that I must do\"?'",
      "Non-Denominational": "Balaam again points to his prior statement: he is bound to speak only what the Lord commands.",
      "Baptist": "Balaam reminds Balak of his previous declaration: he must do exactly what the Lord speaks.",
      "Catholic": "Balaam reminds Balak of his previous statement: 'All that the Lord speaks, I must do.'",
      "Methodist": "Balaam reminds Balak again that he already told him he must speak whatever the Lord says.",
      "Lutheran": "Balaam reminds Balak, 'Told not I thee, saying, All that the Lord speaketh, that I must do?'"
    },
    "27": {
      "General": "Balak says to Balaam, 'Come now, I will take you to another place. Perhaps it will please God ('peradventure it will please God') that you may curse them for me from there.'",
      "Non-Denominational": "Balak makes a third attempt, suggesting another location, still hoping God might permit a curse from a different perspective.",
      "Baptist": "Balak persists, suggesting a third location, superstitiously hoping God might allow a curse from there.",
      "Catholic": "Balak suggests trying yet another place, hoping God might perhaps permit a curse from there.",
      "Methodist": "Balak tries again, suggesting another place, hoping maybe God will allow a curse from there.",
      "Lutheran": "Balak suggests trying another place, saying, 'Peradventure it will please God that thou mayest curse me them from thence.'"
    },
    "28": {
      "General": "So Balak takes Balaam to the top of Peor, which overlooks the wasteland (Jeshimon).",
      "Non-Denominational": "Balak leads Balaam to the summit of Peor, another vantage point overlooking the wilderness where Israel is camped.",
      "Baptist": "Balak takes Balaam to the top of Mount Peor, which overlooks the desert wilderness.",
      "Catholic": "Balak takes Balaam to the top of Mount Peor, overlooking the wasteland.",
      "Methodist": "Balak brings Balaam to the top of Peor, which overlooks the desert.",
      "Lutheran": "Balak brings Balaam to the top of Peor, overlooking Jeshimon (the wasteland)."
    },
    "29": {
      "General": "Balaam tells Balak, 'Build me seven altars here and prepare seven bulls and seven rams for me.'",
      "Non-Denominational": "For the third time, Balaam instructs Balak to prepare the seven altars and specific sacrifices.",
      "Baptist": "Balaam repeats the instruction for the third time: build seven altars and prepare seven bulls and seven rams.",
      "Catholic": "Balaam again instructs Balak to build seven altars and prepare seven bulls and seven rams.",
      "Methodist": "Balaam gives the same instructions again: build seven altars and prepare seven bulls and rams.",
      "Lutheran": "Balaam again tells Balak to build seven altars and prepare seven bulls and seven rams."
    },
    "30": {
      "General": "Balak does as Balaam says and offers a bull and a ram on each altar.",
      "Non-Denominational": "Balak complies, performing the sacrificial ritual for the third time.",
      "Baptist": "Balak obeys Balaam again, offering the bull and ram on each of the seven altars.",
      "Catholic": "Balak follows Balaam's instructions, offering a bull and ram on each altar.",
      "Methodist": "Balak does as Balaam instructs, offering a bull and ram on each altar once more.",
      "Lutheran": "Balak does as Balaam had said, offering a bull and a ram on every altar."
    }
  }
}
