{
  "Summary": {
    "General": "Seeing that it pleased the Lord to bless Israel, Balaam stops using sorcery ('enchantments') and turns his face toward the wilderness where Israel is camped. The Spirit of God comes upon him, and he delivers his third oracle. He describes the beauty and fruitfulness of Israel's tents and dwelling places, comparing them to valleys, gardens, aloe trees, and cedars beside waters. He prophesies Israel's king will be higher than Agag (perhaps an Amalekite king or title) and his kingdom exalted. He repeats the imagery of God bringing Israel from Egypt with the strength of a wild ox, consuming enemy nations, breaking their bones, and piercing them with arrows. He concludes, 'Blessed is he who blesses you, and cursed is he who curses you.' Balak, enraged, strikes his hands together, dismisses Balaam for blessing Israel three times instead of cursing, and refuses payment. Balaam reminds Balak he had warned him he could only speak God's word. Balaam then volunteers a final prophecy ('advertise thee') about what Israel will do to Moab in the 'latter days.' He delivers his fourth oracle, predicting the rise of a Star from Jacob and a Sceptre from Israel that will crush the corners (leaders/borders) of Moab and destroy the descendants of Sheth. He also foretells the conquest of Edom and Seir, Israel's strength, and the destruction of Amalek ('first of the nations' to attack Israel, but doomed to perish) and the Kenites (despite their secure dwelling).",
    "Non-Denominational": "Focuses on the irresistible power of God's Spirit compelling Balaam to bless Israel, overriding Balak's intentions. Balaam abandons divination and, under divine influence, delivers prophecies of Israel's beauty, prosperity, strength, and ultimate victory over enemies, including a significant prophecy about a future Star and Sceptre from Jacob who will rule and conquer (often seen as pointing towards David or ultimately the Messiah). Balak's anger contrasts with God's determined blessing. The chapter affirms God's sovereign plan for Israel and His ability to use even unwilling agents.",
    "Baptist": "Emphasizes the sovereignty of God's blessing and the work of the Holy Spirit. Balaam, under the Spirit's control, cannot curse but must bless. The oracles describe Israel's God-given prosperity, security, and future dominance. The prophecy of the Star and Sceptre is viewed as a significant Messianic prophecy, foretelling the coming King (Christ) from Jacob who will judge the nations (Moab, Edom, etc.). Balak's fury highlights the world's futile opposition to God's plan. The blessings affirm God's covenant faithfulness.",
    "Catholic": "Highlights the prophetic nature of Balaam's oracles under the influence of the Spirit of God. He is compelled to speak blessings, describing Israel's flourishing and divinely granted power. The prophecy of the Star out of Jacob and the Sceptre from Israel is traditionally seen as a key Messianic prophecy foretelling Christ's coming, His kingship, and His victory over hostile powers (Moab, Edom). Balak's rejection and Balaam's final prophecies against other nations underscore the theme of divine judgment against those opposing God's people.",
    "Methodist": "Focuses on the manifest power of the Spirit of God overcoming Balaam's own will and Balak's desires. Balaam, no longer seeking omens, becomes a true mouthpiece for God, prophesying Israel's beauty, strength, and enduring blessing. The Star and Sceptre prophecy points to future righteous leadership and victory, often understood in a Messianic sense. Balak's anger and dismissal show human resistance to God's declared will. The final oracles against surrounding nations reinforce God's sovereignty over all peoples.",
    "Lutheran": "Sees the Holy Spirit compelling Balaam to speak God's Word of blessing, demonstrating that God's plan cannot be thwarted by human schemes or pagan practices. The content of the blessings focuses on Israel's God-given prosperity, strength, and distinct status. The Star and Sceptre prophecy is understood Christologically, pointing to Christ as the true King who arises from Israel to crush God's enemies and establish His kingdom. The oracles against the nations show God's ultimate judgment upon those who oppose His people and plan."
  },
  "Verses": {
    "1": {
      "General": "When Balaam sees that it pleases the Lord to bless Israel, he stops going to seek enchantments (omens/sorcery) as he had done before, and instead sets his face toward the wilderness (where Israel is camped).",
      "Non-Denominational": "Balaam recognizes God's firm intention to bless Israel and abandons his attempts at divination, turning directly towards Israel.",
      "Baptist": "Realizing God intends only blessing for Israel, Balaam ceases seeking omens and directly faces the Israelite camp.",
      "Catholic": "Balaam, seeing the Lord is pleased to bless Israel, abandons seeking omens and turns towards the wilderness camp.",
      "Methodist": "Recognizing God's pleasure in blessing Israel, Balaam stops using enchantments and turns his focus towards the wilderness camp.",
      "Lutheran": "When Balaam sees it pleases the Lord to bless Israel, he stops seeking enchantments and sets his face toward the wilderness."
    },
    "2": {
      "General": "Balaam lifts his eyes and sees Israel camping tribe by tribe; and the Spirit of God comes upon him.",
      "Non-Denominational": "As Balaam observes the orderly Israelite camp, the Spirit of God empowers him for prophecy.",
      "Baptist": "Looking upon the Israelites camped in tribal order, Balaam is empowered by the Spirit of God.",
      "Catholic": "Balaam sees Israel encamped by tribes, and the Spirit of God comes upon him.",
      "Methodist": "As Balaam looks and sees Israel camped by tribes, the Spirit of God comes upon him.",
      "Lutheran": "Balaam lifts his eyes, sees Israel camping by tribes, and the Spirit of God comes upon him."
    },
    "3": {
      "General": "He takes up his oracle (parable) and says: 'The utterance of Balaam son of Beor, the utterance of the man whose eyes are opened (or closed/unveiled),'",
      "Non-Denominational": "Balaam begins his third oracle, identifying himself and describing himself as one whose eyes are now truly opened.",
      "Baptist": "Balaam delivers his third oracle (parable), identifying himself as the man whose eyes are now opened (spiritually illumined).",
      "Catholic": "He delivers his oracle: 'The utterance of Balaam son of Beor, the utterance of the man whose eye is true (or opened),'",
      "Methodist": "He begins his prophetic utterance, identifying himself as Balaam, the man whose eyes have been opened.",
      "Lutheran": "He takes up his oracle (parable): 'The utterance of Balaam son of Beor, the utterance of the man whose eyes are open.'"
    },
    "4": {
      "General": "'The utterance of him who hears the words of God, who sees the vision of the Almighty, falling down, but having his eyes uncovered (open).'",
      "Non-Denominational": "He further describes himself as one who hears God's words and sees visions from the Almighty, even while in a state of prophetic trance ('falling down').",
      "Baptist": "He identifies himself as one hearing God's words and seeing visions from the Almighty, in a trance-like state with eyes open.",
      "Catholic": "'The utterance of one who hears God's words, sees the vision of the Almighty, falling into a trance, but with eyes open.'",
      "Methodist": "He describes himself as hearing God's words, seeing the Almighty's vision, falling down yet with eyes open.",
      "Lutheran": "'The utterance of him who heard God's words, saw the Almighty's vision, falling [into a trance], but having his eyes open.'"
    },
    "5": {
      "General": "'How beautiful are your tents, O Jacob, your dwelling places, O Israel!'",
      "Non-Denominational": "The oracle begins with admiration for the beauty and orderliness of Israel's encampment.",
      "Baptist": "Expresses admiration for the beauty ('goodly') of Jacob's tents and Israel's dwellings.",
      "Catholic": "Extols the beauty of Jacob's tents and Israel's encampments.",
      "Methodist": "Admires the beauty of Jacob's tents and Israel's dwellings.",
      "Lutheran": "Exclaims, 'How goodly are thy tents, O Jacob, and thy tabernacles, O Israel!'"
    },
    "6": {
      "General": "'Like valleys they spread out, like gardens beside a river, like aloe trees planted by the Lord, like cedars beside the waters.'",
      "Non-Denominational": "Uses metaphors of fertile, well-watered, divinely planted gardens and strong trees to describe Israel's flourishing state.",
      "Baptist": "Compares Israel's flourishing to spreading valleys, riverside gardens, and strong trees (aloes, cedars) planted by God near water.",
      "Catholic": "Compares their spread to valleys, riverside gardens, aloes planted by the Lord, and cedars by the water, signifying beauty and vitality.",
      "Methodist": "Likens their encampments to fertile valleys, riverside gardens, and enduring trees planted by God near water.",
      "Lutheran": "Compares them to spreading valleys, riverside gardens, aloe trees planted by the Lord, and cedars beside waters."
    },
    "7": {
      "General": "'Water shall flow from his buckets; his seed shall be in many waters. His king shall be higher than Agag; his kingdom shall be exalted.'",
      "Non-Denominational": "Prophesies Israel's abundance (water/prosperity), widespread influence ('seed in many waters'), and a future king surpassing Agag, with an exalted kingdom.",
      "Baptist": "Prophesies Israel's abundance ('water from buckets'), prolific posterity ('seed beside many waters'), and a future king greater than Agag (prominent Amalekite king/title), with an exalted kingdom.",
      "Catholic": "Prophesies abundance ('water flow from his buckets'), widespread posterity ('seed shall have abundant water'), a king mightier than Agag, and an exalted kingdom.",
      "Methodist": "Foretells Israel's prosperity ('water from buckets'), numerous descendants ('seed in many waters'), and a king superior to Agag, with an exalted kingdom.",
      "Lutheran": "Prophesies abundance ('water flow from his buckets'), posterity ('seed in many waters'), a king higher than Agag, and an exalted kingdom."
    },
    "8": {
      "General": "'God brought him out of Egypt; he has strength like a wild ox. He shall consume the nations, his enemies; he shall break their bones and pierce them through with his arrows.'",
      "Non-Denominational": "Reiterates God's deliverance from Egypt and Israel's ox-like strength, predicting their complete destruction of enemy nations.",
      "Baptist": "Repeats the theme of God bringing Israel from Egypt with wild ox-like strength, foretelling Israel's complete victory over enemies (consuming nations, breaking bones, piercing with arrows).",
      "Catholic": "Recalls God bringing Israel from Egypt with wild ox strength, prophesying the consumption and destruction of enemy nations.",
      "Methodist": "Repeats God's deliverance from Egypt and Israel's wild-ox strength, predicting the utter defeat and destruction of enemy nations.",
      "Lutheran": "Reiterates God bringing him from Egypt with strength like a wild ox, predicting he will consume enemy nations, break their bones, and pierce them with arrows."
    },
    "9": {
      "General": "'He crouches, he lies down like a lion, like a lioness—who dares rouse him? Blessed is he who blesses you, and cursed is he who curses you!'",
      "Non-Denominational": "Compares Israel's secure and powerful state to a resting lion/lioness, dangerous to provoke. Concludes by affirming the principle of blessing those who bless Israel and cursing those who curse them.",
      "Baptist": "Likens Israel's secure power to a resting lion/lioness that no one dares disturb. Concludes with the covenant formula: blessing for blessing Israel, cursing for cursing them.",
      "Catholic": "Compares Israel to a resting lion/lioness, formidable and secure. Ends with the definitive statement: 'Blessed are those who bless you, cursed are those who curse you!'",
      "Methodist": "Likens Israel to a powerful, resting lion/lioness, dangerous to provoke. Concludes by stating that blessing Israel brings blessing, and cursing Israel brings curses.",
      "Lutheran": "Compares him to a lion/lioness crouching and lying down, questioning who dares rouse him. Concludes: 'Blessed is he that blesseth thee, and cursed is he that curseth thee.'"
    },
    "10": {
      "General": "Then Balak's anger burns against Balaam. He strikes his hands together and says to Balaam, 'I summoned you to curse my enemies, but behold, you have blessed them these three times!'",
      "Non-Denominational": "Balak reacts with fury, striking his hands in anger and berating Balaam for blessing Israel three times instead of delivering the requested curse.",
      "Baptist": "Balak's anger flares; he claps his hands in fury and accuses Balaam of blessing his enemies three times instead of cursing them.",
      "Catholic": "Balak's anger flares against Balaam; he strikes his hands together and accuses Balaam of blessing his enemies three times instead of cursing them.",
      "Methodist": "Balak becomes furious, strikes his hands together, and tells Balaam he summoned him for curses but received only blessings three times.",
      "Lutheran": "Balak's anger is kindled against Balaam; he strikes his hands together and tells Balaam he called him to curse enemies, but Balaam has blessed them three times."
    },
    "11": {
      "General": "'Now flee to your own place! I said I would reward you richly (honor you greatly), but behold, the Lord has kept you back from honor.'",
      "Non-Denominational": "Balak dismisses Balaam, telling him to leave, and spitefully attributes Balaam's lack of reward to the Lord's intervention.",
      "Baptist": "Balak commands Balaam to flee home, stating he intended great honor but the Lord prevented it (implying Balaam lost out by obeying God).",
      "Catholic": "Balak tells Balaam to flee home, stating he intended great honor but the Lord has withheld it.",
      "Methodist": "Balak tells Balaam to flee, stating he meant to honor him greatly, but the Lord prevented it.",
      "Lutheran": "Balak tells Balaam to flee home, stating he intended great honor, but the Lord has kept him from honor."
    },
    "12": {
      "General": "Balaam replies to Balak, 'Did I not already tell your messengers whom you sent to me,'",
      "Non-Denominational": "Balaam reminds Balak that he had already warned the initial messengers about his divine constraint.",
      "Baptist": "Balaam reminds Balak that he had already informed the first delegation of messengers.",
      "Catholic": "Balaam reminds Balak that he had told the initial messengers.",
      "Methodist": "Balaam asks Balak if he didn't already tell the messengers sent earlier.",
      "Lutheran": "Balaam reminds Balak, 'Spake I not also to thy messengers which thou sentest unto me, saying,'"
    },
    "13": {
      "General": "'Even if Balak were to give me his palace full of silver and gold, I cannot go beyond the command (word) of the Lord, to do either good or bad of my own accord (mind)? What the Lord says, that I must speak.'",
      "Non-Denominational": "He repeats his earlier declaration: no amount of wealth could make him disobey the Lord's command; he must speak only God's words.",
      "Baptist": "He repeats his inability to disobey God for wealth, affirming he cannot act independently ('of mine own mind') but must speak precisely what the Lord says.",
      "Catholic": "'If Balak gave me his house full of silver and gold, I could not transgress the Lord's command to do anything good or evil of my own will; what the Lord speaks, I must speak.'",
      "Methodist": "He reiterates that even a palace of wealth wouldn't allow him to go beyond God's command, good or bad, on his own; he must speak what the Lord says.",
      "Lutheran": "'If Balak would give me his house full of silver and gold, I cannot go beyond the commandment of the Lord, to do either good or bad of mine own mind; but what the Lord saith, that will I speak?'"
    },
    "14": {
      "General": "'And now, behold, I am going to my people. Come, I will advise (advertise/warn) you what this people (Israel) will do to your people (Moab) in the latter days.'",
      "Non-Denominational": "As he prepares to leave, Balaam offers Balak a final, unsolicited prophecy about Israel's future impact on Moab.",
      "Baptist": "Balaam, before leaving, offers to prophesy ('advertise thee') what Israel will eventually do to Moab in the future ('latter days').",
      "Catholic": "Balaam announces his departure but offers a prophecy about what Israel will do to Moab in the future ('latter days').",
      "Methodist": "Balaam states he is leaving but offers to advise Balak about what Israel will do to Moab in the future.",
      "Lutheran": "Balaam states he is returning home but will first advise ('advertise') Balak what Israel will do to Moab in the latter days."
    },
    "15": {
      "General": "He takes up his oracle and says: 'The utterance of Balaam son of Beor, the utterance of the man whose eyes are opened,'",
      "Non-Denominational": "Balaam begins his fourth oracle, again identifying himself as the seer whose eyes are truly opened.",
      "Baptist": "Balaam delivers his fourth oracle (parable), again identifying himself as the man whose eyes are open.",
      "Catholic": "He delivers his oracle: 'The utterance of Balaam son of Beor, the utterance of the man whose eye is true (or opened),'",
      "Methodist": "He begins his next prophetic utterance, identifying himself as Balaam whose eyes are open.",
      "Lutheran": "He takes up his oracle (parable): 'The utterance of Balaam son of Beor, the utterance of the man whose eyes are open:'"
    },
    "16": {
      "General": "'The utterance of him who hears the words of God, and knows the knowledge of the Most High, who sees the vision of the Almighty, falling down, but having his eyes uncovered (open).'",
      "Non-Denominational": "He reiterates his credentials as one receiving divine words, knowledge, and visions from God Almighty.",
      "Baptist": "He repeats his claim to hear God's words, possess knowledge from the Most High, and see visions from the Almighty in a trance.",
      "Catholic": "'The utterance of one who hears God's words, knows the knowledge of the Most High, sees the vision of the Almighty, falling into a trance, but with eyes open.'",
      "Methodist": "He repeats his description: hearing God's words, knowing the Most High's knowledge, seeing the Almighty's vision, falling down with eyes open.",
      "Lutheran": "'The utterance of him which heard the words of God, and knew the knowledge of the most High, which saw the vision of the Almighty, falling [into a trance], but having his eyes open.'"
    },
    "17": {
      "General": "'I see him, but not now; I behold him, but not near. A Star shall come out of Jacob; a Sceptre shall rise out of Israel, and shall strike the corners (forehead/leaders) of Moab, and destroy all the children of Sheth.'",
      "Non-Denominational": "Balaam prophesies a future event: the rise of a ruling figure (Star/Sceptre) from Jacob/Israel who will decisively defeat Moab and other peoples (children of Sheth). Often seen as Messianic or fulfilled in David.",
      "Baptist": "Prophesies a future ruler ('Star', 'Sceptre') arising from Jacob/Israel, though distant in time ('not now', 'not nigh'). This ruler will crush Moab's leadership/borders and destroy the descendants of Sheth. This is strongly interpreted as Messianic.",
      "Catholic": "Prophesies a future event, distant in time: a Star from Jacob and Sceptre from Israel will crush Moab's frontiers/leaders and the skulls of Sheth's descendants. Traditionally seen as Messianic.",
      "Methodist": "He prophesies a future, though distant, event: a Star and Sceptre (ruler) will emerge from Jacob/Israel, defeating Moab and destroying the children of Sheth. Often points to David and/or Christ.",
      "Lutheran": "Prophesies, 'I shall see him, but not now: I shall behold him, but not nigh: there shall come a Star out of Jacob, and a Sceptre shall rise out of Israel, and shall smite the corners of Moab, and destroy all the children of Sheth.' (Understood as Messianic)."
    },
    "18": {
      "General": "'Edom shall be a possession; Seir also, his enemies, shall be a possession, while Israel does valiantly.'",
      "Non-Denominational": "Predicts Edom and Seir (related territory) will be conquered and possessed by Israel, who will act with strength.",
      "Baptist": "Prophesies Edom and Seir will become Israel's possession while Israel acts valiantly (with strength/virtue).",
      "Catholic": "Prophesies Edom and Seir will be conquered possessions, while Israel acts valiantly.",
      "Methodist": "Foretells that Edom and Seir will be possessed by Israel, who will demonstrate great strength.",
      "Lutheran": "Predicts Edom and Seir shall be possessions, while Israel acts valiantly."
    },
    "19": {
      "General": "'Out of Jacob shall come he who has dominion, and shall destroy the remnant from the city.'",
      "Non-Denominational": "Reiterates a ruler will come from Jacob who will exercise dominion and destroy any remaining survivors in enemy cities.",
      "Baptist": "States a ruler ('he that shall have dominion') will come from Jacob and destroy the remaining survivors of the enemy cities.",
      "Catholic": "A ruler from Jacob shall exercise dominion and destroy the survivors of the cities.",
      "Methodist": "States a ruler from Jacob will have dominion and destroy the city's remnant.",
      "Lutheran": "Predicts one from Jacob shall have dominion and destroy the remnant from the city."
    },
    "20": {
      "General": "Then he looks on Amalek and speaks his oracle: 'Amalek was the first of the nations (to attack Israel), but his latter end shall be everlasting destruction.'",
      "Non-Denominational": "Balaam delivers an oracle against Amalek: though they were the first nation to attack Israel, their ultimate fate is complete destruction.",
      "Baptist": "Delivers an oracle against Amalek: they were the first nation to attack Israel, but their final end is utter destruction ('perish for ever').",
      "Catholic": "Pronounces an oracle against Amalek: first among nations (in attacking Israel), but destined for ultimate destruction.",
      "Methodist": "He gives an oracle concerning Amalek: the first nation (to fight Israel), but destined to perish forever.",
      "Lutheran": "Takes up an oracle against Amalek: 'Amalek was the first of the nations; but his latter end shall be that he perish for ever.'"
    },
    "21": {
      "General": "Then he looks on the Kenites and speaks his oracle: 'Strong is your dwelling place, and your nest is set in the rock.'",
      "Non-Denominational": "Balaam delivers an oracle concerning the Kenites, acknowledging their seemingly secure, rock-like dwelling.",
      "Baptist": "Delivers an oracle regarding the Kenites, noting the strength and security of their dwelling place ('nest in a rock').",
      "Catholic": "Pronounces an oracle on the Kenites: acknowledging their strong, rock-nested dwelling.",
      "Methodist": "He gives an oracle about the Kenites, noting their strong dwelling place, like a nest set in rock.",
      "Lutheran": "Takes up an oracle concerning the Kenites: 'Strong is thy dwellingplace, and thou puttest thy nest in a rock.'"
    },
    "22": {
      "General": "'Nevertheless, Kain shall be burned (wasted), though Asshur (Assyria) shall carry you away captive.'",
      "Non-Denominational": "Despite their security, the oracle predicts the Kenites (Kain) will be wasted/destroyed, eventually taken captive by Assyria.",
      "Baptist": "Predicts that despite their security, the Kenites (Kain) will eventually be wasted/consumed, until Assyria takes them captive.",
      "Catholic": "Predicts, nevertheless, that Kain (Kenites) will be consumed, asking how long until Asshur takes them captive.",
      "Methodist": "Yet, predicts the Kenites will be wasted/burned, until Asshur (Assyria) takes them captive.",
      "Lutheran": "Predicts, 'Nevertheless the Kenite shall be wasted, until Asshur shall carry thee away captive.'"
    },
    "23": {
      "General": "He speaks his final oracle: 'Alas, who shall live when God does this?'",
      "Non-Denominational": "Balaam concludes with a lament or exclamation about the severity of the future events God will bring about.",
      "Baptist": "Delivers a final oracle, lamenting ('Alas') the severity of the future divine judgments, questioning who could survive them.",
      "Catholic": "Delivers a final oracle, exclaiming, 'Alas, who can live when God does this!' expressing awe at future judgments.",
      "Methodist": "He gives a final utterance, lamenting 'Alas,' and questioning who can survive when God brings these things to pass.",
      "Lutheran": "Takes up his final oracle: 'Alas, who shall live when God doeth this!'"
    },
    "24": {
      "General": "'But ships shall come from the coast of Kittim (Cyprus/Mediterranean coasts), and shall afflict Asshur (Assyria) and Eber (Hebrews/peoples beyond Euphrates), and he (Kittim/invaders) also shall perish forever.'",
      "Non-Denominational": "Predicts future invasions by sea peoples (from Kittim) who will afflict Assyria and Eber (perhaps encompassing Israel/Judah or Mesopotamian peoples), but these invaders too will ultimately perish.",
      "Baptist": "Prophesies ships from Kittim (Cyprus/West) will afflict Assyria and Eber (trans-Euphrates region/Hebrews), but these invaders themselves will also ultimately perish.",
      "Catholic": "Predicts ships from Kittim (Cyprus/western lands) will afflict Asshur and Eber, but they too shall perish forever.",
      "Methodist": "Foretells ships from Kittim (western coasts) afflicting Asshur and Eber, but these invaders will also ultimately perish.",
      "Lutheran": "Predicts ships from the coast of Kittim shall afflict Asshur and Eber, but he (the invader from Kittim) also shall perish for ever."
    },
    "25": {
      "General": "Then Balaam rises and returns to his place, and Balak also goes his way.",
      "Non-Denominational": "Balaam departs to return home, and Balak also leaves, their encounter concluded.",
      "Baptist": "Balaam gets up and begins his return journey home; Balak also departs.",
      "Catholic": "Balaam rises, departs for home, and Balak also goes his way.",
      "Methodist": "Balaam rises and goes back to his place, and Balak also departs.",
      "Lutheran": "Balaam rises up, returns to his place, and Balak also went his way."
    }
  }
}
