{
  "Summary": {
    "General": "While Israel stays in Shittim (Acacia Grove), the men begin to engage in sexual immorality with Moabite women. These women invite the Israelites to the sacrifices of their gods, and the Israelites eat and bow down to these gods, specifically joining themselves to Baal of Peor. The Lord's anger burns against Israel. God commands Moses to take all the leaders (chiefs/heads) of the people and hang them publicly before the Lord (execute them, possibly by impalement, as a public display) to turn away His fierce anger. Moses instructs Israel's judges to kill every man under their jurisdiction who has joined himself to Baal of Peor. As this is happening, an Israelite man brings a Midianite woman into his family's presence, right before Moses and the whole congregation who are weeping at the entrance of the Tent of Meeting. Phinehas, son of Eleazar and grandson of Aaron the priest, sees this, leaves the assembly, takes a spear, follows the Israelite man into the tent (inner room/pavilion), and thrusts the spear through both the Israelite man and the Midianite woman, piercing her belly. Immediately, the plague that was ravaging Israel stops. Those who died in the plague numbered 24,000. The Lord commends Phinehas to Moses, stating that Phinehas turned His wrath away from Israel by being zealous for God's honor among them, so God did not consume Israel in His jealousy. God establishes His covenant of peace with Phinehas, granting him and his descendants after him the covenant of a perpetual priesthood, because he was zealous for his God and made atonement for the Israelites. The slain Israelite man is identified as Zimri son of Salu, a leader of a Simeonite family, and the Midianite woman as Cozbi daughter of Zur, a tribal chief among the Midianites. Finally, God instructs Moses to treat the Midianites as enemies and attack them, because they treated Israel as enemies with their deceitful scheme at Peor and regarding Cozbi.",
    "Non-Denominational": "Focuses on the severe consequences of spiritual compromise and sexual immorality. Israel's sin at Peor, mingling pagan worship with immorality, provokes God's righteous anger and judgment (plague). Phinehas's decisive action demonstrates righteous zeal against blatant sin, effectively stopping the plague and making atonement. It highlights the importance of holiness, separation from pagan influences, and confronting sin boldly. God's covenant with Phinehas rewards faithfulness and zeal for God's honor. The command against Midian underscores accountability for leading others into sin.",
    "Baptist": "Emphasizes the holiness of God, the seriousness of idolatry and sexual sin, and the necessity of judgment against sin. The Israelites fall into temptation through Moabite/Midianite seduction, violating their covenant with God. God's wrath results in a deadly plague. Phinehas's zeal for God's law and honor is highlighted as righteous; his decisive act stops judgment and secures the priesthood. It demonstrates that true faith requires separation from sin and active opposition to ungodliness. Divine judgment against Midian follows their role in Israel's sin.",
    "Catholic": "Views the incident as a grave failure in covenant fidelity, involving both idolatry (worshipping Baal of Peor) and immorality. God's justice is manifest in the plague. Phinehas's action, motivated by zeal for God's honor and the sanctity of the covenant, is presented as a righteous act of justice that placates divine wrath and makes atonement. His reward, the perpetual priesthood, affirms God's blessing on faithfulness. The narrative underscores the danger of syncretism and the importance of maintaining religious purity. The condemnation of Midian reflects the consequences of tempting God's people into sin.",
    "Methodist": "Highlights the themes of temptation, sin, divine judgment, and righteous zeal. Israel succumbs to temptation, leading to idolatry and immorality at Peor, incurring God's wrath. Phinehas's action represents necessary, zealous intervention against public and defiant sin, turning away God's anger. It underscores the importance of upholding God's standards of holiness and the role of leadership in confronting sin. God's covenant with Phinehas emphasizes the value of acting faithfully and zealously for God. The call to punish Midian shows the consequences of facilitating sin.",
    "Lutheran": "Focuses on the conflict between God's command for holiness and human sinfulness. Israel's fall into idolatry and immorality represents a rejection of God's grace and covenant (Law). God's wrath (Law) is revealed in the plague. Phinehas acts out of zeal for God's Law and honor, executing judgment which stops the plague (atonement through judgment). This act, pleasing to God, secures the priestly covenant (Gospel promise tied to faithfulness under the Law). It demonstrates the severity of sin, especially idolatry, and God's demand for faithfulness, while also showing judgment against those (Midian) who tempt others away from God."
  },
  "Verses": {
    "1": {
      "General": "While Israel is staying in Shittim, the men begin to commit sexual immorality (whoredom) with the women of Moab.",
      "Non-Denominational": "At Shittim, Israelite men begin engaging in sexual immorality with local Moabite women.",
      "Baptist": "During their stay in Shittim, the Israelite men succumb to temptation and begin illicit sexual relations with Moabite women.",
      "Catholic": "While encamped at Shittim, the Israelite men begin to engage in illicit relations with Moabite women.",
      "Methodist": "While staying at Shittim, the Israelite men start committing sexual immorality with Moabite women.",
      "Lutheran": "While Israel stayed in Shittim, the men began to commit whoredom with the daughters of Moab."
    },
    "2": {
      "General": "These women invite the people (Israelites) to the sacrifices of their gods; the people eat and bow down to their gods.",
      "Non-Denominational": "The Moabite women invite the Israelites to pagan sacrificial feasts, leading the Israelites to participate and worship their gods.",
      "Baptist": "The Moabite women entice the Israelites to participate in sacrifices to their idols, leading the Israelites to eat sacrificial food and worship false gods.",
      "Catholic": "These women invited the Israelites to the sacrifices of their gods, and the Israelites ate and worshipped their gods.",
      "Methodist": "The Moabite women invite the Israelites to sacrifices for their gods, and the Israelites eat and bow down to these gods.",
      "Lutheran": "The Moabite women invited the Israelites to the sacrifices of their gods; the Israelites ate and bowed down to their gods."
    },
    "3": {
      "General": "So Israel joins themselves to Baal of Peor (the Baal worshipped at Peor), and the Lord's anger burns against Israel.",
      "Non-Denominational": "Israel becomes attached to the worship of Baal of Peor, provoking the Lord's intense anger.",
      "Baptist": "Israel yokes themselves to the idolatrous worship of Baal of Peor, kindling the Lord's righteous anger against them.",
      "Catholic": "Israel becomes attached to the Baal of Peor, provoking the Lord's anger.",
      "Methodist": "Israel joins in the worship of Baal of Peor, and the Lord's anger is kindled against them.",
      "Lutheran": "Israel joined himself unto Baalpeor, and the anger of the Lord was kindled against Israel."
    },
    "4": {
      "General": "The Lord says to Moses, 'Take all the leaders (heads) of the people and hang (impale) them before the Lord in broad daylight (against the sun), so that the fierce anger of the Lord may turn away from Israel.'",
      "Non-Denominational": "God commands Moses to execute the leaders responsible for this apostasy publicly as a means to appease His wrath.",
      "Baptist": "God instructs Moses to execute the leaders involved in the apostasy publicly ('hang them up before the Lord against the sun') to turn away His fierce anger.",
      "Catholic": "The Lord instructs Moses to take the leaders and execute them publicly (impale them) before the Lord to turn away His wrath.",
      "Methodist": "God tells Moses to take the leaders and execute them publicly in daylight before the Lord, to turn away His fierce anger.",
      "Lutheran": "The Lord commands Moses to take the leaders and hang them up publicly before the Lord, so His fierce anger may turn from Israel."
    },
    "5": {
      "General": "So Moses tells the judges of Israel, 'Each of you must kill his men who have joined themselves to Baal of Peor.'",
      "Non-Denominational": "Moses relays the command for judgment, instructing the judges to execute those under their authority who participated in the Baal worship.",
      "Baptist": "Moses instructs the judges of Israel to carry out the sentence, executing the men guilty of worshipping Baal of Peor.",
      "Catholic": "Moses instructs the judges of Israel to execute every man under their authority who joined the Baal of Peor cult.",
      "Methodist": "Moses instructs the judges to execute the men within their jurisdictions who joined in worshipping Baal of Peor.",
      "Lutheran": "Moses tells the judges of Israel to slay every one of his men that were joined unto Baalpeor."
    },
    "6": {
      "General": "Behold, one of the Israelites comes and brings a Midianite woman to his family (brethren) in the sight of Moses and in the sight of the whole congregation of Israel, while they are weeping at the entrance of the Tent of Meeting.",
      "Non-Denominational": "A shocking act of defiance occurs: an Israelite man openly brings a Midianite woman into the camp near the Tabernacle, while the community is mourning the ongoing judgment.",
      "Baptist": "An Israelite man brazenly brings a Midianite woman into his family's presence, flaunting his sin before Moses and the weeping congregation at the Tabernacle entrance.",
      "Catholic": "An Israelite man brazenly brings a Midianite woman to his family in full view of Moses and the weeping congregation at the entrance of the Tent of Meeting.",
      "Methodist": "An Israelite man publicly defies God and the community by bringing a Midianite woman to his family, while Moses and the congregation are weeping at the Tabernacle entrance.",
      "Lutheran": "An Israelite man brazenly brings a Midianitish woman to his brethren in the sight of Moses and the whole congregation, while they were weeping before the door of the tabernacle."
    },
    "7": {
      "General": "When Phinehas son of Eleazar, the son of Aaron the priest, sees it, he rises from the midst of the congregation and takes a spear in his hand.",
      "Non-Denominational": "Phinehas, grandson of Aaron the High Priest, witnesses this defiance, rises from the assembly, and arms himself with a spear.",
      "Baptist": "Phinehas, Aaron's grandson, sees this flagrant sin, gets up from the assembly, and takes a spear.",
      "Catholic": "Phinehas, son of Eleazar and grandson of Aaron the priest, sees this, rises from the assembly, and takes a spear.",
      "Methodist": "Seeing this, Phinehas, grandson of Aaron the priest, rises from the congregation and takes a spear.",
      "Lutheran": "When Phinehas, son of Eleazar, son of Aaron the priest, sees it, he rises up from among the congregation and takes a javelin in his hand."
    },
    "8": {
      "General": "He goes after the Israelite man into the tent (inner room/pavilion) and thrusts both of them through, the Israelite man and the woman through her belly. Thus the plague is stopped (stayed) from the Israelites.",
      "Non-Denominational": "Phinehas follows the couple into the tent and executes them both with the spear, immediately stopping the plague.",
      "Baptist": "Phinehas pursues the man into the tent and impales both him and the Midianite woman with the spear, instantly stopping the plague upon Israel.",
      "Catholic": "He follows the Israelite into the tent and impales both him and the woman through her abdomen. The plague among the Israelites ceases.",
      "Methodist": "He follows the Israelite man into the tent and thrusts the spear through both of them, the man and the woman (through her belly). The plague against Israel stops.",
      "Lutheran": "He follows the Israelite man into the tent and thrusts both of them through, the man and the woman through her belly. So the plague was stayed from the children of Israel."
    },
    "9": {
      "General": "Nevertheless, those who died by the plague were 24,000.",
      "Non-Denominational": "States the death toll from the plague before it was stopped: 24,000 Israelites.",
      "Baptist": "Records the number of deaths caused by the plague before Phinehas intervened: 24,000 people.",
      "Catholic": "Records the number who died in the plague: 24,000.",
      "Methodist": "Reports the death toll from the plague: 24,000 people.",
      "Lutheran": "Those that died in the plague were twenty and four thousand."
    },
    "10": {
      "General": "The Lord speaks to Moses, saying,",
      "Non-Denominational": "God addresses Moses following these events.",
      "Baptist": "The Lord communicates His response to Moses.",
      "Catholic": "The Lord speaks to Moses.",
      "Methodist": "God speaks to Moses.",
      "Lutheran": "The Lord spake unto Moses, saying,"
    },
    "11": {
      "General": "'Phinehas son of Eleazar, the son of Aaron the priest, has turned my wrath away from the Israelites, because he was zealous with my zeal among them, so that I did not consume the Israelites in my jealousy.'",
      "Non-Denominational": "God commends Phinehas, stating his righteous zeal mirrored God's own jealousy for holiness and turned away God's wrath, preventing Israel's complete destruction.",
      "Baptist": "God praises Phinehas for turning away His wrath by demonstrating Godly zeal ('zealous for my sake') among the people, thus sparing Israel from utter destruction due to God's jealousy (righteous indignation).",
      "Catholic": "God declares that Phinehas turned His wrath away by showing the same zeal (jealousy) for God's honor as God Himself, preventing Israel's destruction.",
      "Methodist": "God tells Moses that Phinehas turned His wrath away from Israel by being zealous with God's own zeal among them, preventing God from consuming Israel in His jealousy.",
      "Lutheran": "God declares Phinehas has turned His wrath away, being zealous for God's sake among them, so God did not consume Israel in His jealousy."
    },
    "12": {
      "General": "'Therefore say, \"Behold, I give to him my covenant of peace.\"'",
      "Non-Denominational": "As a reward, God grants Phinehas His covenant of peace, signifying blessing, security, and divine favor.",
      "Baptist": "God instructs Moses to announce His reward for Phinehas: the establishment of His covenant of peace with him.",
      "Catholic": "Therefore, God grants Phinehas His covenant of peace.",
      "Methodist": "God instructs Moses to declare that He is giving Phinehas His covenant of peace.",
      "Lutheran": "God declares, 'Behold, I give unto him my covenant of peace.'"
    },
    "13": {
      "General": "'And it shall be to him and to his descendants after him the covenant of a perpetual priesthood, because he was zealous for his God and made atonement for the Israelites.'",
      "Non-Denominational": "This covenant includes the promise of a lasting priesthood for Phinehas and his descendants, explicitly linking it to his zeal for God and his act of atonement.",
      "Baptist": "This covenant guarantees an everlasting priesthood for Phinehas and his lineage, because he was zealous for God and made atonement for Israel's sin.",
      "Catholic": "This covenant grants Phinehas and his descendants a perpetual priesthood because he was zealous for God and made atonement for Israel.",
      "Methodist": "The covenant grants Phinehas and his descendants a perpetual priesthood, awarded because he was zealous for God and made atonement for Israel.",
      "Lutheran": "This covenant guarantees him and his descendants an everlasting priesthood, because he was zealous for his God and made atonement for the children of Israel."
    },
    "14": {
      "General": "The name of the slain Israelite man, who was killed with the Midianite woman, was Zimri the son of Salu, a leader (prince) of a father's house among the Simeonites.",
      "Non-Denominational": "Identifies the executed Israelite man as Zimri, a leader from the tribe of Simeon.",
      "Baptist": "Names the slain Israelite: Zimri son of Salu, a Simeonite leader, emphasizing his prominent status.",
      "Catholic": "Identifies the slain Israelite as Zimri son of Salu, a leader of a Simeonite family.",
      "Methodist": "Names the slain Israelite man as Zimri son of Salu, a leader within the tribe of Simeon.",
      "Lutheran": "Names the slain Israelite: Zimri, son of Salu, a prince of a chief house among the Simeonites."
    },
    "15": {
      "General": "And the name of the slain Midianite woman was Cozbi the daughter of Zur; he (Zur) was head over a people, a father's house in Midian.",
      "Non-Denominational": "Identifies the executed Midianite woman as Cozbi, the daughter of Zur, a prominent Midianite tribal chief.",
      "Baptist": "Names the slain Midianite woman: Cozbi daughter of Zur, identifying her father as a Midianite chief, highlighting her high status.",
      "Catholic": "Identifies the slain Midianite woman as Cozbi, daughter of Zur, a Midianite tribal chief.",
      "Methodist": "Names the slain Midianite woman as Cozbi, daughter of Zur, a leader and head of a Midianite family.",
      "Lutheran": "Names the slain Midianite woman: Cozbi, daughter of Zur, head over a people and chief house in Midian."
    },
    "16": {
      "General": "The Lord speaks to Moses, saying,",
      "Non-Denominational": "God again addresses Moses with further instructions.",
      "Baptist": "The Lord gives Moses further instructions.",
      "Catholic": "The Lord speaks to Moses.",
      "Methodist": "God speaks again to Moses.",
      "Lutheran": "And the Lord spake unto Moses, saying,"
    },
    "17": {
      "General": "'Treat the Midianites as enemies (vex/harass) and attack (smite) them,'",
      "Non-Denominational": "God commands Israel to view and treat the Midianites as hostile enemies and to attack them.",
      "Baptist": "God commands Moses to perpetually harass ('vex') the Midianites and attack them militarily.",
      "Catholic": "God commands Moses to harass the Midianites and attack them.",
      "Methodist": "God instructs Moses to treat the Midianites as enemies and attack them.",
      "Lutheran": "God commands Moses, 'Vex the Midianites, and smite them:'"
    },
    "18": {
      "General": "'For they treated you as enemies with their tricks (wiles) with which they deceived you in the matter of Peor, and in the matter of Cozbi, the daughter of a leader of Midian, their sister, who was slain on the day of the plague because of the matter of Peor.'",
      "Non-Denominational": "God justifies this command by citing the Midianites' deceitful scheme at Peor and the role of Cozbi, which led Israel into sin and judgment.",
      "Baptist": "Provides the reason for hostility: the Midianites acted deceptively ('with their wiles') against Israel in the Peor incident involving their 'sister' Cozbi, who died during the resulting plague.",
      "Catholic": "Justifies the command: the Midianites acted deceitfully in the Peor incident and concerning Cozbi, the Midianite leader's daughter slain during the plague.",
      "Methodist": "Explains the reason: the Midianites treated Israel as enemies with their deceitful tricks concerning Peor and Cozbi, the leader's daughter slain during the plague.",
      "Lutheran": "Gives the reason: 'For they vex you with their wiles, wherewith they have beguiled you in the matter of Peor, and in the matter of Cozbi, the daughter of a prince of Midian, their sister, which was slain in the day of the plague for Peor's sake.'"
    }
  }
}
