{
  "Summary": {
    "General": "The daughters of Zelophehad (Mahlah, Noah, Hoglah, Milcah, Tirzah), from the tribe of Manasseh, approach Moses, Eleazar the priest, and the leaders at the Tabernacle entrance. They explain their father died in the wilderness, not as part of Korah's rebellion, but due to his own sin, leaving no sons. They petition Moses not to let their father's name and lineage disappear and request an inheritance among their father's relatives. Moses presents their case to the Lord. God declares their request just and commands Moses to grant them an inheritance among their father's brothers, establishing a law: if a man dies with no son, his inheritance passes to his daughter. If no daughter, it goes to his brothers. If no brothers, to his father's brothers. If his father has no brothers, it goes to the nearest kinsman in his clan. This becomes a binding ordinance for Israel. Subsequently, God instructs Moses to ascend Mount Abarim to view the Promised Land, informing him he will die soon, like Aaron, because they both rebelled at the waters of Meribah in Kadesh (Wilderness of Zin) by not sanctifying God before the people. Moses petitions God, the God of the spirits of all flesh, to appoint a successor to lead the congregation in and out, preventing them from being like sheep without a shepherd. God chooses Joshua son of Nun, a man possessing the Spirit, instructs Moses to lay his hand on him, commission him publicly before Eleazar and the congregation, and bestow some of his authority upon him so Israel will obey. Joshua is to receive divine guidance through Eleazar consulting the Urim before the Lord. Moses obeys, publicly commissions Joshua by laying hands on him, giving him his charge as commanded.",
    "Non-Denominational": "Focuses on God's justice and provision, seen in the ruling for Zelophehad's daughters, establishing fair inheritance laws that include women when male heirs are absent. It highlights the importance of lineage and family continuity. The second part addresses leadership transition. Moses, despite his faithfulness, faces the consequence of past disobedience (Meribah) and is denied entry into Canaan. His concern for Israel's future leadership demonstrates selfless care. God's choice of Joshua, a man filled with the Spirit and commissioned through Moses and Eleazar, ensures continuity and divine guidance (Urim) for the nation.",
    "Baptist": "Emphasizes God's righteousness in addressing the daughters' plea, modifying inheritance law to ensure justice and preserve family lines within the covenant community. This highlights God's responsiveness to legitimate concerns presented humbly. Moses' impending death due to disobedience at Meribah underscores God's holiness and the seriousness of sin, even for great leaders. Moses' prayer for a successor reveals his pastoral heart. God's sovereign choice of Joshua, emphasizing the presence of the Spirit and the public commissioning (laying on of hands), validates Joshua's authority and ensures continued leadership under God's direction.",
    "Catholic": "Views the case of Zelophehad's daughters as an instance of divine law being clarified and developed to address specific circumstances justly, upholding the importance of family inheritance within the covenant. Moses' exclusion from the Promised Land due to the sin at Meribah illustrates the gravity of failing to uphold God's sanctity. His prayer for a successor shows responsible leadership. The commissioning of Joshua involves a transfer of authority (laying on of hands, sharing honor) and establishes a means of divine consultation (Urim via the priest), ensuring the continuity of leadership guided by God's will for His people entering the land.",
    "Methodist": "Highlights God's fairness and compassion in the ruling for Zelophehad's daughters, adapting laws to meet needs justly while maintaining tribal inheritance structures. It shows God values individuals and families. The transition narrative underscores the consequences of disobedience (Moses' exclusion) but also God's provision for the future. Moses' concern for a leader demonstrates his faithfulness. God's selection of Joshua, emphasizing the Spirit's presence and the orderly transfer of authority (public commissioning, priestly consultation via Urim), ensures the community will be led according to God's guidance.",
    "Lutheran": "Focuses on God's justice and ordering of society through law, demonstrated in the inheritance ruling for Zelophehad's daughters (Law). God's judgment on Moses for the Meribah incident (Law) is reaffirmed, barring him from the land. Moses' prayer reflects godly concern for God's people. God's gracious provision of a successor, Joshua, filled with the Spirit (Gospel promise of guidance), ensures the continuity of leadership. The commissioning process, involving laying on of hands and reliance on the priest and Urim, establishes the divinely ordained means for Joshua's leadership under God's Word and authority."
  },
  "Verses": {
    "1": {
      "General": "The daughters of Zelophehad (Mahlah, Noah, Hoglah, Milcah, Tirzah), descendants of Manasseh son of Joseph through Hepher, Gilead, and Machir, come forward.",
      "Non-Denominational": "Introduces the daughters of Zelophehad, tracing their lineage within the tribe of Manasseh, son of Joseph.",
      "Baptist": "Presents the case involving the daughters of Zelophehad, establishing their identity and lineage within the tribe of Manasseh.",
      "Catholic": "Introduces the daughters of Zelophehad, detailing their specific lineage from Manasseh, son of Joseph.",
      "Methodist": "Introduces the daughters of Zelophehad, providing their names and lineage within the tribe of Manasseh.",
      "Lutheran": "Introduces the daughters of Zelophehad, specifying their names and descent from Manasseh."
    },
    "2": {
      "General": "They stand before Moses, Eleazar the priest, the tribal leaders (princes), and the entire assembly at the entrance of the Tent of Meeting.",
      "Non-Denominational": "They present their case formally before the entire leadership structure of Israel (Moses, priest, leaders, assembly) at the Tabernacle entrance.",
      "Baptist": "They bring their petition publicly before Moses, Eleazar the priest, the tribal leaders, and the whole congregation at the Tabernacle door.",
      "Catholic": "They formally present themselves before Moses, Eleazar the priest, the leaders, and the whole community at the entrance of the Tent of Meeting.",
      "Methodist": "They make their appeal before Moses, Eleazar the priest, the leaders, and the entire assembly at the Tabernacle entrance.",
      "Lutheran": "They stand before the gathered leadership (Moses, priest, princes) and the congregation at the Tabernacle entrance to present their case."
    },
    "3": {
      "General": "They state: 'Our father died in the wilderness. He wasn't part of Korah's group that rebelled against the Lord; he died for his own sin and had no sons.'",
      "Non-Denominational": "They argue their father died a natural death in the wilderness due to his own individual sin (common to the generation), not as part of Korah's specific rebellion, and he lacked male heirs.",
      "Baptist": "They clarify their father died in the wilderness for his personal sin (part of the judged generation), explicitly denying involvement in Korah's rebellion, and state he left no sons.",
      "Catholic": "They explain their father died in the wilderness, distinguishing his death (due to his own sin) from participation in Korah's rebellion, and note his lack of sons.",
      "Methodist": "They state their father died in the wilderness for his own sin, making clear he wasn't involved in Korah's rebellion, and he had no sons.",
      "Lutheran": "They state their father died in the wilderness for his own sin (part of the generation under judgment), not in Korah's rebellion, and lacked sons."
    },
    "4": {
      "General": "'Why should our father's name be lost from his clan just because he had no son? Give us property (a possession) among our father's relatives (brethren).'",
      "Non-Denominational": "They appeal for justice: Should their father's name/lineage disappear simply due to having no sons? They request land inheritance among their father's male relatives.",
      "Baptist": "They pose a question of fairness: Why should their father's name be eliminated from the family records because he lacked a son? They request an inheritance share among their father's kinsmen.",
      "Catholic": "They question the justice of their father's name disappearing from his clan due to lack of sons, requesting a property inheritance among their father's kinsmen.",
      "Methodist": "They ask why their father's name should vanish from the clan due to lack of a son, requesting an inheritance portion among their father's relatives.",
      "Lutheran": "They argue against their father's name being lost due to lack of a son and request an inheritance among their father's brothers."
    },
    "5": {
      "General": "Moses brings their case before the Lord for judgment.",
      "Non-Denominational": "Recognizing the unique situation, Moses seeks divine guidance, presenting their plea directly to the Lord.",
      "Baptist": "Moses, uncertain of the correct application of the law, takes their specific case to the Lord for a ruling.",
      "Catholic": "Moses refers their petition to the Lord for a decision.",
      "Methodist": "Moses presents their appeal to the Lord for His judgment.",
      "Lutheran": "Moses brings their legal case before the Lord for His ruling."
    },
    "6": {
      "General": "The Lord speaks to Moses.",
      "Non-Denominational": "God responds to Moses regarding the daughters' plea.",
      "Baptist": "The Lord gives His ruling to Moses.",
      "Catholic": "The Lord gives His instructions to Moses.",
      "Methodist": "God speaks His decision to Moses.",
      "Lutheran": "The Lord responds to Moses with His judgment."
    },
    "7": {
      "General": "'The daughters of Zelophehad are right. You must surely give them property as an inheritance among their father's relatives; transfer their father's inheritance to them.'",
      "Non-Denominational": "God validates their claim ('speak right'), commanding Moses to grant them land inheritance among their father's brothers, passing the father's allotted portion to them.",
      "Baptist": "The Lord affirms the daughters' request as just ('speak right'), commanding Moses to give them an inheritance among their father's brothers, transferring the father's inheritance to them.",
      "Catholic": "God declares the daughters' petition just, commanding Moses to grant them an inheritance among their father's kinsmen, transferring the paternal inheritance to them.",
      "Methodist": "God affirms their request is right, instructing Moses to give them an inheritance among their father's relatives, passing the father's inheritance to them.",
      "Lutheran": "The Lord declares the daughters' case is just ('speak right') and commands Moses to give them an inheritance among their father's brothers, transferring the father's inheritance."
    },
    "8": {
      "General": "'Furthermore, tell the Israelites: If a man dies and has no son, transfer his inheritance to his daughter.'",
      "Non-Denominational": "God establishes a general inheritance law: If a man dies sonless, his daughter inherits his property.",
      "Baptist": "The Lord promulgates a new statute for Israel: If a man dies without a son, his inheritance passes to his daughter.",
      "Catholic": "God establishes a general rule for Israel: If a man dies without a son, his inheritance shall pass to his daughter.",
      "Methodist": "God sets forth a general inheritance rule: If a man dies without a son, his inheritance goes to his daughter.",
      "Lutheran": "God establishes a general inheritance law (statute): If a man dies sonless, his inheritance transfers to his daughter."
    },
    "9": {
      "General": "'If he has no daughter, give his inheritance to his brothers.'",
      "Non-Denominational": "The law continues: If there is no daughter either, the inheritance goes to the deceased man's brothers.",
      "Baptist": "The statute continues: If he has no daughter, the inheritance goes to his brothers.",
      "Catholic": "The rule continues: If he has no daughter, the inheritance goes to his brothers.",
      "Methodist": "If there is no daughter, the inheritance passes to his brothers.",
      "Lutheran": "The law continues: If no daughter exists, the inheritance goes to his brothers."
    },
    "10": {
      "General": "'If he has no brothers, give his inheritance to his father's brothers.'",
      "Non-Denominational": "Further provision: If there are no brothers, the inheritance goes to his father's brothers (uncles).",
      "Baptist": "The statute continues: If he has no brothers, the inheritance goes to his paternal uncles.",
      "Catholic": "The rule continues: If he has no brothers, the inheritance goes to his paternal uncles.",
      "Methodist": "If there are no brothers, the inheritance passes to his father's brothers.",
      "Lutheran": "The law continues: If no brothers exist, the inheritance goes to his father's brothers."
    },
    "11": {
      "General": "'If his father had no brothers, give his inheritance to the nearest relative in his clan, who shall possess it. This shall be a statute and ordinance (statute of judgment) for the Israelites, as the Lord commanded Moses.'",
      "Non-Denominational": "Final provision: If no paternal uncles exist, the inheritance goes to the closest relative within the clan. This entire sequence becomes a binding legal statute for Israel, commanded by God.",
      "Baptist": "The statute concludes: If there are no paternal uncles, the inheritance goes to the nearest kinsman of his family. This establishes a legal ordinance ('statute of judgment') for Israel, as commanded by the Lord.",
      "Catholic": "The final provision: If the father has no brothers, the inheritance goes to the nearest relative of his clan. This becomes a binding legal ordinance for Israel, as commanded by the Lord.",
      "Methodist": "If the father had no brothers, the inheritance passes to the nearest relative in the clan. This becomes a legal requirement ('statute of judgment') for Israel, commanded by God.",
      "Lutheran": "The law concludes: If no paternal uncles exist, the inheritance goes to the nearest kinsman in the family. This is established as a legal statute (Law) for Israel, per God's command."
    },
    "12": {
      "General": "The Lord tells Moses, 'Go up this Mount Abarim and view the land I have given the Israelites.'",
      "Non-Denominational": "God instructs Moses to ascend Mount Abarim to see the Promised Land designated for Israel.",
      "Baptist": "The Lord commands Moses to go up Mount Abarim to visually survey the land promised to Israel.",
      "Catholic": "The Lord directs Moses to ascend Mount Abarim and behold the land given to the Israelites.",
      "Methodist": "God instructs Moses to climb Mount Abarim to see the land promised to the Israelites.",
      "Lutheran": "The Lord commands Moses to ascend Mount Abarim to view the Promised Land given to Israel."
    },
    "13": {
      "General": "'After you have seen it, you too will be gathered to your people (die), just as your brother Aaron was.'",
      "Non-Denominational": "God informs Moses that after seeing the land, he will die and join his ancestors, just like his brother Aaron.",
      "Baptist": "The Lord tells Moses that seeing the land will precede his death ('gathered unto thy people'), mirroring Aaron's end.",
      "Catholic": "God informs Moses that after viewing the land, he too will die ('be gathered to your people'), like his brother Aaron.",
      "Methodist": "God tells Moses that after seeing the land, he will die, joining his ancestors, just as Aaron did.",
      "Lutheran": "The Lord informs Moses that after viewing the land, he will die ('be gathered to thy people'), just as Aaron did."
    },
    "14": {
      "General": "'For in the Wilderness of Zin, during the strife of the congregation, you both rebelled against my command to honor me (sanctify me) as holy before their eyes at the waters.' (This refers to the waters of Meribah Kadesh in the Wilderness of Zin).",
      "Non-Denominational": "God reminds Moses of the reason: his rebellion (along with Aaron) at Meribah in Zin, failing to publicly sanctify God at the waters during the people's contention.",
      "Baptist": "The Lord gives the reason for Moses' exclusion: rebellion against His command at Meribah Kadesh (Zin) during the people's strife, failing to sanctify God before them at the waters.",
      "Catholic": "God explains the reason: Moses and Aaron rebelled against His command in the Zin desert during the community's strife by failing to manifest His holiness at the waters (Meribah Kadesh).",
      "Methodist": "God states the reason: Moses and Aaron rebelled against His command at Meribah in Zin by not honoring Him as holy before the people at the waters.",
      "Lutheran": "God states the reason (Law): Moses and Aaron rebelled against His command at Meribah in Zin, failing to sanctify Him before the people at the waters."
    },
    "15": {
      "General": "Moses speaks to the Lord.",
      "Non-Denominational": "Moses addresses the Lord in response.",
      "Baptist": "Moses makes a petition to the Lord.",
      "Catholic": "Moses petitions the Lord.",
      "Methodist": "Moses speaks to the Lord.",
      "Lutheran": "Moses addresses the Lord."
    },
    "16": {
      "General": "'May the Lord, the God who gives breath (the God of the spirits) to all flesh, appoint a man over the congregation...'",
      "Non-Denominational": "Moses prays that the Lord, acknowledged as the source of life for all people ('God of the spirits of all flesh'), would appoint a new leader over Israel.",
      "Baptist": "Moses prays, addressing God as the sovereign source of life ('God of the spirits of all flesh'), asking Him to appoint a leader over the congregation.",
      "Catholic": "Moses prays, asking the Lord, the God of the spirits of all flesh, to appoint a leader for the community.",
      "Methodist": "Moses requests that the Lord, the 'God of the spirits of all flesh,' appoint a man to lead the congregation.",
      "Lutheran": "Moses prays, asking the Lord, the 'God of the spirits of all flesh,' to appoint a leader over the congregation."
    },
    "17": {
      "General": "'...who will go out and come in before them, one who will lead them out and bring them in, so the Lord's congregation will not be like sheep without a shepherd.'",
      "Non-Denominational": "Moses specifies the leader's role: to actively lead the people in all their affairs (going out/coming in, leading out/bringing in), preventing them from becoming directionless like sheep lacking a shepherd.",
      "Baptist": "Moses desires a leader who will actively guide Israel in all activities (military and civil), so they won't be vulnerable and disorganized like sheep without a shepherd.",
      "Catholic": "Moses asks for a leader to guide the people in their activities ('go out... come in... lead them out... bring them in'), ensuring the Lord's community is not left without guidance like shepherdless sheep.",
      "Methodist": "Moses requests a leader to guide the people ('go out... come in... lead... bring in'), so that God's people won't be like sheep lacking a shepherd.",
      "Lutheran": "Moses asks for a leader to actively guide the people ('go out/in', 'lead out/in'), preventing the Lord's congregation from being like sheep without a shepherd."
    },
    "18": {
      "General": "So the Lord said to Moses, 'Take Joshua son of Nun, a man in whom is the spirit, and lay your hand on him.'",
      "Non-Denominational": "God designates Joshua son of Nun, identified as a man possessing the Spirit (of wisdom/leadership), instructing Moses to commission him by laying his hand upon him.",
      "Baptist": "The Lord chooses Joshua son of Nun, described as 'a man in whom is the spirit' (empowered by God's Spirit), and commands Moses to formally commission him by laying his hand on him.",
      "Catholic": "The Lord instructs Moses to take Joshua son of Nun, a man endowed with the spirit, and to lay his hand upon him as a sign of designation.",
      "Methodist": "God directs Moses to select Joshua son of Nun, described as having the spirit within him, and to lay his hand on him for commissioning.",
      "Lutheran": "The Lord commands Moses to take Joshua son of Nun, 'a man in whom is the spirit' (God's enabling Spirit - Gospel), and lay his hand on him."
    },
    "19": {
      "General": "'Have him stand before Eleazar the priest and the entire assembly and commission him (give him a charge) in their sight.'",
      "Non-Denominational": "Instructs Moses to present Joshua publicly before the priest and the whole congregation and formally charge him with his duties in their presence.",
      "Baptist": "Commands Moses to present Joshua before Eleazar the priest and the entire congregation, publicly commissioning ('give him a charge') him before them.",
      "Catholic": "Instructs Moses to present Joshua before Eleazar the priest and the whole community and to commission him in their presence.",
      "Methodist": "Instructs Moses to have Joshua stand before Eleazar and the entire assembly and publicly commission him.",
      "Lutheran": "Command Moses to set Joshua before Eleazar the priest and the whole congregation and give him his charge publicly."
    },
    "20": {
      "General": "'Invest him with some of your authority (honor) so the whole Israelite community will obey him.'",
      "Non-Denominational": "Moses is to transfer a portion of his own God-given authority/honor to Joshua, ensuring the obedience of the Israelite congregation.",
      "Baptist": "Moses is commanded to bestow some of his honor (authority, dignity) upon Joshua, so that the entire congregation of Israel will recognize and obey his leadership.",
      "Catholic": "Moses is to confer some of his authority ('honour') upon Joshua, ensuring the obedience of the entire Israelite community.",
      "Methodist": "Moses is to impart some of his authority ('honour') to Joshua, ensuring the entire community of Israel will obey him.",
      "Lutheran": "Moses is commanded to place some of his honor (authority) upon Joshua, so the whole congregation of Israel will obey him."
    },
    "21": {
      "General": "'He is to stand before Eleazar the priest, who will obtain decisions (ask counsel) for him by inquiring of the Urim before the Lord. At his command (word), Joshua and the entire community of Israel will go out, and at his command they will come in.'",
      "Non-Denominational": "Specifies Joshua's method for seeking divine guidance: through Eleazar the priest consulting the Urim before the Lord. The priest's word, based on this divine inquiry, will direct the actions (going out/coming in) of Joshua and all Israel.",
      "Baptist": "Joshua's direction will come via Eleazar the priest consulting the Urim (a means of divine inquiry) before the Lord. Based on the priest's instruction ('at his word'), Joshua and all Israel will conduct their affairs.",
      "Catholic": "Joshua will receive guidance by standing before Eleazar the priest, who will inquire for him through the judgment of the Urim before the Lord. The priest's directives will guide the movements of Joshua and the entire community.",
      "Methodist": "Joshua is to seek guidance by standing before Eleazar the priest, who will use the judgment of the Urim before the Lord to discern God's will. This priestly word will direct the actions of Joshua and the community.",
      "Lutheran": "Joshua is to stand before Eleazar the priest, who will seek counsel for him via the judgment of the Urim before the Lord. By this word, Joshua and all Israel will operate."
    },
    "22": {
      "General": "Moses did as the Lord commanded him. He took Joshua and had him stand before Eleazar the priest and the whole assembly.",
      "Non-Denominational": "Moses faithfully executes God's commands, taking Joshua and presenting him publicly before Eleazar and the congregation.",
      "Baptist": "Moses obediently follows the Lord's instructions, taking Joshua and setting him before Eleazar the priest and the entire congregation.",
      "Catholic": "Moses carries out the Lord's command, taking Joshua and presenting him before Eleazar the priest and the whole community.",
      "Methodist": "Moses obeys God's command, taking Joshua and having him stand before Eleazar the priest and the entire assembly.",
      "Lutheran": "Moses obeys the Lord's command, taking Joshua and setting him before Eleazar the priest and the whole congregation."
    },
    "23": {
      "General": "Then he laid his hands on him and commissioned him (gave him a charge), just as the Lord had instructed through Moses (by the hand of Moses).",
      "Non-Denominational": "Moses completes the commissioning by laying his hands on Joshua and giving him his charge, exactly as the Lord had directed through him.",
      "Baptist": "Moses lays his hands on Joshua and gives him the official charge, precisely fulfilling what the Lord had commanded through him.",
      "Catholic": "Moses lays his hands on Joshua and commissions him, just as the Lord had commanded through Moses.",
      "Methodist": "Moses lays his hands on Joshua and commissions him, fulfilling the Lord's instructions given through Moses.",
      "Lutheran": "Moses lays his hands on Joshua and gives him his charge, exactly as the Lord commanded through Moses."
    }
  }
}
