{
  "Summary": {
    "General": "God instructs Moses regarding the offerings Israel must present at their appointed times as a pleasing aroma to Him. This chapter details the regular sacrifices: the daily burnt offering (two lambs, morning and evening, with grain and drink offerings), the weekly Sabbath offering (two additional lambs with grain and drink offerings, besides the daily), and the monthly offering at the beginning of each month (two bulls, one ram, seven lambs, plus a goat for a sin offering, all with specific grain and drink offerings). It then specifies the offerings for the Passover (observed on the 14th day of the first month) and the subsequent seven-day Feast of Unleavened Bread (starting on the 15th). This feast involves a holy convocation and rest from work on the first and seventh days, and daily offerings for seven days identical to the monthly offering (two bulls, one ram, seven lambs, plus a goat for sin offering), in addition to the regular daily burnt offering. Finally, it details the offerings for the Day of Firstfruits (Feast of Weeks/Pentecost), which also requires a holy convocation and rest from work. The special burnt offering for this day is identical to the monthly and Unleavened Bread offerings (two bulls, one ram, seven lambs), accompanied by a goat for a sin offering, all in addition to the continual daily burnt offering. All burnt offering animals must be without blemish.",
    "Non-Denominational": "Focuses on the importance of regular, prescribed worship and atonement through sacrifice, maintaining fellowship with God. The detailed schedule (daily, weekly, monthly, annual festivals) emphasizes the rhythm of devotion God desired. These offerings, described as 'food' and a 'pleasing aroma' to God, represent Israel's dedication and God's provision. The repetition underscores the constancy of worship required. The inclusion of sin offerings alongside burnt offerings highlights the ongoing need for atonement. Passover and Firstfruits are emphasized as key moments in God's redemptive calendar, requiring specific communal worship.",
    "Baptist": "Emphasizes God's holiness, the necessity of atonement for sin through blood sacrifice (prefiguring Christ), and the importance of obedient worship according to divine instruction. The detailed regulations for daily, weekly, monthly, and festival offerings highlight the structure and seriousness of the sacrificial system ordained by God. The requirement for unblemished animals points to the perfection required in approaching a holy God and foreshadows Christ's perfect sacrifice. The repetition of sacrifices underscores humanity's continual need for atonement. Observance of these appointed times was central to Israel's covenant relationship.",
    "Catholic": "Views the prescribed offerings as central to the Old Covenant liturgy, expressing worship, thanksgiving, and atonement, foreshadowing the one perfect sacrifice of Christ. The detailed calendar of sacrifices (daily, Sabbath, New Moon, Passover, Unleavened Bread, Firstfruits) establishes the liturgical year and sanctifies time. The specific requirements for unblemished animals and precise measurements reflect the sacredness of the worship due to God. These rites maintain the covenant relationship and provide for communal and individual atonement, preparing for the definitive atonement in Christ.",
    "Methodist": "Highlights the importance of ordered and consistent worship practices as commanded by God for maintaining the covenant relationship. The schedule of daily, weekly, monthly, and festival sacrifices provided a framework for Israel's spiritual life, reminding them of God's sovereignty, provision, and the need for atonement. The 'sweet savour' indicates offerings given in obedience are acceptable to God. The emphasis on specific times ('due season') underscores faithfulness. These practices fostered communal identity and dependence on God, pointing towards the ultimate sacrifice of Christ fulfilling these types.",
    "Lutheran": "Focuses on God's command (Law) establishing the specific requirements for worship and sacrifice necessary under the Old Covenant to maintain favor and deal with sin. The sacrifices, including burnt offerings (devotion) and sin offerings (atonement), point to humanity's inability to satisfy God's Law perfectly and the need for substitution. The requirement for unblemished sacrifices foreshadows Christ, the perfect Lamb (Gospel). The prescribed calendar sanctifies time and orders worship life according to God's decree. Obedience to these commands demonstrates faithfulness within the covenant structure."
  },
  "Verses": {
    "1": {
      "General": "The Lord speaks to Moses.",
      "Non-Denominational": "God communicates further instructions to Moses.",
      "Baptist": "The Lord gives Moses specific commands regarding worship.",
      "Catholic": "The Lord addresses Moses with instructions.",
      "Methodist": "God speaks instructions to Moses.",
      "Lutheran": "The Lord addresses Moses, giving commands."
    },
    "2": {
      "General": "'Command the Israelites: Be careful to present to me at its appointed time my offering, my food for my offerings by fire, as a pleasing aroma to me.'",
      "Non-Denominational": "Instruct Israel to be diligent in bringing God's required offerings (described metaphorically as His 'food' or 'bread' from fire sacrifices) at the designated times, which are a pleasing aroma to Him.",
      "Baptist": "Command Israel to faithfully observe offering God's required sacrifices ('My offering, and my bread') by fire at their proper times ('due season'), which serve as a sweet savour (pleasing aroma) to Him.",
      "Catholic": "Instruct the Israelites to be careful to present God's offering, His food for sacrifices by fire, as a pleasing fragrance, at the designated time.",
      "Methodist": "Tell the Israelites to be careful to present God's offerings—His food presented by fire as a pleasing aroma—at their appointed times.",
      "Lutheran": "Command Israel to observe presenting God's offering, His 'bread' for fire sacrifices, as a pleasing aroma, at the correct time (due season)."
    },
    "3": {
      "General": "'Say to them: This is the food offering (offering made by fire) you shall offer to the Lord: two male lambs a year old without defect, day by day, as a regular burnt offering.'",
      "Non-Denominational": "Specify the daily requirement: two unblemished yearling male lambs as a continual burnt offering made by fire to the Lord.",
      "Baptist": "Detail the daily burnt offering: two unblemished, year-old male lambs, offered continually, day by day, as a fire sacrifice to the Lord.",
      "Catholic": "Specify the daily fire offering to the Lord: two unblemished yearling lambs each day as a regular burnt offering.",
      "Methodist": "Instruct them on the daily fire offering: two flawless yearling lambs each day as a continual burnt offering.",
      "Lutheran": "Detail the required daily fire offering: two perfect yearling male lambs, day by day, as a continual burnt offering."
    },
    "4": {
      "General": "'Offer one lamb in the morning and the other lamb at twilight (between the evenings).'",
      "Non-Denominational": "Schedule the daily offering: one lamb in the morning, the second at twilight.",
      "Baptist": "Specify the timing: one lamb offered in the morning, the second offered at twilight ('at even').",
      "Catholic": "Designate the times for the daily offering: one lamb in the morning, the other at twilight.",
      "Methodist": "Prescribe the timing: one lamb in the morning, the other at twilight.",
      "Lutheran": "Specify the timing: one lamb in the morning and the other at twilight ('at even')."
    },
    "5": {
      "General": "'Also offer a tenth of an ephah of fine flour for a grain offering, mixed with a quarter of a hin of oil from pressed olives.'",
      "Non-Denominational": "Include the accompanying grain offering: a tenth of an ephah of fine flour mixed with a quarter hin of high-quality pressed olive oil.",
      "Baptist": "Mandate the accompanying grain ('meat') offering: one-tenth ephah of fine flour mixed with one-fourth hin of beaten (pure) oil.",
      "Catholic": "Specify the accompanying grain offering: a tenth of an ephah of fine flour mixed with a fourth of a hin of beaten oil.",
      "Methodist": "Include the required grain offering: a tenth of an ephah of fine flour mixed with a quarter hin of pressed olive oil.",
      "Lutheran": "Require the grain offering: a tenth ephah of flour mixed with a fourth hin of beaten oil."
    },
    "6": {
      "General": "'This is the regular burnt offering ordained at Mount Sinai for a pleasing aroma, a food offering (offering made by fire) to the Lord.'",
      "Non-Denominational": "Identify this daily practice as the continual burnt offering established at Sinai, a pleasing aroma, a fire offering to God.",
      "Baptist": "Confirm this as the continual burnt offering commanded at Sinai, a sweet-smelling fire sacrifice to the Lord.",
      "Catholic": "State this is the regular burnt offering established at Mount Sinai as a pleasing fragrance, a fire offering to the Lord.",
      "Methodist": "Identify this as the continual burnt offering instituted at Mount Sinai, a pleasing aroma, an offering by fire to the Lord.",
      "Lutheran": "Identify this continual burnt offering as the one ordained at Sinai, a pleasing aroma, a fire sacrifice to the Lord."
    },
    "7": {
      "General": "'The accompanying drink offering shall be a quarter of a hin for each lamb. Pour out the drink offering of fermented drink (strong wine) to the Lord in the sanctuary area (holy place).'",
      "Non-Denominational": "Specify the drink offering: a quarter hin of fermented drink (strong wine) poured out to the Lord in the Holy Place for each lamb.",
      "Baptist": "Detail the drink offering: one-fourth hin for each lamb; this strong wine is to be poured out to the Lord in the holy place.",
      "Catholic": "Describe the drink offering: a fourth of a hin per lamb, poured out as an offering of strong drink to the Lord within the sanctuary.",
      "Methodist": "Specify the drink offering: a quarter hin for each lamb, pouring out the fermented drink to the Lord in the holy place.",
      "Lutheran": "Detail the drink offering: a fourth hin for each lamb; strong wine poured out to the Lord in the holy place."
    },
    "8": {
      "General": "'Offer the second lamb at twilight (between the evenings); offer it with the same kind of grain offering and drink offering as in the morning, a food offering (offering made by fire), a pleasing aroma to the Lord.'",
      "Non-Denominational": "Instruct that the evening lamb be offered identically to the morning one, with its corresponding grain and drink offerings, as a fire offering, a pleasing aroma to God.",
      "Baptist": "Command the evening lamb sacrifice to mirror the morning one, including the same grain ('meat') and drink offerings, presented as a fire sacrifice, a sweet savour to the Lord.",
      "Catholic": "Direct the offering of the second lamb at twilight, accompanied by the same grain and drink offerings as the morning sacrifice, as a fire offering, a pleasing fragrance to the Lord.",
      "Methodist": "Instruct the offering of the twilight lamb identically to the morning one, with the same grain and drink offerings, as a fire offering, a pleasing aroma to the Lord.",
      "Lutheran": "Command the evening lamb to be offered just like the morning one, with its grain and drink offering, as a fire sacrifice, a pleasing aroma to the Lord."
    },
    "9": {
      "General": "'On the Sabbath day, offer two male lambs a year old without defect, plus a grain offering of two-tenths of an ephah of fine flour mixed with oil, and its drink offering.'",
      "Non-Denominational": "Specify the Sabbath offering: two unblemished yearling male lambs, plus a double portion (two-tenths ephah) of fine flour mixed with oil, and its drink offering.",
      "Baptist": "Detail the Sabbath day offering: two perfect yearling male lambs, two-tenths ephah of fine flour mixed with oil for the grain ('meat') offering, and its drink offering.",
      "Catholic": "Prescribe the Sabbath offering: two unblemished yearling lambs, two-tenths of an ephah of fine flour mixed with oil as a grain offering, and its corresponding drink offering.",
      "Methodist": "Instruct for the Sabbath: offer two flawless yearling lambs, two-tenths ephah of fine flour with oil, and the accompanying drink offering.",
      "Lutheran": "Prescribe the Sabbath offering: two perfect yearling male lambs, two-tenths ephah of flour with oil (grain offering), and its drink offering."
    },
    "10": {
      "General": "'This is the burnt offering for every Sabbath, in addition to the regular daily burnt offering and its drink offering.'",
      "Non-Denominational": "Clarify this Sabbath burnt offering is required *in addition to* the regular daily burnt offering and its drink offering.",
      "Baptist": "State this is the required burnt offering for each Sabbath, offered *besides* the continual daily burnt offering and its drink offering.",
      "Catholic": "Specify this weekly Sabbath burnt offering is supplementary to the continual daily burnt offering and its drink offering.",
      "Methodist": "Clarify this special Sabbath offering is presented *in addition to* the regular daily burnt offering and its drink offering.",
      "Lutheran": "State this is the specific burnt offering for every Sabbath, *in addition to* the continual daily burnt offering and its drink offering."
    },
    "11": {
      "General": "'At the beginnings of your months (New Moons), you shall offer a burnt offering to the Lord: two young bulls, one ram, seven male lambs a year old without defect.'",
      "Non-Denominational": "Specify the New Moon offering: a burnt offering consisting of two young bulls, one ram, and seven unblemished yearling male lambs.",
      "Baptist": "Detail the monthly (New Moon) burnt offering: two young bulls, one ram, seven perfect yearling male lambs.",
      "Catholic": "Prescribe the offering for the beginning of each month (New Moon): a burnt offering to the Lord of two young bulls, one ram, and seven unblemished yearling lambs.",
      "Methodist": "Instruct for the start of each month (New Moon): offer a burnt offering of two young bulls, one ram, and seven flawless yearling lambs.",
      "Lutheran": "Prescribe the New Moon burnt offering: two young bulls, one ram, seven perfect yearling male lambs."
    },
    "12": {
      "General": "'With each bull offer a grain offering of three-tenths of an ephah of fine flour mixed with oil; with the ram, two-tenths of an ephah of fine flour mixed with oil.'",
      "Non-Denominational": "Detail the accompanying grain offerings: three-tenths ephah of flour with oil for each bull, and two-tenths ephah of flour with oil for the ram.",
      "Baptist": "Specify the grain ('meat') offerings for the monthly sacrifice: three-tenths ephah of flour with oil per bull, and two-tenths ephah of flour with oil for the ram.",
      "Catholic": "Detail the grain offerings for the New Moon sacrifice: three-tenths of an ephah of fine flour mixed with oil for each bull, and two-tenths for the ram.",
      "Methodist": "Specify the grain offerings: three-tenths ephah of flour with oil for each bull, and two-tenths ephah for the ram.",
      "Lutheran": "Detail the grain offerings: three-tenths ephah of flour with oil for each bull, two-tenths ephah for the ram."
    },
    "13": {
      "General": "'And with each lamb, a tenth of an ephah of fine flour mixed with oil. This is for a burnt offering, a pleasing aroma, a food offering (offering made by fire) to the Lord.'",
      "Non-Denominational": "Specify the grain offering for each lamb (one-tenth ephah of flour with oil), identifying the entire offering as a burnt offering, a pleasing aroma, a fire offering to God.",
      "Baptist": "Require a separate ('several') tenth ephah of flour with oil for each lamb, designating this as a burnt offering, a sweet-smelling fire sacrifice to the Lord.",
      "Catholic": "Specify a tenth of an ephah of fine flour mixed with oil as the grain offering for each lamb, part of the burnt offering, a pleasing fragrance, a fire offering to the Lord.",
      "Methodist": "Require a tenth ephah of flour with oil for each lamb, constituting a burnt offering, a pleasing aroma, a fire offering to the Lord.",
      "Lutheran": "Require a separate tenth ephah of flour with oil for each lamb; this is a burnt offering, a pleasing aroma, a fire sacrifice to the Lord."
    },
    "14": {
      "General": "'Their accompanying drink offerings shall be: half a hin of wine for a bull, a third of a hin for the ram, and a quarter of a hin for a lamb. This is the burnt offering for each month throughout the months of the year.'",
      "Non-Denominational": "Specify the drink offerings for the monthly sacrifice: half a hin of wine per bull, one-third hin per ram, one-quarter hin per lamb. Reiterate this is the required monthly burnt offering.",
      "Baptist": "Detail the monthly drink offerings: one-half hin of wine per bull, one-third hin per ram, one-fourth hin per lamb. Confirms this as the prescribed burnt offering for every month.",
      "Catholic": "Detail the drink offerings: half a hin of wine for each bull, a third for the ram, and a fourth for each lamb. This constitutes the monthly burnt offering throughout the year.",
      "Methodist": "Specify the drink offerings: half hin of wine per bull, a third hin per ram, a quarter hin per lamb. This is the required monthly burnt offering.",
      "Lutheran": "Detail the drink offerings: half hin of wine per bull, third hin per ram, quarter hin per lamb. This is the prescribed monthly burnt offering."
    },
    "15": {
      "General": "'Also, one male goat shall be offered to the Lord as a sin offering, in addition to the regular daily burnt offering and its drink offering.'",
      "Non-Denominational": "Require an additional sacrifice at the New Moon: one male goat as a sin offering to the Lord, presented *besides* the continual daily burnt offering and its drink offering.",
      "Baptist": "Mandate a sin offering for the New Moon: one male goat offered to the Lord, *in addition to* the regular daily burnt offering with its drink offering.",
      "Catholic": "Add a requirement for the New Moon: one male goat as a sin offering to the Lord, offered *in addition to* the regular burnt offering and its drink offering.",
      "Methodist": "Require also for the New Moon: one male goat for a sin offering, presented *in addition to* the continual burnt offering and its drink offering.",
      "Lutheran": "Require a sin offering at the New Moon: one male goat, offered *besides* the continual burnt offering and its drink offering."
    },
    "16": {
      "General": "'The Lord's Passover is to be held on the fourteenth day of the first month.'",
      "Non-Denominational": "States the date for the Passover observance: the 14th day of the first month.",
      "Baptist": "Specifies the date for the Lord's Passover: the 14th day of the first month (Nisan).",
      "Catholic": "Designates the date for the Passover of the Lord: the fourteenth day of the first month.",
      "Methodist": "Sets the date for the Lord's Passover: the 14th day of the first month.",
      "Lutheran": "Specifies the date for the Lord's Passover: the 14th day of the first month."
    },
    "17": {
      "General": "'On the fifteenth day of this month there shall be a festival; for seven days unleavened bread must be eaten.'",
      "Non-Denominational": "Beginning the day after Passover (15th), a seven-day festival commences, during which only unleavened bread is to be eaten.",
      "Baptist": "States that the Feast of Unleavened Bread begins on the 15th day, lasting seven days, requiring the eating of unleavened bread.",
      "Catholic": "Declares a festival on the fifteenth day of the month, lasting seven days, during which unleavened bread must be eaten.",
      "Methodist": "Specifies the Feast of Unleavened Bread starts on the 15th day, lasting seven days, requiring the consumption of unleavened bread.",
      "Lutheran": "Specifies the Feast of Unleavened Bread begins on the 15th day, lasting seven days, characterized by eating unleavened bread."
    },
    "18": {
      "General": "'On the first day hold a sacred assembly (holy convocation); do no regular work (servile work).'",
      "Non-Denominational": "The first day of the Feast of Unleavened Bread is a day of sacred assembly, where ordinary work is prohibited.",
      "Baptist": "Commands a holy convocation (sacred assembly) on the first day, prohibiting all regular occupational work ('servile work').",
      "Catholic": "Designates the first day as a sacred assembly, forbidding any strenuous work.",
      "Methodist": "Requires a holy convocation on the first day, prohibiting regular work.",
      "Lutheran": "Commands a holy convocation (sacred assembly) on the first day, forbidding regular ('servile') work."
    },
    "19": {
      "General": "'Present a food offering (offering made by fire), a burnt offering to the Lord: two young bulls, one ram, and seven male lambs a year old. Ensure they are without defect.'",
      "Non-Denominational": "Specify the burnt offering for this festival day: a fire offering of two young bulls, one ram, and seven yearling male lambs, all without blemish.",
      "Baptist": "Command a specific burnt offering by fire for the festival: two young bulls, one ram, and seven yearling male lambs, ensuring they are unblemished.",
      "Catholic": "Require a fire offering, a burnt offering to the Lord: two young bulls, one ram, and seven yearling lambs, all without blemish.",
      "Methodist": "Instruct to offer a fire offering, a burnt offering: two young bulls, one ram, seven yearling lambs, ensuring they are flawless.",
      "Lutheran": "Command a fire sacrifice, a burnt offering: two young bulls, one ram, seven perfect yearling male lambs."
    },
    "20": {
      "General": "'With them present their grain offering of fine flour mixed with oil: three-tenths of an ephah for each bull and two-tenths for the ram.'",
      "Non-Denominational": "Detail the accompanying grain offerings: three-tenths ephah of flour with oil per bull, and two-tenths ephah per ram.",
      "Baptist": "Specify the accompanying grain ('meat') offerings: three-tenths ephah of flour with oil for each bull, two-tenths ephah for the ram.",
      "Catholic": "Detail the grain offerings: three-tenths of an ephah of fine flour mixed with oil for each bull, and two-tenths for the ram.",
      "Methodist": "Specify the grain offerings: three-tenths ephah of flour with oil per bull, two-tenths ephah for the ram.",
      "Lutheran": "Detail the grain offerings: three-tenths ephah of flour with oil for each bull, two-tenths for the ram."
    },
    "21": {
      "General": "'Offer one-tenth of an ephah for each of the seven lambs.'",
      "Non-Denominational": "Require one-tenth ephah of flour with oil as the grain offering for each of the seven lambs.",
      "Baptist": "Require a separate ('several') tenth ephah for each of the seven lambs.",
      "Catholic": "Require a tenth of an ephah for each of the seven lambs.",
      "Methodist": "Specify one-tenth ephah for each of the seven lambs.",
      "Lutheran": "Require a separate tenth ephah for each of the seven lambs."
    },
    "22": {
      "General": "'Also include one male goat as a sin offering to make atonement for you.'",
      "Non-Denominational": "Include a male goat for a sin offering to provide atonement for the people.",
      "Baptist": "Require one male goat for a sin offering to make atonement.",
      "Catholic": "Include one male goat as a sin offering to make atonement for the community.",
      "Methodist": "Require one male goat as a sin offering for atonement.",
      "Lutheran": "Include one male goat for a sin offering for atonement."
    },
    "23": {
      "General": "'Offer these in addition to the regular morning burnt offering.'",
      "Non-Denominational": "Clarify these special festival offerings are presented *in addition to* the continual morning burnt offering.",
      "Baptist": "State these offerings are *besides* the regular morning burnt offering (the continual daily sacrifice).",
      "Catholic": "Specify these offerings are supplementary to the morning burnt offering, which is the regular daily sacrifice.",
      "Methodist": "Clarify these are offered *in addition to* the regular morning burnt offering.",
      "Lutheran": "State these are offered *besides* the continual morning burnt offering."
    },
    "24": {
      "General": "'In this manner, offer the food (meat) of the food offering (offering made by fire) daily for seven days as a pleasing aroma to the Lord; it is to be offered in addition to the regular daily burnt offering and its drink offering.'",
      "Non-Denominational": "Instruct that this entire set of sacrifices (burnt offerings, grain, sin offering) be offered daily throughout the seven days of the feast, as a pleasing aroma, *in addition to* the regular daily burnt offering and its drink offering.",
      "Baptist": "Command this pattern of fire sacrifices ('meat of the sacrifice') as a sweet savour to be offered daily for the seven days of the feast, *besides* the continual burnt offering and its drink offering.",
      "Catholic": "Direct this manner of daily offering for seven days – the food of the fire sacrifice, a pleasing fragrance to the Lord – offered *in addition to* the regular burnt offering and its drink offering.",
      "Methodist": "Instruct this pattern of fire offering to be presented daily for seven days, a pleasing aroma to the Lord, *in addition to* the regular burnt offering and its drink offering.",
      "Lutheran": "Command this manner of fire sacrifice daily for seven days, a pleasing aroma to the Lord, offered *besides* the continual burnt offering and its drink offering."
    },
    "25": {
      "General": "'On the seventh day hold a sacred assembly (holy convocation) and do no regular work (servile work).'",
      "Non-Denominational": "The seventh day of the Feast of Unleavened Bread is also a day of sacred assembly, prohibiting ordinary work.",
      "Baptist": "Commands a holy convocation (sacred assembly) on the seventh day, prohibiting all regular occupational work ('servile work').",
      "Catholic": "Designates the seventh day as a sacred assembly, forbidding any strenuous work.",
      "Methodist": "Requires a holy convocation on the seventh day, prohibiting regular work.",
      "Lutheran": "Commands a holy convocation (sacred assembly) on the seventh day, forbidding regular ('servile') work."
    },
    "26": {
      "General": "'Also, on the day of firstfruits, when you present a grain offering of new grain to the Lord during the Festival of Weeks (after your weeks be out), hold a sacred assembly (holy convocation) and do no regular work (servile work).'",
      "Non-Denominational": "Specify instructions for the Day of Firstfruits (Feast of Weeks/Pentecost): when presenting the new grain offering, hold a sacred assembly and cease from ordinary work.",
      "Baptist": "Command for the Day of Firstfruits (Feast of Weeks): hold a holy convocation and do no regular work when bringing the new grain ('meat') offering to the Lord at the conclusion of the weeks (after Passover).",
      "Catholic": "Instruct for the Day of Firstfruits (Feast of Weeks): hold a sacred assembly and do no strenuous work when presenting the offering of new grain to the Lord.",
      "Methodist": "Require for the Day of Firstfruits (Feast of Weeks): hold a holy convocation and abstain from regular work when presenting the new grain offering.",
      "Lutheran": "Command for the Day of Firstfruits (Feast of Weeks): a holy convocation and cessation of regular work when the new grain offering is presented."
    },
    "27": {
      "General": "'Present a burnt offering as a pleasing aroma to the Lord: two young bulls, one ram, and seven male lambs a year old.'",
      "Non-Denominational": "Specify the burnt offering for Firstfruits: two young bulls, one ram, and seven yearling male lambs, as a pleasing aroma to God.",
      "Baptist": "Command the burnt offering for Firstfruits as a sweet savour: two young bulls, one ram, seven yearling male lambs.",
      "Catholic": "Require a burnt offering for a pleasing fragrance to the Lord: two young bulls, one ram, and seven yearling lambs.",
      "Methodist": "Instruct the burnt offering for a pleasing aroma: two young bulls, one ram, seven yearling lambs.",
      "Lutheran": "Command the burnt offering for Firstfruits, a pleasing aroma: two young bulls, one ram, seven yearling male lambs."
    },
    "28": {
      "General": "'With them present their grain offering of fine flour mixed with oil: three-tenths of an ephah for each bull, two-tenths for the ram.'",
      "Non-Denominational": "Detail the accompanying grain offerings for Firstfruits: three-tenths ephah of flour with oil per bull, two-tenths ephah per ram.",
      "Baptist": "Specify the accompanying grain ('meat') offerings for Firstfruits: three-tenths ephah of flour with oil for each bull, two-tenths ephah for the ram.",
      "Catholic": "Detail the grain offerings for Firstfruits: three-tenths of an ephah of fine flour mixed with oil for each bull, and two-tenths for the ram.",
      "Methodist": "Specify the grain offerings for Firstfruits: three-tenths ephah of flour with oil per bull, two-tenths ephah for the ram.",
      "Lutheran": "Detail the grain offerings for Firstfruits: three-tenths ephah of flour with oil for each bull, two-tenths for the ram."
    },
    "29": {
      "General": "'Offer one-tenth of an ephah for each of the seven lambs.'",
      "Non-Denominational": "Require one-tenth ephah of flour with oil as the grain offering for each of the seven lambs for Firstfruits.",
      "Baptist": "Require a separate ('several') tenth ephah for each of the seven lambs for Firstfruits.",
      "Catholic": "Require a tenth of an ephah for each of the seven lambs for Firstfruits.",
      "Methodist": "Specify one-tenth ephah for each of the seven lambs for Firstfruits.",
      "Lutheran": "Require a separate tenth ephah for each of the seven lambs for Firstfruits."
    },
    "30": {
      "General": "'Also include one male goat to make atonement for you.'",
      "Non-Denominational": "Include a male goat with the Firstfruits offerings to provide atonement.",
      "Baptist": "Require one male goat for Firstfruits to make atonement.",
      "Catholic": "Include one male goat to make atonement for the community on Firstfruits.",
      "Methodist": "Require one male goat for atonement on Firstfruits.",
      "Lutheran": "Include one male goat for atonement on Firstfruits."
    },
    "31": {
      "General": "'Offer these (making sure they are without defect) with their drink offerings, in addition to the regular daily burnt offering and its grain offering.'",
      "Non-Denominational": "Instruct that these Firstfruits offerings (animals without blemish) and their drink offerings are to be presented *in addition to* the continual daily burnt offering and its corresponding grain offering.",
      "Baptist": "Command these Firstfruits offerings (ensuring the animals are unblemished) and their drink offerings be presented *besides* the continual daily burnt offering and its grain ('meat') offering.",
      "Catholic": "Direct these offerings (without blemish) and their drink offerings be presented *in addition to* the regular burnt offering and its grain offering.",
      "Methodist": "Instruct these offerings (without blemish) and their drink offerings are presented *in addition to* the continual burnt offering and its grain offering.",
      "Lutheran": "Command these Firstfruits offerings (animals without blemish) with their drink offerings be offered *besides* the continual burnt offering and its grain offering."
    }
  }
}
