{
  "Summary": {
    "General": "This chapter details the required offerings for the seventh month (Tishri), a month heavy with sacred observances. On the first day (Feast of Trumpets/Rosh Hashanah), a holy convocation is held with rest from work, and special burnt offerings (one bull, one ram, seven lambs) plus a sin offering (one goat) are presented, in addition to the regular monthly and daily offerings. On the tenth day (Day of Atonement/Yom Kippur), another holy convocation occurs with affliction of souls (fasting) and rest from work. Special burnt offerings (one bull, one ram, seven lambs) are offered, along with a specific sin offering (one goat), besides the primary sin offering of atonement (detailed in Leviticus 16) and the regular daily burnt offering. From the fifteenth day begins the seven-day Feast of Tabernacles/Booths (Sukkot). A holy convocation and rest from work mark the first day. A unique, diminishing scale of burnt offerings is required over the seven days: Day 1 (13 bulls, 2 rams, 14 lambs), Day 2 (12 bulls, 2 rams, 14 lambs), Day 3 (11 bulls, 2 rams, 14 lambs), Day 4 (10 bulls, 2 rams, 14 lambs), Day 5 (9 bulls, 2 rams, 14 lambs), Day 6 (8 bulls, 2 rams, 14 lambs), Day 7 (7 bulls, 2 rams, 14 lambs). Each day also includes one goat for a sin offering, all in addition to the continual daily burnt offerings with their grain and drink offerings. The eighth day, following the feast, is a solemn assembly (Shemini Atzeret) with rest from work, featuring burnt offerings (one bull, one ram, seven lambs) and a sin offering (one goat), alongside the regular daily sacrifices. All animals must be without blemish. Moses communicates these requirements to the Israelites.",
    "Non-Denominational": "Focuses on the heightened sacredness of the seventh month, emphasizing repentance (Trumpets, Atonement) and thanksgiving/remembrance (Tabernacles). The specific, numerous sacrifices underscore the seriousness of approaching God, the need for constant atonement, and joyful gratitude for His provision and presence. The blowing of trumpets signals a call to attention and repentance. The Day of Atonement highlights deep national repentance and cleansing. The Feast of Tabernacles commemorates God's provision during the wilderness journey and celebrates the harvest. The eighth day assembly provides a concluding time of worship. These observances structure communal spiritual life around key themes of repentance, forgiveness, and gratitude.",
    "Baptist": "Emphasizes God's sovereignty in establishing specific times and means of worship, the necessity of atonement through blood sacrifice (prefiguring Christ), and the call to repentance and thanksgiving. The Feast of Trumpets calls for spiritual awakening. The Day of Atonement, with its fasting and sacrifices, underscores the gravity of sin and the provision for forgiveness through substitutionary atonement. The Feast of Tabernacles, requiring numerous sacrifices and dwelling in booths, reminds Israel of their dependence on God and His faithfulness, pointing towards ultimate redemption. Obedience to these detailed commands was crucial for maintaining the covenant relationship.",
    "Catholic": "Views the liturgical calendar of the seventh month as rich in symbolism, pointing towards Christ's work. The Feast of Trumpets calls the faithful to vigilance. The Day of Atonement, with its emphasis on penance ('afflict your souls') and atonement, prefigures Christ's sacrifice for the forgiveness of sins. The Feast of Tabernacles commemorates God's dwelling with His people and looks forward to the final ingathering, foreshadowing the Church and heavenly rejoicing. The numerous sacrifices signify the fullness of worship due to God and the constant need for grace, ultimately fulfilled in the Eucharist. The solemn eighth day points to eternal rest.",
    "Methodist": "Highlights God's ordered plan for worship and spiritual formation within the community. The seventh month festivals call for reflection, repentance (Trumpets, Atonement), and joyful celebration of God's faithfulness and provision (Tabernacles). The 'afflicting of souls' on Atonement signifies sincere repentance. The abundance of sacrifices during Tabernacles reflects overflowing gratitude and dedication. These practices fostered communal piety, reminded Israel of their history and dependence on God, and instilled rhythms of grace, confession, and thanksgiving, pointing toward the perfect atonement and presence offered in Christ.",
    "Lutheran": "Focuses on God's commands (Law) dictating the specific sacrifices for the seventh month festivals, demonstrating His holiness and the requirements for approaching Him. The Feast of Trumpets serves as a call to repentance. The Day of Atonement emphasizes the need for atonement for sin, achieved through prescribed sacrifice (Law), foreshadowing Christ's ultimate sacrifice (Gospel). The Feast of Tabernacles, with its many offerings, demonstrates joyful response to God's provision yet underscores the constant need for mediation. The eighth day assembly concludes the cycle. These laws reveal human inability to fulfill righteousness and point to Christ who fulfills all requirements."
  },
  "Verses": {
    "1": {
      "General": "'On the first day of the seventh month, hold a sacred assembly (holy convocation) and do no regular work (servile work). It is a day for you to sound the trumpets (day of blowing the trumpets).'",
      "Non-Denominational": "Commands a sacred gathering with rest from work on the first day of the seventh month, designated as a day for blowing trumpets (Feast of Trumpets/Rosh Hashanah).",
      "Baptist": "Instructs a holy convocation and cessation of regular work on the first day of the seventh month, a day specifically marked by the blowing of trumpets.",
      "Catholic": "Requires a sacred assembly and cessation of strenuous work on the first day of the seventh month, designated as a day of trumpet blasts.",
      "Methodist": "Commands a holy convocation and no regular work on the first day of the seventh month, a day characterized by the blowing of trumpets.",
      "Lutheran": "Commands a holy convocation and cessation of regular work on the first day of the seventh month, designating it a day of trumpet blowing (Law)."
    },
    "2": {
      "General": "'As a pleasing aroma to the Lord, offer a burnt offering: one young bull, one ram, and seven male lambs a year old, all without defect.'",
      "Non-Denominational": "Specifies the burnt offering for this day, a pleasing aroma to God: one young bull, one ram, and seven unblemished yearling male lambs.",
      "Baptist": "Details the burnt offering for the Feast of Trumpets, a sweet savour to the Lord: one young bull, one ram, seven perfect yearling male lambs.",
      "Catholic": "Prescribes the burnt offering for a pleasing fragrance to the Lord: one young bull, one ram, and seven unblemished yearling lambs.",
      "Methodist": "Instructs the burnt offering for a pleasing aroma: one young bull, one ram, seven flawless yearling lambs.",
      "Lutheran": "Specifies the burnt offering for a pleasing aroma: one young bull, one ram, seven perfect yearling male lambs."
    },
    "3": {
      "General": "'With the bull offer a grain offering of three-tenths of an ephah of fine flour mixed with oil; with the ram, two-tenths.'",
      "Non-Denominational": "Details the accompanying grain offerings: three-tenths ephah of flour with oil for the bull, and two-tenths ephah for the ram.",
      "Baptist": "Specifies the grain ('meat') offerings: three-tenths ephah of flour with oil for the bull, two-tenths ephah for the ram.",
      "Catholic": "Details the grain offerings: three-tenths of an ephah of fine flour mixed with oil for the bull, and two-tenths for the ram.",
      "Methodist": "Specifies the grain offerings: three-tenths ephah of flour with oil per bull, two-tenths for the ram.",
      "Lutheran": "Details the grain offerings: three-tenths ephah of flour with oil for the bull, two-tenths for the ram."
    },
    "4": {
      "General": "'And with each of the seven lambs, one-tenth of an ephah.'",
      "Non-Denominational": "Requires one-tenth ephah of flour with oil as the grain offering for each of the seven lambs.",
      "Baptist": "Requires a separate ('several') tenth ephah for each of the seven lambs.",
      "Catholic": "Requires a tenth of an ephah for each of the seven lambs.",
      "Methodist": "Specifies one-tenth ephah for each of the seven lambs.",
      "Lutheran": "Requires a separate tenth ephah for each of the seven lambs."
    },
    "5": {
      "General": "'Also include one male goat as a sin offering to make atonement for you.'",
      "Non-Denominational": "Require one male goat as a sin offering for atonement.",
      "Baptist": "Mandates one male goat for a sin offering to provide atonement.",
      "Catholic": "Include one male goat as a sin offering to make atonement.",
      "Methodist": "Require one male goat as a sin offering for atonement.",
      "Lutheran": "Include one male goat for a sin offering for atonement."
    },
    "6": {
      "General": "'Offer these besides the monthly burnt offering and its grain offering, and the regular daily burnt offering and its grain offering, with their prescribed drink offerings, as a pleasing aroma, a food offering (offering made by fire) to the Lord.'",
      "Non-Denominational": "Clarifies these Feast of Trumpets offerings are *in addition to* the regular New Moon burnt offering, the continual daily burnt offering, and all their respective grain and drink offerings, presented as a pleasing aroma fire offering.",
      "Baptist": "States these special offerings are *besides* the monthly burnt offering, the daily burnt offering, and their associated grain ('meat') and drink offerings, offered according to regulation ('their manner') as a sweet-smelling fire sacrifice.",
      "Catholic": "Specifies these offerings are supplementary to the burnt offering of the new moon, the regular daily burnt offering, and their respective grain and drink offerings according to regulation, as a pleasing fragrance, a fire offering to the Lord.",
      "Methodist": "Clarifies these are offered *in addition to* the monthly burnt offering, the daily burnt offering, and their associated grain and prescribed drink offerings, as a pleasing aroma, a fire offering to the Lord.",
      "Lutheran": "States these offerings are *besides* the monthly burnt offering, the daily burnt offering, and their respective grain and drink offerings per the regulations, a pleasing aroma, a fire sacrifice to the Lord."
    },
    "7": {
      "General": "'On the tenth day of this seventh month, hold a sacred assembly (holy convocation). You must deny yourselves (afflict your souls) and do no work.'",
      "Non-Denominational": "Commands a sacred gathering on the tenth day of the seventh month (Day of Atonement/Yom Kippur), requiring self-denial (fasting, repentance) and complete rest from work.",
      "Baptist": "Instructs a holy convocation on the tenth day of the seventh month, commanding the people to afflict their souls (practice self-denial, fast) and abstain from all work.",
      "Catholic": "Requires a sacred assembly on the tenth day of the seventh month, commanding the people to practice self-denial ('afflict your souls') and refrain from all work.",
      "Methodist": "Commands a holy convocation on the tenth day of the seventh month, requiring self-denial ('afflict your souls') and cessation from all work.",
      "Lutheran": "Commands a holy convocation on the tenth day of the seventh month, requiring affliction of souls (Law) and cessation of all work."
    },
    "8": {
      "General": "'Present to the Lord a burnt offering as a pleasing aroma: one young bull, one ram, and seven male lambs a year old, all without defect.'",
      "Non-Denominational": "Specifies the burnt offering for the Day of Atonement, a pleasing aroma: one young bull, one ram, and seven unblemished yearling male lambs.",
      "Baptist": "Details the burnt offering for the Day of Atonement, a sweet savour: one young bull, one ram, seven perfect yearling male lambs.",
      "Catholic": "Prescribes the burnt offering for a pleasing fragrance: one young bull, one ram, and seven unblemished yearling lambs.",
      "Methodist": "Instructs the burnt offering for a pleasing aroma: one young bull, one ram, seven flawless yearling lambs.",
      "Lutheran": "Specifies the burnt offering for a pleasing aroma: one young bull, one ram, seven perfect yearling male lambs."
    },
    "9": {
      "General": "'With the bull offer a grain offering of three-tenths of an ephah of fine flour mixed with oil; with the ram, two-tenths.'",
      "Non-Denominational": "Details the accompanying grain offerings: three-tenths ephah of flour with oil for the bull, two-tenths ephah for the ram.",
      "Baptist": "Specifies the grain ('meat') offerings: three-tenths ephah of flour with oil for the bull, two-tenths ephah for the ram.",
      "Catholic": "Details the grain offerings: three-tenths of an ephah of fine flour mixed with oil for the bull, and two-tenths for the ram.",
      "Methodist": "Specifies the grain offerings: three-tenths ephah of flour with oil per bull, two-tenths for the ram.",
      "Lutheran": "Details the grain offerings: three-tenths ephah of flour with oil for the bull, two-tenths for the ram."
    },
    "10": {
      "General": "'And with each of the seven lambs, one-tenth of an ephah.'",
      "Non-Denominational": "Requires one-tenth ephah of flour with oil as the grain offering for each of the seven lambs.",
      "Baptist": "Requires a separate ('several') tenth ephah for each of the seven lambs.",
      "Catholic": "Requires a tenth of an ephah for each of the seven lambs.",
      "Methodist": "Specifies one-tenth ephah for each of the seven lambs.",
      "Lutheran": "Requires a separate tenth ephah for each of the seven lambs."
    },
    "11": {
      "General": "'Also include one male goat as a sin offering, besides the sin offering of atonement and the regular daily burnt offering with its grain offering and their drink offerings.'",
      "Non-Denominational": "Requires one male goat as a sin offering, specifically noting this is *in addition to* the main sin offering of Atonement Day (Lev. 16 scapegoat ritual), the continual daily burnt offering, its grain offering, and their drink offerings.",
      "Baptist": "Mandates one male goat for a sin offering, *in addition to* the primary sin offering of atonement (Lev. 16), the regular daily burnt offering, its grain ('meat') offering, and their respective drink offerings.",
      "Catholic": "Requires one male goat as a sin offering, supplementary to the sin offering of expiation (Lev. 16), the regular daily burnt offering, its grain offering, and their drink offerings.",
      "Methodist": "Requires one male goat for a sin offering, *in addition to* the sin offering of atonement, the continual daily burnt offering, its grain offering, and their associated drink offerings.",
      "Lutheran": "Includes one male goat for a sin offering, *besides* the main sin offering of atonement (Lev. 16), the continual burnt offering, its grain offering, and their drink offerings."
    },
    "12": {
      "General": "'On the fifteenth day of the seventh month, hold a sacred assembly (holy convocation) and do no regular work (servile work). Celebrate a festival to the Lord for seven days.'",
      "Non-Denominational": "Commands a sacred gathering with rest from work on the fifteenth day of the seventh month, initiating a seven-day festival to the Lord (Feast of Tabernacles/Booths).",
      "Baptist": "Instructs a holy convocation and cessation of regular work on the fifteenth day of the seventh month, beginning a seven-day feast dedicated to the Lord.",
      "Catholic": "Requires a sacred assembly and cessation of strenuous work on the fifteenth day of the seventh month, beginning a seven-day festival to the Lord.",
      "Methodist": "Commands a holy convocation and no regular work on the fifteenth day of the seventh month, initiating a seven-day festival to the Lord.",
      "Lutheran": "Commands a holy convocation and cessation of regular work on the fifteenth day of the seventh month, beginning a seven-day feast to the Lord (Law)."
    },
    "13": {
      "General": "'Present as a pleasing aroma to the Lord a food offering (offering made by fire), a burnt offering: thirteen young bulls, two rams, and fourteen male lambs a year old, all without defect.'",
      "Non-Denominational": "Specifies the extensive burnt offering for the first day of Tabernacles, a pleasing aroma fire offering: thirteen young bulls, two rams, and fourteen unblemished yearling male lambs.",
      "Baptist": "Details the large burnt offering by fire for the first day, a sweet savour: thirteen young bulls, two rams, fourteen perfect yearling male lambs.",
      "Catholic": "Prescribes the fire offering, a burnt offering for a pleasing fragrance to the Lord: thirteen young bulls, two rams, and fourteen unblemished yearling lambs.",
      "Methodist": "Instructs the fire offering, a burnt offering for a pleasing aroma: thirteen young bulls, two rams, fourteen flawless yearling lambs.",
      "Lutheran": "Specifies the fire sacrifice, a burnt offering for a pleasing aroma on day one: thirteen young bulls, two rams, fourteen perfect yearling male lambs."
    },
    "14": {
      "General": "'With the thirteen bulls offer a grain offering of three-tenths of an ephah of fine flour mixed with oil for each bull; with the two rams, two-tenths.'",
      "Non-Denominational": "Details the accompanying grain offerings: three-tenths ephah of flour with oil for each of the thirteen bulls, and two-tenths ephah for each of the two rams.",
      "Baptist": "Specifies the grain ('meat') offerings: three-tenths ephah of flour with oil for each of the thirteen bulls, two-tenths ephah for each of the two rams.",
      "Catholic": "Details the grain offerings: three-tenths of an ephah of fine flour mixed with oil for each of the thirteen bulls, and two-tenths for each of the two rams.",
      "Methodist": "Specifies the grain offerings: three-tenths ephah of flour with oil per bull, two-tenths per ram.",
      "Lutheran": "Details the grain offerings: three-tenths ephah of flour with oil for each of the thirteen bulls, two-tenths for each of the two rams."
    },
    "15": {
      "General": "'And with each of the fourteen lambs, one-tenth of an ephah.'",
      "Non-Denominational": "Requires one-tenth ephah of flour with oil as the grain offering for each of the fourteen lambs.",
      "Baptist": "Requires a separate ('several') tenth ephah for each of the fourteen lambs.",
      "Catholic": "Requires a tenth of an ephah for each of the fourteen lambs.",
      "Methodist": "Specifies one-tenth ephah for each of the fourteen lambs.",
      "Lutheran": "Requires a separate tenth ephah for each of the fourteen lambs."
    },
    "16": {
      "General": "'Also include one male goat as a sin offering, besides the regular daily burnt offering with its grain offering and drink offering.'",
      "Non-Denominational": "Requires one male goat as a sin offering each day of the feast, *in addition to* the continual daily burnt offering with its grain and drink offerings.",
      "Baptist": "Mandates one male goat daily for a sin offering, *besides* the continual burnt offering, its grain ('meat') offering, and its drink offering.",
      "Catholic": "Requires one male goat daily as a sin offering, supplementary to the regular burnt offering with its grain and drink offerings.",
      "Methodist": "Requires one male goat daily for a sin offering, *in addition to* the continual burnt offering with its grain and drink offering.",
      "Lutheran": "Includes one male goat daily for a sin offering, *besides* the continual burnt offering, its grain offering, and its drink offering."
    },
    "17": {
      "General": "'On the second day offer twelve young bulls, two rams, and fourteen male lambs a year old, all without defect.'",
      "Non-Denominational": "Specifies the burnt offering for the second day: twelve young bulls, two rams, fourteen unblemished yearling male lambs.",
      "Baptist": "Details the burnt offering for the second day: twelve young bulls, two rams, fourteen perfect yearling male lambs.",
      "Catholic": "Prescribes the offering for the second day: twelve young bulls, two rams, and fourteen unblemished yearling lambs.",
      "Methodist": "Instructs for the second day: twelve young bulls, two rams, fourteen flawless yearling lambs.",
      "Lutheran": "Specifies the burnt offering for day two: twelve young bulls, two rams, fourteen perfect yearling male lambs."
    },
    "18": {
      "General": "'Include the grain offerings and drink offerings for the bulls, rams, and lambs according to their number, as prescribed.'",
      "Non-Denominational": "Requires the corresponding grain and drink offerings for the bulls, rams, and lambs, calculated according to their specified numbers and the established regulations.",
      "Baptist": "Mandates the grain ('meat') and drink offerings for the bulls, rams, and lambs according to their quantity, following the prescribed manner ('ordinance').",
      "Catholic": "Requires the grain and drink offerings for the bulls, rams, and lambs according to their number, following the prescribed regulation.",
      "Methodist": "Requires the grain and drink offerings for the bulls, rams, and lambs based on their number, according to the prescribed manner.",
      "Lutheran": "Requires the grain and drink offerings for the animals according to their number, following the prescribed ordinance."
    },
    "19": {
      "General": "'Also include one male goat as a sin offering, besides the regular daily burnt offering with its grain offering and their drink offerings.'",
      "Non-Denominational": "Reiterates the daily requirement of one male goat for a sin offering, in addition to the continual daily burnt offering and its accompaniments.",
      "Baptist": "Reiterates the daily sin offering: one male goat, besides the continual burnt offering, its grain ('meat') offering, and their drink offerings.",
      "Catholic": "Reiterates the daily requirement of one male goat as a sin offering, supplementary to the regular burnt offering, its grain offering, and their drink offerings.",
      "Methodist": "Reiterates the daily requirement of one male goat for a sin offering, in addition to the continual burnt offering and its grain and drink offerings.",
      "Lutheran": "Reiterates the daily sin offering: one male goat, besides the continual burnt offering, its grain offering, and their drink offerings."
    },
    "20": {
      "General": "'On the third day offer eleven bulls, two rams, and fourteen male lambs a year old, all without defect.'",
      "Non-Denominational": "Specifies the burnt offering for the third day: eleven bulls, two rams, fourteen unblemished yearling male lambs.",
      "Baptist": "Details the burnt offering for the third day: eleven bulls, two rams, fourteen perfect yearling male lambs.",
      "Catholic": "Prescribes the offering for the third day: eleven bulls, two rams, and fourteen unblemished yearling lambs.",
      "Methodist": "Instructs for the third day: eleven bulls, two rams, fourteen flawless yearling lambs.",
      "Lutheran": "Specifies the burnt offering for day three: eleven bulls, two rams, fourteen perfect yearling male lambs."
    },
    "21": {
      "General": "'Include the grain offerings and drink offerings for the bulls, rams, and lambs according to their number, as prescribed.'",
      "Non-Denominational": "Requires the corresponding grain and drink offerings according to number and regulation.",
      "Baptist": "Mandates the grain ('meat') and drink offerings according to quantity and ordinance.",
      "Catholic": "Requires the grain and drink offerings according to number and regulation.",
      "Methodist": "Requires the grain and drink offerings based on number, according to the prescribed manner.",
      "Lutheran": "Requires the grain and drink offerings according to number and ordinance."
    },
    "22": {
      "General": "'Also include one male goat as a sin offering, besides the regular daily burnt offering with its grain offering and drink offering.'",
      "Non-Denominational": "Reiterates the daily sin offering requirement alongside the continual offerings.",
      "Baptist": "Reiterates the daily sin offering besides the continual offerings.",
      "Catholic": "Reiterates the daily sin offering supplementary to the continual offerings.",
      "Methodist": "Reiterates the daily sin offering in addition to the continual offerings.",
      "Lutheran": "Reiterates the daily sin offering besides the continual offerings."
    },
    "23": {
      "General": "'On the fourth day offer ten bulls, two rams, and fourteen male lambs a year old, all without defect.'",
      "Non-Denominational": "Specifies the burnt offering for the fourth day: ten bulls, two rams, fourteen unblemished yearling male lambs.",
      "Baptist": "Details the burnt offering for the fourth day: ten bulls, two rams, fourteen perfect yearling male lambs.",
      "Catholic": "Prescribes the offering for the fourth day: ten bulls, two rams, and fourteen unblemished yearling lambs.",
      "Methodist": "Instructs for the fourth day: ten bulls, two rams, fourteen flawless yearling lambs.",
      "Lutheran": "Specifies the burnt offering for day four: ten bulls, two rams, fourteen perfect yearling male lambs."
    },
    "24": {
      "General": "'Include the grain offerings and drink offerings for the bulls, rams, and lambs according to their number, as prescribed.'",
      "Non-Denominational": "Requires the corresponding grain and drink offerings according to number and regulation.",
      "Baptist": "Mandates the grain ('meat') and drink offerings according to quantity and ordinance.",
      "Catholic": "Requires the grain and drink offerings according to number and regulation.",
      "Methodist": "Requires the grain and drink offerings based on number, according to the prescribed manner.",
      "Lutheran": "Requires the grain and drink offerings according to number and ordinance."
    },
    "25": {
      "General": "'Also include one male goat as a sin offering, besides the regular daily burnt offering with its grain offering and drink offering.'",
      "Non-Denominational": "Reiterates the daily sin offering requirement alongside the continual offerings.",
      "Baptist": "Reiterates the daily sin offering besides the continual offerings.",
      "Catholic": "Reiterates the daily sin offering supplementary to the continual offerings.",
      "Methodist": "Reiterates the daily sin offering in addition to the continual offerings.",
      "Lutheran": "Reiterates the daily sin offering besides the continual offerings."
    },
    "26": {
      "General": "'On the fifth day offer nine bulls, two rams, and fourteen male lambs a year old, all without defect.'",
      "Non-Denominational": "Specifies the burnt offering for the fifth day: nine bulls, two rams, fourteen unblemished yearling male lambs.",
      "Baptist": "Details the burnt offering for the fifth day: nine bulls, two rams, fourteen perfect yearling male lambs.",
      "Catholic": "Prescribes the offering for the fifth day: nine bulls, two rams, and fourteen unblemished yearling lambs.",
      "Methodist": "Instructs for the fifth day: nine bulls, two rams, fourteen flawless yearling lambs.",
      "Lutheran": "Specifies the burnt offering for day five: nine bulls, two rams, fourteen perfect yearling male lambs."
    },
    "27": {
      "General": "'Include the grain offerings and drink offerings for the bulls, rams, and lambs according to their number, as prescribed.'",
      "Non-Denominational": "Requires the corresponding grain and drink offerings according to number and regulation.",
      "Baptist": "Mandates the grain ('meat') and drink offerings according to quantity and ordinance.",
      "Catholic": "Requires the grain and drink offerings according to number and regulation.",
      "Methodist": "Requires the grain and drink offerings based on number, according to the prescribed manner.",
      "Lutheran": "Requires the grain and drink offerings according to number and ordinance."
    },
    "28": {
      "General": "'Also include one male goat as a sin offering, besides the regular daily burnt offering with its grain offering and drink offering.'",
      "Non-Denominational": "Reiterates the daily sin offering requirement alongside the continual offerings.",
      "Baptist": "Reiterates the daily sin offering besides the continual offerings.",
      "Catholic": "Reiterates the daily sin offering supplementary to the continual offerings.",
      "Methodist": "Reiterates the daily sin offering in addition to the continual offerings.",
      "Lutheran": "Reiterates the daily sin offering besides the continual offerings."
    },
    "29": {
      "General": "'On the sixth day offer eight bulls, two rams, and fourteen male lambs a year old, all without defect.'",
      "Non-Denominational": "Specifies the burnt offering for the sixth day: eight bulls, two rams, fourteen unblemished yearling male lambs.",
      "Baptist": "Details the burnt offering for the sixth day: eight bulls, two rams, fourteen perfect yearling male lambs.",
      "Catholic": "Prescribes the offering for the sixth day: eight bulls, two rams, and fourteen unblemished yearling lambs.",
      "Methodist": "Instructs for the sixth day: eight bulls, two rams, fourteen flawless yearling lambs.",
      "Lutheran": "Specifies the burnt offering for day six: eight bulls, two rams, fourteen perfect yearling male lambs."
    },
    "30": {
      "General": "'Include the grain offerings and drink offerings for the bulls, rams, and lambs according to their number, as prescribed.'",
      "Non-Denominational": "Requires the corresponding grain and drink offerings according to number and regulation.",
      "Baptist": "Mandates the grain ('meat') and drink offerings according to quantity and ordinance.",
      "Catholic": "Requires the grain and drink offerings according to number and regulation.",
      "Methodist": "Requires the grain and drink offerings based on number, according to the prescribed manner.",
      "Lutheran": "Requires the grain and drink offerings according to number and ordinance."
    },
    "31": {
      "General": "'Also include one male goat as a sin offering, besides the regular daily burnt offering with its grain offering and drink offering.'",
      "Non-Denominational": "Reiterates the daily sin offering requirement alongside the continual offerings.",
      "Baptist": "Reiterates the daily sin offering besides the continual offerings.",
      "Catholic": "Reiterates the daily sin offering supplementary to the continual offerings.",
      "Methodist": "Reiterates the daily sin offering in addition to the continual offerings.",
      "Lutheran": "Reiterates the daily sin offering besides the continual offerings."
    },
    "32": {
      "General": "'On the seventh day offer seven bulls, two rams, and fourteen male lambs a year old, all without defect.'",
      "Non-Denominational": "Specifies the burnt offering for the seventh day: seven bulls, two rams, fourteen unblemished yearling male lambs.",
      "Baptist": "Details the burnt offering for the seventh day: seven bulls, two rams, fourteen perfect yearling male lambs.",
      "Catholic": "Prescribes the offering for the seventh day: seven bulls, two rams, and fourteen unblemished yearling lambs.",
      "Methodist": "Instructs for the seventh day: seven bulls, two rams, fourteen flawless yearling lambs.",
      "Lutheran": "Specifies the burnt offering for day seven: seven bulls, two rams, fourteen perfect yearling male lambs."
    },
    "33": {
      "General": "'Include the grain offerings and drink offerings for the bulls, rams, and lambs according to their number, as prescribed.'",
      "Non-Denominational": "Requires the corresponding grain and drink offerings according to number and regulation.",
      "Baptist": "Mandates the grain ('meat') and drink offerings according to quantity and ordinance.",
      "Catholic": "Requires the grain and drink offerings according to number and regulation.",
      "Methodist": "Requires the grain and drink offerings based on number, according to the prescribed manner.",
      "Lutheran": "Requires the grain and drink offerings according to number and ordinance."
    },
    "34": {
      "General": "'Also include one male goat as a sin offering, besides the regular daily burnt offering with its grain offering and drink offering.'",
      "Non-Denominational": "Reiterates the daily sin offering requirement alongside the continual offerings.",
      "Baptist": "Reiterates the daily sin offering besides the continual offerings.",
      "Catholic": "Reiterates the daily sin offering supplementary to the continual offerings.",
      "Methodist": "Reiterates the daily sin offering in addition to the continual offerings.",
      "Lutheran": "Reiterates the daily sin offering besides the continual offerings."
    },
    "35": {
      "General": "'On the eighth day hold a closing assembly (solemn assembly) and do no regular work (servile work).'",
      "Non-Denominational": "Commands a solemn assembly with rest from work on the eighth day, concluding the Feast of Tabernacles (Shemini Atzeret).",
      "Baptist": "Instructs a solemn assembly and cessation of regular work on the eighth day, marking the conclusion of the festival period.",
      "Catholic": "Requires a solemn assembly and cessation of strenuous work on the eighth day.",
      "Methodist": "Commands a solemn assembly and no regular work on the eighth day.",
      "Lutheran": "Commands a solemn assembly and cessation of regular work on the eighth day (Law)."
    },
    "36": {
      "General": "'Present as a pleasing aroma to the Lord a food offering (offering made by fire), a burnt offering: one bull, one ram, and seven male lambs a year old, all without defect.'",
      "Non-Denominational": "Specifies the burnt offering for the eighth day, a pleasing aroma fire offering: one bull, one ram, and seven unblemished yearling male lambs.",
      "Baptist": "Details the burnt offering by fire for the eighth day, a sweet savour: one bull, one ram, seven perfect yearling male lambs.",
      "Catholic": "Prescribes the fire offering, a burnt offering for a pleasing fragrance to the Lord: one bull, one ram, and seven unblemished yearling lambs.",
      "Methodist": "Instructs the fire offering, a burnt offering for a pleasing aroma: one bull, one ram, seven flawless yearling lambs.",
      "Lutheran": "Specifies the fire sacrifice, a burnt offering for a pleasing aroma on the eighth day: one bull, one ram, seven perfect yearling male lambs."
    },
    "37": {
      "General": "'Include the grain offerings and drink offerings for the bull, the ram, and the lambs according to their number, as prescribed.'",
      "Non-Denominational": "Requires the corresponding grain and drink offerings for the bull, ram, and lambs according to number and regulation.",
      "Baptist": "Mandates the grain ('meat') and drink offerings for the bull, ram, and lambs according to their quantity and ordinance.",
      "Catholic": "Requires the grain and drink offerings for the bull, ram, and lambs according to their number, following the prescribed regulation.",
      "Methodist": "Requires the grain and drink offerings for the bull, ram, and lambs based on their number, according to the prescribed manner.",
      "Lutheran": "Requires the grain and drink offerings for the animals according to their number, following the prescribed ordinance."
    },
    "38": {
      "General": "'Also include one male goat as a sin offering, besides the regular daily burnt offering with its grain offering and drink offering.'",
      "Non-Denominational": "Requires one male goat as a sin offering on the eighth day, *in addition to* the continual daily burnt offering and its accompaniments.",
      "Baptist": "Mandates one male goat for a sin offering on the eighth day, *besides* the continual burnt offering, its grain ('meat') offering, and its drink offering.",
      "Catholic": "Requires one male goat as a sin offering on the eighth day, supplementary to the regular burnt offering with its grain and drink offerings.",
      "Methodist": "Requires one male goat for a sin offering on the eighth day, *in addition to* the continual burnt offering with its grain and drink offering.",
      "Lutheran": "Includes one male goat for a sin offering on the eighth day, *besides* the continual burnt offering, its grain offering, and its drink offering."
    },
    "39": {
      "General": "'These are the offerings you are to present to the Lord at your appointed festivals, in addition to your vow offerings, your freewill offerings, your burnt offerings, your grain offerings, your drink offerings, and your fellowship offerings (peace offerings).'",
      "Non-Denominational": "Summarizes that these specified festival offerings are mandatory additions to any personal voluntary offerings (vows, freewill gifts) or other required sacrifices (burnt, grain, drink, fellowship).",
      "Baptist": "Concludes these prescribed festival sacrifices must be offered at their set times, separate from and in addition to voluntary vows, freewill offerings, and other general categories of offerings (burnt, grain, drink, peace).",
      "Catholic": "Summarizes these are the required offerings for the appointed feasts, distinct from and in addition to voluntary offerings (vows, freewill), and the general categories of sacrifices (burnt, grain, drink, peace).",
      "Methodist": "States these required festival offerings are to be presented at their appointed times, separate from personal vow or freewill offerings, and the standard types of sacrifices.",
      "Lutheran": "Concludes these prescribed festival offerings (Law) are required at the set feasts, in addition to any voluntary offerings (vows, freewill) or other sacrifices."
    },
    "40": {
      "General": "So Moses told the Israelites everything the Lord had commanded him.",
      "Non-Denominational": "Moses faithfully communicated all these divine commands regarding the festival offerings to the people of Israel.",
      "Baptist": "Moses relays all these specific instructions from the Lord concerning the offerings to the Israelites.",
      "Catholic": "Moses communicates to the Israelites all the commands he received from the Lord.",
      "Methodist": "Moses conveys all the Lord's commands concerning these offerings to the Israelites.",
      "Lutheran": "Moses communicates all the Lord's commands regarding these offerings to Israel."
    }
  }
}
