{
  "chapterSummary": {
    "General": "Numbers 3 focuses on the lineage of Aaron and Moses, and the appointment of the Levites to serve in the Tabernacle. It details the sons of Aaron who served as priests and notes that Moses had no sons who reached positions of priestly service. The chapter then describes the Levites being given to Aaron to assist him in the work of the Tabernacle, outlining their responsibilities and their placement around it. Finally, it records the census of the Levites by their clans, counting all males from a month old and upward, and their total number is given.",
    "Non-Denominational": "Emphasizes the divine establishment of the priesthood through Aaron and the distinct role of the Levites in supporting the worship and service of the Tabernacle, highlighting the importance of ordained ministry and dedicated service in religious life.",
    "Baptist": "Focuses on the divinely ordained priesthood of Aaron and the Levites' role as assistants, seeing in this a foreshadowing of Christ's ultimate priesthood and the importance of service within the church.",
    "Catholic": "Highlights the establishment of the priestly lineage through Aaron, which is seen as the foundation for the ordained priesthood in the Church, and the Levites' role in liturgical service and the care of the sanctuary.",
    "Methodist": "Emphasizes the importance of order and designated roles in ministry, as seen in the appointment of Aaron's sons as priests and the Levites for other service, reflecting the need for both ordained and lay ministry within the church.",
    "Lutheran": "Focuses on the institution of the priesthood through divine command and the Levites' role in the Old Testament worship, seeing parallels to the ordained ministry in the New Testament that serves in the proclamation of the Gospel and the administration of the sacraments.",
    "Presbyterian": "Stresses the covenantal framework for the establishment of the priesthood and the Levites' service, highlighting the divine order and the importance of those set apart for ministry within the community of faith.",
    "Pentecostal": "Highlights the divine appointment of Aaron's line for the priesthood and the Levites for service in the Tabernacle, seeing this as a model for the importance of God-ordained roles within the church for worship and ministry.",
    "Anglican": "Notes the historical establishment of the Aaronic priesthood and the Levitical service, which forms part of the Old Testament context for understanding the ordained ministry within the Christian tradition.",
    "Orthodox": "Emphasizes the sacred lineage of Aaron as the beginning of the Old Testament priesthood and the Levites' divinely appointed roles in the service of the Tabernacle, seeing these as types and shadows of the priesthood and diaconate in the Church."
  },
  "1": {
    "General": "These are the generations of Aaron and Moses at the time when the Lord spoke with Moses on Mount Sinai.",
    "Non-Denominational": "Introduces the lineage of Aaron and Moses in the context of divine revelation at Mount Sinai, setting the stage for the establishment of the priesthood and Levitical service.",
    "Baptist": "Highlights the divine setting for the establishment of the priestly line, emphasizing God's authority and initiative.",
    "Catholic": "Focuses on the divine encounter at Mount Sinai as the backdrop for the unfolding of God's plan for worship and ministry.",
    "Methodist": "Emphasizes the significance of this divine communication in establishing the foundational roles within the community.",
    "Lutheran": "Highlights the divine word spoken at Sinai as the basis for the subsequent organization of worship and service.",
    "Presbyterian": "Stresses the covenantal context of God's communication with Moses regarding the generations of Aaron.",
    "Pentecostal": "Highlights the divine encounter on Mount Sinai as the source of the instructions for the priesthood.",
    "Anglican": "Notes the historical setting of Mount Sinai as the place where these foundational instructions were given.",
    "Orthodox": "Emphasizes the importance of Mount Sinai as the location of divine revelation concerning the lineage of Aaron and Moses."
  },
  "2": {
    "General": "These are the names of the sons of Aaron: Nadab the firstborn, and Abihu, Eleazar, and Ithamar.",
    "Non-Denominational": "Lists the names of Aaron's sons, highlighting Nadab as the firstborn, who would initially be in line for the high priesthood.",
    "Baptist": "Records the names of Aaron's sons who would serve as priests, noting the order of their birth.",
    "Catholic": "Identifies the sons of Aaron who were designated for the priesthood.",
    "Methodist": "Lists the names of Aaron's sons, establishing the lineage of the priesthood.",
    "Lutheran": "Records the names of Aaron's sons who would be the first priests.",
    "Presbyterian": "Identifies the sons of Aaron who would serve in the priestly office.",
    "Pentecostal": "Lists the names of Aaron's sons who were appointed to the priesthood.",
    "Anglican": "Records the names of Aaron's sons, the initial priests.",
    "Orthodox": "Identifies the four sons of Aaron by name."
  },
  "3": {
    "General": "These are the names of the sons of Aaron, the anointed priests, whom he ordained to minister as priests.",
    "Non-Denominational": "Emphasizes the anointing and ordination of Aaron's sons for priestly ministry, highlighting the divine sanction and the purpose of their role.",
    "Baptist": "Highlights the divine appointment and consecration of Aaron's sons for priestly service.",
    "Catholic": "Focuses on the sacramental nature of their ordination, setting them apart for their sacred duties.",
    "Methodist": "Emphasizes the official recognition and setting apart of Aaron's sons for ministry.",
    "Lutheran": "Highlights the divine act of ordaining Aaron's sons to serve as priests.",
    "Presbyterian": "Stresses the official and sacred nature of their appointment to the priestly office.",
    "Pentecostal": "Highlights the divine anointing and ordination that qualified Aaron's sons for ministry as priests.",
    "Anglican": "Notes the formal ordination of Aaron's sons to the priesthood.",
    "Orthodox": "Emphasizes the divine anointing that sanctified Aaron's sons for priestly ministry."
  },
  "4": {
    "General": "But Nadab and Abihu died before the Lord when they offered unauthorized fire before the Lord in the wilderness of Sinai, and they had no children. So Eleazar and Ithamar served as priests in the lifetime of Aaron their father.",
    "Non-Denominational": "Recounts the tragic death of Nadab and Abihu due to their disobedience, emphasizing the seriousness of approaching God improperly, and notes that Eleazar and Ithamar continued the priestly service.",
    "Baptist": "Highlights the consequences of disobedience in worship and the continuation of the priesthood through Eleazar and Ithamar.",
    "Catholic": "Focuses on the solemn consequence of offering 'unauthorized fire,' underscoring the need for reverence in worship, and notes the succession of Eleazar and Ithamar.",
    "Methodist": "Emphasizes the importance of proper reverence and obedience in serving God, as illustrated by the fate of Nadab and Abihu, and the continuation of the priesthood.",
    "Lutheran": "Highlights the severe judgment on Nadab and Abihu for their irreverence and the continuation of the priesthood through the remaining sons.",
    "Presbyterian": "Stresses the importance of adhering to God's prescribed ways of worship, as seen in the judgment of Nadab and Abihu, and the continuation of the priestly line through Eleazar and Ithamar.",
    "Pentecostal": "Highlights the seriousness of approaching God without proper reverence and the continuation of the priesthood through Aaron's remaining sons.",
    "Anglican": "Notes the historical account of Nadab and Abihu's death as a cautionary tale and the continuation of priestly service by Eleazar and Ithamar.",
    "Orthodox": "Emphasizes the grave consequences of irreverent worship, as shown by Nadab and Abihu, and the continuation of the priesthood through Eleazar and Ithamar during Aaron's life."
  },
  "5": {
    "General": "And the Lord spoke to Moses, saying,",
    "Non-Denominational": "Indicates a new section of divine instruction to Moses, now focusing on the role of the Levites.",
    "Baptist": "Highlights God's continued guidance and instruction for His people.",
    "Catholic": "Focuses on the divine initiative in establishing the roles of the Levites.",
    "Methodist": "Emphasizes the ongoing communication between God and Moses for the organization of the community.",
    "Lutheran": "Highlights the divine word as the basis for the instructions regarding the Levites.",
    "Presbyterian": "Stresses the covenantal communication between God and Moses.",
    "Pentecostal": "Highlights God's direct communication to Moses.",
    "Anglican": "Notes the divine instruction given to Moses.",
    "Orthodox": "Emphasizes the divine address to Moses."
  },
  "6": {
    "General": "\"Bring the tribe of Levi near, and set them before Aaron the priest, that they may minister to him.",
    "Non-Denominational": "Commands Moses to bring the tribe of Levi to Aaron for the purpose of assisting him in his priestly duties, highlighting the supportive role of the Levites.",
    "Baptist": "Highlights the divine appointment of the Levites to serve under the authority of the priesthood.",
    "Catholic": "Focuses on the Levites being designated as assistants to Aaron in the liturgical service.",
    "Methodist": "Emphasizes the collaborative nature of ministry, with the Levites supporting the priests.",
    "Lutheran": "Highlights the divine instruction to bring the Levites to serve Aaron in his priestly office.",
    "Presbyterian": "Stresses the divinely ordained role of the Levites to assist the priesthood within the covenant community.",
    "Pentecostal": "Highlights the specific command to bring the Levites to Aaron for the purpose of ministry.",
    "Anglican": "Notes the divine instruction for the Levites to serve under Aaron's direction.",
    "Orthodox": "Emphasizes the divine appointment of the Levites to assist Aaron in his priestly functions."
  },
  "7": {
    "General": "They shall keep charge of his duties and the duties of the whole congregation before the tent of meeting by serving at the tabernacle.",
    "Non-Denominational": "Outlines the general responsibilities of the Levites, which included assisting with the duties related to the Tabernacle and serving the needs of the congregation in matters of worship.",
    "Baptist": "Highlights the Levites' role in serving both the priests and the congregation in the context of worship at the Tabernacle.",
    "Catholic": "Focuses on the Levites' responsibility for the practical aspects of worship and the care of the sanctuary, serving both the clergy and the laity.",
    "Methodist": "Emphasizes the Levites' service to the entire community in matters related to the Tabernacle and worship.",
    "Lutheran": "Highlights the Levites' role in assisting with the various duties associated with the Tabernacle and the worship of the congregation.",
    "Presbyterian": "Stresses the Levites' responsibility for the practical and logistical aspects of worship within the covenant community.",
    "Pentecostal": "Highlights the Levites' role in serving the needs of both the priesthood and the congregation at the Tabernacle.",
    "Anglican": "Notes the broad responsibilities of the Levites in maintaining the Tabernacle and assisting in worship for the whole community.",
    "Orthodox": "Emphasizes the Levites' service to both the priesthood and the entire congregation in the context of the Tabernacle and its worship."
  },
  "8": {
    "General": "They shall have charge of all the furnishings of the tent of meeting and keep charge of the duties of the people of Israel by serving at the tabernacle.",
    "Non-Denominational": "Further specifies the Levites' responsibilities to include the care and maintenance of all the articles within the Tabernacle, as well as continuing their service to the people.",
    "Baptist": "Highlights the Levites' oversight of the Tabernacle's contents and their ongoing service to the community in matters of worship.",
    "Catholic": "Focuses on the Levites' charge over the sacred vessels and furnishings of the Tabernacle, as well as their service to the people in the context of worship.",
    "Methodist": "Emphasizes the Levites' role in caring for the physical aspects of worship and their continued service to the community.",
    "Lutheran": "Highlights the Levites' responsibility for the Tabernacle's furnishings and their ongoing service to the people in matters of worship.",
    "Presbyterian": "Stresses the Levites' charge over the sacred items within the Tabernacle and their continued service to the covenant community.",
    "Pentecostal": "Highlights the Levites' responsibility for the care of the Tabernacle's contents and their ongoing service to the people in worship.",
    "Anglican": "Notes the Levites' specific duties regarding the furnishings of the tent of meeting and their continued service to the people.",
    "Orthodox": "Emphasizes the Levites' responsibility for the sacred furnishings of the Tabernacle and their ongoing service to the people of Israel."
  },
  "9": {
    "General": "And you shall give the Levites to Aaron and his sons; they are wholly given to him from among the people of Israel.",
    "Non-Denominational": "Emphasizes that the Levites were specifically given as a gift to Aaron and his sons to aid them in their priestly duties, highlighting their dedication to this service.",
    "Baptist": "Highlights the divine provision of the Levites as helpers for the priesthood, emphasizing their complete dedication to this role.",
    "Catholic": "Focuses on the Levites being divinely assigned to assist Aaron and his successors in their priestly ministry, emphasizing their dedication to this service.",
    "Methodist": "Emphasizes the Levites as a dedicated group given to support the ministry of the priests within the community.",
    "Lutheran": "Highlights the divine act of giving the Levites to Aaron and his sons for the purpose of assisting in the priestly service, emphasizing their complete dedication.",
    "Presbyterian": "Stresses the divinely ordained provision of the Levites as assistants to the priesthood within the covenant community, highlighting their complete dedication to this service.",
    "Pentecostal": "Highlights the Levites being specifically given to Aaron and his sons for ministry, emphasizing their dedication to this divinely appointed role.",
    "Anglican": "Notes the divine provision of the Levites as assistants to the priests, emphasizing their dedication to this service.",
    "Orthodox": "Emphasizes the Levites as a gift from God to Aaron and his sons, dedicated entirely to assisting in the priestly ministry."
  },
  "10": {
    "General": "And you shall appoint Aaron and his sons, and they shall attend to their priesthood. And any outsider who comes near shall be put to death.",
    "Non-Denominational": "Reaffirms the specific appointment of Aaron and his sons to the priesthood, emphasizing the exclusivity of this role and the severe consequences for unauthorized individuals encroaching on sacred duties.",
    "Baptist": "Highlights the divine establishment of the priesthood through Aaron's lineage and the strict separation of this role from others.",
    "Catholic": "Focuses on the divinely ordained priesthood of Aaron and his successors, emphasizing the sacred nature of their office and the prohibition against unauthorized individuals performing priestly duties.",
    "Methodist": "Emphasizes the distinct role of the priesthood and the serious consequences for those not called to it who attempt to perform priestly functions.",
    "Lutheran": "Highlights the divine appointment of Aaron and his sons to the priesthood and the strict warning against unauthorized individuals approaching sacred duties.",
    "Presbyterian": "Stresses the divinely ordained office of the priesthood within the covenant community, emphasizing its exclusivity and the consequences for unauthorized intrusion.",
    "Pentecostal": "Highlights the divine appointment of Aaron and his sons to the priesthood and the strict boundaries set to protect its sanctity.",
    "Anglican": "Notes the divinely established priesthood of Aaron and the serious consequences for those not authorized to perform priestly duties.",
    "Orthodox": "Emphasizes the sacred and exclusive nature of the priesthood of Aaron and his sons, with a strict warning against unauthorized individuals approaching the altar."
  },
  "11": {
    "General": "And the Lord spoke to Moses, saying,",
    "Non-Denominational": "Indicates another section of divine instruction to Moses, now concerning the substitution of the Levites for the firstborn of Israel.",
    "Baptist": "Highlights God's continued guidance and instruction for His people.",
    "Catholic": "Focuses on the divine initiative in establishing the role of the Levites in relation to the firstborn.",
    "Methodist": "Emphasizes the ongoing communication between God and Moses for the organization of the community.",
    "Lutheran": "Highlights the divine word as the basis for the instructions regarding the Levites and the firstborn.",
    "Presbyterian": "Stresses the covenantal communication between God and Moses.",
    "Pentecostal": "Highlights God's direct communication to Moses.",
    "Anglican": "Notes the divine instruction given to Moses.",
    "Orthodox": "Emphasizes the divine address to Moses."
  },
  "12": {
    "General": "\"Behold, I have taken the Levites from among the people of Israel instead of every firstborn among the people of Israel. The Levites shall be mine.",
    "Non-Denominational": "Announces God's choice of the Levites to serve Him in place of the firstborn sons of all Israel, emphasizing the Levites' special belonging to God.",
    "Baptist": "Highlights God's sovereign choice of the Levites for His service, taking them in place of the firstborn.",
    "Catholic": "Focuses on the Levites being chosen by God for a specific sacred purpose, substituting for the firstborn sons.",
    "Methodist": "Emphasizes God's prerogative in choosing who will serve Him, selecting the Levites for a special role.",
    "Lutheran": "Highlights God's gracious act of taking the Levites for Himself in place of the firstborn sons of Israel.",
    "Presbyterian": "Stresses God's sovereign right to choose whom He will for service within the covenant community, selecting the Levites for this purpose.",
    "Pentecostal": "Highlights God's divine selection of the Levites for His service, taking them as His own instead of the firstborn.",
    "Anglican": "Notes the divine act of choosing the Levites for special service, in place of the firstborn of Israel.",
    "Orthodox": "Emphasizes God's sovereign choice of the Levites to be His own, taking them from among the people of Israel in place of the firstborn."
  },
  "13": {
    "General": "For all the firstborn are mine. On the day that I struck down all the firstborn in the land of Egypt, I consecrated to myself all the firstborn in Israel, both of man and of beast. They shall be mine. I am the Lord.\"",
    "Non-Denominational": "Explains the rationale behind the substitution, reminding that God claimed all the firstborn as His own on the night of the Passover in Egypt, thus justifying His taking the Levites in their stead.",
    "Baptist": "Highlights God's ownership of the firstborn due to His deliverance of Israel from Egypt, which forms the basis for taking the Levites.",
    "Catholic": "Focuses on the divine claim over the firstborn as a result of the Passover event, establishing the legitimacy of the Levites' substitution.",
    "Methodist": "Emphasizes God's redemption of the firstborn in Egypt, which gives Him the right to designate the Levites for His service.",
    "Lutheran": "Highlights God's sovereign act of claiming the firstborn as His own during the Exodus, which provides the context for the Levites' substitution.",
    "Presbyterian": "Stresses God's redemptive act in Egypt, where He spared the firstborn of Israel, thus establishing His claim over them and the subsequent taking of the Levites.",
    "Pentecostal": "Highlights God's power and sovereignty demonstrated in the Passover, establishing His right to claim the firstborn and subsequently choose the Levites.",
    "Anglican": "Notes the historical event of the Passover and God's claim over the firstborn as the reason for the Levites' substitution.",
    "Orthodox": "Emphasizes God's saving act during the Passover, through which He consecrated the firstborn to Himself, thus justifying the taking of the Levites in their place."
  },
  "14": {
    "General": "And the Lord spoke to Moses in the wilderness of Sinai, saying,",
    "Non-Denominational": "Indicates another instance of divine communication to Moses in the wilderness of Sinai, this time regarding the numbering of the Levites.",
    "Baptist": "Highlights God's continued guidance in the wilderness, now concerning the census of the Levites.",
    "Catholic": "Focuses on the divine instruction given to Moses in the context of their journey in the wilderness.",
    "Methodist": "Emphasizes God's ongoing direction for the community during their time in the wilderness.",
    "Lutheran": "Highlights the divine word spoken to Moses in the wilderness regarding the Levites' census.",
    "Presbyterian": "Stresses the covenantal communication between God and Moses in the wilderness setting.",
    "Pentecostal": "Highlights God's direct communication to Moses in the wilderness.",
    "Anglican": "Notes the setting of the wilderness of Sinai for these instructions.",
    "Orthodox": "Emphasizes the location of the wilderness of Sinai as the place of this divine communication about the Levites' numbering."
  },
  "15": {
    "General": "\"Number the sons of Levi by their fathers' houses and by their clans; every male from a month old and upward you shall number.\"",
    "Non-Denominational": "Commands Moses to conduct a census specifically of the Levites, based on their families and clans, counting all males from one month old and older, indicating a different criteria than the census of the other tribes.",
    "Baptist": "Highlights the specific instruction to count the Levites, including even young children, based on their family divisions.",
    "Catholic": "Focuses on the distinct census of the Levites, which included males from one month old, emphasizing their unique role from infancy.",
    "Methodist": "Emphasizes the separate counting of the Levites, highlighting the inclusion of even the youngest males within their tribal structure.",
    "Lutheran": "Highlights the specific command to number the Levites according to their families and clans, including all males from a month old.",
    "Presbyterian": "Stresses the separate census of the Levites within the covenant community, with a different age criteria than the other tribes.",
    "Pentecostal": "Highlights the divine instruction to count all male Levites from one month old, based on their families.",
    "Anglican": "Notes the specific instructions for the census of the Levites, including the age criteria and the basis of their count.",
    "Orthodox": "Emphasizes the distinct census of the Levites, which included all males from one month old, based on their paternal houses and clans."
  },
  "16": {
    "General": "So Moses numbered them according to the word of the Lord, as he was commanded.",
    "Non-Denominational": "Highlights Moses' obedience to God's command in conducting the census of the Levites.",
    "Baptist": "Emphasizes Moses' faithfulness in carrying out God's instructions precisely.",
    "Catholic": "Focuses on Moses' obedience to the divine command regarding the numbering of the Levites.",
    "Methodist": "Highlights Moses' compliance with God's directives.",
    "Lutheran": "Emphasizes Moses' obedience to the Lord's word in conducting the census.",
    "Presbyterian": "Stresses Moses' faithfulness in carrying out the divine command.",
    "Pentecostal": "Highlights Moses' obedience to God's specific instructions.",
    "Anglican": "Notes Moses' adherence to the Lord's command.",
    "Orthodox": "Emphasizes Moses' obedience in numbering the Levites according to the Lord's word."
  },
  "17": {
    "General": "These were the sons of Levi by their names: Gershon and Kohath and Merari.",
    "Non-Denominational": "Lists the three main clans or divisions within the tribe of Levi: Gershon, Kohath, and Merari, establishing the framework for their subsequent numbering and assignments.",
    "Baptist": "Identifies the three primary families within the tribe of Levi.",
    "Catholic": "Focuses on the three main branches of the Levitical tribe.",
    "Methodist": "Lists the names of the three sons of Levi, who were the heads of the Levitical clans.",
    "Lutheran": "Records the names of the three main divisions of the tribe of Levi.",
    "Presbyterian": "Identifies the three principal families within the tribe of Levi, which would form the basis of their organization.",
    "Pentecostal": "Lists the three sons of Levi, from whom the major Levitical clans descended.",
    "Anglican": "Notes the three main divisions of the tribe of Levi by name.",
    "Orthodox": "Identifies the three sons of Levi, who were the founders of the Levitical clans."
  },
  "18": {
    "General": "These are the names of the sons of Gershon by their clans: Libni and Shimei.",
    "Non-Denominational": "Details the two main families or clans that descended from Gershon: Libni and Shimei.",
    "Baptist": "Identifies the two families within the Gershonite division of the Levites.",
    "Catholic": "Focuses on the two main clans of the Gershonites.",
    "Methodist": "Lists the names of the sons of Gershon, who were the heads of his clans.",
    "Lutheran": "Records the names of the two clans that descended from Gershon.",
    "Presbyterian": "Identifies the two principal families within the Gershonite clan.",
    "Pentecostal": "Lists the sons of Gershon, who were the founders of his clans.",
    "Anglican": "Notes the two clans that belonged to the Gershonite division.",
    "Orthodox": "Identifies the two clans descended from Gershon: Libni and Shimei."
  },
  "19": {
    "General": "These are the names of the sons of Kohath by their clans: Amram and Izhar, Hebron and Uzziel.",
    "Non-Denominational": "Details the four main families or clans that descended from Kohath: Amram, Izhar, Hebron, and Uzziel, noting that Moses and Aaron were from the clan of Amram.",
    "Baptist": "Identifies the four families within the Kohathite division of the Levites.",
    "Catholic": "Focuses on the four main clans of the Kohathites.",
    "Methodist": "Lists the names of the sons of Kohath, who were the heads of his clans.",
    "Lutheran": "Records the names of the four clans that descended from Kohath.",
    "Presbyterian": "Identifies the four principal families within the Kohathite clan.",
    "Pentecostal": "Lists the sons of Kohath, who were the founders of his clans.",
    "Anglican": "Notes the four clans that belonged to the Kohathite division.",
    "Orthodox": "Identifies the four clans descended from Kohath: Amram, Izhar, Hebron, and Uzziel."
  },
  "20": {
    "General": "These are the names of the sons of Merari by their clans: Mahli and Mushi. These are the clans of the Levites according to their fathers' houses.",
    "Non-Denominational": "Details the two main families or clans that descended from Merari: Mahli and Mushi, concluding the listing of the Levitical clans based on their three main ancestors.",
    "Baptist": "Identifies the two families within the Merarite division of the Levites.",
    "Catholic": "Focuses on the two main clans of the Merarites.",
    "Methodist": "Lists the names of the sons of Merari, who were the heads of his clans, concluding the list of Levitical families.",
    "Lutheran": "Records the names of the two clans that descended from Merari, completing the list of Levitical divisions.",
    "Presbyterian": "Identifies the two principal families within the Merarite clan, concluding the enumeration of the Levitical clans.",
    "Pentecostal": "Lists the sons of Merari, who were the founders of his clans, completing the overview of the Levitical lineages.",
    "Anglican": "Notes the two clans that belonged to the Merarite division, concluding the list of Levitical families.",
    "Orthodox": "Identifies the two clans descended from Merari: Mahli and Mushi, completing the list of the Levitical clans according to their ancestral houses."
  },
  "21": {
    "General": "Of Gershon was the clan of the Libnites and the clan of the Shimeites; these were the clans of the Gershonites.",
    "Non-Denominational": "Begins the numbering of the Levites by clan, starting with the Gershonites and listing their two constituent clans.",
    "Baptist": "Starts the census of the Gershonite families within the tribe of Levi.",
    "Catholic": "Focuses on the enumeration of the Gershonite clans.",
    "Methodist": "Begins the count of the Gershonite division by their families.",
    "Lutheran": "Starts the numbering of the Levites, beginning with the Gershonites and their clans.",
    "Presbyterian": "Begins the census of the Gershonite clan.",
    "Pentecostal": "Starts the count of the Gershonite families within the Levites.",
    "Anglican": "Begins the numbering of the Gershonite clans.",
    "Orthodox": "Starts the enumeration of the Gershonite clans: the Libnites and the Shimeites."
  },
  "22": {
    "General": "Their number according to the numbering of all males from a month old and upward was seven thousand five hundred.",
    "Non-Denominational": "Records the total number of male Gershonites from one month old and upward.",
    "Baptist": "Notes the total count of male Gershonites in the census.",
    "Catholic": "Highlights the numerical count of the male Gershonites.",
    "Methodist": "Records the number of male Gershonites counted in the census.",
    "Lutheran": "Presents the total number of male Gershonites included in the census.",
    "Presbyterian": "Records the total number of male Gershonites.",
    "Pentecostal": "Highlights the total count of male Gershonites from a month old.",
    "Anglican": "Notes the total number of male Gershonites counted.",
    "Orthodox": "Records the total number of male Gershonites from one month old and upward."
  },
  "23": {
    "General": "The clans of the Gershonites were to encamp behind the tabernacle on the west.",
    "Non-Denominational": "Specifies the location for the Gershonite encampment: behind the Tabernacle on the west side, indicating their proximity to the sacred space and their assigned area.",
    "Baptist": "Notes the designated camping area for the Gershonite families, west of the Tabernacle.",
    "Catholic": "Highlights the assigned position of the Gershonites in relation to the Tabernacle.",
    "Methodist": "Records the designated camping location for the Gershonites.",
    "Lutheran": "Specifies the area where the Gershonite clans were to encamp: behind the Tabernacle on the west.",
    "Presbyterian": "Notes the assigned camping position for the Gershonite clan.",
    "Pentecostal": "Highlights the designated encampment area for the Gershonites, west of the Tabernacle.",
    "Anglican": "Notes the designated camping location of the Gershonite clans.",
    "Orthodox": "Specifies that the Gershonite clans were to encamp on the west side, behind the Tabernacle."
  },
  "24": {
    "General": "The leader of the fathers' house of the Gershonites was Eliasaph the son of Lael.",
    "Non-Denominational": "Identifies the leader appointed over the Gershonite division: Eliasaph the son of Lael.",
    "Baptist": "Notes the designated leader for the Gershonite families.",
    "Catholic": "Highlights the appointed leader of the Gershonite clans.",
    "Methodist": "Records the name of the leader for the Gershonite division.",
    "Lutheran": "Identifies Eliasaph the son of Lael as the leader of the Gershonite fathers' house.",
    "Presbyterian": "Notes the appointed leader for the Gershonite clan.",
    "Pentecostal": "Highlights the designated leader for the Gershonite families.",
    "Anglican": "Records the name of the leader of the Gershonite fathers' house.",
    "Orthodox": "Identifies Eliasaph the son of Lael as the leader of the Gershonite paternal house."
  },
  "25": {
    "General": "And the charge of the sons of Gershon in the tent of meeting was to be the tabernacle with its tent, the covering of it, the screen for the entrance of the tent of meeting,",
    "Non-Denominational": "Outlines the specific responsibilities of the Gershonites concerning the Tabernacle, which included the care and transport of the Tabernacle structure itself, its coverings, and the entrance screen.",
    "Baptist": "Notes the specific duties assigned to the Gershonites regarding the Tabernacle's structure and coverings.",
    "Catholic": "Highlights the Gershonites' responsibility for the tent of the Tabernacle and its associated coverings.",
    "Methodist": "Records the specific charges given to the Gershonites concerning the Tabernacle's physical structure.",
    "Lutheran": "Specifies the responsibilities of the Gershonites in caring for the Tabernacle tent, its covering, and the entrance screen.",
    "Presbyterian": "Notes the assigned duties of the Gershonites related to the Tabernacle's tent and its coverings.",
    "Pentecostal": "Highlights the specific responsibilities of the Gershonites concerning the Tabernacle's physical structure and coverings.",
    "Anglican": "Records the specific charges of the Gershonites regarding the Tabernacle tent and its components.",
    "Orthodox": "Outlines the responsibilities of the Gershonites for the Tabernacle tent, its coverings, and the screen at the entrance."
  },
  "26": {
    "General": "the hangings of the court, the screen for the entrance of the court that is around the tabernacle and the altar, and its cords, and all the service of these.",
    "Non-Denominational": "Continues to detail the Gershonites' responsibilities, including the hangings of the outer court, the screen at the court's entrance surrounding the Tabernacle and the altar, and all related cords and service.",
    "Baptist": "Further specifies the Gershonites' duties to include the care of the outer court hangings and entrance screen.",
    "Catholic": "Continues to highlight the Gershonites' responsibilities for the outer court and its components.",
    "Methodist": "Records additional charges for the Gershonites related to the Tabernacle's outer court.",
    "Lutheran": "Further specifies the Gershonites' duties in caring for the hangings and screen of the outer court surrounding the Tabernacle and altar, as well as the cords and all related service.",
    "Presbyterian": "Notes additional assigned duties of the Gershonites related to the outer court and its components.",
    "Pentecostal": "Further specifies the Gershonites' responsibilities concerning the outer court hangings, screen, cords, and related service.",
    "Anglican": "Records further charges for the Gershonites regarding the outer court and its components.",
    "Orthodox": "Continues to outline the responsibilities of the Gershonites, including the hangings and screen of the outer court, its cords, and all associated service."
  },
  "27": {
    "General": "Of Kohath was the clan of the Amramites and the clan of the Izharites and the clan of the Hebronites and the clan of the Uzzielites; these were the clans of Kohath.",
    "Non-Denominational": "Begins the numbering of the Kohathites by clan, listing their four constituent clans.",
    "Baptist": "Starts the census of the Kohathite families within the tribe of Levi.",
    "Catholic": "Focuses on the enumeration of the Kohathite clans.",
    "Methodist": "Begins the count of the Kohathite division by their families.",
    "Lutheran": "Starts the numbering of the Levites, focusing on the Kohathites and their clans.",
    "Presbyterian": "Begins the census of the Kohathite clan.",
    "Pentecostal": "Starts the count of the Kohathite families within the Levites.",
    "Anglican": "Begins the numbering of the Kohathite clans.",
    "Orthodox": "Starts the enumeration of the Kohathite clans: the Amramites, Izharites, Hebronites, and Uzzielites."
  },
  "28": {
    "General": "Their number according to the numbering of all males from a month old and upward was eight thousand six hundred, having charge of the sanctuary.",
    "Non-Denominational": "Records the total number of male Kohathites from one month old and upward, noting their specific responsibility for the sanctuary itself.",
    "Baptist": "Notes the total count of male Kohathites in the census and their duty related to the sanctuary.",
    "Catholic": "Highlights the numerical count of the male Kohathites and their charge over the holy place.",
    "Methodist": "Records the number of male Kohathites counted in the census, emphasizing their responsibility for the sanctuary.",
    "Lutheran": "Presents the total number of male Kohathites included in the census, noting their specific duty concerning the sanctuary.",
    "Presbyterian": "Records the total number of male Kohathites and their assigned responsibility for the sanctuary.",
    "Pentecostal": "Highlights the total count of male Kohathites from a month old, emphasizing their charge over the sanctuary.",
    "Anglican": "Notes the total number of male Kohathites counted and their responsibility for the sanctuary.",
    "Orthodox": "Records the total number of male Kohathites from one month old and upward, highlighting their responsibility for the sanctuary."
  },
  "29": {
    "General": "The clans of the Kohathites were to encamp on the south side of the tabernacle.",
    "Non-Denominational": "Specifies the location for the Kohathite encampment: on the south side of the Tabernacle, indicating their proximity to the most sacred area.",
    "Baptist": "Notes the designated camping area for the Kohathite families, south of the Tabernacle.",
    "Catholic": "Highlights the assigned position of the Kohathites in relation to the Tabernacle.",
    "Methodist": "Records the designated camping location for the Kohathites.",
    "Lutheran": "Specifies the area where the Kohathite clans were to encamp: on the south side of the Tabernacle.",
    "Presbyterian": "Notes the assigned camping position for the Kohathite clan.",
    "Pentecostal": "Highlights the designated encampment area for the Kohathites, south of the Tabernacle.",
    "Anglican": "Notes the designated camping location of the Kohathite clans.",
    "Orthodox": "Specifies that the Kohathite clans were to encamp on the south side of the Tabernacle."
  },
  "30": {
    "General": "The leader of the fathers' house of the clans of the Kohathites was Elizaphan the son of Uzziel.",
    "Non-Denominational": "Identifies the leader appointed over the Kohathite division: Elizaphan the son of Uzziel.",
    "Baptist": "Notes the designated leader for the Kohathite families.",
    "Catholic": "Highlights the appointed leader of the Kohathite clans.",
    "Methodist": "Records the name of the leader for the Kohathite division.",
    "Lutheran": "Identifies Elizaphan the son of Uzziel as the leader of the Kohathite fathers' house.",
    "Presbyterian": "Notes the appointed leader for the Kohathite clan.",
    "Pentecostal": "Highlights the designated leader for the Kohathite families.",
    "Anglican": "Records the name of the leader of the Kohathite fathers' house.",
    "Orthodox": "Identifies Elizaphan the son of Uzziel as the leader of the Kohathite paternal house."
  },
  "31": {
    "General": "And their charge was to be the ark, the table, the lampstand, the altars, the vessels of the sanctuary with which they minister, and the screen,",
    "Non-Denominational": "Outlines the specific and highly sacred responsibilities of the Kohathites, which included the care and transport of the Ark of the Covenant, the table of showbread, the golden lampstand, the altars of incense and burnt offering, the sacred vessels used in ministry, and the inner veil.",
    "Baptist": "Notes the specific and most holy duties assigned to the Kohathites regarding the Ark and other sacred items within the Tabernacle.",
    "Catholic": "Highlights the Kohathites' responsibility for the most sacred elements of the Tabernacle, including the Ark and the altars.",
    "Methodist": "Records the specific charges given to the Kohathites concerning the holiest items within the Tabernacle.",
    "Lutheran": "Specifies the responsibilities of the Kohathites in caring for the Ark, the table, the lampstand, the altars, the sacred vessels, and the inner veil.",
    "Presbyterian": "Notes the assigned duties of the Kohathites related to the most sacred articles within the Tabernacle.",
    "Pentecostal": "Highlights the specific and holy responsibilities of the Kohathites concerning the Ark, the table, the lampstand, the altars, the sacred vessels, and the screen.",
    "Anglican": "Records the specific charges of the Kohathites regarding the most sacred elements of the Tabernacle.",
    "Orthodox": "Outlines the responsibilities of the Kohathites for the Ark of the Covenant, the table, the lampstand, the altars, the sacred vessels, and the inner veil."
  },
  "32": {
    "General": "and all the service connected with these. Eleazar the son of Aaron the priest was to be chief over the leaders of the Levites and to have oversight of those who had charge of the sanctuary.",
    "Non-Denominational": "Continues to detail the Kohathites' responsibilities and notes that Eleazar, son of Aaron the priest, was appointed as the chief over all the Levitical leaders, with specific oversight of those responsible for the sanctuary.",
    "Baptist": "Further specifies the Kohathites' duties and highlights Eleazar's leadership over the Levites responsible for the sanctuary.",
    "Catholic": "Continues to highlight the Kohathites' responsibilities and notes Eleazar's leadership role over the sanctuary's caretakers.",
    "Methodist": "Records additional charges for the Kohathites and emphasizes Eleazar's leadership over the Levitical leaders responsible for the sanctuary.",
    "Lutheran": "Further specifies the responsibilities of the Kohathites and notes Eleazar's role as the chief leader over those caring for the sanctuary.",
    "Presbyterian": "Notes additional assigned duties of the Kohathites and highlights Eleazar's leadership role within the Levitical service, especially concerning the sanctuary.",
    "Pentecostal": "Further specifies the Kohathites' responsibilities and emphasizes Eleazar's leadership over the Levites in charge of the sanctuary.",
    "Anglican": "Records further charges for the Kohathites and notes Eleazar's leadership over the Levitical leaders responsible for the sanctuary.",
    "Orthodox": "Continues to outline the responsibilities of the Kohathites and emphasizes Eleazar's role as the chief overseer of those responsible for the sanctuary."
  },
  "33": {
    "General": "Of Merari was the clan of the Mahlites and the clan of the Mushites; these were the clans of Merari.",
    "Non-Denominational": "Begins the numbering of the Merarites by clan, listing their two constituent clans.",
    "Baptist": "Starts the census of the Merarite families within the tribe of Levi.",
    "Catholic": "Focuses on the enumeration of the Merarite clans.",
    "Methodist": "Begins the count of the Merarite division by their families.",
    "Lutheran": "Starts the numbering of the Levites, focusing on the Merarites and their clans.",
    "Presbyterian": "Begins the census of the Merarite clan.",
    "Pentecostal": "Starts the count of the Merarite families within the Levites.",
    "Anglican": "Begins the numbering of the Merarite clans.",
    "Orthodox": "Starts the enumeration of the Merarite clans: the Mahlites and the Mushites."
  },
  "34": {
    "General": "Their number according to the numbering of all males from a month old and upward was six thousand two hundred.",
    "Non-Denominational": "Records the total number of male Merarites from one month old and upward.",
    "Baptist": "Notes the total count of male Merarites in the census.",
    "Catholic": "Highlights the numerical count of the male Merarites.",
    "Methodist": "Records the number of male Merarites counted in the census.",
    "Lutheran": "Presents the total number of male Merarites included in the census.",
    "Presbyterian": "Records the total number of male Merarites.",
    "Pentecostal": "Highlights the total count of male Merarites from a month old.",
    "Anglican": "Notes the total number of male Merarites counted.",
    "Orthodox": "Records the total number of male Merarites from one month old and upward."
  },
  "35": {
    "General": "The leader of the fathers' house of the clans of Merari was Zuriel the son of Abihail.",
    "Non-Denominational": "Identifies the leader appointed over the Merarite division: Zuriel the son of Abihail.",
    "Baptist": "Notes the designated leader for the Merarite families.",
    "Catholic": "Highlights the appointed leader of the Merarite clans.",
    "Methodist": "Records the name of the leader for the Merarite division.",
    "Lutheran": "Identifies Zuriel the son of Abihail as the leader of the Merarite fathers' house.",
    "Presbyterian": "Notes the appointed leader for the Merarite clan.",
    "Pentecostal": "Highlights the designated leader for the Merarite families.",
    "Anglican": "Records the name of the leader of the Merarite fathers' house.",
    "Orthodox": "Identifies Zuriel the son of Abihail as the leader of the Merarite paternal house."
  },
  "36": {
    "General": "And their appointed charge was to be the frames of the tabernacle, the bars, the pillars, the bases, and all their accessories, and the pillars of the court around,",
    "Non-Denominational": "Outlines the responsibilities of the Merarites, which included the care and transport of the structural elements of the Tabernacle, such as the frames, bars, pillars, bases, and all their fittings, as well as the pillars of the outer court.",
    "Baptist": "Notes the specific duties assigned to the Merarites regarding the Tabernacle's structural components.",
    "Catholic": "Highlights the Merarites' responsibility for the framework and supports of the Tabernacle and the outer court.",
    "Methodist": "Records the specific charges given to the Merarites concerning the Tabernacle's structural elements.",
    "Lutheran": "Specifies the responsibilities of the Merarites in caring for the frames, bars, pillars, bases, and accessories of the Tabernacle, as well as the pillars of the outer court.",
    "Presbyterian": "Notes the assigned duties of the Merarites related to the structural components of the Tabernacle and the outer court.",
    "Pentecostal": "Highlights the specific responsibilities of the Merarites concerning the Tabernacle's frames, bars, pillars, bases, accessories, and the pillars of the court.",
    "Anglican": "Records the specific charges of the Merarites regarding the structural elements of the Tabernacle and the outer court pillars.",
    "Orthodox": "Outlines the responsibilities of the Merarites for the frames, bars, pillars, bases, and accessories of the Tabernacle, as well as the pillars of the surrounding court."
  },
  "37": {
    "General": "with their bases and their pegs and their cords.",
    "Non-Denominational": "Completes the list of the Merarites' responsibilities, which included the bases, pegs, and cords associated with the pillars of the outer court.",
    "Baptist": "Further specifies the Merarites' duties to include the bases, pegs, and cords of the outer court pillars.",
    "Catholic": "Continues to highlight the Merarites' responsibilities for the supports and fastenings of the outer court.",
    "Methodist": "Records additional charges for the Merarites related to the outer court pillars.",
    "Lutheran": "Further specifies the Merarites' duties in caring for the bases, pegs, and cords of the pillars of the outer court.",
    "Presbyterian": "Notes additional assigned duties of the Merarites related to the bases, pegs, and cords of the outer court pillars.",
    "Pentecostal": "Further specifies the Merarites' responsibilities concerning the bases, pegs, and cords of the pillars of the court.",
    "Anglican": "Records further charges for the Merarites regarding the bases, pegs, and cords of the outer court pillars.",
    "Orthodox": "Completes the outline of the Merarites' responsibilities, including the bases, pegs, and cords of the pillars of the outer court."
  },
  "38": {
    "General": "Those to encamp before the tabernacle on the east, before the tent of meeting toward the sunrise, were Moses and Aaron and his sons, keeping charge of the sanctuary for the charge of the people of Israel. And any outsider who came near shall be put to death.",
    "Non-Denominational": "Specifies the position of Moses, Aaron, and his sons to the east of the Tabernacle, highlighting their primary responsibility for the sanctuary itself and emphasizing the severe penalty for unauthorized access.",
    "Baptist": "Notes the privileged position of Moses, Aaron, and his sons nearest to the entrance of the Tabernacle, emphasizing their priestly duties and the warning against unauthorized approach.",
    "Catholic": "Highlights the placement of Moses and the priests on the east, signifying their direct responsibility for the sanctuary and the grave consequences for those not authorized to approach.",
    "Methodist": "Emphasizes the central role of Moses and the priests, positioned at the front of the Tabernacle, with the responsibility for its sacred duties and the protection against unauthorized access.",
    "Lutheran": "Highlights the position of Moses, Aaron, and his sons in front of the Tabernacle, noting their primary duty for the sanctuary and the stern warning against unauthorized approach.",
    "Presbyterian": "Stresses the unique and central position of Moses and the priests in relation to the Tabernacle, emphasizing their responsibility for its sanctity and the consequences for unauthorized intrusion.",
    "Pentecostal": "Highlights the divinely ordained position of Moses and the priests at the entrance of the Tabernacle, emphasizing their charge over the sanctuary and the serious warning against outsiders.",
    "Anglican": "Notes the prominent position of Moses and the priests on the east side of the Tabernacle, underscoring their primary responsibility for the sanctuary and the penalty for unauthorized access.",
    "Orthodox": "Emphasizes the placement of Moses, Aaron, and his sons at the front of the Tabernacle, highlighting their primary responsibility for the sanctuary and the severe warning against unauthorized approach, ensuring the holiness of God's dwelling."
  },
  "39": {
    "General": "All those of the Levites who were numbered by their clans, whom Moses and Aaron numbered according to the word of the Lord, all the males from a month old and upward, were twenty-two thousand.",
    "Non-Denominational": "Provides the total number of Levites counted in the census (excluding those who were not male or under one month old), emphasizing that the count was done according to God's command.",
    "Baptist": "Notes the total number of Levite males counted in the census, highlighting the divine instruction for this enumeration.",
    "Catholic": "Highlights the total count of the male Levites from one month old, as commanded by the Lord.",
    "Methodist": "Records the total number of Levite males counted in the census, emphasizing the obedience to God's word.",
    "Lutheran": "Presents the total number of male Levites included in the census, noting that it was done according to the Lord's command.",
    "Presbyterian": "Records the total number of male Levites counted within the covenant community, according to divine instruction.",
    "Pentecostal": "Highlights the total count of male Levites from a month old, as instructed by God.",
    "Anglican": "Notes the total number of male Levites counted in the census, in accordance with the Lord's command.",
    "Orthodox": "Emphasizes the total number of male Levites from one month old and upward, counted by Moses and Aaron according to the Lord's word."
  },
  "40": {
    "General": "And the Lord said to Moses, \"Number all the firstborn males of the people of Israel from a month old and upward, and take the number of their names.",
    "Non-Denominational": "Commands Moses to conduct a census of all the firstborn males in Israel who are one month old or older, emphasizing the need to record their names.",
    "Baptist": "Highlights God's instruction to count all firstborn males in Israel from one month old.",
    "Catholic": "Focuses on the divine command to number all firstborn males in Israel, noting the age criteria.",
    "Methodist": "Emphasizes God's directive to Moses to count the firstborn males in the community.",
    "Lutheran": "Highlights the Lord's command to Moses to number all the firstborn males in Israel from a month old.",
    "Presbyterian": "Stresses the divine instruction to Moses to conduct a census of all firstborn males within the covenant community.",
    "Pentecostal": "Highlights God's command to Moses to count all firstborn males in Israel from one month old.",
    "Anglican": "Notes the Lord's instruction to Moses to number all firstborn males in Israel.",
    "Orthodox": "Emphasizes the divine command to Moses to number all firstborn males among the people of Israel who are a month old or older."
  },
  "41": {
    "General": "And you shall take the Levites for meI am the Lordinstead of all the firstborn among the people of Israel, and the livestock of the Levites instead of all the firstborn livestock of the people of Israel.\"",
    "Non-Denominational": "Reiterates God's choice of the Levites to serve Him in place of all the firstborn sons of Israel, and their livestock in place of the firstborn livestock, emphasizing God's ownership and sovereignty.",
    "Baptist": "Highlights God's substitution of the Levites for the firstborn, both human and animal, emphasizing His ownership.",
    "Catholic": "Focuses on the divine exchange, with the Levites and their livestock being taken in place of the firstborn of Israel.",
    "Methodist": "Emphasizes God's prerogative to choose and designate individuals and their possessions for His service.",
    "Lutheran": "Highlights God's gracious act of taking the Levites and their livestock as substitutes for the firstborn of Israel.",
    "Presbyterian": "Stresses God's sovereign right to choose the Levites and their livestock as substitutes within the covenant arrangement.",
    "Pentecostal": "Highlights God's divine plan of substitution, taking the Levites and their animals in place of the firstborn of Israel.",
    "Anglican": "Notes the divine act of substitution, with the Levites and their livestock replacing the firstborn of Israel.",
    "Orthodox": "Emphasizes God's sovereign act of taking the Levites and their livestock as His own, in place of all the firstborn among the people of Israel and their livestock."
  },
  "42": {
    "General": "So Moses numbered all the firstborn among the people of Israel, as the Lord commanded him.",
    "Non-Denominational": "Highlights Moses' obedience to God's command in conducting the census of all the firstborn males in Israel.",
    "Baptist": "Emphasizes Moses' faithfulness in carrying out God's instructions precisely.",
    "Catholic": "Focuses on Moses' obedience to the divine command regarding the numbering of the firstborn.",
    "Methodist": "Highlights Moses' compliance with God's directives.",
    "Lutheran": "Emphasizes Moses' obedience to the Lord's word in conducting the census of the firstborn.",
    "Presbyterian": "Stresses Moses' faithfulness in carrying out the divine command.",
    "Pentecostal": "Highlights Moses' obedience to God's specific instructions.",
    "Anglican": "Notes Moses' adherence to the Lord's command.",
    "Orthodox": "Emphasizes Moses' obedience in numbering all the firstborn among the people of Israel as the Lord commanded him."
  },
  "43": {
    "General": "And all the firstborn males according to the number of names, from a month old and upward, belonging to the people of Israel, were twenty-two thousand two hundred and seventy-three.",
    "Non-Denominational": "Records the total number of firstborn males in Israel from one month old and upward, providing the figure that would be used for the exchange with the Levites.",
    "Baptist": "Notes the total count of firstborn males in Israel as determined by the census.",
    "Catholic": "Highlights the numerical count of the firstborn males in Israel.",
    "Methodist": "Records the number of firstborn males counted in the census.",
    "Lutheran": "Presents the total number of firstborn males in Israel included in the census.",
    "Presbyterian": "Records the total number of firstborn males in Israel.",
    "Pentecostal": "Highlights the total count of firstborn males in Israel from a month old.",
    "Anglican": "Notes the total number of firstborn males in Israel counted.",
    "Orthodox": "Records the total number of firstborn males among the people of Israel from one month old and upward."
  },
  "44": {
    "General": "And the Lord spoke to Moses, saying,",
    "Non-Denominational": "Indicates another section of divine instruction to Moses, now concerning the redemption of the excess number of firstborn.",
    "Baptist": "Highlights God's continued guidance and instruction for His people.",
    "Catholic": "Focuses on the divine initiative regarding the redemption of the firstborn.",
    "Methodist": "Emphasizes the ongoing communication between God and Moses for the organization of the community.",
    "Lutheran": "Highlights the divine word as the basis for the instructions regarding the redemption of the firstborn.",
    "Presbyterian": "Stresses the covenantal communication between God and Moses.",
    "Pentecostal": "Highlights God's direct communication to Moses.",
    "Anglican": "Notes the divine instruction given to Moses.",
    "Orthodox": "Emphasizes the divine address to Moses."
  },
  "45": {
    "General": "\"Take the Levites instead of all the firstborn among the people of Israel, and the livestock of the Levites instead of their livestock. And the Levites shall be mine. I am the Lord.",
    "Non-Denominational": "Reaffirms the substitution of the Levites and their livestock for the firstborn of Israel and their livestock, reiterating God's ownership.",
    "Baptist": "Highlights again God's substitution of the Levites for the firstborn.",
    "Catholic": "Focuses once more on the divine exchange of the Levites for the firstborn.",
    "Methodist": "Emphasizes God's sovereign right to choose and designate for His service.",
    "Lutheran": "Reiterates God's gracious act of taking the Levites as substitutes.",
    "Presbyterian": "Stresses God's sovereign choice in this substitution.",
    "Pentecostal": "Highlights again God's plan of substitution.",
    "Anglican": "Notes the reaffirmation of the divine substitution.",
    "Orthodox": "Emphasizes the reiteration of God's sovereign substitution of the Levites for the firstborn."
  },
  "46": {
    "General": "And for the redemption of the two hundred and seventy-three of the firstborn of the people of Israel who are more than the number of the Levites,",
    "Non-Denominational": "Addresses the fact that there were more firstborn males than Levites and provides instructions for the redemption of the excess.",
    "Baptist": "Highlights the surplus of firstborn males over the number of Levites, necessitating a redemption process.",
    "Catholic": "Focuses on the numerical difference between the firstborn and the Levites, requiring a means of redemption for the excess.",
    "Methodist": "Emphasizes the need for a process to account for the larger number of firstborn compared to the Levites.",
    "Lutheran": "Highlights the numerical disparity between the firstborn and the Levites, leading to the need for redemption.",
    "Presbyterian": "Stresses the numerical difference that required a plan for the redemption of the extra firstborn.",
    "Pentecostal": "Highlights the fact that there were more firstborn than Levites, necessitating a redemption.",
    "Anglican": "Notes the numerical imbalance between the firstborn and the Levites, requiring a redemption process.",
    "Orthodox": "Emphasizes the numerical surplus of the firstborn over the Levites, which necessitated a redemption for the remainder."
  },
  "47": {
    "General": "you shall take five shekels apiece for each of them. You shall take the money from the redemption of those who are in excess among them and give it to Aaron and his sons.\"",
    "Non-Denominational": "Commands Moses to collect five shekels for each of the excess firstborn sons (beyond the number of Levites) as a redemption price and give this money to Aaron and his sons, establishing a monetary redemption for those not replaced by the Levites.",
    "Baptist": "Highlights God's provision for the redemption of the firstborn who were in excess, with a specific monetary value assigned and the funds given to the priesthood.",
    "Catholic": "Focuses on the practice of redemption through a monetary offering for the firstborn sons who were not covered by the Levites, with the proceeds going to Aaron and his sons.",
    "Methodist": "Emphasizes the fairness of the redemption process, with a standard price set for each of the excess firstborn, the proceeds supporting the priestly ministry.",
    "Lutheran": "Highlights God's merciful provision for the redemption of the additional firstborn through a set monetary payment, which was to be given to Aaron and his sons.",
    "Presbyterian": "Stresses the covenantal provision for the redemption of the extra firstborn through a prescribed payment, which would support the priestly service.",
    "Pentecostal": "Highlights God's specific instructions for the monetary redemption of the firstborn who exceeded the number of Levites, with the payment designated for Aaron and his sons.",
    "Anglican": "Notes the historical practice of redeeming the excess firstborn through a monetary payment of five shekels each, given to Aaron and his sons.",
    "Orthodox": "Emphasizes the just provision for the redemption of the firstborn who were more numerous than the Levites, through a set monetary offering to Aaron and his sons."
  },
  "48": {
    "General": "And Moses took the redemption money from those who were in excess beyond those redeemed by the Levites.",
    "Non-Denominational": "Records Moses' obedience in collecting the redemption money from the families of the firstborn sons who were in excess of the number of Levites.",
    "Baptist": "Highlights Moses' faithfulness in carrying out the instructions for the redemption of the firstborn.",
    "Catholic": "Focuses on Moses' action of collecting the prescribed payment for the redemption of the excess firstborn.",
    "Methodist": "Emphasizes Moses' role in ensuring the redemption process was carried out according to God's instructions.",
    "Lutheran": "Highlights Moses' obedience in collecting the redemption money from those firstborn not replaced by the Levites.",
    "Presbyterian": "Stresses Moses' responsibility in overseeing the redemption process for the extra firstborn within the covenant community.",
    "Pentecostal": "Highlights Moses' action in collecting the redemption money as instructed by God.",
    "Anglican": "Notes Moses' historical action of collecting the redemption money.",
    "Orthodox": "Emphasizes Moses' obedience in collecting the redemption money from those firstborn who were in excess."
  },
  "49": {
    "General": "From the firstborn of the people of Israel he took money, one thousand three hundred and sixty-five shekels, according to the sanctuary shekel.",
    "Non-Denominational": "Records the total amount of redemption money collected by Moses, which was one thousand three hundred and sixty-five shekels, using the standard sanctuary shekel weight.",
    "Baptist": "Notes the specific amount of money collected for the redemption of the excess firstborn.",
    "Catholic": "Highlights the total sum of the redemption money, measured according to the sanctuary standard.",
    "Methodist": "Emphasizes the precise amount of the redemption offering collected from the firstborn.",
    "Lutheran": "Records the total monetary value of the redemption offering from the firstborn, according to the sanctuary shekel.",
    "Presbyterian": "Stresses the specific amount of the redemption money collected from the firstborn within the covenant community.",
    "Pentecostal": "Highlights the exact amount of money collected for the redemption of the excess firstborn, using the sanctuary shekel.",
    "Anglican": "Notes the specific amount of redemption money collected from the firstborn of Israel.",
    "Orthodox": "Emphasizes the total amount of redemption money collected, measured by the standard sanctuary shekel."
  },
  "50": {
    "General": "And Moses gave the redemption money to Aaron and his sons, according to the word of the Lord, as the Lord commanded Moses.",
    "Non-Denominational": "Records Moses' obedience in giving the collected redemption money to Aaron and his sons, fulfilling God's command regarding the distribution of these funds.",
    "Baptist": "Highlights Moses' faithfulness in distributing the redemption money to the priesthood as instructed.",
    "Catholic": "Focuses on Moses' action of giving the redemption money to Aaron and his sons, in accordance with the divine command.",
    "Methodist": "Emphasizes Moses' role in ensuring the proper distribution of the redemption funds to support the priestly ministry.",
    "Lutheran": "Highlights Moses' obedience in giving the redemption money to Aaron and his sons, as the Lord had commanded.",
    "Presbyterian": "Stresses Moses' responsibility in distributing the redemption money to Aaron and his sons within the covenant community, according to divine instruction.",
    "Pentecostal": "Highlights Moses' action in giving the redemption money to Aaron and his sons as instructed by God.",
    "Anglican": "Notes Moses' historical action of giving the redemption money to Aaron and his sons.",
    "Orthodox": "Emphasizes Moses' obedience in giving the redemption money to Aaron and his sons, according to the Lord's command."
  },
  "51": {
    "General": "And Moses gave the redemption money to Aaron and his sons, according to the word of the Lord, as the Lord commanded Moses.",
    "Non-Denominational": "This verse concludes the chapter by reiterating Moses' complete obedience in carrying out the Lord's commands regarding the census and the redemption of the firstborn, emphasizing his faithfulness as a leader.",
    "Baptist": "Highlights the concluding note of Moses' obedience to God's specific instructions concerning the Levites and the redemption of the firstborn.",
    "Catholic": "Focuses on the final statement emphasizing Moses' adherence to the divine will in all the instructions given for this chapter.",
    "Methodist": "Emphasizes the importance of obedience to God's word as demonstrated by Moses in fulfilling these commands.",
    "Lutheran": "Highlights the concluding affirmation of Moses' obedience to the Lord's commands regarding the matters discussed in this chapter.",
    "Presbyterian": "Stresses the final note of Moses' faithfulness in carrying out the divine instructions within the covenant community.",
    "Pentecostal": "Highlights the concluding statement affirming Moses' obedience to God's specific commands in this chapter.",
    "Anglican": "Notes the concluding remark on Moses' obedience to the Lord's commands.",
    "Orthodox": "Emphasizes the final statement highlighting Moses' complete obedience to the Lord's word in all the instructions for this chapter."
  }
}
