{
  "chapterSummary": {
    "General": "Numbers 3 details the duties and census of the Levites, who are set apart for service in the tabernacle. The chapter outlines the responsibilities of the different Levitical families and their role in the community.",
    "Non-Denominational": "This chapter highlights the importance of dedicated service and the unique role of the Levites in God's plan.",
    "Baptist": "The chapter emphasizes the importance of service and dedication to God's work.",
    "Catholic": "Numbers 3 illustrates the Church's understanding of sacred service and the role of the clergy.",
    "Methodist": "This chapter shows the importance of organized service and the role of dedicated individuals in the community.",
    "Lutheran": "The chapter demonstrates God's order and the special role of the Levites in His plan.",
    "Presbyterian": "This chapter reflects God's covenant faithfulness and the importance of dedicated service.",
    "Pentecostal": "Numbers 3 shows the importance of spiritual dedication and service in God's kingdom.",
    "Anglican": "The chapter demonstrates the importance of sacred service and the role of the clergy.",
    "Orthodox": "This chapter reveals the sacred nature of service and the unique role of the Levites."
  },
  "1": {
    "General": "This is the account of the family of Aaron and Moses at the time the Lord spoke to Moses at Mount Sinai.",
    "Non-Denominational": "God's communication with Moses highlights the importance of leadership and family.",
    "Baptist": "The verse emphasizes the importance of family and leadership in God's plan.",
    "Catholic": "The account reflects the importance of apostolic succession and leadership.",
    "Methodist": "This verse shows the importance of family and leadership in the community.",
    "Lutheran": "God's communication with Moses highlights the importance of leadership.",
    "Presbyterian": "The verse reflects God's covenant with families and leaders.",
    "Pentecostal": "God's communication emphasizes the importance of leadership and family.",
    "Anglican": "The account highlights the importance of leadership and family in God's plan.",
    "Orthodox": "This verse reveals the importance of leadership and family in God's plan."
  },
  "2": {
    "General": "The names of the sons of Aaron were Nadab the firstborn and Abihu, Eleazar and Ithamar.",
    "Non-Denominational": "The naming of Aaron's sons highlights the importance of family and succession.",
    "Baptist": "The verse emphasizes the importance of family and succession in leadership.",
    "Catholic": "The naming reflects the importance of apostolic succession and family.",
    "Methodist": "This verse shows the importance of family and succession in the community.",
    "Lutheran": "The naming of Aaron's sons highlights the importance of family.",
    "Presbyterian": "The verse reflects God's covenant with families and leaders.",
    "Pentecostal": "The naming emphasizes the importance of family and succession.",
    "Anglican": "The account highlights the importance of family and succession in God's plan.",
    "Orthodox": "This verse reveals the importance of family and succession in God's plan."
  },
  "3": {
    "General": "These were the names of Aaron's sons, the anointed priests, who were ordained to serve as priests.",
    "Non-Denominational": "The ordination of Aaron's sons highlights the importance of dedicated service.",
    "Baptist": "The verse emphasizes the importance of ordination and service in God's work.",
    "Catholic": "The ordination reflects the importance of sacred service and the role of the clergy.",
    "Methodist": "This verse shows the importance of ordination and service in the community.",
    "Lutheran": "The ordination of Aaron's sons highlights the importance of service.",
    "Presbyterian": "The verse reflects God's covenant with His servants.",
    "Pentecostal": "The ordination emphasizes the importance of dedicated service.",
    "Anglican": "The account highlights the importance of ordination and service in God's plan.",
    "Orthodox": "This verse reveals the importance of ordination and service in God's plan."
  },
  "4": {
    "General": "Nadab and Abihu, however, died before the Lord when they made an offering with unauthorized fire before him in the Desert of Sinai. They had no sons, so Eleazar and Ithamar served as priests during the lifetime of their father Aaron.",
    "Non-Denominational": "The account of Nadab and Abihu highlights the importance of obedience and proper worship.",
    "Baptist": "The verse emphasizes the importance of obedience and proper worship in God's service.",
    "Catholic": "The account reflects the importance of obedience and proper worship in the Church.",
    "Methodist": "This verse shows the importance of obedience and proper worship in the community.",
    "Lutheran": "The account of Nadab and Abihu highlights the importance of obedience.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of obedience.",
    "Pentecostal": "The account emphasizes the importance of obedience and proper worship.",
    "Anglican": "The account highlights the importance of obedience and proper worship in God's plan.",
    "Orthodox": "This verse reveals the importance of obedience and proper worship in God's plan."
  },
  "5": {
    "General": "The Lord said to Moses,",
    "Non-Denominational": "God's communication with Moses highlights the importance of divine guidance.",
    "Baptist": "The verse emphasizes the importance of divine guidance in leadership.",
    "Catholic": "God's communication reflects the importance of divine guidance in the Church.",
    "Methodist": "This verse shows the importance of divine guidance in the community.",
    "Lutheran": "God's communication with Moses highlights the importance of guidance.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of guidance.",
    "Pentecostal": "God's communication emphasizes the importance of divine guidance.",
    "Anglican": "The account highlights the importance of divine guidance in God's plan.",
    "Orthodox": "This verse reveals the importance of divine guidance in God's plan."
  },
  "6": {
    "General": "Bring the tribe of Levi and present them to Aaron the priest to assist him.",
    "Non-Denominational": "The presentation of the Levites highlights the importance of service and assistance.",
    "Baptist": "The verse emphasizes the importance of service and assistance in God's work.",
    "Catholic": "The presentation reflects the importance of service and assistance in the Church.",
    "Methodist": "This verse shows the importance of service and assistance in the community.",
    "Lutheran": "The presentation of the Levites highlights the importance of service.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of service.",
    "Pentecostal": "The presentation emphasizes the importance of service and assistance.",
    "Anglican": "The account highlights the importance of service and assistance in God's plan.",
    "Orthodox": "This verse reveals the importance of service and assistance in God's plan."
  },
  "7": {
    "General": "They are to perform duties for him and for the whole community at the Tent of Meeting by doing the work of the tabernacle.",
    "Non-Denominational": "The duties of the Levites highlight the importance of service and community.",
    "Baptist": "The verse emphasizes the importance of service and community in God's work.",
    "Catholic": "The duties reflect the importance of service and community in the Church.",
    "Methodist": "This verse shows the importance of service and community in the community.",
    "Lutheran": "The duties of the Levites highlight the importance of service.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of service.",
    "Pentecostal": "The duties emphasize the importance of service and community.",
    "Anglican": "The account highlights the importance of service and community in God's plan.",
    "Orthodox": "This verse reveals the importance of service and community in God's plan."
  },
  "8": {
    "General": "They are to take care of all the furnishings of the Tent of Meeting, fulfilling the obligations of the Israelites by doing the work of the tabernacle.",
    "Non-Denominational": "The care of the tabernacle highlights the importance of responsibility and service.",
    "Baptist": "The verse emphasizes the importance of responsibility and service in God's work.",
    "Catholic": "The care reflects the importance of responsibility and service in the Church.",
    "Methodist": "This verse shows the importance of responsibility and service in the community.",
    "Lutheran": "The care of the tabernacle highlights the importance of responsibility.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of responsibility.",
    "Pentecostal": "The care emphasizes the importance of responsibility and service.",
    "Anglican": "The account highlights the importance of responsibility and service in God's plan.",
    "Orthodox": "This verse reveals the importance of responsibility and service in God's plan."
  },
  "9": {
    "General": "Give the Levites to Aaron and his sons; they are the Israelites who are to be given wholly to him.",
    "Non-Denominational": "The giving of the Levites highlights the importance of dedication and service.",
    "Baptist": "The verse emphasizes the importance of dedication and service in God's work.",
    "Catholic": "The giving reflects the importance of dedication and service in the Church.",
    "Methodist": "This verse shows the importance of dedication and service in the community.",
    "Lutheran": "The giving of the Levites highlights the importance of dedication.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of dedication.",
    "Pentecostal": "The giving emphasizes the importance of dedication and service.",
    "Anglican": "The account highlights the importance of dedication and service in God's plan.",
    "Orthodox": "This verse reveals the importance of dedication and service in God's plan."
  },
  "10": {
    "General": "Appoint Aaron and his sons to serve as priests; anyone else who approaches the sanctuary must be put to death.",
    "Non-Denominational": "The appointment of Aaron and his sons highlights the importance of sacred service.",
    "Baptist": "The verse emphasizes the importance of sacred service and dedication in God's work.",
    "Catholic": "The appointment reflects the importance of sacred service and the role of the clergy.",
    "Methodist": "This verse shows the importance of sacred service and dedication in the community.",
    "Lutheran": "The appointment of Aaron and his sons highlights the importance of sacred service.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of sacred service.",
    "Pentecostal": "The appointment emphasizes the importance of sacred service and dedication.",
    "Anglican": "The account highlights the importance of sacred service and dedication in God's plan.",
    "Orthodox": "This verse reveals the importance of sacred service and dedication in God's plan."
  }
}