{
  "Summary": {
    "General": "Moses addresses the leaders of the tribes of Israel, conveying the Lord's commands regarding vows and oaths. If a man makes a vow to the Lord or swears an oath to bind himself, he must fulfill his word exactly. If a woman makes a vow or a binding oath while young and living in her father's house, and her father hears it but says nothing, the vow stands. However, if her father forbids her on the day he hears, the vow or oath is nullified, and the Lord will forgive her. If she marries while under a vow or a rash pledge, and her husband hears it but says nothing on that day, the vow stands. But if her husband forbids her on the day he hears, he nullifies the vow or pledge, and the Lord will forgive her. Vows made by a widow or a divorced woman are binding. If a married woman makes a vow or oath in her husband's house, and he hears but remains silent, it stands. If he explicitly nullifies it on the day he hears, it is void, and the Lord will forgive her. The husband has the authority to confirm or nullify any vow or oath his wife makes. If he remains silent day after day, he confirms them. If he nullifies them after initially hearing them without objection, he bears her iniquity. These are the statutes the Lord commanded Moses concerning husbands and wives, and fathers and daughters living in their father's house during their youth.",
    "Non-Denominational": "Focuses on the seriousness of vows and oaths made before God, emphasizing integrity and faithfulness in keeping one's word. It outlines the specific conditions under which vows made by women (young daughters, wives) could be confirmed or nullified by male authorities (father, husband), reflecting the social structure of the time. This authority was linked to responsibility; the father/husband could annul a vow but also bore responsibility if they confirmed it inappropriately or annulled it late. The core principle remains the importance of honoring commitments made to God, while providing specific regulations for women within the patriarchal family system.",
    "Baptist": "Emphasizes the sanctity of vows made to God and the importance of fulfilling sworn commitments. It highlights God's ordained structure of authority within the family, where fathers and husbands held responsibility for the vows made by dependent women (daughters, wives). This authority included the power to nullify vows considered rash or inappropriate, thereby protecting the woman and the family. The husband's responsibility is underscored – failing to nullify promptly meant confirming the vow; nullifying later meant bearing the wife's guilt. The passage stresses both personal integrity in commitments and the functioning of God-ordained family headship.",
    "Catholic": "Views vows and oaths as sacred commitments made to God, requiring fulfillment. The regulations concerning women's vows reflect the societal context and principles of family authority and responsibility recognized in the Old Covenant. The father's or husband's authority to confirm or nullify vows is seen as protecting the woman and ensuring vows align with family duties and God's law. This doesn't diminish the woman's personal responsibility but places it within the family structure. The Lord's forgiveness when a vow is nullified underscores divine mercy within these legal structures. These statutes guide responsible commitment-making.",
    "Methodist": "Highlights the importance of keeping promises made to God (vows and oaths) as a matter of spiritual integrity. It addresses the practical application within the family structure, granting authority to fathers and husbands over the vows of daughters and wives. This authority was intended to provide guidance and protection, allowing for the annulment of potentially rash or burdensome commitments made by those under their care. The husband's responsibility to act promptly underscores the seriousness of this oversight. The regulations balance the sanctity of vows with the realities of family relationships and responsibilities.",
    "Lutheran": "Focuses on the Law regarding vows and oaths. Keeping one's word, especially to God, is a matter of Law and reflects God's desire for order and faithfulness. The specific regulations concerning women's vows demonstrate God's ordering of households under male headship (Law) in that era. The father's/husband's ability to nullify vows shows a provision within the Law, preventing rash commitments from becoming binding under specific circumstances. The consequence for the husband who delays nullification (bearing her iniquity) reinforces responsibility under the Law. Ultimately, the Law reveals the need for Christ, who perfectly fulfilled all commitments."
  },
  "Verses": {
    "1": {
      "General": "Moses speaks to the heads (chiefs) of the tribes of the Israelites.",
      "Non-Denominational": "Moses addresses the tribal leaders of Israel to deliver God's instructions.",
      "Baptist": "Moses communicates God's commands specifically to the leaders (heads) of the Israelite tribes.",
      "Catholic": "Moses addresses the leaders of the Israelite tribes.",
      "Methodist": "Moses speaks to the leaders of the Israelite tribes.",
      "Lutheran": "Moses addresses the heads of the tribes of Israel."
    },
    "2": {
      "General": "'This is what the Lord has commanded: If a man makes a vow to the Lord or swears an oath (binds his soul with a bond) to obligate himself by a pledge, he must not break his word but must do everything he has promised (according to all that proceedeth out of his mouth).'",
      "Non-Denominational": "God's command regarding men: If a man makes a vow to God or binds himself with a sworn pledge, he must fulfill it completely, not breaking his word.",
      "Baptist": "The Lord's command concerning men's vows: A man making a vow to God or swearing a binding oath must not violate his promise; he must perform everything he stated.",
      "Catholic": "The Lord's command: If a man makes a vow to the Lord or binds himself by oath, he shall not break his word but fulfill all he has promised.",
      "Methodist": "God's command: If a man vows to the Lord or swears a binding oath, he must not break his word but must fulfill everything he promised.",
      "Lutheran": "The Lord's command (Law): A man making a vow to the Lord or a binding oath must not break his word but fulfill all he promised."
    },
    "3": {
      "General": "'If a woman makes a vow to the Lord or obligates herself by a pledge while she is young (in her youth) and still living in her father's house,'",
      "Non-Denominational": "Introduces the case of a young woman making a vow or pledge while living under her father's authority.",
      "Baptist": "Addresses the situation of a young woman making a vow or pledge while still unmarried and residing in her father's home.",
      "Catholic": "Concerns a woman making a vow to the Lord or binding herself by oath while young and living in her father's house.",
      "Methodist": "Addresses a young woman making a vow or pledge while living in her father's house.",
      "Lutheran": "Addresses the case (Law) of a young woman making a vow or pledge while in her father's house."
    },
    "4": {
      "General": "'and her father hears about her vow or pledge but says nothing to her, then all her vows and pledges shall stand.'",
      "Non-Denominational": "If her father hears the vow/pledge and remains silent (doesn't object), then her commitments are binding.",
      "Baptist": "If her father is aware of her vow or pledge and does not object ('holdeth his peace'), then her commitments are established and binding.",
      "Catholic": "If her father hears of her vow or oath and remains silent, then all her vows and oaths stand.",
      "Methodist": "If her father hears the vow or pledge and says nothing, her commitments become binding.",
      "Lutheran": "If her father hears and is silent, her vows/pledges stand (are established)."
    },
    "5": {
      "General": "'But if her father forbids her (disallows her) on the day he hears about it, then none of her vows or pledges shall stand. The Lord will release her (forgive her), because her father has forbidden her.'",
      "Non-Denominational": "However, if her father explicitly forbids her on the day he learns of it, her vows/pledges are nullified. God will release her from the obligation because of her father's annulment.",
      "Baptist": "But if her father disallows her vow/pledge on the very day he hears it, none of her commitments shall stand; the Lord will forgive her because her father overruled her.",
      "Catholic": "But if her father objects on the day he hears, none of her vows or oaths shall stand; the Lord will forgive her because her father objected.",
      "Methodist": "If her father forbids her on the day he hears, none of her vows or pledges are binding. The Lord will release her due to her father's action.",
      "Lutheran": "If her father disallows it on the day he hears, none of her vows/pledges stand; the Lord will forgive her due to the father's annulment."
    },
    "6": {
      "General": "'If she marries after she has made a vow or put herself under a binding obligation by a rash utterance (uttered ought out of her lips),'",
      "Non-Denominational": "Addresses the scenario where a woman marries while already under a vow or a hastily made pledge.",
      "Baptist": "Considers the case of a woman who marries while bound by a pre-existing vow or a rash, spoken pledge.",
      "Catholic": "Concerns a woman who marries while under a vow or a rash pledge she has made.",
      "Methodist": "Addresses a woman who marries while under a vow or a rashly spoken pledge.",
      "Lutheran": "Addresses the case (Law) of a woman marrying while under a vow or rash pledge."
    },
    "7": {
      "General": "'and her husband hears about it but says nothing to her on that day, then her vows or pledges shall stand.'",
      "Non-Denominational": "If her husband learns of her pre-existing vow/pledge and remains silent on that day, her commitments remain binding.",
      "Baptist": "If her husband hears of it and does not object ('holdeth his peace') on that specific day, then her vows/pledges are established and binding.",
      "Catholic": "If her husband hears of it and remains silent on that day, her vows and oaths stand.",
      "Methodist": "If her husband hears and says nothing on that day, her vows or pledges remain binding.",
      "Lutheran": "If her husband hears and is silent on that day, her vows/pledges stand (are established)."
    },
    "8": {
      "General": "'But if her husband forbids her (disallows her) on the day he hears about it, he nullifies the vow she is under or the rash utterance regarding the pledge. The Lord will release her (forgive her).'",
      "Non-Denominational": "However, if her husband explicitly forbids her on the day he learns of it, he cancels her vow or rash pledge. God will release her from the obligation.",
      "Baptist": "But if her husband disallows her on the day he hears it, he makes void her vow or rash pledge; the Lord will forgive her.",
      "Catholic": "But if her husband objects on the day he hears, he nullifies the vow or rash pledge she was under; the Lord will forgive her.",
      "Methodist": "If her husband forbids her on the day he hears, he nullifies her vow or rash pledge. The Lord will release her.",
      "Lutheran": "If her husband disallows it on the day he hears, he voids her vow/pledge; the Lord will forgive her."
    },
    "9": {
      "General": "'Any vow or binding pledge made by a widow or a divorced woman shall stand against her.'",
      "Non-Denominational": "Vows or pledges made by women not under the authority of a father or husband (widows, divorced women) are fully binding upon them.",
      "Baptist": "Vows or binding pledges made by widows or divorced women are automatically established and binding upon them.",
      "Catholic": "However, any vow or binding oath of a widow or divorced woman shall stand.",
      "Methodist": "Vows or pledges made by a widow or divorced woman are binding upon her.",
      "Lutheran": "Vows/pledges of a widow or divorced woman shall stand against her (are binding)."
    },
    "10": {
      "General": "'If a woman made a vow or bound herself by a pledge under oath while in her husband's house,'",
      "Non-Denominational": "Addresses the case of a married woman making a vow or pledge while living with her husband.",
      "Baptist": "Considers a vow or binding oath made by a woman while married and living in her husband's household.",
      "Catholic": "Concerns a woman making a vow or binding herself by oath while living in her husband's house.",
      "Methodist": "Addresses a married woman making a vow or pledge under oath.",
      "Lutheran": "Addresses the case (Law) of a wife making a vow or pledge in her husband's house."
    },
    "11": {
      "General": "'and her husband heard it and said nothing to her and did not forbid her (disallow her), then all her vows shall stand, and every pledge she bound herself by shall stand.'",
      "Non-Denominational": "If her husband heard it, remained silent, and did not forbid her, then all her vows and pledges are confirmed and binding.",
      "Baptist": "If her husband heard, did not object ('held his peace'), and did not disallow her, then all her vows and pledges are established and binding.",
      "Catholic": "If her husband heard but remained silent and did not object, then all her vows and oaths shall stand.",
      "Methodist": "If her husband heard, said nothing, and did not forbid her, all her vows and pledges are binding.",
      "Lutheran": "If her husband heard, was silent, and did not disallow her, all her vows/pledges stand (are established)."
    },
    "12": {
      "General": "'But if her husband definitely nullified them (made them utterly void) on the day he heard them, then whatever she uttered pertaining to her vows or pledges shall not stand. Her husband has nullified them (made them void), and the Lord will release her (forgive her).'",
      "Non-Denominational": "But if her husband definitively nullified them on the day he heard them, anything she spoke concerning her vows or pledges is not binding. Because her husband voided them, God will release her.",
      "Baptist": "However, if her husband completely nullified them on the day he heard them, then nothing she uttered concerning her vows or pledges shall stand; her husband voided them, and the Lord will forgive her.",
      "Catholic": "But if her husband nullified them on the day he heard them, whatever she uttered concerning vows or oaths shall not stand; her husband has nullified them, and the Lord will forgive her.",
      "Methodist": "If her husband definitively nullified them on the day he heard them, nothing she uttered regarding vows or pledges is binding. Her husband voided them, and the Lord will release her.",
      "Lutheran": "But if her husband utterly voided them on the day he heard, whatever she uttered concerning vows/pledges shall not stand; her husband voided them, and the Lord will forgive her."
    },
    "13": {
      "General": "'Her husband may establish or nullify (make void) any vow or any binding oath to humble herself (afflict the soul).'",
      "Non-Denominational": "The husband has the authority to either confirm (establish) or cancel (make void) any vow or any oath involving self-denial made by his wife.",
      "Baptist": "The husband has the power to either establish (confirm) or make void (annul) every vow and every binding oath his wife takes involving self-affliction.",
      "Catholic": "Any vow or any binding oath to practice self-denial, her husband may confirm or nullify.",
      "Methodist": "The husband can confirm or nullify any vow or binding oath his wife makes to practice self-denial.",
      "Lutheran": "Every vow and every binding oath to afflict the soul, her husband may establish or void it."
    },
    "14": {
      "General": "'But if her husband remains completely silent toward her day after day, he establishes all her vows or pledges that are upon her; he confirms them because he said nothing to her on the day he heard them.'",
      "Non-Denominational": "If the husband consistently remains silent ('from day to day'), he thereby confirms all her existing vows and pledges; his silence upon hearing them constitutes establishment.",
      "Baptist": "If her husband consistently remains silent ('altogether hold his peace at her from day to day'), he thereby establishes all her vows and pledges; he confirms them by his silence on the day he learned of them.",
      "Catholic": "But if her husband remains completely silent day after day, he confirms all her vows and oaths; he confirms them by saying nothing on the day he heard.",
      "Methodist": "If her husband remains silent day after day, he confirms all her vows and pledges by not speaking when he first heard them.",
      "Lutheran": "If her husband is altogether silent day after day, he establishes all her vows/pledges; he confirms them by his silence on the day he heard."
    },
    "15": {
      "General": "'But if he should definitely nullify them (make them void) after he has heard them, then he shall bear her guilt (iniquity).'",
      "Non-Denominational": "If, however, he nullifies them *after* the initial day he heard them (i.e., after his silence had implicitly confirmed them), then he bears the responsibility/guilt associated with the broken vow.",
      "Baptist": "But if he nullifies them *after* the day he heard them (delaying the annulment), then he shall bear the iniquity (guilt) associated with her broken vow.",
      "Catholic": "But if he nullifies them after he has heard them, then he shall bear her guilt.",
      "Methodist": "If he nullifies them *after* initially hearing them (and remaining silent), then he bears the responsibility for her broken vow.",
      "Lutheran": "But if he voids them *after* he heard them, then he shall bear her iniquity (guilt under the Law)."
    },
    "16": {
      "General": "'These are the statutes the Lord commanded Moses concerning the relationship between a man and his wife, and between a father and his daughter living in her father's house during her youth.'",
      "Non-Denominational": "Concluding statement: These are the specific regulations God gave Moses regarding vows made by women within the context of husband-wife and father-daughter relationships (specifically a daughter in her youth living at home).",
      "Baptist": "Conclusion: These are the specific laws (statutes) the Lord commanded Moses governing vows in the relationships between husband and wife, and father and young daughter living at home.",
      "Catholic": "These are the statutes the Lord commanded Moses concerning husbands and wives, and fathers and daughters living in the father's house during their youth.",
      "Methodist": "These are the regulations God commanded Moses regarding vows within the husband-wife relationship, and the father-daughter relationship for a daughter in her youth at home.",
      "Lutheran": "Conclusion: These are the statutes (Laws) the Lord commanded Moses concerning husband/wife and father/young daughter (in his house) relationships regarding vows."
    }
  }
}
