{
  "Summary": {
    "General": "The Lord commands Moses to avenge the Israelites against the Midianites before Moses dies. Moses instructs the Israelites to arm 1,000 men from each tribe for war against Midian to carry out the Lord's vengeance. Twelve thousand armed men, along with Phinehas son of Eleazar the priest carrying holy articles and trumpets, go to battle. They attack Midian as commanded, killing every male, including the five kings of Midian (Evi, Rekem, Zur, Hur, Reba) and Balaam son of Beor. They capture the Midianite women and children, take all their livestock and possessions as plunder, and burn all their towns and encampments. They bring the captives, plunder, and spoils to Moses, Eleazar, and the congregation at the plains of Moab. Moses, Eleazar, and the leaders meet them outside the camp. Moses is angry with the military commanders for sparing the women, identifying them as the ones who, on Balaam's advice, caused the Israelites to sin against the Lord in the matter of Peor, leading to a plague. Moses orders the execution of all male children and all women who have slept with a man, but allows virgin girls to be kept alive for themselves. The soldiers and their captives who have touched a dead body must remain outside the camp for seven days and purify themselves and their plunder on the third and seventh days using water of purification. Eleazar instructs them on purifying metal spoils (gold, silver, bronze, iron, tin, lead) by fire and then water, and other items by water alone. After seven days, the purified soldiers re-enter the camp. The Lord tells Moses to count the plunder (captives and animals) with Eleazar and the leaders, and divide it equally between the soldiers who fought and the rest of the congregation. From the soldiers' half, a tribute of one in five hundred (people, cattle, donkeys, sheep) is given to Eleazar for the Lord. From the congregation's half, a tribute of one in fifty (people, cattle, donkeys, sheep) is given to the Levites who serve at the Tabernacle. Moses and Eleazar distribute the plunder and tribute as commanded. The military officers report to Moses that none of their soldiers are missing. As an offering to the Lord for atonement, they present the gold jewelry they captured (armlets, bracelets, rings, earrings, necklaces). Moses and Eleazar accept the gold offering (totaling 16,750 shekels) and bring it into the Tent of Meeting as a memorial for the Israelites before the Lord.",
    "Non-Denominational": "Focuses on God's judgment against Midian for leading Israel into idolatry (Peor incident) and the execution of that judgment through Israel. It highlights the thoroughness of the command, including the execution of specific groups (males, non-virgin women) linked to the Peor sin. The role of Phinehas and holy items signifies God's presence in the battle. The purification rituals emphasize the need for cleansing after contact with death and warfare. The meticulous division of spoils and the setting aside of portions for the Lord (priests) and Levites underscore stewardship, gratitude, and the support of ministry. The officers' offering expresses thanksgiving for God's protection and acknowledges the need for atonement even in victory.",
    "Baptist": "Emphasizes God's holy wrath against sin and His use of Israel as an instrument of judgment upon the Midianites for their role in the Peor apostasy, instigated by Balaam. The killing of Midianite males, non-virgin women, and Balaam underscores the severity of leading God's people astray. The purification laws highlight the defilement associated with death and the need for separation and cleansing before approaching God. The specific division of spoils, including tithes for the priests (Lord's tribute) and Levites, reinforces principles of stewardship and support for God's work. The voluntary thank offering from the soldiers acknowledges God's sovereignty and protection.",
    "Catholic": "Views the war against Midian as an act of divine justice executed by Israel under God's command, punishing Midian for tempting Israel into grave sin (idolatry and immorality at Peor). The severity of the judgment reflects the seriousness of the offense against God. The purification rituals emphasize the sacredness of life and the need for ritual purity after bloodshed before returning to the holy community. The careful division of spoils, with portions dedicated to the Lord (priests) and Levites, demonstrates principles of justice, gratitude, and supporting the priesthood. The soldiers' offering serves as atonement and a memorial of God's protection.",
    "Methodist": "Highlights God's call for justice against those who deliberately lead others into sin (Midianites and Balaam). The battle is portrayed as fulfilling God's command for vengeance. Moses' anger focuses on the commanders' failure to fully address the source of the Peor sin (the women involved). The commands for purification underscore the spiritual contamination associated with killing and warfare, requiring cleansing before rejoining the community. The equitable distribution of spoils, including provisions for the priests and Levites, reflects godly principles of fairness and support for religious service. The soldiers' gold offering demonstrates gratitude and seeks atonement.",
    "Lutheran": "Focuses on the execution of God's judgment (Law) against Midian for causing Israel to sin (Peor), with Israel acting as God's instrument. The command to kill specific groups, including Balaam, shows the consequence of opposing God and leading His people astray. The purification laws (Law) demonstrate the defilement caused by death and the need for cleansing according to God's prescription. The division of spoils and the required tribute to the Lord (priests) and Levites are part of God's ordained order (Law). The soldiers' offering, seeking atonement, acknowledges their dependence on God's mercy even while carrying out His judgment (pointing towards the need for grace/Gospel)."
  },
  "Verses": {
    "1": {
      "General": "The Lord speaks to Moses.",
      "Non-Denominational": "God gives a specific command to Moses.",
      "Baptist": "The Lord communicates His will to Moses.",
      "Catholic": "The Lord addresses Moses.",
      "Methodist": "God speaks instructions to Moses.",
      "Lutheran": "The Lord addresses Moses."
    },
    "2": {
      "General": "'Avenge the Israelites on the Midianites. Afterward, you will be gathered to your people (die).'",
      "Non-Denominational": "God commands Moses to execute vengeance upon the Midianites on behalf of Israel, stating this action will precede Moses' death.",
      "Baptist": "The Lord commands Moses to enact retribution ('avenge') for Israel against the Midianites, linking this final act of leadership to Moses' impending death.",
      "Catholic": "The Lord instructs Moses to exact vengeance for the Israelites on the Midianites, after which Moses will die.",
      "Methodist": "God commands Moses to carry out vengeance on the Midianites for the Israelites, indicating this task precedes Moses' death.",
      "Lutheran": "The Lord commands Moses to avenge Israel upon Midian (Law/Judgment), informing him his death will follow."
    },
    "3": {
      "General": "Moses tells the people, 'Arm some men among you for the war, that they may go against Midian to execute the Lord's vengeance on Midian.'",
      "Non-Denominational": "Moses relays the command, instructing the people to prepare soldiers for war against Midian specifically to carry out God's vengeance.",
      "Baptist": "Moses commands the people to equip men for war to attack Midian and execute the Lord's judgment ('vengeance') upon them.",
      "Catholic": "Moses instructs the people to arm men for war against Midian to execute the Lord's vengeance.",
      "Methodist": "Moses directs the people to arm men for war against Midian to carry out the Lord's vengeance.",
      "Lutheran": "Moses commands the people to arm men for war to execute the Lord's vengeance on Midian."
    },
    "4": {
      "General": "'Send a thousand men from each tribe throughout all the tribes of Israel to the war.'",
      "Non-Denominational": "Moses specifies the number: 1,000 soldiers from each of the twelve tribes are to be sent to battle.",
      "Baptist": "Moses mandates a levy of 1,000 men per tribe from all tribes of Israel for the military campaign.",
      "Catholic": "Moses specifies sending 1,000 men per tribe from all Israelite tribes to the war.",
      "Methodist": "Moses instructs that 1,000 men from each Israelite tribe be sent to the war.",
      "Lutheran": "Moses commands 1,000 men per tribe from all tribes to be sent to war."
    },
    "5": {
      "General": "So twelve thousand men armed for war were provided out of the thousands of Israel, one thousand from each tribe.",
      "Non-Denominational": "The command is fulfilled: 12,000 armed soldiers, 1,000 from each tribe, are mustered from Israel's clans.",
      "Baptist": "Twelve thousand soldiers equipped for war (1,000 per tribe) were supplied from the larger clans ('thousands') of Israel.",
      "Catholic": "Thus, 12,000 men armed for war, 1,000 from each tribe, were levied from the clans of Israel.",
      "Methodist": "Twelve thousand men armed for war, 1,000 from each tribe, were provided from the clans of Israel.",
      "Lutheran": "Twelve thousand armed men, 1,000 per tribe, were delivered out of the thousands (clans) of Israel."
    },
    "6": {
      "General": "Moses sent them, a thousand from each tribe, to the war, along with Phinehas son of Eleazar the priest, who took charge of the holy articles and the trumpets for signaling.",
      "Non-Denominational": "Moses dispatches the 12,000 soldiers, accompanied by Phinehas the priest carrying sacred objects and the signal trumpets.",
      "Baptist": "Moses sends the tribal contingents (1,000 each) to war, accompanied by Phinehas, son of Eleazar the priest, carrying the holy instruments and signal trumpets.",
      "Catholic": "Moses sent the 12,000 soldiers to war, accompanied by Phinehas son of Eleazar the priest, with the sacred vessels and the signal trumpets.",
      "Methodist": "Moses sends the 12,000 soldiers, along with Phinehas the priest carrying the holy articles and signaling trumpets.",
      "Lutheran": "Moses sends the 12,000 to war, with Phinehas the priest, who had the holy instruments and signal trumpets."
    },
    "7": {
      "General": "They fought against Midian, as the Lord commanded Moses, and killed every male.",
      "Non-Denominational": "The Israelites wage war against Midian according to God's command, killing all Midianite males.",
      "Baptist": "They execute the war against Midian exactly as the Lord commanded Moses, killing every male.",
      "Catholic": "They waged war against Midian, as the Lord commanded Moses, and killed every male.",
      "Methodist": "They fought against Midian as commanded by the Lord through Moses, killing every male.",
      "Lutheran": "They warred against Midian, as the Lord commanded Moses, and killed all the males (Judgment)."
    },
    "8": {
      "General": "Among the slain were the kings of Midian: Evi, Rekem, Zur, Hur, and Reba—the five kings of Midian. They also killed Balaam son of Beor with the sword.",
      "Non-Denominational": "Specifically names the five Midianite kings killed, and also notes the execution of Balaam son of Beor by the sword.",
      "Baptist": "Lists the five kings of Midian slain in the battle (Evi, Rekem, Zur, Hur, Reba) and emphasizes that Balaam son of Beor was also killed by the sword.",
      "Catholic": "Besides the slain, they killed the five kings of Midian: Evi, Rekem, Zur, Hur, and Reba. They also killed Balaam son of Beor with the sword.",
      "Methodist": "Includes the five kings of Midian among the slain and notes that Balaam son of Beor was also killed by the sword.",
      "Lutheran": "Names the five kings of Midian killed, along with the other slain, and specifically mentions Balaam son of Beor was killed by the sword."
    },
    "9": {
      "General": "The Israelites captured the Midianite women and their children, and took as plunder all their herds, flocks, and goods.",
      "Non-Denominational": "The Israelites take the Midianite women and children captive and seize all their livestock (herds, flocks) and possessions as spoils of war.",
      "Baptist": "Israel takes the Midianite women and children captive, seizing all their cattle, flocks, and goods as plunder.",
      "Catholic": "The Israelites took the Midianite women and children captive and seized all their cattle, flocks, and goods as spoils.",
      "Methodist": "The Israelites capture the women and children of Midian and take all their livestock and possessions as plunder.",
      "Lutheran": "Israel captures the Midianite women and children and takes all their livestock and goods as plunder."
    },
    "10": {
      "General": "They burned all the towns where the Midianites lived, as well as all their encampments (castles).",
      "Non-Denominational": "They destroy the Midianite infrastructure by burning all their towns and encampments.",
      "Baptist": "They burn all Midianite cities and fortified encampments ('goodly castles') with fire.",
      "Catholic": "They burned all their towns and encampments.",
      "Methodist": "They burn all the Midianite towns and encampments.",
      "Lutheran": "They burn all their cities and encampments ('castles') with fire."
    },
    "11": {
      "General": "They took all the plunder and spoils, both people and animals.",
      "Non-Denominational": "They gather all the spoils, consisting of both captives (people) and material goods (animals, possessions).",
      "Baptist": "They collect all the spoils and plunder, including both the human captives and the animals.",
      "Catholic": "They took all the spoil and plunder, both persons and animals.",
      "Methodist": "They gather all the plunder and spoils, including people and animals.",
      "Lutheran": "They take all the spoil and plunder, both people and animals."
    },
    "12": {
      "General": "They brought the captives, plunder, and spoils to Moses, Eleazar the priest, and the Israelite congregation at the camp on the plains of Moab by the Jordan across from Jericho.",
      "Non-Denominational": "The victorious army brings the captives and spoils back to the main Israelite camp (located on the plains of Moab near the Jordan, opposite Jericho), presenting them to Moses, Eleazar, and the community.",
      "Baptist": "The soldiers bring the captives, plunder, and spoils to Moses, Eleazar the priest, and the entire Israelite congregation situated at the camp in the plains of Moab near Jericho.",
      "Catholic": "They brought the captives, spoil, and plunder to Moses, Eleazar the priest, and the Israelite community at the camp on the plains of Moab, by the Jordan opposite Jericho.",
      "Methodist": "They bring the captives, plunder, and spoils to Moses, Eleazar, and the congregation at the camp on the plains of Moab near Jericho.",
      "Lutheran": "They bring the captives, plunder, and spoils to Moses, Eleazar, and the congregation at the camp in the plains of Moab by the Jordan near Jericho."
    },
    "13": {
      "General": "Moses, Eleazar the priest, and all the leaders of the congregation went out to meet them outside the camp.",
      "Non-Denominational": "The leadership (Moses, Eleazar, community leaders) goes outside the main camp to formally receive the returning army.",
      "Baptist": "Moses, Eleazar the priest, and all the community leaders ('princes') go forth from the camp to meet the returning army.",
      "Catholic": "Moses, Eleazar the priest, and all the leaders of the community went out of the camp to meet them.",
      "Methodist": "Moses, Eleazar, and the community leaders meet the returning army outside the camp.",
      "Lutheran": "Moses, Eleazar, and all the princes of the congregation go out to meet them outside the camp."
    },
    "14": {
      "General": "Moses was angry with the officers of the army—the commanders of thousands and commanders of hundreds—who returned from the battle.",
      "Non-Denominational": "Moses expresses anger towards the military commanders (leaders of thousands and hundreds) upon their return from the war.",
      "Baptist": "Moses becomes angry with the army officers (commanders of thousands and hundreds) returning from the battle.",
      "Catholic": "Moses became angry with the officers of the army, the commanders of thousands and hundreds, who returned from the military expedition.",
      "Methodist": "Moses expresses anger at the army officers returning from battle.",
      "Lutheran": "Moses is angry with the army officers (commanders of thousands/hundreds) returning from battle."
    },
    "15": {
      "General": "'Have you allowed all the women to live?' he asked them.",
      "Non-Denominational": "Moses questions their decision to spare all the Midianite women.",
      "Baptist": "Moses confronts them, questioning why they have kept all the women alive.",
      "Catholic": "He asked them, \"Have you allowed all the women to live? \"",
      "Methodist": "Moses questions why they allowed all the women to live.",
      "Lutheran": "Moses asks them, 'Have you saved all the women alive?'"
    },
    "16": {
      "General": "'They were the ones who followed Balaam's advice and caused the Israelites to act treacherously against the Lord in the matter of Peor, so that a plague struck the Lord's congregation.'",
      "Non-Denominational": "Moses identifies these women as the ones who, guided by Balaam, led the Israelites into unfaithfulness against God regarding the incident at Peor, which resulted in a devastating plague among the people.",
      "Baptist": "Moses reminds them that these women, following Balaam's counsel, caused Israel to sin ('commit trespass') against the Lord in the Peor incident, resulting in the plague on the congregation.",
      "Catholic": "'Behold, these caused the Israelites, by the counsel of Balaam, to act treacherously against the Lord in the matter of Peor, and so a plague came among the congregation of the Lord.'",
      "Methodist": "Moses explains these women, following Balaam's advice, caused the Israelites to be unfaithful to the Lord at Peor, resulting in the plague.",
      "Lutheran": "Moses identifies these women as the ones who, through Balaam's counsel, caused Israel to sin against the Lord at Peor, bringing the plague."
    },
    "17": {
      "General": "'Now kill all the boys. And kill every woman who has slept with a man (known man by lying with him).'",
      "Non-Denominational": "Moses issues a new command: execute all male children and all women who are not virgins.",
      "Baptist": "Moses commands the immediate execution of all male children and all non-virgin women.",
      "Catholic": "'Now therefore, kill every male among the little ones, and kill every woman who has known man by lying with him.'",
      "Methodist": "Moses commands the killing of all male children and all women who have had sexual relations.",
      "Lutheran": "Moses commands: Kill every male child and every non-virgin woman."
    },
    "18": {
      "General": "'But save for yourselves every girl who has never slept with a man.'",
      "Non-Denominational": "Specifies that virgin girls are to be spared and kept alive for the soldiers.",
      "Baptist": "Instructs them to keep alive for themselves all the young virgin girls.",
      "Catholic": "'But all the young girls who have not known man by lying with him, keep alive for yourselves.'",
      "Methodist": "Allows the sparing of all virgin girls, to be kept alive for themselves.",
      "Lutheran": "Command to keep alive for themselves all the virgin girls."
    },
    "19": {
      "General": "'Anyone who has killed someone or touched someone slain must stay outside the camp seven days. On the third and seventh days, you and your captives must purify yourselves.'",
      "Non-Denominational": "Commands purification for soldiers and captives: anyone involved in killing or touching the dead must remain outside the camp for seven days and undergo purification rituals on the third and seventh days.",
      "Baptist": "Instructs all soldiers who killed or touched the dead, along with their captives, to remain outside the camp for seven days and purify themselves on the third and seventh days.",
      "Catholic": "'Encamp outside the camp seven days; whoever of you has killed any person, and whoever has touched any slain, purify yourselves and your captives on the third day and on the seventh day.'",
      "Methodist": "Requires anyone who killed or touched a dead body to stay outside the camp for seven days, purifying themselves and their captives on the third and seventh days.",
      "Lutheran": "Commands anyone who killed or touched the slain to abide outside the camp seven days, purifying themselves and captives on the third and seventh days (Law)."
    },
    "20": {
      "General": "'Purify every garment and everything made of leather, goat hair, or wood.'",
      "Non-Denominational": "Extends the purification requirement to all garments and items made of leather, goat hair, or wood that came into contact with the dead.",
      "Baptist": "Commands the purification of all clothing and articles made of leather, goat hair, or wood.",
      "Catholic": "'You shall purify every garment, every article of skin, everything made of goats' hair, and every article of wood.'",
      "Methodist": "Requires purification for all garments and items made of leather, goat hair, or wood.",
      "Lutheran": "Commands purification of all garments and items of skin, goat hair, and wood."
    },
    "21": {
      "General": "Then Eleazar the priest said to the soldiers who had gone into battle, 'This is the requirement of the law that the Lord commanded Moses:'",
      "Non-Denominational": "Eleazar the priest addresses the returning soldiers, stating the specific legal requirement given by God through Moses regarding spoils.",
      "Baptist": "Eleazar the priest instructs the soldiers about the specific ordinance of the law commanded by the Lord through Moses.",
      "Catholic": "Eleazar the priest said to the men of war who had gone to battle: 'This is the statute of the law that the Lord has commanded Moses:'",
      "Methodist": "Eleazar the priest informs the soldiers of the legal requirement commanded by the Lord through Moses.",
      "Lutheran": "Eleazar the priest states the ordinance of the Law commanded by the Lord to Moses for the soldiers."
    },
    "22": {
      "General": "'Gold, silver, bronze, iron, tin, and lead—'",
      "Non-Denominational": "Begins listing the metal items taken as spoils.",
      "Baptist": "Lists the metals subject to purification: gold, silver, brass (bronze), iron, tin, lead.",
      "Catholic": "'Gold, silver, bronze, iron, tin, and lead—'",
      "Methodist": "Lists the metals requiring purification.",
      "Lutheran": "Lists the metals: gold, silver, bronze, iron, tin, lead."
    },
    "23": {
      "General": "'everything that can withstand fire—must be passed through the fire, and then it will be clean. But it must also be purified with the water of purification. And everything that cannot withstand fire must be passed through the water.'",
      "Non-Denominational": "Specifies the purification method for metals: items that can endure fire must pass through fire first, then be cleansed with the water of purification (water mixed with ashes of the red heifer). Items that cannot endure fire are purified by the water alone.",
      "Baptist": "Instructs that fire-resistant items must pass through fire to be cleansed, followed by purification with the water of separation (ritual cleansing water). Fire-sensitive items are cleansed by water only.",
      "Catholic": "'everything that can stand the fire, you shall pass through the fire, and it shall be clean. Nevertheless, it shall also be purified with the water for impurity. And whatever cannot stand the fire, you shall pass through the water.'",
      "Methodist": "Instructs that fire-resistant items must pass through fire and then be purified with the water of cleansing. Items not resistant to fire are purified by water only.",
      "Lutheran": "Commands fire-resistant items to pass through fire and then be purified with the water of separation; non-fire-resistant items pass through water only."
    },
    "24": {
      "General": "'On the seventh day wash your clothes, and you will be clean. Then you may come into the camp.'",
      "Non-Denominational": "Commands the soldiers to wash their clothes on the seventh day as the final step of purification, after which they are considered clean and may re-enter the main camp.",
      "Baptist": "Instructs the soldiers to wash their clothes on the seventh day to become clean, permitting their return to the camp afterward.",
      "Catholic": "'You must wash your clothes on the seventh day, and you shall be clean. Afterward you may come into the camp.'",
      "Methodist": "Requires washing clothes on the seventh day for cleansing, after which they can enter the camp.",
      "Lutheran": "Commands washing clothes on the seventh day for purification, allowing entry into the camp afterward."
    },
    "25": {
      "General": "The Lord said to Moses,",
      "Non-Denominational": "God gives further instructions to Moses regarding the spoils.",
      "Baptist": "The Lord speaks again to Moses.",
      "Catholic": "The Lord said to Moses,",
      "Methodist": "God speaks further instructions to Moses.",
      "Lutheran": "The Lord speaks to Moses."
    },
    "26": {
      "General": "'You and Eleazar the priest and the family heads of the congregation are to take count of the plunder taken, both people and animals.'",
      "Non-Denominational": "God instructs Moses, Eleazar, and the family leaders to formally count all the plunder, including both captives and animals.",
      "Baptist": "The Lord commands Moses, Eleazar, and the chief family heads of the congregation to tally the sum of the plunder, both human captives and animals.",
      "Catholic": "'Take the count of the booty that was taken, both of persons and of animals, you and Eleazar the priest and the heads of the fathers' houses of the congregation;'",
      "Methodist": "God instructs Moses, Eleazar, and the family heads to count the plunder, including people and animals.",
      "Lutheran": "The Lord commands Moses, Eleazar, and the chief fathers of the congregation to count the plunder (captives and animals)."
    },
    "27": {
      "General": "'Divide the plunder into two equal parts: one for the soldiers who took part in the battle and the other for the rest of the congregation.'",
      "Non-Denominational": "Instructs the plunder to be divided equally: half for the soldiers who fought, and half for the rest of the Israelite community.",
      "Baptist": "Commands the division of the plunder into two equal halves: one share for the soldiers who fought, and the other share for the entire congregation.",
      "Catholic": "'and divide the booty into two halves, between the warriors who went out to battle and all the congregation.'",
      "Methodist": "Instructs the division of the plunder equally between the soldiers who fought and the rest of the community.",
      "Lutheran": "Commands dividing the plunder equally between the soldiers and the rest of the congregation."
    },
    "28": {
      "General": "'From the soldiers who went out to war, levy a tribute for the Lord: one out of every five hundred people, cattle, donkeys, and sheep.'",
      "Non-Denominational": "A tribute for the Lord is required from the soldiers' half: one person/animal out of every 500 (captives, cattle, donkeys, sheep).",
      "Baptist": "Commands a levy (tribute) for the Lord from the soldiers' share: one soul/animal per 500 (captives, cattle, donkeys, sheep).",
      "Catholic": "'And levy for the Lord a tribute from the men of war who went out to battle, one soul out of five hundred, of the persons and of the oxen and of the donkeys and of the sheep.'",
      "Methodist": "Requires a tribute for the Lord from the soldiers' share: one out of every 500 captives, cattle, donkeys, and sheep.",
      "Lutheran": "Commands levying a tribute for the Lord from the soldiers' half: one per 500 (persons, oxen, donkeys, sheep)."
    },
    "29": {
      "General": "'Take this tribute from their half and give it to Eleazar the priest as the Lord's offering (heave offering).'",
      "Non-Denominational": "This tribute taken from the soldiers' half is to be given to Eleazar the priest as a contribution (heave offering) designated for the Lord.",
      "Baptist": "This tribute from the soldiers' share is to be given to Eleazar the priest as the Lord's heave offering (sacred contribution).",
      "Catholic": "'From their half you shall take it and give it to Eleazar the priest as a contribution to the Lord.'",
      "Methodist": "This tribute from the soldiers' half is given to Eleazar the priest as the Lord's contribution.",
      "Lutheran": "Command to take this tribute from their half and give it to Eleazar as the Lord's heave offering."
    },
    "30": {
      "General": "'From the Israelites' half, take one out of every fifty people, cattle, donkeys, and sheep—all the animals—and give them to the Levites who are responsible for the care of the Lord's tabernacle.'",
      "Non-Denominational": "From the congregation's half, a portion of one in fifty (captives, cattle, donkeys, sheep, all livestock) is to be taken and given to the Levites who maintain the Tabernacle.",
      "Baptist": "From the congregation's half, one portion out of every fifty (captives, cattle, donkeys, sheep, all beasts) is to be given to the Levites responsible for the Tabernacle's service.",
      "Catholic": "'And from the congregation's half you shall take one drawn out of every fifty, of the persons, of the oxen, of the donkeys, and of the sheep, of all the animals, and you shall give them to the Levites who have charge of the tabernacle of the Lord.'",
      "Methodist": "From the community's half, one out of every fifty captives, cattle, donkeys, sheep (all animals) is given to the Levites responsible for the Tabernacle.",
      "Lutheran": "From the congregation's half, take one portion per fifty (persons, oxen, donkeys, flocks, all beasts) and give them to the Levites who care for the Tabernacle."
    },
    "31": {
      "General": "Moses and Eleazar the priest did as the Lord commanded Moses.",
      "Non-Denominational": "Moses and Eleazar faithfully carry out God's instructions regarding the division and distribution of the plunder and tribute.",
      "Baptist": "Moses and Eleazar obey and perform exactly what the Lord commanded Moses.",
      "Catholic": "Moses and Eleazar the priest did as the Lord commanded Moses.",
      "Methodist": "Moses and Eleazar follow the Lord's commands precisely.",
      "Lutheran": "Moses and Eleazar obey the Lord's commands to Moses."
    },
    "32": {
      "General": "The plunder remaining from the spoils that the soldiers took was 675,000 sheep,",
      "Non-Denominational": "Lists the total count of sheep taken as plunder by the soldiers: 675,000.",
      "Baptist": "Records the amount of plunder (booty) remaining after the soldiers took their share: 675,000 sheep.",
      "Catholic": "The booty remaining from the spoil that the men of war took was 675,000 sheep,",
      "Methodist": "States the amount of plunder remaining from the soldiers' spoils: 675,000 sheep.",
      "Lutheran": "Records the plunder remaining from the soldiers' spoils: 675,000 sheep."
    },
    "33": {
      "General": "72,000 cattle,",
      "Non-Denominational": "Total cattle: 72,000.",
      "Baptist": "Total cattle: 72,000.",
      "Catholic": "72,000 cattle,",
      "Methodist": "Total cattle: 72,000.",
      "Lutheran": "Total cattle (beeves): 72,000."
    },
    "34": {
      "General": "61,000 donkeys,",
      "Non-Denominational": "Total donkeys: 61,000.",
      "Baptist": "Total donkeys: 61,000.",
      "Catholic": "61,000 donkeys,",
      "Methodist": "Total donkeys: 61,000.",
      "Lutheran": "Total donkeys (asses): 61,000."
    },
    "35": {
      "General": "and 32,000 women (persons in all, of women) who had never slept with a man.",
      "Non-Denominational": "Total virgin women captives: 32,000.",
      "Baptist": "Total human captives (virgin women): 32,000.",
      "Catholic": "and 32,000 persons in all, women who had not known man by lying with him.",
      "Methodist": "Total virgin women captives: 32,000.",
      "Lutheran": "Total persons (virgin women): 32,000."
    },
    "36": {
      "General": "The half share for those who fought in the war was: 337,500 sheep,",
      "Non-Denominational": "Details the soldiers' half share: 337,500 sheep.",
      "Baptist": "Specifies the half portion belonging to the soldiers: 337,500 sheep.",
      "Catholic": "The half, the portion of those who had gone out to war, was in number 337,500 sheep;",
      "Methodist": "Details the soldiers' half share: 337,500 sheep.",
      "Lutheran": "Specifies the soldiers' half share: 337,500 sheep."
    },
    "37": {
      "General": "and the tribute for the Lord from the sheep was 675.",
      "Non-Denominational": "The Lord's tribute from the soldiers' sheep (1 in 500) was 675.",
      "Baptist": "The Lord's tribute from the soldiers' sheep was 675.",
      "Catholic": "and the Lord's tribute of sheep was 675.",
      "Methodist": "The Lord's tribute from these sheep was 675.",
      "Lutheran": "The Lord's tribute from the sheep: 675."
    },
    "38": {
      "General": "The cattle numbered 36,000, from which the Lord's tribute was 72.",
      "Non-Denominational": "Soldiers' cattle: 36,000; Lord's tribute: 72.",
      "Baptist": "Soldiers' cattle: 36,000; Lord's tribute: 72.",
      "Catholic": "The cattle were 36,000, of which the Lord's tribute was 72.",
      "Methodist": "Soldiers' cattle: 36,000; Lord's tribute: 72.",
      "Lutheran": "Soldiers' cattle: 36,000; Lord's tribute: 72."
    },
    "39": {
      "General": "The donkeys numbered 30,500, from which the Lord's tribute was 61.",
      "Non-Denominational": "Soldiers' donkeys: 30,500; Lord's tribute: 61.",
      "Baptist": "Soldiers' donkeys: 30,500; Lord's tribute: 61.",
      "Catholic": "The donkeys were 30,500, of which the Lord's tribute was 61.",
      "Methodist": "Soldiers' donkeys: 30,500; Lord's tribute: 61.",
      "Lutheran": "Soldiers' donkeys: 30,500; Lord's tribute: 61."
    },
    "40": {
      "General": "The people numbered 16,000, from whom the Lord's tribute was 32 people.",
      "Non-Denominational": "Soldiers' captive virgins: 16,000; Lord's tribute: 32 persons.",
      "Baptist": "Soldiers' share of captives (persons): 16,000; Lord's tribute: 32 persons.",
      "Catholic": "The persons were 16,000, of which the Lord's tribute was 32 persons.",
      "Methodist": "Soldiers' captive virgins: 16,000; Lord's tribute: 32 persons.",
      "Lutheran": "Soldiers' share of persons: 16,000; Lord's tribute: 32 persons."
    },
    "41": {
      "General": "Moses gave the tribute, the Lord's offering (heave offering), to Eleazar the priest, as the Lord commanded Moses.",
      "Non-Denominational": "Moses delivers the entire tribute designated as the Lord's offering (taken from the soldiers' share) to Eleazar the priest, following God's command.",
      "Baptist": "Moses gives the tribute, which was the Lord's heave offering, to Eleazar the priest, fulfilling the Lord's command to him.",
      "Catholic": "Moses gave the tribute, which was the contribution for the Lord, to Eleazar the priest, as the Lord commanded Moses.",
      "Methodist": "Moses gives the tribute, the Lord's contribution, to Eleazar the priest as commanded.",
      "Lutheran": "Moses gives the tribute (the Lord's heave offering) to Eleazar the priest, as commanded."
    },
    "42": {
      "General": "From the Israelites' half, which Moses separated from the men who fought—",
      "Non-Denominational": "Focus shifts to the congregation's half of the plunder, separated by Moses from the soldiers' share.",
      "Baptist": "Describes the congregation's half, which Moses divided off from the soldiers' portion.",
      "Catholic": "From the half belonging to the congregation, which Moses separated from the men who had gone to war—",
      "Methodist": "Addresses the community's half, separated by Moses from the soldiers' share.",
      "Lutheran": "Describes the congregation's half, divided by Moses from the soldiers' share."
    },
    "43": {
      "General": "the congregation's half was 337,500 sheep,",
      "Non-Denominational": "The congregation's half share: 337,500 sheep.",
      "Baptist": "The congregation's half share: 337,500 sheep.",
      "Catholic": "now the congregation's half was 337,500 sheep,",
      "Methodist": "Congregation's half: 337,500 sheep.",
      "Lutheran": "Congregation's half: 337,500 sheep."
    },
    "44": {
      "General": "36,000 cattle,",
      "Non-Denominational": "Congregation's cattle: 36,000.",
      "Baptist": "Congregation's cattle: 36,000.",
      "Catholic": "36,000 cattle,",
      "Methodist": "Congregation's cattle: 36,000.",
      "Lutheran": "Congregation's cattle: 36,000."
    },
    "45": {
      "General": "30,500 donkeys,",
      "Non-Denominational": "Congregation's donkeys: 30,500.",
      "Baptist": "Congregation's donkeys: 30,500.",
      "Catholic": "30,500 donkeys,",
      "Methodist": "Congregation's donkeys: 30,500.",
      "Lutheran": "Congregation's donkeys: 30,500."
    },
    "46": {
      "General": "and 16,000 people—",
      "Non-Denominational": "Congregation's captive virgins: 16,000.",
      "Baptist": "Congregation's share of captives (persons): 16,000.",
      "Catholic": "and 16,000 persons—",
      "Methodist": "Congregation's captive virgins: 16,000.",
      "Lutheran": "Congregation's share of persons: 16,000."
    },
    "47": {
      "General": "from the Israelites' half, Moses took one out of every fifty people and animals and gave them to the Levites who were responsible for the care of the Lord's tabernacle, as the Lord commanded Moses.",
      "Non-Denominational": "From this congregation's half, Moses takes the specified portion (one in fifty of captives and animals) and gives it to the Levites responsible for Tabernacle service, fulfilling God's command.",
      "Baptist": "From the congregation's half, Moses takes one portion per fifty (of both people and animals) and gives them to the Levites who maintained the Lord's Tabernacle, as commanded by the Lord.",
      "Catholic": "from the congregation's half Moses took one of every fifty, both of persons and of animals, and gave them to the Levites who had charge of the tabernacle of the Lord; as the Lord commanded Moses.",
      "Methodist": "From the community's half, Moses takes one in fifty (people and animals) and gives them to the Levites responsible for the Tabernacle, as commanded.",
      "Lutheran": "From the congregation's half, Moses takes one per fifty (persons and beasts) and gives them to the Levites caring for the Tabernacle, as commanded."
    },
    "48": {
      "General": "Then the officers who were over the units of the army—the commanders of thousands and commanders of hundreds—came to Moses.",
      "Non-Denominational": "The military officers (commanders of thousands and hundreds) approach Moses.",
      "Baptist": "The army officers (commanders of thousands and hundreds) come near to Moses.",
      "Catholic": "Then the officers who were over the thousands of the army, the commanders of thousands and the commanders of hundreds, came near to Moses",
      "Methodist": "The army officers approach Moses.",
      "Lutheran": "The officers over the army units (commanders of thousands/hundreds) come near to Moses."
    },
    "49": {
      "General": "They said to Moses, 'Your servants have counted the soldiers under our command, and not one man of us is missing.'",
      "Non-Denominational": "They report the remarkable outcome of the battle: after taking a census of their troops, not a single Israelite soldier was lost.",
      "Baptist": "They report to Moses that upon taking a count ('sum') of the soldiers under their command, not one Israelite soldier is missing.",
      "Catholic": "and said to Moses, 'Your servants have counted the men of war who are under our command, and there is not a man missing from us.'",
      "Methodist": "They report that after counting their soldiers, none are missing.",
      "Lutheran": "They report to Moses: 'Your servants counted the soldiers under our charge, and not one is missing.'"
    },
    "50": {
      "General": "'So we have brought an offering to the Lord, what each man found of articles of gold: armlets, bracelets, signet rings, earrings, and necklaces, to make atonement for our souls before the Lord.'",
      "Non-Denominational": "In response, they present a voluntary offering to God from the gold items they personally acquired (various jewelry pieces), explicitly stating it is for atonement for themselves before the Lord.",
      "Baptist": "Therefore, they bring an offering ('oblation') to the Lord consisting of the gold articles each soldier acquired (various ornaments) to make atonement for their souls before Him.",
      "Catholic": "'And we have brought the Lord's offering, what each man found, articles of gold, armlets and bracelets, signet rings, earrings, and beads, to make atonement for ourselves before the Lord.'",
      "Methodist": "Consequently, they bring an offering to the Lord of the gold articles each found (various jewelry) to make atonement for themselves.",
      "Lutheran": "Therefore, they bring an offering (oblation) to the Lord of the gold items found (armlets, bracelets, rings, earrings, tablets) to make atonement for their souls before the Lord."
    },
    "51": {
      "General": "Moses and Eleazar the priest accepted the gold from them, all the handcrafted articles.",
      "Non-Denominational": "Moses and Eleazar accept this gold offering, comprising various crafted items, from the commanders.",
      "Baptist": "Moses and Eleazar receive the gold offering, consisting of various crafted ('wrought') jewels, from them.",
      "Catholic": "Moses and Eleazar the priest received the gold from them, all crafted articles.",
      "Methodist": "Moses and Eleazar accept the gold offering of crafted articles from them.",
      "Lutheran": "Moses and Eleazar accept the gold from them, all crafted items (jewels)."
    },
    "52": {
      "General": "All the gold of the offering (heave offering) that they presented to the Lord, from the commanders of thousands and commanders of hundreds, was 16,750 shekels.",
      "Non-Denominational": "The total weight of this gold offering (presented as a heave offering) from the commanders amounts to 16,750 shekels.",
      "Baptist": "The total weight of the gold heave offering presented to the Lord by the commanders was 16,750 shekels.",
      "Catholic": "And all the gold of the contribution that they presented to the Lord, from the commanders of thousands and the commanders of hundreds, was 16,750 shekels.",
      "Methodist": "The total gold offering presented by the commanders weighed 16,750 shekels.",
      "Lutheran": "The total gold of the heave offering presented to the Lord by the commanders was 16,750 shekels."
    },
    "53": {
      "General": "(Each soldier had taken plunder for himself.)",
      "Non-Denominational": "Parenthetical note clarifying that the regular soldiers had already taken their own personal plunder, distinct from this commanders' offering.",
      "Baptist": "(A parenthetical note stating that the common soldiers had each taken their own individual plunder.)",
      "Catholic": "(for the men of war had taken plunder, every man for himself).",
      "Methodist": "(Adds the note that each regular soldier had taken personal plunder.)",
      "Lutheran": "(Parenthetical note: the common soldiers had taken plunder for themselves.)"
    },
    "54": {
      "General": "Moses and Eleazar the priest received the gold from the commanders of thousands and commanders of hundreds and brought it into the Tent of Meeting as a memorial for the Israelites before the Lord.",
      "Non-Denominational": "Moses and Eleazar take the commanders' gold offering into the Tent of Meeting to serve as a reminder (memorial) for the Israelites before God, likely signifying God's protection and the atonement sought.",
      "Baptist": "Moses and Eleazar receive the gold from the commanders and bring it into the Tabernacle of the Congregation as a memorial (reminder) for the Israelites before the Lord.",
      "Catholic": "And Moses and Eleazar the priest received the gold from the commanders of thousands and of hundreds, and brought it into the tent of meeting as a memorial for the people of Israel before the Lord.",
      "Methodist": "Moses and Eleazar take the gold from the commanders into the Tent of Meeting as a memorial for the Israelites before the Lord.",
      "Lutheran": "Moses and Eleazar receive the gold from the commanders and bring it into the Tent of Meeting as a memorial for Israel before the Lord."
    }
  }
}
