{
  "Summary": {
    "General": "The tribes of Reuben and Gad, possessing vast livestock, observe that the lands of Jazer and Gilead east of the Jordan are ideal for grazing. They approach Moses, Eleazar, and the leaders, requesting this land as their inheritance instead of crossing the Jordan. Moses initially reacts angrily, accusing them of discouraging the other tribes, comparing their request to the spies' actions that led to the previous generation dying in the wilderness. He fears their reluctance will cause God to abandon the entire nation in the wilderness again. The Reubenites and Gadites clarify their proposal: they will build sheepfolds and towns for their families and livestock east of the Jordan, but then arm themselves and cross the Jordan, leading the other tribes into battle until Canaan is subdued and every tribe receives its inheritance. They promise not to return to their eastern lands until the conquest is complete. Moses accepts their proposal on the condition they fulfill their promise: cross armed with the other tribes before the Lord, fight until the land is subdued, and only then return. If they fulfill this vow, they will be guiltless before God and Israel, and the land of Gilead will be theirs. However, if they fail, they will have sinned against the Lord and will face the consequences. The Gadites and Reubenites reaffirm their commitment. Moses then formally assigns the land east of the Jordan (the former kingdoms of Sihon and Og) to the tribes of Gad, Reuben, and half the tribe of Manasseh (who apparently joined the request or were included due to kinship/proximity). The text lists the cities they built or rebuilt in their assigned territories: Gad built Dibon, Ataroth, Aroer, Atroth-shophan, Jazer, Jogbehah, Beth-nimrah, Beth-haran; Reuben built Heshbon, Elealeh, Kiriathaim, Nebo, Baal-meon (names changed), and Sibmah. The descendants of Machir (Manasseh) conquered Gilead, dispossessing the Amorites, and received it from Moses. Jair (Manasseh) captured villages, naming them Havvoth-jair. Nobah (Manasseh) captured Kenath and its villages, renaming it Nobah.",
    "Non-Denominational": "Focuses on the practical request of the Reubenites and Gadites based on their needs (livestock) and the land's suitability. Moses' initial concern highlights the importance of unity and faithfulness in fulfilling God's plan for Canaan. The resolution demonstrates negotiation, compromise, and the importance of keeping vows made before God and the community. The tribes' commitment to fight alongside their brothers ensures collective responsibility is maintained despite settling separately. The inclusion of half the tribe of Manasseh shows flexibility and God's provision. It stresses fulfilling commitments and balancing practical needs with communal obligations.",
    "Baptist": "Emphasizes the potential danger of self-interest (Reuben and Gad seeking prime land) undermining God's collective purpose for Israel (conquering Canaan). Moses' rebuke underscores the seriousness of discouraging God's people, recalling the sin of the spies. The agreement hinges on the tribes' solemn vow to prioritize the conquest before settling, demonstrating conditional blessing based on obedience and faithfulness. Their commitment to lead the fight ('armed before the Lord') shows acceptance of responsibility. God honors their request but holds them accountable to their word. The passage highlights keeping vows, communal responsibility, and the consequences of potential disobedience.",
    "Catholic": "Views the request of the Transjordan tribes through the lens of balancing legitimate needs (pastureland) with covenant obligations (conquest of Canaan). Moses' initial rebuke reflects pastoral concern for unity and avoiding past failures. The negotiated agreement, sealed by a vow, demonstrates the importance of fulfilling commitments made to God and the community. The conditionality highlights that possessing the land is tied to faithfulness. The participation of half of Manasseh illustrates the organic growth and division of the tribes. The account stresses prudence, fidelity to vows, and the unity of God's people in fulfilling His plan.",
    "Methodist": "Highlights the tension between personal needs/desires (Reuben/Gad wanting grazing land) and the communal calling (entering Canaan together). Moses' concern addresses the potential for division and discouragement. The resolution emphasizes responsible commitment: the tribes receive their desired land conditional upon fulfilling their duty to fight alongside their brethren. This balances God's provision for specific needs with the importance of unity and shared responsibility in God's mission. Keeping their vow is essential for maintaining integrity before God and the community. It underscores accountability, faithfulness, and the importance of fulfilling promises.",
    "Lutheran": "Focuses on the interaction between human desire (Reuben/Gad seeking land) and God's command/plan (conquering Canaan). Moses' initial reaction reflects concern over repeating the sin of unbelief (spies). The agreement demonstrates Law and conditional promise: the tribes get the land (blessing) *if* they fulfill their military duty (Law). Failure to keep the vow constitutes sin against the Lord with certain consequences (Law). The tribes' agreement to go armed 'before the Lord' acknowledges His sovereignty over the campaign. The settlement details reflect the carrying out of the agreement under God's allowance."
  },
  "Verses": {
    "1": {
      "General": "The Reubenites and Gadites had a very large number of livestock. They saw that the lands of Jazer and Gilead were suitable places for livestock.",
      "Non-Denominational": "The tribes of Reuben and Gad, being wealthy in livestock, identified the regions of Jazer and Gilead (east of Jordan) as ideal grazing land.",
      "Baptist": "The descendants of Reuben and Gad possessed vast herds of cattle and observed that the territories of Jazer and Gilead were well-suited for livestock.",
      "Catholic": "The Reubenites and Gadites had a very large number of cattle. They saw that the land of Jazer and Gilead was suitable for cattle.",
      "Methodist": "The tribes of Reuben and Gad, having extensive livestock, noticed the suitability of the lands of Jazer and Gilead for grazing.",
      "Lutheran": "The Reubenites and Gadites, having very many cattle, saw the land of Jazer and Gilead as suitable for livestock."
    },
    "2": {
      "General": "So the Gadites and Reubenites came to Moses, Eleazar the priest, and the leaders (princes) of the congregation.",
      "Non-Denominational": "Representatives of Gad and Reuben approach the Israelite leadership (Moses, Eleazar the priest, community leaders) with a request.",
      "Baptist": "The Gadites and Reubenites approach Moses, Eleazar the priest, and the leaders ('princes') of the assembly.",
      "Catholic": "So the Gadites and Reubenites came and spoke to Moses, Eleazar the priest, and the leaders of the congregation.",
      "Methodist": "The people of Gad and Reuben approach Moses, Eleazar the priest, and the community leaders.",
      "Lutheran": "The Gadites and Reubenites come to Moses, Eleazar the priest, and the princes of the congregation."
    },
    "3": {
      "General": "They said, 'Ataroth, Dibon, Jazer, Nimrah, Heshbon, Elealeh, Sebam (Sibmah), Nebo, and Beon—'",
      "Non-Denominational": "They begin listing specific locations within the desired territory east of the Jordan.",
      "Baptist": "They refer to specific cities and regions: Ataroth, Dibon, Jazer, Nimrah, Heshbon, Elealeh, Shebam, Nebo, and Beon.",
      "Catholic": "They said, 'Ataroth, Dibon, Jazer, Nimrah, Heshbon, Elealeh, Sebam, Nebo, and Beon—'",
      "Methodist": "They name specific places in the region: Ataroth, Dibon, Jazer, Nimrah, Heshbon, Elealeh, Sebam, Nebo, and Beon.",
      "Lutheran": "They list the lands: Ataroth, Dibon, Jazer, Nimrah, Heshbon, Elealeh, Shebam, Nebo, Beon."
    },
    "4": {
      "General": "'the land the Lord subdued (smote) before the congregation of Israel, is a land for livestock, and your servants have livestock.'",
      "Non-Denominational": "They identify this region as the land God recently conquered for Israel (referring to the defeat of Sihon and Og), noting its suitability for the livestock they possess.",
      "Baptist": "They state that this land, which the Lord conquered before the Israelite assembly, is suitable for cattle, and they possess cattle.",
      "Catholic": "'the land that the Lord subdued before the congregation of Israel, is a land for cattle; and your servants have cattle.'",
      "Methodist": "They describe this territory, conquered by the Lord for Israel, as suitable for livestock, which they possess.",
      "Lutheran": "They identify this land, which the Lord conquered (smote) before Israel, as cattle land, and state they have cattle."
    },
    "5": {
      "General": "They continued, 'If we have found favor in your eyes, let this land be given to your servants as a possession. Do not make us cross the Jordan.'",
      "Non-Denominational": "They formally request: If Moses approves ('found favor'), grant them this eastern land as their inheritance and do not require them to cross the Jordan River for their portion.",
      "Baptist": "They plead: If they have found grace in Moses' sight, grant them this land as their possession instead of making them cross the Jordan.",
      "Catholic": "They said, 'If we have found favor in your sight, let this land be given to your servants for a possession; do not make us cross the Jordan.'",
      "Methodist": "They request: If they find favor, let this land be given to them as their possession, and do not require them to cross the Jordan.",
      "Lutheran": "They request: If we find grace in your sight, give this land to your servants for a possession; don't make us cross the Jordan."
    },
    "6": {
      "General": "Moses said to the Gadites and Reubenites, 'Shall your brothers go to war while you sit here?'",
      "Non-Denominational": "Moses initially reacts with sharp disapproval, questioning if they intend to stay behind while their fellow Israelites go fight for their inheritance across the Jordan.",
      "Baptist": "Moses rebukes the Gadites and Reubenites, questioning their intention to remain settled while their brethren engage in warfare.",
      "Catholic": "But Moses said to the Gadites and Reubenites, 'Shall your brethren go to the war while you sit here?'",
      "Methodist": "Moses questions their intent, asking if their brothers should go to war while they remain behind.",
      "Lutheran": "Moses asks Gad and Reuben: Should your brethren go to war while you sit here?"
    },
    "7": {
      "General": "'Why do you discourage the heart of the Israelites from crossing over into the land the Lord has given them?'",
      "Non-Denominational": "He accuses them of demoralizing the other tribes, hindering their willingness to enter the Promised Land.",
      "Baptist": "He challenges their motive, asking why they would discourage the Israelites ('discourage the heart') from entering the land God has given them.",
      "Catholic": "'Why will you discourage the heart of the people of Israel from going over into the land that the Lord has given them?'",
      "Methodist": "He accuses them of discouraging the Israelites from entering the land God has given them.",
      "Lutheran": "Moses asks why they discourage the heart of the Israelites from entering the promised land."
    },
    "8": {
      "General": "'This is what your fathers did when I sent them from Kadesh-barnea to see the land.'",
      "Non-Denominational": "Moses draws a parallel between their request and the actions of the previous generation's spies sent from Kadesh-barnea.",
      "Baptist": "He compares their actions to those of their fathers (the spies) sent from Kadesh-barnea to survey the land.",
      "Catholic": "'Thus did your fathers, when I sent them from Kadesh-barnea to see the land.'",
      "Methodist": "He compares their actions to the previous generation sent from Kadesh-barnea to view the land.",
      "Lutheran": "He compares their actions to their fathers' (the spies') actions when sent from Kadesh-barnea."
    },
    "9": {
      "General": "'After they went up to the Valley of Eshcol and saw the land, they discouraged the heart of the Israelites so that they would not go into the land the Lord had given them.'",
      "Non-Denominational": "He recalls how the spies, after seeing the land (specifically mentioning the Valley of Eshcol), gave a bad report that demoralized the people and caused them to refuse entry into the land.",
      "Baptist": "He recounts how the spies, after exploring up to the Valley of Eshcol, discouraged the Israelites, causing them to refuse to enter the promised land.",
      "Catholic": "'For when they went up to the Valley of Eshcol and saw the land, they discouraged the heart of the people of Israel from going into the land that the Lord had given them.'",
      "Methodist": "He recalls that after seeing the land from the Valley of Eshcol, they discouraged the Israelites from entering it.",
      "Lutheran": "He recounts how they went to Eshcol, saw the land, and discouraged Israel from entering."
    },
    "10": {
      "General": "'The Lord's anger burned that day, and he swore an oath:'",
      "Non-Denominational": "Moses reminds them of the consequence: God's intense anger was kindled, leading Him to make a solemn vow.",
      "Baptist": "He emphasizes the result: the Lord's anger flared ('was kindled') that day, and He swore an oath.",
      "Catholic": "'And the Lord's anger was kindled on that day, and he swore,'",
      "Methodist": "He reminds them of God's anger and the resulting oath He swore.",
      "Lutheran": "He recalls the Lord's anger being kindled that day, leading to His oath (Law)."
    },
    "11": {
      "General": "'Surely none of the men who came up out of Egypt, from twenty years old and upward, shall see the land that I swore to give to Abraham, Isaac, and Jacob, because they have not wholly followed me—'",
      "Non-Denominational": "God's oath was that none of the adult men (20 years and older) who left Egypt would enter the Promised Land (sworn to the patriarchs) because they failed to follow Him wholeheartedly.",
      "Baptist": "The oath stated that none of the men aged twenty or older who came from Egypt would see the land promised to Abraham, Isaac, and Jacob, due to their incomplete obedience ('not wholly followed me').",
      "Catholic": "'Surely none of the men who came up out of Egypt, from twenty years old and upward, shall see the land that I swore to give to Abraham, to Isaac, and to Jacob, because they have not wholly followed me—'",
      "Methodist": "God swore that none of the men twenty years or older who came from Egypt would see the promised land because they did not follow Him completely.",
      "Lutheran": "The oath: None of the men 20+ years old from Egypt would see the land sworn to the patriarchs, because they did not wholly follow God."
    },
    "12": {
      "General": "'none except Caleb son of Jephunneh the Kenizzite and Joshua son of Nun, for they have wholly followed the Lord.'",
      "Non-Denominational": "The only exceptions to God's oath were Caleb (the Kenizzite) and Joshua, because they did follow the Lord wholeheartedly.",
      "Baptist": "The exceptions were Caleb son of Jephunneh the Kenezite and Joshua son of Nun, explicitly noted for their complete faithfulness to the Lord.",
      "Catholic": "'none except Caleb the son of Jephunneh the Kenizzite and Joshua the son of Nun, for they have wholly followed the Lord.'",
      "Methodist": "The exceptions were Caleb and Joshua, who followed the Lord completely.",
      "Lutheran": "Exceptions: Caleb the Kenizzite and Joshua, because they wholly followed the Lord."
    },
    "13": {
      "General": "'The Lord's anger burned against Israel, and he made them wander in the wilderness forty years, until the whole generation that had done evil in the Lord's sight was consumed.'",
      "Non-Denominational": "As a result of God's anger, Israel wandered for forty years until that entire generation who displeased God died off in the wilderness.",
      "Baptist": "The Lord's anger burned against Israel, causing them to wander forty years until the entire generation that committed evil in His sight perished.",
      "Catholic": "'And the Lord's anger was kindled against Israel, and he made them wander in the wilderness forty years, until all the generation that had done evil in the sight of the Lord was consumed.'",
      "Methodist": "God's anger led to forty years of wandering until the generation that did evil perished.",
      "Lutheran": "The Lord's anger burned, making Israel wander 40 years until the evil generation was consumed (Judgment/Law)."
    },
    "14": {
      "General": "'And behold, you have risen in your fathers' place, a brood of sinful men, to increase still more the fierce anger of the Lord against Israel!'",
      "Non-Denominational": "Moses accuses the current generation (Reubenites/Gadites) of repeating their fathers' sin ('brood of sinful men'), potentially provoking God's fierce anger against Israel even further.",
      "Baptist": "Moses accuses them ('ye are risen up in your fathers' stead') of being an offspring ('increase') of sinful men, poised to intensify ('augment') the Lord's fierce anger against Israel.",
      "Catholic": "'And behold, you have risen in your fathers' place, a brood of sinful men, to increase still more the fierce anger of the Lord against Israel!'",
      "Methodist": "Moses accuses them of following their fathers' sinful example, increasing God's anger against Israel.",
      "Lutheran": "Moses accuses them of rising up like their fathers, a brood of sinners, to further increase God's fierce anger against Israel."
    },
    "15": {
      "General": "'For if you turn away from following him, he will again leave them in the wilderness, and you will destroy all this people.'",
      "Non-Denominational": "He warns that if they turn away from following God (by refusing to cross the Jordan), God will again abandon the entire nation in the wilderness, and they (Reuben/Gad) will be responsible for the destruction of all the people.",
      "Baptist": "He warns: If they turn away from following God, He will abandon Israel again in the wilderness, and they (Reuben/Gad) will be the cause of the people's destruction.",
      "Catholic": "'For if you turn away from following him, he will again abandon them in the wilderness, and you will destroy all this people.'",
      "Methodist": "He warns that turning away from God will lead to Him abandoning the people in the wilderness again, causing their destruction.",
      "Lutheran": "He warns: If you turn from following Him, He will again leave them in the wilderness, and you will destroy all these people (Consequence/Law)."
    },
    "16": {
      "General": "Then they came near him and said, 'We will build sheepfolds here for our livestock and towns for our little ones.'",
      "Non-Denominational": "The Reubenites and Gadites approach Moses again to clarify their proposal: they intend to build enclosures for their sheep and towns for their families in the eastern land.",
      "Baptist": "They approach Moses to propose: They will build sheepfolds for their livestock and cities for their families ('little ones') there.",
      "Catholic": "Then they came near to him and said, 'We will build sheepfolds here for our livestock, and cities for our little ones,'",
      "Methodist": "They approach Moses to clarify: They will build sheepfolds and towns for their families and livestock.",
      "Lutheran": "They approach Moses and propose: We will build sheepfolds here for our cattle and cities for our little ones."
    },
    "17": {
      "General": "'But we ourselves will arm ourselves readily (go ready armed) and go before the Israelites until we have brought them to their place. Meanwhile, our little ones will live in the fortified towns because of the inhabitants of the land.'",
      "Non-Denominational": "They promise to arm themselves quickly and act as the vanguard ('go before') for the other Israelites, leading them into Canaan until they are settled. Their families will remain safely in fortified towns east of the Jordan.",
      "Baptist": "They pledge to arm themselves speedily ('ready armed') and go before the Israelites until they reach their destination (Canaan). Their families will dwell safely in fortified cities due to the existing inhabitants.",
      "Catholic": "'but we will take up arms, ready to go before the people of Israel, until we have brought them to their place. And our little ones shall live in the fortified cities because of the inhabitants of the land.'",
      "Methodist": "They promise to arm themselves and go ahead of the other Israelites until they are settled, while their families remain in fortified towns for safety.",
      "Lutheran": "They pledge to arm themselves readily and go before Israel until they bring them to their place; their families will stay in fortified cities."
    },
    "18": {
      "General": "'We will not return to our homes until every Israelite has received his inheritance.'",
      "Non-Denominational": "They vow not to return to their eastern settlements until the entire conquest is complete and every Israelite tribe possesses its allotted inheritance in Canaan.",
      "Baptist": "They promise not to return home until every Israelite has inherited their portion.",
      "Catholic": "'We will not return to our homes until every one of the people of Israel has gained his inheritance.'",
      "Methodist": "They vow not to return home until every Israelite has received their inheritance.",
      "Lutheran": "They promise not to return home until every Israelite has their inheritance."
    },
    "19": {
      "General": "'For we will not inherit with them on the other side of the Jordan and beyond, because our inheritance has fallen to us on this side of the Jordan to the east.'",
      "Non-Denominational": "They state their acceptance of not receiving any inheritance west of the Jordan, because their portion will be located on the eastern side.",
      "Baptist": "They declare they will not seek inheritance west of the Jordan, as their inheritance lies east of the Jordan.",
      "Catholic": "'For we will not inherit with them on the other side of the Jordan and beyond, because our inheritance has come to us on this side of the Jordan to the east.'",
      "Methodist": "They state they won't seek inheritance west of the Jordan since their portion is on the eastern side.",
      "Lutheran": "They declare they won't inherit west of the Jordan, because their inheritance is on the eastern side."
    },
    "20": {
      "General": "So Moses said to them, 'If you will do this thing, if you will arm yourselves before the Lord for the war,'",
      "Non-Denominational": "Moses accepts their proposal, stating the condition: If they fulfill their promise by arming themselves 'before the Lord' (acknowledging His presence and authority) for the war...",
      "Baptist": "Moses responds conditionally: If they fulfill this commitment, arming themselves for war before the Lord...",
      "Catholic": "So Moses said to them, 'If you will do this, if you will take up arms to go before the Lord for the war,'",
      "Methodist": "Moses agrees conditionally: If they fulfill their promise and arm themselves before the Lord for war...",
      "Lutheran": "Moses agrees conditionally: If you do this, arming yourselves before the Lord for war..."
    },
    "21": {
      "General": "'and all your armed men cross the Jordan before the Lord until he has driven out his enemies from before him,'",
      "Non-Denominational": "...and if all their armed men cross the Jordan 'before the Lord' and fight until God drives out His enemies...",
      "Baptist": "...and all their armed men cross the Jordan before the Lord until He has expelled His enemies...",
      "Catholic": "'and every armed man of you will pass over the Jordan before the Lord, until he has driven out his enemies from before him,'",
      "Methodist": "...and all their armed men cross the Jordan before the Lord until He drives out His enemies...",
      "Lutheran": "...and all your armed men cross the Jordan before the Lord until He drives out His enemies..."
    },
    "22": {
      "General": "'and the land is subdued before the Lord; then afterward you shall return and be free of obligation (guiltless) before the Lord and before Israel, and this land shall be your possession before the Lord.'",
      "Non-Denominational": "...and the land of Canaan is conquered 'before the Lord,' then they may return, being considered guiltless before God and Israel, and the land of Gilead will be confirmed as their possession 'before the Lord'.",
      "Baptist": "...and the land is subdued before the Lord, then they may return, being guiltless before the Lord and Israel, and this eastern land will be their possession before the Lord.",
      "Catholic": "'and the land is subdued before the Lord; then after that you shall return and be free of obligation to the Lord and to Israel, and this land shall be your possession before the Lord.'",
      "Methodist": "...and the land is subdued before the Lord, then they can return, free from obligation to God and Israel, and this eastern land will be their possession before the Lord.",
      "Lutheran": "...and the land is subdued before the Lord; then afterward you may return and be guiltless before the Lord and Israel, and this land will be your possession before the Lord (Conditional Promise)."
    },
    "23": {
      "General": "'But if you fail to do so, behold, you will have sinned against the Lord; and be sure your sin will find you out.'",
      "Non-Denominational": "Moses warns of the consequence of failure: If they do not fulfill their vow, they will have sinned against God, and their sin will inevitably bring its own punishment ('find you out').",
      "Baptist": "He warns sternly: If they fail to perform this vow, they will have sinned against the Lord, and they must understand that their sin will inevitably lead to judgment ('be sure your sin will find you out').",
      "Catholic": "'But if you will not do so, behold, you have sinned against the Lord, and be sure your sin will find you out.'",
      "Methodist": "He warns: Failure to fulfill this means sinning against the Lord, and they must be certain their sin will have consequences.",
      "Lutheran": "He warns: If you fail, behold, you have sinned against the Lord, and be sure your sin will find you out (Law/Consequence)."
    },
    "24": {
      "General": "'Build towns for your little ones and folds for your sheep, and do what you have promised (proceeded out of your mouth).'",
      "Non-Denominational": "Moses grants permission: Build your towns and sheepfolds, and then fulfill the promise you have made.",
      "Baptist": "Moses permits them: Build cities for your families and folds for your sheep, and then perform what you have verbally committed to do.",
      "Catholic": "'Build cities for your little ones, and folds for your sheep; and do what you have promised.'",
      "Methodist": "Moses instructs: Build your towns and sheepfolds, and then do what you have promised.",
      "Lutheran": "Moses permits: Build cities for your families and folds for your sheep, and do what you have promised."
    },
    "25": {
      "General": "The Gadites and Reubenites said to Moses, 'Your servants will do as my lord commands.'",
      "Non-Denominational": "The tribes of Gad and Reuben formally agree, stating they will obey Moses' commands ('as my lord commands').",
      "Baptist": "The Gadites and Reubenites affirm their commitment, promising to obey Moses' directives ('as my lord commandeth').",
      "Catholic": "And the Gadites and the Reubenites said to Moses, 'Your servants will do as my lord commands.'",
      "Methodist": "The Gadites and Reubenites agree, stating they will do as Moses commands.",
      "Lutheran": "Gad and Reuben reply: Your servants will do as my lord commands."
    },
    "26": {
      "General": "'Our little ones, our wives, our livestock, and all our cattle will stay there in the towns of Gilead.'",
      "Non-Denominational": "They reiterate that their families and possessions will remain in the towns of Gilead.",
      "Baptist": "They confirm their families, flocks, and herds will remain in the cities of Gilead.",
      "Catholic": "'Our little ones, our wives, our livestock, and all our cattle shall remain there in the cities of Gilead,'",
      "Methodist": "They state their families and livestock will remain in the towns of Gilead.",
      "Lutheran": "They state: Our families, flocks, and herds will stay in the cities of Gilead."
    },
    "27": {
      "General": "'But your servants will cross over, every man armed for war, before the Lord to battle, just as my lord says.'",
      "Non-Denominational": "They reaffirm their promise that their armed soldiers will cross over 'before the Lord' to fight, exactly as Moses has stipulated.",
      "Baptist": "They promise again that their soldiers, armed for war, will cross over before the Lord to battle, precisely as Moses instructed.",
      "Catholic": "'but your servants will pass over, every man who is armed for war, before the Lord to battle, as my lord commands.'",
      "Methodist": "They reaffirm that their armed men will cross over before the Lord to battle as Moses directed.",
      "Lutheran": "They promise: Your servants will cross over, every man armed for war, before the Lord to battle, as my lord says."
    },
    "28": {
      "General": "So Moses gave command concerning them to Eleazar the priest, Joshua son of Nun, and the heads of the fathers' houses of the tribes of the Israelites.",
      "Non-Denominational": "Moses formalizes the agreement by giving instructions about it to Eleazar, Joshua (his designated successor), and the tribal family leaders.",
      "Baptist": "Moses gives official command regarding this agreement to Eleazar the priest, Joshua son of Nun, and the chief leaders ('heads of the fathers') of the tribes.",
      "Catholic": "So Moses gave command concerning them to Eleazar the priest, and to Joshua the son of Nun, and to the heads of the fathers' houses of the tribes of the people of Israel.",
      "Methodist": "Moses gives official command regarding them to Eleazar, Joshua, and the tribal leaders.",
      "Lutheran": "Moses commands Eleazar, Joshua, and the chief fathers of the tribes concerning them."
    },
    "29": {
      "General": "Moses said to them, 'If the Gadites and Reubenites, every man armed for battle before the Lord, cross with you over the Jordan, and the land shall be subdued before you, then you shall give them the land of Gilead for a possession.'",
      "Non-Denominational": "Moses instructs the leadership: If Gad and Reuben fulfill their promise (crossing the Jordan armed 'before the Lord', fighting until the land is subdued), then the land of Gilead must be given to them as their inheritance.",
      "Baptist": "Moses instructs the leaders: If the Gadites and Reubenites cross the Jordan with you armed for battle before the Lord, and the land is conquered, then you must grant them Gilead as their possession.",
      "Catholic": "And Moses said to them, 'If the Gadites and the Reubenites, every man who is armed to battle before the Lord, will pass with you over the Jordan and the land shall be subdued before you, then you shall give them the land of Gilead for a possession.'",
      "Methodist": "Moses instructs the leaders: If Gad and Reuben cross the Jordan armed for battle before the Lord, and the land is subdued, then give them Gilead as their possession.",
      "Lutheran": "Moses instructs the leaders: If Gad and Reuben cross the Jordan armed for battle before the Lord, and the land is subdued, then give them Gilead for a possession."
    },
    "30": {
      "General": "'But if they do not cross over with you armed, they must accept their possession with you in the land of Canaan.'",
      "Non-Denominational": "The alternative: If they fail to cross over armed, they forfeit the eastern land and must take an inheritance alongside the other tribes within Canaan proper.",
      "Baptist": "The consequence of failure: If they do not cross over armed with you, they lose their claim to Gilead and must receive their inheritance among the other tribes in Canaan.",
      "Catholic": "'But if they will not pass over with you armed, they shall have possessions among you in the land of Canaan.'",
      "Methodist": "However, if they don't cross over armed with you, they must take their inheritance within the land of Canaan.",
      "Lutheran": "But if they don't cross over armed, they shall have possessions among you in Canaan (Consequence/Law)."
    },
    "31": {
      "General": "The Gadites and Reubenites answered, 'As the Lord has said to your servants, so we will do.'",
      "Non-Denominational": "Gad and Reuben again affirm their commitment, promising to do exactly what the Lord (through Moses) has instructed.",
      "Baptist": "The Gadites and Reubenites respond, pledging to perform precisely what the Lord has commanded Moses ('your servants').",
      "Catholic": "And the Gadites and the Reubenites answered, 'As the Lord has said to your servants, so we will do.'",
      "Methodist": "Gad and Reuben answer, promising to do exactly as the Lord has directed.",
      "Lutheran": "Gad and Reuben answer: As the Lord has said to your servants, so we will do."
    },
    "32": {
      "General": "'We will cross over armed before the Lord into the land of Canaan, that the possession of our inheritance on this side of the Jordan may be ours.'",
      "Non-Denominational": "They explicitly state their intention: cross armed 'before the Lord' into Canaan, so that they may secure their inheritance east of the Jordan.",
      "Baptist": "They declare their intent: They will cross over armed before the Lord into Canaan, ensuring their possession of the inheritance east of the Jordan remains theirs.",
      "Catholic": "'We will pass over armed before the Lord into the land of Canaan, and the possession of our inheritance shall remain with us beyond the Jordan.'",
      "Methodist": "They declare they will cross over armed before the Lord into Canaan, so their inheritance east of the Jordan may be secured.",
      "Lutheran": "They declare: We will cross armed before the Lord into Canaan, so that our inheritance east of the Jordan remains ours."
    },
    "33": {
      "General": "Moses gave to them—to the Gadites and the Reubenites and the half-tribe of Manasseh son of Joseph—the kingdom of Sihon king of the Amorites and the kingdom of Og king of Bashan, the land and its cities with their territories, the cities of the land throughout the country.",
      "Non-Denominational": "Moses formally grants the territory (the former kingdoms of Sihon and Og, including the land, cities, and surrounding territories) to the tribes of Gad, Reuben, and now includes half the tribe of Manasseh.",
      "Baptist": "Moses assigns to Gad, Reuben, and the half-tribe of Manasseh the territory formerly ruled by Sihon (Amorite king) and Og (king of Bashan), encompassing the land with its cities and borders.",
      "Catholic": "And Moses gave to them, to the Gadites and to the Reubenites and to the half-tribe of Manasseh the son of Joseph, the kingdom of Sihon king of the Amorites and the kingdom of Og king of Bashan, the land and its cities with their territories, the cities of the land throughout the country.",
      "Methodist": "Moses grants the kingdom of Sihon and the kingdom of Og (land, cities, territories) to Gad, Reuben, and the half-tribe of Manasseh.",
      "Lutheran": "Moses gives to Gad, Reuben, and the half-tribe of Manasseh the kingdoms of Sihon and Og—the land with its cities and surrounding territories."
    },
    "34": {
      "General": "And the Gadites built Dibon, Ataroth, Aroer,",
      "Non-Denominational": "Lists cities rebuilt or fortified by the tribe of Gad: Dibon, Ataroth, Aroer.",
      "Baptist": "Records that the Gadites built (rebuilt/fortified) Dibon, Ataroth, and Aroer.",
      "Catholic": "And the Gadites built Dibon, Ataroth, Aroer,",
      "Methodist": "The Gadites built Dibon, Ataroth, and Aroer.",
      "Lutheran": "The Gadites built Dibon, Ataroth, Aroer."
    },
    "35": {
      "General": "Atroth-shophan, Jazer, Jogbehah,",
      "Non-Denominational": "Continues the list of Gadite cities: Atroth-shophan, Jazer, Jogbehah.",
      "Baptist": "Continues the list of Gadite construction: Atroth, Shophan, Jazer, Jogbehah.",
      "Catholic": "Atroth-shophan, Jazer, Jogbehah,",
      "Methodist": "Also Atroth-shophan, Jazer, and Jogbehah.",
      "Lutheran": "Also Atroth, Shophan, Jazer, Jogbehah."
    },
    "36": {
      "General": "Beth-nimrah, and Beth-haran, fortified cities, and folds for sheep.",
      "Non-Denominational": "Concludes the list for Gad: Beth-nimrah and Beth-haran (described as fortified cities), along with sheepfolds.",
      "Baptist": "Concludes the Gadite list: Beth-nimrah and Beth-haran (fortified cities), and sheepfolds.",
      "Catholic": "Beth-nimrah, and Beth-haran, fortified cities, and folds for sheep.",
      "Methodist": "And Beth-nimrah and Beth-haran (fortified cities), plus sheepfolds.",
      "Lutheran": "And Beth-nimrah, Beth-haran (fortified cities), and sheepfolds."
    },
    "37": {
      "General": "And the Reubenites built Heshbon, Elealeh, Kiriathaim,",
      "Non-Denominational": "Lists cities rebuilt or fortified by the tribe of Reuben: Heshbon, Elealeh, Kiriathaim.",
      "Baptist": "Records that the Reubenites built (rebuilt/fortified) Heshbon, Elealeh, and Kiriathaim.",
      "Catholic": "And the Reubenites built Heshbon, Elealeh, Kiriathaim,",
      "Methodist": "The Reubenites built Heshbon, Elealeh, and Kiriathaim.",
      "Lutheran": "The Reubenites built Heshbon, Elealeh, Kiriathaim."
    },
    "38": {
      "General": "Nebo, and Baal-meon (their names were changed), and Sibmah; and they gave other names to the cities that they built.",
      "Non-Denominational": "Continues the Reubenite list: Nebo and Baal-meon (noting their names were changed, likely due to pagan associations), and Sibmah. Adds that they renamed the cities they built.",
      "Baptist": "Continues the Reubenite list: Nebo, Baal-meon (with a note that their names were changed), and Shibmah. Adds they assigned new names to the cities they built.",
      "Catholic": "Nebo, and Baal-meon (their names were changed), and Sibmah; and they gave other names to the cities that they built.",
      "Methodist": "Also Nebo and Baal-meon (names changed), and Sibmah. They renamed the cities they built.",
      "Lutheran": "Also Nebo, Baal-meon (names changed), Sibmah; they renamed the cities they built."
    },
    "39": {
      "General": "The descendants of Machir son of Manasseh went to Gilead, captured it, and dispossessed the Amorites who were there.",
      "Non-Denominational": "Explains the involvement of Manasseh: The clan of Machir (Manasseh's son) conquered the region of Gilead, driving out the resident Amorites.",
      "Baptist": "Details the actions of the clan of Machir son of Manasseh: they went to Gilead, captured it, and dispossessed the Amorites residing there.",
      "Catholic": "And the sons of Machir the son of Manasseh went to Gilead and took it, and dispossessed the Amorites who were in it.",
      "Methodist": "The descendants of Machir (Manasseh's son) captured Gilead and drove out the Amorites there.",
      "Lutheran": "The descendants of Machir son of Manasseh went to Gilead, took it, and dispossessed the Amorites there."
    },
    "40": {
      "General": "So Moses gave Gilead to Machir son of Manasseh, and he settled there.",
      "Non-Denominational": "Moses then assigned this conquered Gilead territory to the Machirite clan of Manasseh, and they settled there.",
      "Baptist": "Moses formally gives Gilead to the clan of Machir son of Manasseh, and they dwell there.",
      "Catholic": "And Moses gave Gilead to Machir the son of Manasseh, and he settled in it.",
      "Methodist": "Moses gave Gilead to Machir son of Manasseh, who settled there.",
      "Lutheran": "Moses gives Gilead to Machir son of Manasseh, and he settled there."
    },
    "41": {
      "General": "Jair son of Manasseh went and captured their villages (small towns) and called them Havvoth-jair.",
      "Non-Denominational": "Another Manassite leader, Jair, captured some smaller settlements and renamed them Havvoth-jair ('villages of Jair').",
      "Baptist": "Jair son of Manasseh captured the smaller towns in the area and named them Havoth-jair.",
      "Catholic": "And Jair the son of Manasseh went and took their villages, and called them Havvoth-jair.",
      "Methodist": "Jair son of Manasseh captured villages and named them Havvoth-jair.",
      "Lutheran": "Jair son of Manasseh took their small towns and called them Havvoth-jair."
    },
    "42": {
      "General": "And Nobah went and captured Kenath and its villages (daughters) and called it Nobah, after his own name.",
      "Non-Denominational": "A third Manassite figure, Nobah, captured Kenath and its surrounding villages, renaming the main town Nobah after himself.",
      "Baptist": "Nobah captured Kenath and its dependent villages ('daughters') and renamed it Nobah, after himself.",
      "Catholic": "And Nobah went and took Kenath and its villages, and called it Nobah, after his own name.",
      "Methodist": "Nobah captured Kenath and its villages, renaming it Nobah after himself.",
      "Lutheran": "Nobah took Kenath and its villages (daughters) and called it Nobah, after his own name."
    }
  }
}
