{
  "Summary": {
    "General": "This chapter records the stages of the Israelites' journey, written down by Moses at the Lord's command, starting from their departure from Egypt under Moses and Aaron. It meticulously lists each encampment location, beginning with Rameses and Succoth, through the Red Sea crossing, the wildernesses of Etham, Sin, and Sinai (where the Law was given), Kadesh-barnea (where the spies were sent and the rebellion occurred), the death of Aaron on Mount Hor, and finally arriving at the plains of Moab across the Jordan from Jericho. Forty distinct stages/locations are listed. After detailing the journey, the chapter concludes with God commanding Moses, while in the plains of Moab, to instruct the Israelites on what they must do upon entering Canaan: drive out all inhabitants, destroy all their carved images and high places, take possession of the land, and divide it by lot according to the size of their clans/tribes. God warns that if they fail to drive out the inhabitants, those remaining will become serious trouble ('pricks in your eyes and thorns in your sides') and vex them in the land. Furthermore, God states He will then do to Israel what He intended to do to those nations.",
    "Non-Denominational": "Focuses on the historical record of God's faithfulness throughout Israel's long journey, despite their frequent failures. The detailed itinerary serves as a memorial, reminding future generations of God's guidance, provision (manna, water), judgment (wilderness deaths), and the fulfillment of His promise to bring them to Canaan's border. The commands given at the end emphasize the necessity of complete obedience in possessing the land: removing all pagan influences (inhabitants, idols, high places) to avoid compromise and future trouble. The warning underscores the consequences of incomplete obedience and God's requirement for holiness in the promised land.",
    "Baptist": "Emphasizes the documentation of Israel's journey as a testament to God's sovereign guidance and judgment. It traces their path from Egyptian bondage to the verge of the Promised Land, highlighting key events like the Exodus, Sinai, Kadesh-barnea rebellion, and Aaron's death. The final commands stress the necessity of holy warfare upon entering Canaan – complete separation from paganism by driving out the inhabitants and destroying their idols/high places. This reflects God's holiness and the danger of spiritual compromise. The warning about remaining inhabitants becoming 'pricks and thorns' underscores the consequences of disobedience and incomplete sanctification.",
    "Catholic": "Views the recorded journey as a sacred history, demonstrating God's providential guidance and patience with Israel through their pilgrimage from slavery to the threshold of the Promised Land. The list of stages serves as a historical anchor and a reminder of God's actions. The commands for entering Canaan emphasize the need to cleanse the land of idolatry and establish a society dedicated solely to the Lord. Driving out inhabitants and destroying idols is seen as necessary for preserving the covenant and the purity of worship. The warning highlights the spiritual dangers of syncretism and the importance of fidelity to God's commands for possessing the promised inheritance.",
    "Methodist": "Highlights the journey narrative as a chronicle of God's persistent grace and guidance despite Israel's unfaithfulness. The recorded stages map their spiritual and physical pilgrimage. The concluding commands focus on the responsibility that comes with God's gift of the land: they must actively possess it by removing all sources of idolatry and temptation (inhabitants, images, high places). This underscores the Wesleyan emphasis on active holiness and complete dedication to God. The warning illustrates the painful consequences ('pricks,' 'thorns') of failing to fully embrace God's sanctifying work and purpose for them.",
    "Lutheran": "Focuses on the journey as a record commanded by God, detailing Israel's path under His direction. It lists the historical stages from Egypt to Moab. The commands given at the end represent God's Law for entering Canaan: the requirement to drive out inhabitants, destroy idols, and divide the land reflects God's specific will and order for Israel in that time. The warning illustrates the Law's consequence for disobedience – failure to purge the land leads to affliction and ultimately risks God turning His judgment upon Israel itself. This underscores the severity of the Law and the need for God's intervention and grace (fulfilled in Christ)."
  },
  "Verses": {
    "1": {
      "General": "These are the stages of the journey (journeys) of the Israelites, when they went out of the land of Egypt by their military divisions (armies) under the leadership (hand) of Moses and Aaron.",
      "Non-Denominational": "Introduces the chapter as a record of the Israelites' journey stages after leaving Egypt, organized by divisions under Moses' and Aaron's leadership.",
      "Baptist": "States the purpose: to list the journey stages of the Israelites after their organized exodus from Egypt under the command of Moses and Aaron.",
      "Catholic": "Introduces the list of the stages of the Israelites' journey after leaving Egypt in organized divisions under Moses and Aaron.",
      "Methodist": "Introduces the record of the Israelites' journey stages from Egypt, noting their organization and leadership under Moses and Aaron.",
      "Lutheran": "Introduces the record of Israel's journey stages from Egypt, organized by armies under Moses and Aaron."
    },
    "2": {
      "General": "Moses wrote down their starting points (goings out) for their stages (journeys) by the commandment of the Lord, and these are their stages according to their starting points.",
      "Non-Denominational": "Specifies that Moses recorded this itinerary stage by stage as commanded by God, documenting their movements.",
      "Baptist": "Highlights that Moses documented their departure points for each stage of the journey according to the Lord's direct command.",
      "Catholic": "Moses recorded their starting places stage by stage, as commanded by the Lord; and these are their stages according to their starting places.",
      "Methodist": "States that Moses recorded the starting points of their journey stages by God's command.",
      "Lutheran": "Notes that Moses wrote down their departure points for the journeys by God's command."
    },
    "3": {
      "General": "They set out from Rameses in the first month, on the fifteenth day of the first month. On the day after the Passover, the Israelites went out defiantly (with a high hand) in the sight of all the Egyptians,",
      "Non-Denominational": "Records the starting point: Rameses, on the 15th day of the first month (day after Passover). Notes their departure was bold/triumphant ('with a high hand') witnessed by the Egyptians.",
      "Baptist": "Specifies the departure from Rameses on the 15th day of the first month, the day after Passover, emphasizing their bold departure ('with an high hand') in view of the Egyptians.",
      "Catholic": "They set out from Rameses in the first month, on the fifteenth day; on the day after the Passover the Israelites went out triumphantly in the sight of all the Egyptians,",
      "Methodist": "Records the departure from Rameses on the 15th of the first month (after Passover), noting their bold ('high hand') exit seen by the Egyptians.",
      "Lutheran": "Records departure from Rameses on the 15th day of the 1st month (after Passover), going out boldly ('high hand') before the Egyptians."
    },
    "4": {
      "General": "while the Egyptians were burying all their firstborn, whom the Lord had struck down (smitten) among them. The Lord had also executed judgments on their gods.",
      "Non-Denominational": "Provides context for the departure: the Egyptians were occupied burying their firstborn, whom God had killed, demonstrating God's judgment against both the people and the gods of Egypt.",
      "Baptist": "Adds context: the Egyptians were burying their firstborn slain by the Lord, upon whose gods the Lord had also executed judgment.",
      "Catholic": "while the Egyptians were burying all their firstborn, whom the Lord had struck down among them. Upon their gods also the Lord executed judgments.",
      "Methodist": "Notes the Egyptians were burying their firstborn killed by the Lord, highlighting God's judgment on their gods as well.",
      "Lutheran": "Adds context: Egyptians were burying their firstborn slain by the Lord, upon whose gods the Lord also executed judgment."
    },
    "5": {
      "General": "So the Israelites set out from Rameses and camped at Succoth.",
      "Non-Denominational": "First stage: Departed Rameses, camped at Succoth.",
      "Baptist": "First journey: From Rameses to encampment at Succoth.",
      "Catholic": "So the Israelites set out from Rameses and camped at Succoth.",
      "Methodist": "Stage 1: Depart Rameses, camp at Succoth.",
      "Lutheran": "Stage 1: Depart Rameses, camp at Succoth."
    },
    "6": {
      "General": "They set out from Succoth and camped at Etham, which is on the edge of the wilderness.",
      "Non-Denominational": "Second stage: Departed Succoth, camped at Etham (located at the wilderness edge).",
      "Baptist": "Second journey: From Succoth to encampment at Etham, bordering the wilderness.",
      "Catholic": "And they set out from Succoth and camped at Etham, which is on the edge of the wilderness.",
      "Methodist": "Stage 2: Depart Succoth, camp at Etham (wilderness edge).",
      "Lutheran": "Stage 2: Depart Succoth, camp at Etham (edge of wilderness)."
    },
    "7": {
      "General": "They set out from Etham and turned back to Pi-hahiroth, which faces Baal-zephon, and they camped before Migdol.",
      "Non-Denominational": "Third stage: Departed Etham, turned back towards Pi-hahiroth (opposite Baal-zephon), camped near Migdol (location of Red Sea crossing).",
      "Baptist": "Third journey: From Etham, turning back to Pi-hahiroth (before Baal-zephon), camping before Migdol.",
      "Catholic": "And they set out from Etham and turned back to Pi-hahiroth, which is east of Baal-zephon; and they camped before Migdol.",
      "Methodist": "Stage 3: Depart Etham, turn back to Pi-hahiroth (facing Baal-zephon), camp before Migdol.",
      "Lutheran": "Stage 3: Depart Etham, turn back to Pi-hahiroth (east of Baal-zephon), camp before Migdol."
    },
    "8": {
      "General": "They set out from before Pi-hahiroth (from Pi-hahiroth) and passed through the midst of the sea into the wilderness, went a three days' journey in the wilderness of Etham, and camped at Marah.",
      "Non-Denominational": "Fourth stage: Departed Pi-hahiroth, passed through the Red Sea into the wilderness, traveled three days into the Etham wilderness, camped at Marah (place of bitter water).",
      "Baptist": "Fourth journey: From Pi-hahiroth, passing through the Red Sea into the wilderness, traveling three days in the Etham wilderness, camping at Marah.",
      "Catholic": "And they set out from before Hahiroth and passed through the midst of the sea into the wilderness, and they went a three days' journey in the wilderness of Etham and camped at Marah.",
      "Methodist": "Stage 4: Depart Pi-hahiroth, pass through the sea, travel 3 days in Etham wilderness, camp at Marah.",
      "Lutheran": "Stage 4: Depart Pi-hahiroth, pass through the sea, journey 3 days in Etham wilderness, camp at Marah."
    },
    "9": {
      "General": "They set out from Marah and came to Elim; at Elim there were twelve springs of water and seventy palm trees, and they camped there.",
      "Non-Denominational": "Fifth stage: Departed Marah, arrived at Elim (noted for its abundance: 12 springs, 70 palm trees), camped there.",
      "Baptist": "Fifth journey: From Marah to Elim, noted for having twelve wells and seventy palm trees, where they camped.",
      "Catholic": "And they set out from Marah and came to Elim; at Elim there were twelve springs of water and seventy palm trees, and they camped there.",
      "Methodist": "Stage 5: Depart Marah, arrive and camp at Elim (12 springs, 70 palms).",
      "Lutheran": "Stage 5: Depart Marah, come to Elim (12 springs, 70 palms), camp there."
    },
    "10": {
      "General": "They set out from Elim and camped by the Red Sea.",
      "Non-Denominational": "Sixth stage: Departed Elim, camped by the Red Sea.",
      "Baptist": "Sixth journey: From Elim to encampment by the Red Sea.",
      "Catholic": "And they set out from Elim and camped by the Red Sea.",
      "Methodist": "Stage 6: Depart Elim, camp by the Red Sea.",
      "Lutheran": "Stage 6: Depart Elim, camp by the Red Sea."
    },
    "11": {
      "General": "They set out from the Red Sea and camped in the Wilderness of Sin.",
      "Non-Denominational": "Seventh stage: Departed the Red Sea, camped in the Wilderness of Sin (where manna began).",
      "Baptist": "Seventh journey: From the Red Sea to encampment in the Wilderness of Sin.",
      "Catholic": "And they set out from the Red Sea and camped in the wilderness of Sin.",
      "Methodist": "Stage 7: Depart Red Sea, camp in Wilderness of Sin.",
      "Lutheran": "Stage 7: Depart Red Sea, camp in Wilderness of Sin."
    },
    "12": {
      "General": "They set out from the Wilderness of Sin and camped at Dophkah.",
      "Non-Denominational": "Eighth stage: Departed Wilderness of Sin, camped at Dophkah.",
      "Baptist": "Eighth journey: From Wilderness of Sin to encampment at Dophkah.",
      "Catholic": "And they set out from the wilderness of Sin and camped at Dophkah.",
      "Methodist": "Stage 8: Depart Wilderness of Sin, camp at Dophkah.",
      "Lutheran": "Stage 8: Depart Wilderness of Sin, camp at Dophkah."
    },
    "13": {
      "General": "They set out from Dophkah and camped at Alush.",
      "Non-Denominational": "Ninth stage: Departed Dophkah, camped at Alush.",
      "Baptist": "Ninth journey: From Dophkah to encampment at Alush.",
      "Catholic": "And they set out from Dophkah and camped at Alush.",
      "Methodist": "Stage 9: Depart Dophkah, camp at Alush.",
      "Lutheran": "Stage 9: Depart Dophkah, camp at Alush."
    },
    "14": {
      "General": "They set out from Alush and camped at Rephidim, where there was no water for the people to drink.",
      "Non-Denominational": "Tenth stage: Departed Alush, camped at Rephidim (noted as the place where water was miraculously provided from the rock).",
      "Baptist": "Tenth journey: From Alush to encampment at Rephidim, significantly noting the lack of water there for the people.",
      "Catholic": "And they set out from Alush and camped at Rephidim, where there was no water for the people to drink.",
      "Methodist": "Stage 10: Depart Alush, camp at Rephidim (where there was no water).",
      "Lutheran": "Stage 10: Depart Alush, camp at Rephidim (no water available)."
    },
    "15": {
      "General": "They set out from Rephidim and camped in the Wilderness of Sinai.",
      "Non-Denominational": "Eleventh stage: Departed Rephidim, camped in the Wilderness of Sinai (location where the Law was given).",
      "Baptist": "Eleventh journey: From Rephidim to encampment in the Wilderness of Sinai.",
      "Catholic": "And they set out from Rephidim and camped in the wilderness of Sinai.",
      "Methodist": "Stage 11: Depart Rephidim, camp in Wilderness of Sinai.",
      "Lutheran": "Stage 11: Depart Rephidim, camp in Wilderness of Sinai."
    },
    "16": {
      "General": "They set out from the Wilderness of Sinai and camped at Kibroth-hattaavah.",
      "Non-Denominational": "Twelfth stage: Departed Wilderness of Sinai, camped at Kibroth-hattaavah ('graves of craving,' where people died after demanding meat).",
      "Baptist": "Twelfth journey: From Wilderness of Sinai to encampment at Kibroth-hattaavah.",
      "Catholic": "And they set out from the wilderness of Sinai and camped at Kibroth-hattaavah.",
      "Methodist": "Stage 12: Depart Wilderness of Sinai, camp at Kibroth-hattaavah.",
      "Lutheran": "Stage 12: Depart Wilderness of Sinai, camp at Kibroth-hattaavah."
    },
    "17": {
      "General": "They set out from Kibroth-hattaavah and camped at Hazeroth.",
      "Non-Denominational": "Thirteenth stage: Departed Kibroth-hattaavah, camped at Hazeroth (where Miriam and Aaron challenged Moses).",
      "Baptist": "Thirteenth journey: From Kibroth-hattaavah to encampment at Hazeroth.",
      "Catholic": "And they set out from Kibroth-hattaavah and camped at Hazeroth.",
      "Methodist": "Stage 13: Depart Kibroth-hattaavah, camp at Hazeroth.",
      "Lutheran": "Stage 13: Depart Kibroth-hattaavah, camp at Hazeroth."
    },
    "18": {
      "General": "They set out from Hazeroth and camped at Rithmah.",
      "Non-Denominational": "Fourteenth stage: Departed Hazeroth, camped at Rithmah.",
      "Baptist": "Fourteenth journey: From Hazeroth to encampment at Rithmah.",
      "Catholic": "And they set out from Hazeroth and camped at Rithmah.",
      "Methodist": "Stage 14: Depart Hazeroth, camp at Rithmah.",
      "Lutheran": "Stage 14: Depart Hazeroth, camp at Rithmah."
    },
    "19": {
      "General": "They set out from Rithmah and camped at Rimmon-perez.",
      "Non-Denominational": "Fifteenth stage: Departed Rithmah, camped at Rimmon-perez.",
      "Baptist": "Fifteenth journey: From Rithmah to encampment at Rimmon-parez.",
      "Catholic": "And they set out from Rithmah and camped at Rimmon-perez.",
      "Methodist": "Stage 15: Depart Rithmah, camp at Rimmon-perez.",
      "Lutheran": "Stage 15: Depart Rithmah, camp at Rimmon-parez."
    },
    "20": {
      "General": "They set out from Rimmon-perez and camped at Libnah.",
      "Non-Denominational": "Sixteenth stage: Departed Rimmon-perez, camped at Libnah.",
      "Baptist": "Sixteenth journey: From Rimmon-parez to encampment at Libnah.",
      "Catholic": "And they set out from Rimmon-perez and camped at Libnah.",
      "Methodist": "Stage 16: Depart Rimmon-perez, camp at Libnah.",
      "Lutheran": "Stage 16: Depart Rimmon-parez, camp at Libnah."
    },
    "21": {
      "General": "They set out from Libnah and camped at Rissah.",
      "Non-Denominational": "Seventeenth stage: Departed Libnah, camped at Rissah.",
      "Baptist": "Seventeenth journey: From Libnah to encampment at Rissah.",
      "Catholic": "And they set out from Libnah and camped at Rissah.",
      "Methodist": "Stage 17: Depart Libnah, camp at Rissah.",
      "Lutheran": "Stage 17: Depart Libnah, camp at Rissah."
    },
    "22": {
      "General": "They set out from Rissah and camped at Kehelathah.",
      "Non-Denominational": "Eighteenth stage: Departed Rissah, camped at Kehelathah.",
      "Baptist": "Eighteenth journey: From Rissah to encampment at Kehelathah.",
      "Catholic": "And they set out from Rissah and camped at Kehelathah.",
      "Methodist": "Stage 18: Depart Rissah, camp at Kehelathah.",
      "Lutheran": "Stage 18: Depart Rissah, camp at Kehelathah."
    },
    "23": {
      "General": "They set out from Kehelathah and camped at Mount Shepher.",
      "Non-Denominational": "Nineteenth stage: Departed Kehelathah, camped at Mount Shepher.",
      "Baptist": "Nineteenth journey: From Kehelathah to encampment at Mount Shapher.",
      "Catholic": "And they set out from Kehelathah and camped at Mount Shepher.",
      "Methodist": "Stage 19: Depart Kehelathah, camp at Mount Shepher.",
      "Lutheran": "Stage 19: Depart Kehelathah, camp at Mount Shapher."
    },
    "24": {
      "General": "They set out from Mount Shepher and camped at Haradah.",
      "Non-Denominational": "Twentieth stage: Departed Mount Shepher, camped at Haradah.",
      "Baptist": "Twentieth journey: From Mount Shapher to encampment at Haradah.",
      "Catholic": "And they set out from Mount Shepher and camped at Haradah.",
      "Methodist": "Stage 20: Depart Mount Shepher, camp at Haradah.",
      "Lutheran": "Stage 20: Depart Mount Shapher, camp at Haradah."
    },
    "25": {
      "General": "They set out from Haradah and camped at Makheloth.",
      "Non-Denominational": "Twenty-first stage: Departed Haradah, camped at Makheloth.",
      "Baptist": "Twenty-first journey: From Haradah to encampment at Makheloth.",
      "Catholic": "And they set out from Haradah and camped at Makheloth.",
      "Methodist": "Stage 21: Depart Haradah, camp at Makheloth.",
      "Lutheran": "Stage 21: Depart Haradah, camp at Makheloth."
    },
    "26": {
      "General": "They set out from Makheloth and camped at Tahath.",
      "Non-Denominational": "Twenty-second stage: Departed Makheloth, camped at Tahath.",
      "Baptist": "Twenty-second journey: From Makheloth to encampment at Tahath.",
      "Catholic": "And they set out from Makheloth and camped at Tahath.",
      "Methodist": "Stage 22: Depart Makheloth, camp at Tahath.",
      "Lutheran": "Stage 22: Depart Makheloth, camp at Tahath."
    },
    "27": {
      "General": "They set out from Tahath and camped at Terah.",
      "Non-Denominational": "Twenty-third stage: Departed Tahath, camped at Terah.",
      "Baptist": "Twenty-third journey: From Tahath to encampment at Tarah.",
      "Catholic": "And they set out from Tahath and camped at Terah.",
      "Methodist": "Stage 23: Depart Tahath, camp at Terah.",
      "Lutheran": "Stage 23: Depart Tahath, camp at Tarah."
    },
    "28": {
      "General": "They set out from Terah and camped at Mithkah.",
      "Non-Denominational": "Twenty-fourth stage: Departed Terah, camped at Mithkah.",
      "Baptist": "Twenty-fourth journey: From Tarah to encampment at Mithcah.",
      "Catholic": "And they set out from Terah and camped at Mithkah.",
      "Methodist": "Stage 24: Depart Terah, camp at Mithkah.",
      "Lutheran": "Stage 24: Depart Tarah, camp at Mithcah."
    },
    "29": {
      "General": "They set out from Mithkah and camped at Hashmonah.",
      "Non-Denominational": "Twenty-fifth stage: Departed Mithkah, camped at Hashmonah.",
      "Baptist": "Twenty-fifth journey: From Mithcah to encampment at Hashmonah.",
      "Catholic": "And they set out from Mithkah and camped at Hashmonah.",
      "Methodist": "Stage 25: Depart Mithkah, camp at Hashmonah.",
      "Lutheran": "Stage 25: Depart Mithcah, camp at Hashmonah."
    },
    "30": {
      "General": "They set out from Hashmonah and camped at Moseroth.",
      "Non-Denominational": "Twenty-sixth stage: Departed Hashmonah, camped at Moseroth.",
      "Baptist": "Twenty-sixth journey: From Hashmonah to encampment at Moseroth.",
      "Catholic": "And they set out from Hashmonah and camped at Moseroth.",
      "Methodist": "Stage 26: Depart Hashmonah, camp at Moseroth.",
      "Lutheran": "Stage 26: Depart Hashmonah, camp at Moseroth."
    },
    "31": {
      "General": "They set out from Moseroth and camped at Bene-jaakan.",
      "Non-Denominational": "Twenty-seventh stage: Departed Moseroth, camped at Bene-jaakan.",
      "Baptist": "Twenty-seventh journey: From Moseroth to encampment at Bene-jaakan.",
      "Catholic": "And they set out from Moseroth and camped at Bene-jaakan.",
      "Methodist": "Stage 27: Depart Moseroth, camp at Bene-jaakan.",
      "Lutheran": "Stage 27: Depart Moseroth, camp at Bene-jaakan."
    },
    "32": {
      "General": "They set out from Bene-jaakan and camped at Hor-haggidgad.",
      "Non-Denominational": "Twenty-eighth stage: Departed Bene-jaakan, camped at Hor-haggidgad.",
      "Baptist": "Twenty-eighth journey: From Bene-jaakan to encampment at Hor-hagidgad.",
      "Catholic": "And they set out from Bene-jaakan and camped at Hor-haggidgad.",
      "Methodist": "Stage 28: Depart Bene-jaakan, camp at Hor-haggidgad.",
      "Lutheran": "Stage 28: Depart Bene-jaakan, camp at Hor-hagidgad."
    },
    "33": {
      "General": "They set out from Hor-haggidgad and camped at Jotbathah.",
      "Non-Denominational": "Twenty-ninth stage: Departed Hor-haggidgad, camped at Jotbathah.",
      "Baptist": "Twenty-ninth journey: From Hor-hagidgad to encampment at Jotbathah.",
      "Catholic": "And they set out from Hor-haggidgad and camped at Jotbathah.",
      "Methodist": "Stage 29: Depart Hor-haggidgad, camp at Jotbathah.",
      "Lutheran": "Stage 29: Depart Hor-hagidgad, camp at Jotbathah."
    },
    "34": {
      "General": "They set out from Jotbathah and camped at Abronah.",
      "Non-Denominational": "Thirtieth stage: Departed Jotbathah, camped at Abronah.",
      "Baptist": "Thirtieth journey: From Jotbathah to encampment at Ebronah.",
      "Catholic": "And they set out from Jotbathah and camped at Abronah.",
      "Methodist": "Stage 30: Depart Jotbathah, camp at Abronah.",
      "Lutheran": "Stage 30: Depart Jotbathah, camp at Ebronah."
    },
    "35": {
      "General": "They set out from Abronah and camped at Ezion-geber.",
      "Non-Denominational": "Thirty-first stage: Departed Abronah, camped at Ezion-geber (port city on the Red Sea).",
      "Baptist": "Thirty-first journey: From Ebronah to encampment at Ezion-gaber.",
      "Catholic": "And they set out from Abronah and camped at Ezion-geber.",
      "Methodist": "Stage 31: Depart Abronah, camp at Ezion-geber.",
      "Lutheran": "Stage 31: Depart Ebronah, camp at Ezion-gaber."
    },
    "36": {
      "General": "They set out from Ezion-geber and camped in the Wilderness of Zin, which is Kadesh.",
      "Non-Denominational": "Thirty-second stage: Departed Ezion-geber, camped in the Wilderness of Zin, identified as Kadesh (location of the spies' departure and subsequent rebellion).",
      "Baptist": "Thirty-second journey: From Ezion-gaber to encampment in the Wilderness of Zin, which is Kadesh.",
      "Catholic": "And they set out from Ezion-geber and camped in the wilderness of Zin (that is, Kadesh).",
      "Methodist": "Stage 32: Depart Ezion-geber, camp in Wilderness of Zin (Kadesh).",
      "Lutheran": "Stage 32: Depart Ezion-gaber, camp in Wilderness of Zin (Kadesh)."
    },
    "37": {
      "General": "They set out from Kadesh and camped at Mount Hor, on the edge of the land of Edom.",
      "Non-Denominational": "Thirty-third stage: Departed Kadesh, camped at Mount Hor (bordering Edom).",
      "Baptist": "Thirty-third journey: From Kadesh to encampment at Mount Hor, on the border of Edom.",
      "Catholic": "And they set out from Kadesh and camped at Mount Hor, on the edge of the land of Edom.",
      "Methodist": "Stage 33: Depart Kadesh, camp at Mount Hor (Edom border).",
      "Lutheran": "Stage 33: Depart Kadesh, camp at Mount Hor (edge of Edom)."
    },
    "38": {
      "General": "Aaron the priest went up Mount Hor at the command of the Lord and died there in the fortieth year after the Israelites came out of Egypt, on the first day of the fifth month.",
      "Non-Denominational": "Records the death of Aaron the priest on Mount Hor, occurring by God's command in the 40th year of the Exodus (1st day, 5th month).",
      "Baptist": "Notes Aaron's ascent of Mount Hor by the Lord's command and his death there, precisely dated to the 40th year, 5th month, 1st day of the Exodus.",
      "Catholic": "And Aaron the priest went up Mount Hor at the command of the Lord and died there, in the fortieth year after the people of Israel had come out of the land of Egypt, on the first day of the fifth month.",
      "Methodist": "Records Aaron the priest ascending Mount Hor by God's command and dying there in the 40th year after Exodus (1st day, 5th month).",
      "Lutheran": "Records Aaron going up Mount Hor by God's command and dying there (40th year, 5th month, 1st day post-Exodus)."
    },
    "39": {
      "General": "Aaron was 123 years old when he died on Mount Hor.",
      "Non-Denominational": "States Aaron's age at death: 123 years old.",
      "Baptist": "Gives Aaron's age at death as 123 years.",
      "Catholic": "Aaron was 123 years old when he died on Mount Hor.",
      "Methodist": "States Aaron was 123 years old when he died.",
      "Lutheran": "States Aaron's age at death: 123."
    },
    "40": {
      "General": "The Canaanite king of Arad, who lived in the Negev in the land of Canaan, heard that the Israelites were coming.",
      "Non-Denominational": "Mentions the king of Arad (a Canaanite in the Negev) becoming aware of Israel's approach (referencing an earlier battle in Num 21).",
      "Baptist": "Notes that the Canaanite king of Arad (dwelling in the southern region of Canaan) heard of Israel's advance.",
      "Catholic": "And the Canaanite, the king of Arad, who lived in the Negeb in the land of Canaan, heard of the coming of the people of Israel.",
      "Methodist": "Records the Canaanite king of Arad hearing of Israel's approach.",
      "Lutheran": "Notes the Canaanite king of Arad (in the south of Canaan) heard of Israel's coming."
    },
    "41": {
      "General": "They set out from Mount Hor and camped at Zalmonah.",
      "Non-Denominational": "Thirty-fourth stage: Departed Mount Hor, camped at Zalmonah.",
      "Baptist": "Thirty-fourth journey: From Mount Hor to encampment at Zalmonah.",
      "Catholic": "And they set out from Mount Hor and camped at Zalmonah.",
      "Methodist": "Stage 34: Depart Mount Hor, camp at Zalmonah.",
      "Lutheran": "Stage 34: Depart Mount Hor, camp at Zalmonah."
    },
    "42": {
      "General": "They set out from Zalmonah and camped at Punon.",
      "Non-Denominational": "Thirty-fifth stage: Departed Zalmonah, camped at Punon.",
      "Baptist": "Thirty-fifth journey: From Zalmonah to encampment at Punon.",
      "Catholic": "And they set out from Zalmonah and camped at Punon.",
      "Methodist": "Stage 35: Depart Zalmonah, camp at Punon.",
      "Lutheran": "Stage 35: Depart Zalmonah, camp at Punon."
    },
    "43": {
      "General": "They set out from Punon and camped at Oboth.",
      "Non-Denominational": "Thirty-sixth stage: Departed Punon, camped at Oboth.",
      "Baptist": "Thirty-sixth journey: From Punon to encampment at Oboth.",
      "Catholic": "And they set out from Punon and camped at Oboth.",
      "Methodist": "Stage 36: Depart Punon, camp at Oboth.",
      "Lutheran": "Stage 36: Depart Punon, camp at Oboth."
    },
    "44": {
      "General": "They set out from Oboth and camped at Iye-abarim, in the territory of Moab.",
      "Non-Denominational": "Thirty-seventh stage: Departed Oboth, camped at Iye-abarim (located on the border of Moab).",
      "Baptist": "Thirty-seventh journey: From Oboth to encampment at Ije-abarim, on the Moabite border.",
      "Catholic": "And they set out from Oboth and camped at Iye-abarim, in the territory of Moab.",
      "Methodist": "Stage 37: Depart Oboth, camp at Iye-abarim (Moab border).",
      "Lutheran": "Stage 37: Depart Oboth, camp at Ije-abarim (border of Moab)."
    },
    "45": {
      "General": "They set out from Iyim (Iye-abarim) and camped at Dibon-gad.",
      "Non-Denominational": "Thirty-eighth stage: Departed Iye-abarim, camped at Dibon-gad.",
      "Baptist": "Thirty-eighth journey: From Iim (Ije-abarim) to encampment at Dibon-gad.",
      "Catholic": "And they set out from Iyim and camped at Dibon-gad.",
      "Methodist": "Stage 38: Depart Iyim, camp at Dibon-gad.",
      "Lutheran": "Stage 38: Depart Iim, camp at Dibon-gad."
    },
    "46": {
      "General": "They set out from Dibon-gad and camped at Almon-diblathaim.",
      "Non-Denominational": "Thirty-ninth stage: Departed Dibon-gad, camped at Almon-diblathaim.",
      "Baptist": "Thirty-ninth journey: From Dibon-gad to encampment at Almon-diblathaim.",
      "Catholic": "And they set out from Dibon-gad and camped at Almon-diblathaim.",
      "Methodist": "Stage 39: Depart Dibon-gad, camp at Almon-diblathaim.",
      "Lutheran": "Stage 39: Depart Dibon-gad, camp at Almon-diblathaim."
    },
    "47": {
      "General": "They set out from Almon-diblathaim and camped in the mountains of Abarim, before Nebo.",
      "Non-Denominational": "Fortieth stage: Departed Almon-diblathaim, camped in the Abarim mountains, near Mount Nebo (where Moses would later view the land and die).",
      "Baptist": "Fortieth journey: From Almon-diblathaim to encampment in the mountains of Abarim, facing Nebo.",
      "Catholic": "And they set out from Almon-diblathaim and camped in the mountains of Abarim, before Nebo.",
      "Methodist": "Stage 40: Depart Almon-diblathaim, camp in Abarim mountains (before Nebo).",
      "Lutheran": "Stage 40: Depart Almon-diblathaim, camp in mountains of Abarim, before Nebo."
    },
    "48": {
      "General": "They set out from the mountains of Abarim and camped on the plains of Moab by the Jordan across from Jericho.",
      "Non-Denominational": "Forty-first stage: Departed Abarim mountains, camped in the plains of Moab along the Jordan River, opposite Jericho (the final encampment before crossing).",
      "Baptist": "Forty-first journey: From the Abarim mountains to encampment in the plains of Moab, by the Jordan near Jericho.",
      "Catholic": "And they set out from the mountains of Abarim and camped in the plains of Moab by the Jordan at Jericho;",
      "Methodist": "Stage 41: Depart Abarim mountains, camp on plains of Moab by Jordan (opposite Jericho).",
      "Lutheran": "Stage 41: Depart Abarim mountains, camp in plains of Moab by Jordan near Jericho."
    },
    "49": {
      "General": "They camped by the Jordan from Beth-jeshimoth as far as Abel-shittim in the plains of Moab.",
      "Non-Denominational": "Specifies the extent of their encampment in the plains of Moab: stretching from Beth-jeshimoth to Abel-shittim (place of the Baal-Peor incident).",
      "Baptist": "Details their encampment location by the Jordan: stretching from Beth-jesimoth to Abel-shittim in the plains of Moab.",
      "Catholic": "they camped by the Jordan from Beth-jeshimoth as far as Abel-shittim in the plains of Moab.",
      "Methodist": "Specifies their camp stretched along the Jordan from Beth-jeshimoth to Abel-shittim.",
      "Lutheran": "Specifies camp location by Jordan: from Beth-jesimoth to Abel-shittim in plains of Moab."
    },
    "50": {
      "General": "On the plains of Moab by the Jordan across from Jericho, the Lord spoke to Moses,",
      "Non-Denominational": "Location setting for the following commands: The plains of Moab, near the Jordan opposite Jericho. God speaks to Moses.",
      "Baptist": "Sets the scene for final instructions: In the plains of Moab by the Jordan near Jericho, the Lord commands Moses.",
      "Catholic": "And the Lord spoke to Moses in the plains of Moab by the Jordan at Jericho, saying,",
      "Methodist": "Location setting for God's commands to Moses: Plains of Moab near Jericho.",
      "Lutheran": "Location setting: Plains of Moab by Jordan near Jericho. The Lord speaks to Moses."
    },
    "51": {
      "General": "'Speak to the Israelites and say to them: When you cross the Jordan into the land of Canaan,'",
      "Non-Denominational": "God instructs Moses to relay commands to Israel regarding their actions upon entering Canaan.",
      "Baptist": "The Lord directs Moses to instruct the Israelites concerning their actions after crossing the Jordan into Canaan.",
      "Catholic": "'Speak to the people of Israel and say to them, When you pass over the Jordan into the land of Canaan,'",
      "Methodist": "God instructs Moses to tell the Israelites what to do upon crossing into Canaan.",
      "Lutheran": "God instructs Moses: Speak to Israel - When you cross Jordan into Canaan..."
    },
    "52": {
      "General": "'you must drive out all the inhabitants of the land before you, destroy all their figured stones (pictures), destroy all their molten images, and demolish (pluck down) all their high places.'",
      "Non-Denominational": "First command: Completely dispossess the current inhabitants. Destroy all their idolatrous objects (carved stones, cast idols) and places of worship (high places).",
      "Baptist": "Command 1: Drive out all inhabitants. Command 2: Destroy all their pictorial representations ('pictures'), molten images, and high places (pagan worship sites).",
      "Catholic": "'then you shall drive out all the inhabitants of the land from before you and destroy all their figured stones and destroy all their metal images and demolish all their high places.'",
      "Methodist": "Command: Drive out all inhabitants, destroy all their idols (figured stones, molten images), and demolish their high places.",
      "Lutheran": "Command (Law): Drive out all inhabitants, destroy all their figured stones/pictures, molten images, and high places."
    },
    "53": {
      "General": "'You shall take possession of (dispossess the inhabitants of) the land and settle in it, for I have given you the land to possess.'",
      "Non-Denominational": "Second command: Take possession of and settle the land, affirming that God has given it to them for this purpose.",
      "Baptist": "Command 3: Dispossess the inhabitants and dwell in the land, for God has given it to them to possess.",
      "Catholic": "'And you shall take possession of the land and settle in it, for I have given the land to you to possess it.'",
      "Methodist": "Command: Take possession of the land and settle there, because God has given it to them.",
      "Lutheran": "Command: Dispossess the inhabitants and dwell there, for God has given them the land to possess."
    },
    "54": {
      "General": "'You shall inherit the land by lot according to your clans. To a larger clan give a larger inheritance, and to a smaller clan give a smaller inheritance. Whatever place the lot falls for any man, that shall be his. You shall inherit according to the tribes of your fathers.'",
      "Non-Denominational": "Third command: Distribute the land inheritance by casting lots among the clans. Larger clans receive larger territories, smaller clans receive smaller ones. Allocation is by lot but organized according to ancestral tribes.",
      "Baptist": "Command 4: Divide the land for inheritance by lot according to families (clans). Apportion larger shares to larger groups and smaller shares to smaller groups. Each person's inheritance is determined by the lot, distributed according to ancestral tribes.",
      "Catholic": "'You shall inherit the land by lot according to your clans. To a large tribe you shall give a large inheritance, and to a small tribe you shall give a small inheritance. Wherever the lot falls for anyone, that shall be his. According to the tribes of your fathers you shall inherit.'",
      "Methodist": "Command: Divide the land by lot according to clans, giving larger portions to larger clans and smaller portions to smaller clans. Inherit according to ancestral tribes.",
      "Lutheran": "Command: Inherit the land by lot according to families. Give more to the more numerous, less to the fewer. Where the lot falls, that is theirs. Inherit according to paternal tribes."
    },
    "55": {
      "General": "'But if you do not drive out the inhabitants of the land from before you, then those whom you allow to remain shall be irritants (pricks) in your eyes and thorns in your sides, and they shall harass (vex) you in the land where you dwell.'",
      "Non-Denominational": "Warning: Failure to drive out the inhabitants will result in those remaining becoming constant irritants and sources of trouble ('pricks in eyes, thorns in sides'), vexing Israel within their own land.",
      "Baptist": "Stern Warning: If they fail to drive out the inhabitants, those remaining will become like sharp objects ('pricks') in their eyes and thorns in their sides, constantly troubling them in the land.",
      "Catholic": "'But if you do not drive out the inhabitants of the land from before you, then those of them whom you let remain shall be as barbs in your eyes and thorns in your sides, and they shall trouble you in the land where you dwell.'",
      "Methodist": "Warning: If they fail to drive out the inhabitants, those remaining will become like painful irritants ('pricks in eyes, thorns in sides') and trouble them in the land.",
      "Lutheran": "Warning (Law): If you don't drive out the inhabitants, those remaining will be pricks in your eyes and thorns in your sides, vexing you in the land."
    },
    "56": {
      "General": "'And I will do to you as I thought to do to them.'",
      "Non-Denominational": "Final consequence: If Israel fails in this command, God will inflict upon them the same judgment He intended for the Canaanite nations (i.e., dispossession from the land).",
      "Baptist": "Ultimate Consequence: God declares He will then inflict upon Israel the judgment He had intended to inflict upon the Canaanite nations.",
      "Catholic": "'And I will do to you as I thought to do to them.'",
      "Methodist": "Final Warning: God will then treat Israel as He intended to treat the Canaanite nations.",
      "Lutheran": "Final Warning (Law/Judgment): God will then do to Israel what He intended (thought) to do to the Canaanites."
    }
  }
}
