{
  "Summary": {
    "General": "This chapter details God's instructions to Moses concerning the specific geographical boundaries of the land of Canaan, the inheritance promised to the Israelites west of the Jordan River. It outlines the southern border starting from the Wilderness of Zin and the Dead Sea, the western border as the Mediterranean Sea ('the great sea'), the northern border involving Mount Hor and extending towards Hamath and Zedad, and the eastern border running down from Shepham, past Ain and the Sea of Chinnereth (Galilee), to the Jordan River and ending at the Dead Sea. Moses reiterates that this land is to be divided by lot among the nine and a half tribes who had not yet received their inheritance (Reuben, Gad, and half of Manasseh having already settled east of the Jordan). Finally, God appoints the leaders who will oversee this division: Eleazar the priest, Joshua son of Nun, and one designated prince (leader) from each of the nine and a half tribes.",
    "Non-Denominational": "Focuses on God's sovereignty and faithfulness in defining the precise inheritance He is giving Israel. The detailed boundaries underscore the reality and tangibility of the promise. The exclusion of the trans-Jordan tribes highlights their earlier choice. The appointment of leaders (Eleazar, Joshua, and tribal princes) demonstrates God's ordained structure for distributing the land fairly ('by lot') and establishing order within the community as they possess their God-given territory. It emphasizes God's meticulous planning and provision for His people.",
    "Baptist": "Emphasizes God's specific covenant promise being fulfilled through the delineation of Canaan's borders. The clear geographical limits represent the tangible inheritance God grants to the tribes west of the Jordan. The process of division by lot, overseen by appointed, godly leadership (Eleazar, Joshua, tribal princes), highlights God's sovereign control and desire for equitable distribution among His people. The mention of the tribes already settled east serves as a reminder of prior agreements and tribal distinctions within the larger nation.",
    "Catholic": "Views the chapter as detailing God's specific gift of the Promised Land, defining its sacred geography. The borders establish the territorial extent of the covenant inheritance west of the Jordan. The division by lot under the authority of the priest (Eleazar), the successor leader (Joshua), and tribal representatives signifies a divinely ordered and just process for distributing God's blessings. It foreshadows the Church's inheritance, though spiritual rather than physical, allocated through God's grace and structure.",
    "Methodist": "Highlights God's faithfulness in bringing Israel to the point of receiving their promised inheritance and providing clear instructions for its demarcation. The detailed borders signify God's gracious provision and intention for Israel's settlement. The appointment of leaders emphasizes the importance of responsible stewardship and organized community life in receiving and managing God's gifts. The division process reflects practical holiness and fairness in establishing the tribes within the land designated by God.",
    "Lutheran": "Focuses on the chapter as God's specific command (Law) defining the borders of the land Israel is to inherit west of the Jordan. This act demonstrates God's ordering of creation and His specific plan for Israel. The land is a gift, distributed by lot (acknowledging God's ultimate control) under designated authorities (Eleazar, Joshua, princes) established by God's command. The exclusion of the eastern tribes follows previous arrangements. It underscores God's sovereign authority in bestowing earthly blessings and establishing governance."
  },
  "Verses": {
    "1": {
      "General": "The Lord spoke to Moses, initiating the instructions that follow.",
      "Non-Denominational": "Records the divine origin of the following commands regarding the land's boundaries.",
      "Baptist": "States that the subsequent instructions came directly from the Lord to Moses.",
      "Catholic": "Indicates divine communication from the Lord to Moses, setting the stage for the commands.",
      "Methodist": "Notes the beginning of a divine revelation from the Lord to Moses.",
      "Lutheran": "Records that the Lord spoke to Moses, giving divine authority to the following words."
    },
    "2": {
      "General": "Command the Israelites: When you enter the land of Canaan, this specific land with its defined borders is what will fall to you as your inheritance.",
      "Non-Denominational": "God instructs Moses to tell Israel that upon entering Canaan, the land described is their specific, divinely allocated inheritance.",
      "Baptist": "The Lord commands Moses to inform Israel that the land of Canaan, as defined, is their designated inheritance.",
      "Catholic": "God directs Moses to command the Israelites that the land of Canaan, within specified boundaries, is their inheritance.",
      "Methodist": "God instructs Moses to tell the Israelites that the land of Canaan, as defined, is their promised inheritance upon entry.",
      "Lutheran": "The Lord commands Moses to tell Israel: Upon entering Canaan, this land defined by its borders is your inheritance."
    },
    "3": {
      "General": "Your southern region shall extend from the Wilderness of Zin along the border of Edom, with the southern boundary starting eastward from the edge of the Salt Sea (Dead Sea).",
      "Non-Denominational": "Defines the southern boundary: starting from the Dead Sea's eastern edge, running along Edom adjacent to the Zin wilderness.",
      "Baptist": "Specifies the southern border starting at the eastern end of the Salt Sea, running alongside Edom by the Wilderness of Zin.",
      "Catholic": "Describes the southern border originating from the Wilderness of Zin near Edom, starting eastward from the end of the Salt Sea.",
      "Methodist": "Outlines the southern boundary: beginning east of the Salt Sea, adjacent to Edom via the Wilderness of Zin.",
      "Lutheran": "Defines the southern territory: from the Zin wilderness alongside Edom, the border starting east from the Salt Sea's edge."
    },
    "4": {
      "General": "Your border shall turn south of the ascent of Akrabbim, pass through Zin, continue south of Kadesh-barnea, go on to Hazar-addar, and pass along to Azmon.",
      "Non-Denominational": "Details the course of the southern border: turning south of Akrabbim pass, through Zin, south of Kadesh-barnea, to Hazar-addar, and then to Azmon.",
      "Baptist": "Traces the southern border's path: turning south from Akrabbim ascent, passing Zin, going south of Kadesh-barnea towards Hazar-addar and Azmon.",
      "Catholic": "Further defines the southern border's course: turning from the south towards the ascent of Akrabbim, passing Zin, south of Kadesh-barnea, to Hazar-addar, and on to Azmon.",
      "Methodist": "Describes the southern border's route: turning south of Akrabbim ascent, via Zin, south of Kadesh-barnea, continuing to Hazar-addar and Azmon.",
      "Lutheran": "Specifies the southern border's path: turning south to Akrabbim ascent, passing Zin, south of Kadesh-barnea, to Hazar-addar, then Azmon."
    },
    "5": {
      "General": "From Azmon, the border shall turn (fetch a compass) towards the River of Egypt (likely Wadi el-Arish), and its termination point shall be at the Mediterranean Sea.",
      "Non-Denominational": "Completes the southern border description: turning from Azmon towards the Brook of Egypt and ending at the Mediterranean Sea.",
      "Baptist": "Continues the southern border: turning from Azmon to the River of Egypt, ending at the Mediterranean Sea.",
      "Catholic": "The southern border concludes by turning from Azmon towards the Wadi of Egypt, terminating at the Sea.",
      "Methodist": "Finalizes the southern border: turning from Azmon to the River of Egypt, ending at the Mediterranean Sea.",
      "Lutheran": "Concludes the southern border: turning from Azmon to the river of Egypt, ending at the Sea."
    },
    "6": {
      "General": "For the western border, you shall have the Great Sea (Mediterranean Sea) and its coastline; this will be your western boundary.",
      "Non-Denominational": "Establishes the western border simply as the Mediterranean Sea and its coast.",
      "Baptist": "Defines the western border: the Great Sea (Mediterranean) and its coast.",
      "Catholic": "Sets the western border as the Great Sea (Mediterranean) and its coast.",
      "Methodist": "Identifies the western border: the Mediterranean Sea ('Great Sea') and its shoreline.",
      "Lutheran": "Defines the western border: the Great Sea (Mediterranean) serves as the boundary."
    },
    "7": {
      "General": "This shall be your northern border: Draw a line for yourselves from the Great Sea to Mount Hor (distinct from Aaron's Mount Hor).",
      "Non-Denominational": "Begins defining the northern border: starting from the Mediterranean Sea, extending to a specific Mount Hor (in the north).",
      "Baptist": "Instructs on marking the northern border starting from the Great Sea to Mount Hor (a northern mountain).",
      "Catholic": "Specifies the start of the northern border: from the Great Sea, a line is to be drawn to Mount Hor.",
      "Methodist": "Begins the northern border definition: from the Mediterranean Sea to Mount Hor.",
      "Lutheran": "Defines the starting point of the northern border: from the Great Sea mark out Mount Hor."
    },
    "8": {
      "General": "From Mount Hor, you shall mark out your border to the entrance of Hamath, and the boundary shall extend to Zedad.",
      "Non-Denominational": "Continues the northern border: from Mount Hor towards Lebo-hamath, extending to Zedad.",
      "Baptist": "Traces the northern border from Mount Hor towards the entrance of Hamath, reaching Zedad.",
      "Catholic": "The northern border continues from Mount Hor towards the entrance of Hamath, terminating at Zedad.",
      "Methodist": "Describes the northern border's path: from Mount Hor towards the entrance of Hamath, ending at Zedad.",
      "Lutheran": "Continues the northern border: from Mount Hor mark the border towards Lebo-hamath, ending at Zedad."
    },
    "9": {
      "General": "The border shall then go on to Ziphron, and its termination point shall be at Hazar-enan. This constitutes your northern border.",
      "Non-Denominational": "Completes the northern border description: extending from Zedad to Ziphron, ending at Hazar-enan.",
      "Baptist": "Finalizes the northern border: continuing to Ziphron and ending at Hazar-enan.",
      "Catholic": "The northern border concludes by extending to Ziphron and terminating at Hazar-enan.",
      "Methodist": "Finalizes the northern border: extending to Ziphron and ending at Hazar-enan.",
      "Lutheran": "Concludes the northern border: extending to Ziphron, ending at Hazar-enan."
    },
    "10": {
      "General": "You shall mark out your eastern border from Hazar-enan to Shepham.",
      "Non-Denominational": "Begins defining the eastern border: starting from Hazar-enan down to Shepham.",
      "Baptist": "Instructs on marking the eastern border from Hazar-enan to Shepham.",
      "Catholic": "Specifies the start of the eastern border: from Hazar-enan, a line is to be drawn to Shepham.",
      "Methodist": "Begins the eastern border definition: from Hazar-enan down to Shepham.",
      "Lutheran": "Defines the starting point of the eastern border: mark from Hazar-enan to Shepham."
    },
    "11": {
      "General": "The border shall go down from Shepham to Riblah on the east side of Ain; then the border shall descend and reach the eastern slope (side/shoulder) of the Sea of Chinnereth (Sea of Galilee).",
      "Non-Denominational": "Details the eastern border's course: south from Shepham to Riblah (east of Ain), then down to the eastern shore of the Sea of Galilee.",
      "Baptist": "Traces the eastern border downwards from Shepham to Riblah (east of Ain), then descending to the eastern edge of the Sea of Chinnereth.",
      "Catholic": "Describes the eastern border's descent from Shepham to Riblah (east of Ain), continuing down to the eastern shore of the Sea of Chinnereth.",
      "Methodist": "Describes the eastern border's path: down from Shepham to Riblah (east of Ain), descending further to the eastern side of the Sea of Chinnereth.",
      "Lutheran": "Specifies the eastern border's path: down from Shepham to Riblah (east of Ain), descending to the eastern slope of the Sea of Chinnereth."
    },
    "12": {
      "General": "The border shall then go down along the Jordan River, and its termination point shall be at the Salt Sea (Dead Sea). This defines the land within its surrounding borders.",
      "Non-Denominational": "Completes the eastern border: following the Jordan River southwards to the Dead Sea. This encircles the promised land.",
      "Baptist": "Finalizes the eastern border: following the Jordan River down to the Salt Sea. This describes the complete land boundaries.",
      "Catholic": "The eastern border concludes by following the Jordan River down to the Salt Sea, encompassing the defined land.",
      "Methodist": "Finalizes the eastern border: following the Jordan down to the Salt Sea. This marks the extent of the land.",
      "Lutheran": "Concludes the eastern border: down the Jordan River, ending at the Salt Sea. This defines the land within all its borders."
    },
    "13": {
      "General": "Moses commanded the Israelites: This is the land you shall inherit by lot, which the Lord has commanded to be given to the nine and a half tribes.",
      "Non-Denominational": "Moses relays God's command: This defined land is to be distributed by lot as an inheritance for the 9.5 tribes settling west of the Jordan.",
      "Baptist": "Moses instructs Israel that this specific land is their inheritance, to be divided by lot as God commanded for the 9.5 tribes.",
      "Catholic": "Moses commands the Israelites, reiterating that this is the land to be inherited by lot, designated by God for the nine and a half tribes.",
      "Methodist": "Moses instructs the people: This defined territory is the inheritance God commanded to be given by lot to the 9.5 tribes.",
      "Lutheran": "Moses commands Israel: This is the land to inherit by lot, which the Lord commanded for the nine and a half tribes."
    },
    "14": {
      "General": "Because the tribe of Reuben (by their patriarchal families), the tribe of Gad (by their patriarchal families), and the half-tribe of Manasseh have already received their inheritance.",
      "Non-Denominational": "Explains why only 9.5 tribes are mentioned: Reuben, Gad, and half of Manasseh have already received their allotted land.",
      "Baptist": "Provides the reason: Reuben, Gad, and half of Manasseh (according to their family lines) have already received their inheritance.",
      "Catholic": "Clarifies that the tribes of Reuben, Gad, and the half-tribe of Manasseh have already received their inheritance according to their ancestral houses.",
      "Methodist": "States the reason for 9.5 tribes: Reuben, Gad, and half of Manasseh have previously received their inheritance.",
      "Lutheran": "Explains the 9.5 tribes: Reuben, Gad (by father's houses), and the half-tribe of Manasseh already received their inheritance."
    },
    "15": {
      "General": "These two and a half tribes have received their inheritance on the east side of the Jordan River, near Jericho, towards the sunrise (eastward).",
      "Non-Denominational": "Specifies the location of the inheritance for the 2.5 tribes: east of the Jordan, opposite Jericho, in the eastern direction.",
      "Baptist": "Identifies the location of the 2.5 tribes' inheritance: east of the Jordan near Jericho, eastward.",
      "Catholic": "Confirms the location of the inheritance for the two and a half tribes: east of the Jordan, near Jericho, towards the east.",
      "Methodist": "Specifies the location of the 2.5 tribes' inheritance: east of the Jordan near Jericho.",
      "Lutheran": "Locates the 2.5 tribes' inheritance: east ('toward the sunrising') of the Jordan near Jericho."
    },
    "16": {
      "General": "The Lord spoke again to Moses, initiating further instructions.",
      "Non-Denominational": "Indicates another divine communication to Moses, preparing for the next set of instructions.",
      "Baptist": "States that the Lord communicated further instructions to Moses.",
      "Catholic": "Records another instance of the Lord speaking to Moses.",
      "Methodist": "Notes the continuation of God's instructions to Moses.",
      "Lutheran": "Records that the Lord spoke to Moses again."
    },
    "17": {
      "General": "These are the names of the men who shall divide the land inheritance among you: Eleazar the priest and Joshua son of Nun.",
      "Non-Denominational": "Appoints the primary leaders responsible for overseeing the land division: Eleazar (religious authority) and Joshua (civil/military leader).",
      "Baptist": "Names the chief administrators for dividing the land: Eleazar the priest and Joshua.",
      "Catholic": "Designates the principal figures responsible for dividing the land: Eleazar the priest and Joshua son of Nun.",
      "Methodist": "Identifies the key leaders appointed to divide the land: Eleazar the priest and Joshua.",
      "Lutheran": "Names the men who will divide the land: Eleazar the priest and Joshua son of Nun."
    },
    "18": {
      "General": "And you shall also take one leader (prince) from each tribe to assist in dividing the land by inheritance.",
      "Non-Denominational": "Adds the requirement of including one leader from each participating tribe in the land division process.",
      "Baptist": "Commands the appointment of one leader ('prince') from each tribe to participate in the inheritance division.",
      "Catholic": "Instructs that one leader (prince) from each tribe must be selected to participate in the division of the inheritance.",
      "Methodist": "Requires one leader from each tribe to be involved in the process of dividing the land.",
      "Lutheran": "Commands taking one prince from each tribe to divide the land by inheritance."
    },
    "19": {
      "General": "These are the names of the appointed men: From the tribe of Judah, Caleb son of Jephunneh.",
      "Non-Denominational": "Begins listing the tribal leaders, starting with Caleb representing Judah.",
      "Baptist": "Names the representative leader for Judah: Caleb son of Jephunneh.",
      "Catholic": "Identifies the leader for the tribe of Judah: Caleb son of Jephunneh.",
      "Methodist": "Names the leader for Judah: Caleb son of Jephunneh.",
      "Lutheran": "Names the men: For Judah, Caleb son of Jephunneh."
    },
    "20": {
      "General": "From the tribe of the Simeonites, Shemuel son of Ammihud.",
      "Non-Denominational": "Names Shemuel son of Ammihud as the representative for the tribe of Simeon.",
      "Baptist": "Names the representative leader for Simeon: Shemuel son of Ammihud.",
      "Catholic": "Identifies the leader for the tribe of Simeon: Shemuel son of Ammihud.",
      "Methodist": "Names the leader for Simeon: Shemuel son of Ammihud.",
      "Lutheran": "For Simeon, Shemuel son of Ammihud."
    },
    "21": {
      "General": "From the tribe of Benjamin, Elidad son of Chislon.",
      "Non-Denominational": "Names Elidad son of Chislon as the representative for the tribe of Benjamin.",
      "Baptist": "Names the representative leader for Benjamin: Elidad son of Chislon.",
      "Catholic": "Identifies the leader for the tribe of Benjamin: Elidad son of Chislon.",
      "Methodist": "Names the leader for Benjamin: Elidad son of Chislon.",
      "Lutheran": "For Benjamin, Elidad son of Chislon."
    },
    "22": {
      "General": "From the tribe of the Danites, the leader Bukki son of Jogli.",
      "Non-Denominational": "Names Bukki son of Jogli as the chief representing the tribe of Dan.",
      "Baptist": "Names the representative leader ('prince') for Dan: Bukki son of Jogli.",
      "Catholic": "Identifies the leader for the tribe of Dan: Bukki son of Jogli.",
      "Methodist": "Names the leader for Dan: Bukki son of Jogli.",
      "Lutheran": "For the tribe of Dan, the prince Bukki son of Jogli."
    },
    "23": {
      "General": "From the sons of Joseph: for the tribe of the Manassites, the leader Hanniel son of Ephod.",
      "Non-Denominational": "Names Hanniel son of Ephod as the chief representing the half-tribe of Manasseh (west of Jordan).",
      "Baptist": "Names the representative leader ('prince') for the Manassite portion of Joseph's sons: Hanniel son of Ephod.",
      "Catholic": "Identifies the leader for the tribe of Manasseh (from the sons of Joseph): Hanniel son of Ephod.",
      "Methodist": "Names the leader for Manasseh (Joseph's son): Hanniel son of Ephod.",
      "Lutheran": "For the sons of Joseph: for Manasseh, the prince Hanniel son of Ephod."
    },
    "24": {
      "General": "And from the tribe of the Ephraimites, the leader Kemuel son of Shiphtan.",
      "Non-Denominational": "Names Kemuel son of Shiphtan as the chief representing the tribe of Ephraim.",
      "Baptist": "Names the representative leader ('prince') for Ephraim: Kemuel son of Shiphtan.",
      "Catholic": "Identifies the leader for the tribe of Ephraim: Kemuel son of Shiphtan.",
      "Methodist": "Names the leader for Ephraim: Kemuel son of Shiphtan.",
      "Lutheran": "For the tribe of Ephraim, the prince Kemuel son of Shiphtan."
    },
    "25": {
      "General": "From the tribe of the Zebulunites, the leader Elizaphan son of Parnach.",
      "Non-Denominational": "Names Elizaphan son of Parnach as the chief representing the tribe of Zebulun.",
      "Baptist": "Names the representative leader ('prince') for Zebulun: Elizaphan son of Parnach.",
      "Catholic": "Identifies the leader for the tribe of Zebulun: Elizaphan son of Parnach.",
      "Methodist": "Names the leader for Zebulun: Elizaphan son of Parnach.",
      "Lutheran": "For the tribe of Zebulun, the prince Elizaphan son of Parnach."
    },
    "26": {
      "General": "From the tribe of the Issacharites, the leader Paltiel son of Azzan.",
      "Non-Denominational": "Names Paltiel son of Azzan as the chief representing the tribe of Issachar.",
      "Baptist": "Names the representative leader ('prince') for Issachar: Paltiel son of Azzan.",
      "Catholic": "Identifies the leader for the tribe of Issachar: Paltiel son of Azzan.",
      "Methodist": "Names the leader for Issachar: Paltiel son of Azzan.",
      "Lutheran": "For the tribe of Issachar, the prince Paltiel son of Azzan."
    },
    "27": {
      "General": "From the tribe of the Asherites, the leader Ahihud son of Shelomi.",
      "Non-Denominational": "Names Ahihud son of Shelomi as the chief representing the tribe of Asher.",
      "Baptist": "Names the representative leader ('prince') for Asher: Ahihud son of Shelomi.",
      "Catholic": "Identifies the leader for the tribe of Asher: Ahihud son of Shelomi.",
      "Methodist": "Names the leader for Asher: Ahihud son of Shelomi.",
      "Lutheran": "For the tribe of Asher, the prince Ahihud son of Shelomi."
    },
    "28": {
      "General": "From the tribe of the Naphtalites, the leader Pedahel son of Ammihud.",
      "Non-Denominational": "Names Pedahel son of Ammihud as the chief representing the tribe of Naphtali.",
      "Baptist": "Names the representative leader ('prince') for Naphtali: Pedahel son of Ammihud.",
      "Catholic": "Identifies the leader for the tribe of Naphtali: Pedahel son of Ammihud.",
      "Methodist": "Names the leader for Naphtali: Pedahel son of Ammihud.",
      "Lutheran": "For the tribe of Naphtali, the prince Pedahel son of Ammihud."
    },
    "29": {
      "General": "These are the men whom the Lord commanded to divide the inheritance among the Israelites in the land of Canaan.",
      "Non-Denominational": "Concludes the list, confirming these appointed leaders are those commanded by God to oversee the land distribution in Canaan.",
      "Baptist": "Confirms that these named individuals were specifically commanded by the Lord to divide Canaan's inheritance for Israel.",
      "Catholic": "Reiterates that these are the men commanded by the Lord to apportion the inheritance to the Israelites within Canaan.",
      "Methodist": "Confirms these are the leaders God commanded to divide the inheritance for the Israelites in Canaan.",
      "Lutheran": "Confirms these are the men the Lord commanded to divide the inheritance for Israel in Canaan."
    }
  }
}
