{
  "Summary": {
    "General": "This chapter addresses provisions for the Levites and laws concerning bloodshed. First, God commands Moses to instruct the Israelites to allocate 48 cities from their tribal inheritances for the Levites to dwell in, complete with surrounding pasturelands (suburbs) for their livestock. These cities are to be distributed proportionally among the tribes. Six of these Levitical cities are designated as 'cities of refuge.' Second, the chapter details the purpose and rules of these cities of refuge. They are safe havens for anyone who kills a person unintentionally ('at unawares' or accidentally). Three cities are located east of the Jordan and three within Canaan proper, accessible to Israelites and resident foreigners. A person accused of accidental killing can flee there to escape the 'avenger of blood' (a kinsman seeking retribution) until they can stand trial before the congregation. The chapter distinguishes between intentional murder (using weapons, striking with hatred or enmity) and accidental killing (sudden thrust without enmity, unintentional casting of an object/stone). Murderers must be put to death by the avenger of blood, based on the testimony of multiple witnesses; no ransom is acceptable. Those who killed accidentally must remain in the city of refuge until the death of the current high priest; leaving prematurely forfeits their protection. Finally, the chapter stresses the importance of these laws for maintaining justice and preventing the land from being polluted by unatoned bloodshed, emphasizing that God Himself dwells among Israel in the land.",
    "Non-Denominational": "Focuses on God's provision for the Levites (who had no tribal land inheritance) through designated cities and pasturelands, ensuring their support and integration throughout Israel. It highlights God's justice and mercy through the institution of cities of refuge, protecting the unintentional killer from immediate vengeance while ensuring murderers face capital punishment. The distinction between intentional and unintentional killing emphasizes personal responsibility and the sanctity of life. The requirement to stay until the high priest's death symbolizes a form of temporary exile/atonement. The final verses underscore the need for purity in the land where God dwells, linking justice with God's presence.",
    "Baptist": "Emphasizes God's care for the Levites, providing for their sustenance and dwelling through cities given by the other tribes. It stresses the establishment of justice through the cities of refuge, balancing the need for retribution for murder (capital punishment required, no ransom) with mercy for accidental killing. The judicial process before the congregation ensures fairness. The distinction between murder and manslaughter is crucial. The high priest's death acting as a release points towards the finality needed for reconciliation. The chapter underscores God's holiness, requiring the land He inhabits to be kept free from the defilement of unpunished bloodshed.",
    "Catholic": "Views the provision for the Levites' cities as God's plan for supporting the priestly tribe dedicated to sacred service throughout the land. The cities of refuge are seen as an institution demonstrating God's mercy and justice, providing sanctuary for the unintentionally culpable while upholding the grave consequence (death penalty) for murder, reflecting the sanctity of human life created by God. The role of the congregation in judgment and the symbolism of the high priest's death (potentially prefiguring Christ's role) are significant. The final warning against polluting the land highlights the sacredness of the Promised Land as God's dwelling place, requiring moral purity.",
    "Methodist": "Highlights God's practical provision for the Levites, ensuring their needs are met through designated cities and lands. It emphasizes the moral and judicial framework established through the cities of refuge, showcasing God's concern for both justice against murderers and compassion for those who kill accidentally. The process stresses community responsibility (congregation's judgment) and personal accountability. The high priest's death as a condition for release points to the seriousness of taking a life, even accidentally. The chapter connects maintaining justice and the sanctity of life directly to the holiness required because of God's presence dwelling in the land.",
    "Lutheran": "Focuses on God's commands (Law) regarding the Levites' cities as part of His ordering of Israelite society and provision for the priestly tribe. The cities of refuge and the laws distinguishing murder from accidental killing represent God's Law concerning justice and the sanctity of life. Capital punishment is mandated for murder (based on witness testimony, no satisfaction/ransom allowed), while refuge is provided for the unintentional killer under specific conditions (trial, confinement until the high priest's death). This system upholds God's righteous judgment against sin (murder) while providing a specific, limited means of dealing with accidental death. The final verses emphasize that failure to uphold this justice defiles the land where God dwells, underscoring the severity of breaking God's Law."
  },
  "Verses": {
    "1": {
      "General": "The Lord spoke to Moses in the plains of Moab by the Jordan near Jericho, continuing His instructions.",
      "Non-Denominational": "Records the location and divine origin of the laws regarding Levitical cities and cities of refuge.",
      "Baptist": "States that these instructions were given by the Lord to Moses in the plains of Moab.",
      "Catholic": "Indicates the setting (plains of Moab) and divine source (the Lord) of the following commands to Moses.",
      "Methodist": "Notes the context: God speaking to Moses in the plains of Moab near the Jordan.",
      "Lutheran": "Records the location (plains of Moab) where the Lord spoke these commands to Moses."
    },
    "2": {
      "General": "Command the Israelites to give the Levites, from their own inherited possessions, cities to live in, along with surrounding pasturelands (suburbs).",
      "Non-Denominational": "God instructs that the Levites, having no land inheritance, are to be provided with cities and pasturelands by the other tribes.",
      "Baptist": "The Lord commands that the Israelites must provide the Levites with cities and surrounding suburbs from their own tribal inheritances.",
      "Catholic": "God directs the Israelites to allocate cities from their inheritance for the Levites to inhabit, including adjacent pasturelands.",
      "Methodist": "Instructs the Israelites to provide cities and surrounding common lands for the Levites from their own possessions.",
      "Lutheran": "The Lord commands Israel to give the Levites cities to dwell in and suburbs around them from their inheritance."
    },
    "3": {
      "General": "The Levites shall have these cities to live in, and the surrounding pasturelands shall be for their cattle, their property (goods), and all their animals.",
      "Non-Denominational": "Specifies the purpose of the cities (dwelling) and pasturelands (supporting livestock and property) for the Levites.",
      "Baptist": "Clarifies the use of the allocated areas: cities for dwelling, suburbs for their livestock and possessions.",
      "Catholic": "States the purpose of the cities (habitation) and the pasturelands (for livestock and possessions) given to the Levites.",
      "Methodist": "Explains the function: cities for living, pasturelands for their cattle, goods, and animals.",
      "Lutheran": "Specifies the use: cities for dwelling, suburbs for their cattle, goods, and animals."
    },
    "4": {
      "General": "The pasturelands (suburbs) given to the Levites shall extend outwards from the city wall for a distance of one thousand cubits all around.",
      "Non-Denominational": "Defines the initial measurement for the pastureland: 1000 cubits outward from the city wall in every direction.",
      "Baptist": "Specifies the dimensions of the immediate suburbs: extending 1000 cubits outward from the city wall on all sides.",
      "Catholic": "States the first measure of the pasturelands: 1000 cubits extending outward from the city wall all around.",
      "Methodist": "Gives the measurement for the pastureland directly around the city: 1000 cubits from the wall outward.",
      "Lutheran": "Specifies the extent of the suburbs: 1000 cubits outward from the city wall all around."
    },
    "5": {
      "General": "You shall measure outside the city: two thousand cubits on the east side, two thousand cubits on the south side, two thousand cubits on the west side, and two thousand cubits on the north side, with the city in the center. This total area shall be their city pasturelands.",
      "Non-Denominational": "Defines the larger area allocated for pastureland: measured 2000 cubits in each cardinal direction from a central point outside the city, encompassing the initial 1000 cubits.",
      "Baptist": "Details the larger measurement for the suburbs: 2000 cubits measured externally on each side (east, south, west, north), with the city at the center.",
      "Catholic": "Describes the overall dimensions of the pasturelands: measuring 2000 cubits on each side (east, south, west, north) outside the city, with the city itself in the middle.",
      "Methodist": "Specifies the full extent of the pasturelands: measured 2000 cubits outward on each of the four sides, centered on the city.",
      "Lutheran": "Commands measuring 2000 cubits outward on each side (E, S, W, N) from outside the city, city in the middle; this is the cities' suburbs."
    },
    "6": {
      "General": "Among the cities given to the Levites, you shall designate six as cities of refuge, where someone who has killed a person (manslayer) may flee. In addition to these six, you shall give forty-two other cities.",
      "Non-Denominational": "Introduces the concept of cities of refuge: six specific Levitical cities designated for manslayers to flee to, alongside 42 other Levitical cities.",
      "Baptist": "Specifies that six of the Levitical cities must be designated cities of refuge for manslayers, with 42 additional cities allocated.",
      "Catholic": "Designates six of the Levitical cities as cities of refuge for manslayers, supplementing these with forty-two other cities.",
      "Methodist": "Mandates that six Levitical cities serve as cities of refuge for those who kill someone, plus 42 other cities.",
      "Lutheran": "Commands that six of the Levitical cities be cities of refuge for the manslayer, adding 42 more cities to them."
    },
    "7": {
      "General": "Therefore, the total number of cities you shall give to the Levites is forty-eight, provided along with their surrounding pasturelands.",
      "Non-Denominational": "States the total number of Levitical cities: 48 (6 refuge + 42 others), including their associated pasturelands.",
      "Baptist": "Summarizes the total count of Levitical cities: 48, each with its suburbs.",
      "Catholic": "Confirms the total number of cities given to the Levites as forty-eight, including their pasturelands.",
      "Methodist": "Gives the total number of cities for the Levites: 48, with their pasturelands included.",
      "Lutheran": "Specifies the total number of cities for Levites: 48, including their suburbs."
    },
    "8": {
      "General": "These cities shall be given from the possessions of the Israelites. From tribes with large inheritances, give many cities; from tribes with small inheritances, give few. Each tribe shall contribute cities to the Levites in proportion to the inheritance they receive.",
      "Non-Denominational": "Mandates proportional contribution: tribes with more land give more Levitical cities, those with less land give fewer, ensuring fairness.",
      "Baptist": "Requires that the cities given come from Israel's possessions, allocated proportionally: more from larger tribes, fewer from smaller tribes.",
      "Catholic": "Instructs that the cities come from Israelite possessions, with contributions proportional to each tribe's inheritance (more from large tribes, fewer from small).",
      "Methodist": "Stipulates that cities are given from Israelite holdings, proportionally based on the size of each tribe's inheritance.",
      "Lutheran": "Commands that cities be given from Israel's possession, proportionally: many from the numerous, few from the fewer, according to their inheritance."
    },
    "9": {
      "General": "The Lord spoke again to Moses, giving further instructions.",
      "Non-Denominational": "Indicates the start of a new section of divine commands, focusing specifically on the cities of refuge.",
      "Baptist": "Records the Lord giving additional instructions to Moses.",
      "Catholic": "Notes another divine communication from the Lord to Moses.",
      "Methodist": "Signals further instructions from God to Moses.",
      "Lutheran": "Records that the Lord spoke to Moses again, introducing the next set of laws."
    },
    "10": {
      "General": "Speak to the Israelites and tell them: When you have crossed the Jordan River into the land of Canaan,",
      "Non-Denominational": "Sets the context for the following laws: they apply upon entering the Promised Land of Canaan.",
      "Baptist": "Directs Moses to instruct Israel regarding actions to be taken after entering Canaan.",
      "Catholic": "Instructs Moses to address the Israelites concerning regulations upon entering Canaan.",
      "Methodist": "Tells Moses to instruct the Israelites about what to do once they cross into Canaan.",
      "Lutheran": "Commands Moses to tell Israel: When you cross the Jordan into Canaan..."
    },
    "11": {
      "General": "Then you shall select cities to be designated as cities of refuge for yourselves, so that anyone who kills a person accidentally (at unawares) may flee there.",
      "Non-Denominational": "Commands the designation of cities of refuge specifically for those who kill someone unintentionally.",
      "Baptist": "Instructs the Israelites to appoint specific cities as refuge cities, providing sanctuary for those who kill unintentionally.",
      "Catholic": "Mandates the appointment of cities of refuge for those who kill someone accidentally (without malice).",
      "Methodist": "Commands the selection of cities of refuge for those who kill someone accidentally.",
      "Lutheran": "Commands them to appoint cities of refuge for the slayer who kills someone unintentionally ('at unawares')."
    },
    "12": {
      "General": "These cities shall serve as a refuge from the avenger (of blood), ensuring that the manslayer does not die before standing trial before the congregation.",
      "Non-Denominational": "Explains the primary purpose: protection from the 'avenger of blood' until a formal judgment by the community can occur.",
      "Baptist": "Defines the function of these cities: refuge from the avenger, preventing death before trial by the congregation.",
      "Catholic": "Specifies the purpose of refuge cities: protection from the kinsman redeemer (avenger) until judgment by the assembly.",
      "Methodist": "Clarifies the role of refuge cities: protection from the avenger until the accused can face judgment by the community.",
      "Lutheran": "States the purpose: refuge from the avenger, so the manslayer doesn't die before facing judgment by the congregation."
    },
    "13": {
      "General": "Of the cities you provide, six shall be designated for refuge.",
      "Non-Denominational": "Reiterates the number of cities designated specifically for refuge: six.",
      "Baptist": "Confirms the number of refuge cities required: six.",
      "Catholic": "Specifies the number of refuge cities: six.",
      "Methodist": "States the number of refuge cities to be established: six.",
      "Lutheran": "Reiterates the number of refuge cities: six."
    },
    "14": {
      "General": "You shall provide three cities east of the Jordan River and three cities in the land of Canaan; these shall be the cities of refuge.",
      "Non-Denominational": "Specifies the geographical distribution: three refuge cities east of the Jordan and three within Canaan.",
      "Baptist": "Details the locations: three cities east of the Jordan and three in Canaan proper.",
      "Catholic": "Mandates the placement of the refuge cities: three east of the Jordan and three within Canaan.",
      "Methodist": "Dictates the locations: three cities east of Jordan, three within Canaan.",
      "Lutheran": "Specifies location: three cities east of Jordan, three cities in Canaan."
    },
    "15": {
      "General": "These six cities shall serve as a refuge for the Israelites, as well as for the foreigner and the temporary resident (sojourner) among them, so that anyone who kills a person unintentionally may flee there.",
      "Non-Denominational": "Extends the protection of the cities of refuge to Israelites, resident aliens, and temporary visitors alike, for cases of unintentional killing.",
      "Baptist": "Declares the availability of these six refuge cities to Israelites, strangers, and sojourners who kill unintentionally.",
      "Catholic": "Specifies that refuge is available in these six cities for Israelites, resident aliens (strangers), and temporary visitors (sojourners) who kill unintentionally.",
      "Methodist": "Makes clear that refuge is available to Israelites, foreigners, and sojourners among them who kill someone unintentionally.",
      "Lutheran": "States who can use the refuge: Israelites, strangers, and sojourners who kill someone unintentionally."
    },
    "16": {
      "General": "However, if someone strikes another with an iron object, causing death, that person is a murderer; the murderer must certainly be put to death.",
      "Non-Denominational": "Defines the first condition for murder: killing with an iron implement. This requires the death penalty.",
      "Baptist": "Establishes a criterion for murder: killing with an iron instrument. The penalty is mandatory death.",
      "Catholic": "Identifies killing with an iron instrument as murder, requiring the death penalty for the murderer.",
      "Methodist": "Defines killing with an iron object as murder, mandating the death penalty.",
      "Lutheran": "Defines murder (requiring death penalty): striking with an iron instrument causing death."
    },
    "17": {
      "General": "And if someone strikes another with a stone capable of causing death (throwing a stone), and death results, that person is a murderer; the murderer must certainly be put to death.",
      "Non-Denominational": "Defines the second condition for murder: killing by striking with a stone large enough to be lethal. Requires the death penalty.",
      "Baptist": "Establishes another criterion for murder: killing by striking with a lethal stone. The penalty is mandatory death.",
      "Catholic": "Identifies killing by striking with a lethal stone as murder, requiring the death penalty.",
      "Methodist": "Defines killing by striking with a deadly stone as murder, mandating the death penalty.",
      "Lutheran": "Defines murder (requiring death penalty): striking with a lethal stone causing death."
    },
    "18": {
      "General": "Or if someone strikes another with a wooden hand weapon capable of causing death, and death results, that person is a murderer; the murderer must certainly be put to death.",
      "Non-Denominational": "Defines the third condition for murder: killing by striking with a wooden weapon capable of causing death. Requires the death penalty.",
      "Baptist": "Establishes a third criterion for murder: killing by striking with a lethal wooden hand weapon. The penalty is mandatory death.",
      "Catholic": "Identifies killing by striking with a lethal wooden weapon as murder, requiring the death penalty.",
      "Methodist": "Defines killing by striking with a deadly wooden weapon as murder, mandating the death penalty.",
      "Lutheran": "Defines murder (requiring death penalty): striking with a lethal wooden hand weapon causing death."
    },
    "19": {
      "General": "The avenger of blood is the one who shall execute the murderer; when he encounters the murderer, he shall put him to death.",
      "Non-Denominational": "Assigns the responsibility of executing the convicted murderer to the 'avenger of blood' (the victim's near kinsman).",
      "Baptist": "Specifies that the 'revenger of blood' (next of kin) is responsible for executing the murderer upon meeting him.",
      "Catholic": "Designates the 'avenger of blood' (kinsman redeemer) to carry out the execution of the murderer.",
      "Methodist": "States the avenger of blood has the right and duty to execute the murderer upon encountering him.",
      "Lutheran": "Assigns the execution of the murderer to the revenger of blood, upon meeting him."
    },
    "20": {
      "General": "If someone pushes another out of hatred, or throws something at them deliberately (by laying of wait), causing death,",
      "Non-Denominational": "Provides further criteria for murder: shoving out of hatred or throwing something with premeditation ('lying in wait') resulting in death.",
      "Baptist": "Adds indicators of murderous intent: shoving out of hatred or throwing an object with premeditation, causing death.",
      "Catholic": "Includes acts demonstrating malice: thrusting out of hatred or throwing something with premeditation, causing death.",
      "Methodist": "Gives examples of murderous intent: pushing someone out of hatred or throwing something with premeditation, resulting in death.",
      "Lutheran": "Adds criteria for murder: thrusting out of hatred or hurling something with premeditation ('laying of wait') causing death."
    },
    "21": {
      "General": "Or strikes another with their hand out of enmity, causing death: the one who struck the blow must certainly be put to death, for he is a murderer. The avenger of blood shall execute the murderer when he encounters him.",
      "Non-Denominational": "Adds another criterion for murder: striking with the hand out of enmity resulting in death. Reaffirms the death penalty executed by the avenger.",
      "Baptist": "Includes striking with the hand out of enmity, causing death, as murder. Reiterates the execution by the revenger of blood.",
      "Catholic": "Considers striking with the hand out of enmity, causing death, as murder. The avenger executes the murderer.",
      "Methodist": "Includes striking with the hand out of enmity causing death as murder. The avenger carries out the execution.",
      "Lutheran": "Adds criterion for murder: striking with the hand in enmity causing death. Reaffirms death penalty by the revenger of blood."
    },
    "22": {
      "General": "But if someone pushes another suddenly, without enmity, or throws any object at them without deliberate intent (laying of wait),",
      "Non-Denominational": "Begins describing conditions for accidental killing: a sudden push without prior hostility or throwing something unintentionally.",
      "Baptist": "Contrasts murder with accidental killing: a sudden push without enmity or throwing something without premeditation.",
      "Catholic": "Describes accidental killing: thrusting suddenly without enmity or throwing something without premeditation.",
      "Methodist": "Introduces scenarios of accidental killing: pushing suddenly without hostility or throwing something without premeditation.",
      "Lutheran": "Describes accidental killing: thrusting suddenly without enmity or casting something without premeditation ('laying of wait')."
    },
    "23": {
      "General": "Or drops any stone capable of causing death on someone without seeing them, causing death, when they were not an enemy and did not seek their harm:",
      "Non-Denominational": "Provides another example of accidental killing: dropping a lethal stone on someone unseen, without hostile intent or seeking harm.",
      "Baptist": "Gives another example of accidental killing: dropping a lethal stone on someone unseen, without being their enemy or seeking harm.",
      "Catholic": "Illustrates accidental killing: unintentionally dropping a lethal stone on someone unseen, without enmity or intent to harm.",
      "Methodist": "Adds an example of accidental killing: dropping a deadly stone on someone unseen, without enmity or harmful intent.",
      "Lutheran": "Example of accidental killing: casting a lethal stone without seeing the person, causing death, without enmity or seeking harm."
    },
    "24": {
      "General": "Then the congregation must judge between the slayer and the avenger of blood according to these rules (judgments).",
      "Non-Denominational": "Assigns the responsibility of judging the case (distinguishing murder from accident) to the community ('congregation') based on the established laws.",
      "Baptist": "Mandates that the congregation judges between the slayer and the revenger of blood based on these stated judgments.",
      "Catholic": "Requires the assembly (congregation) to adjudicate between the slayer and the avenger based on these ordinances.",
      "Methodist": "States the congregation must judge the case between the slayer and the avenger according to these rules.",
      "Lutheran": "Commands the congregation to judge between the slayer and the revenger of blood according to these judgments (rules)."
    },
    "25": {
      "General": "The congregation shall rescue the slayer from the avenger of blood and restore him to the city of refuge where he fled. He must remain there until the death of the high priest who was anointed with the holy oil.",
      "Non-Denominational": "Specifies the outcome if judged accidental: the congregation protects the slayer from the avenger, returns him to the refuge city, where he must stay until the high priest's death.",
      "Baptist": "Dictates the congregation's duty if accidental: deliver the slayer from the revenger, return him to his refuge city, where he stays until the anointed high priest dies.",
      "Catholic": "Outlines the procedure for accidental killing: the assembly protects the slayer, returns him to the refuge city, where he remains until the anointed high priest's death.",
      "Methodist": "Specifies the verdict for accidental killing: the congregation protects the slayer, returns him to the refuge city, requiring him to stay until the death of the anointed high priest.",
      "Lutheran": "Result if accidental: congregation delivers slayer from revenger, restores him to refuge city, where he must stay until the anointed high priest's death."
    },
    "26": {
      "General": "But if the slayer should at any time go outside the border of the city of refuge where he fled,",
      "Non-Denominational": "States the condition under which protection is lost: if the slayer leaves the designated boundaries of the refuge city.",
      "Baptist": "Warns that if the slayer leaves the boundary of his refuge city...",
      "Catholic": "Warns that if the slayer ventures outside the limits of his city of refuge...",
      "Methodist": "Specifies the consequence of leaving: if the slayer goes outside the refuge city's border...",
      "Lutheran": "Condition for losing protection: if the slayer leaves the border of his refuge city."
    },
    "27": {
      "General": "And the avenger of blood finds him outside the borders of his city of refuge, and the avenger of blood kills the slayer, the avenger shall not be guilty of bloodshed.",
      "Non-Denominational": "Specifies the consequence of leaving: the avenger of blood may kill the slayer outside the refuge city without incurring guilt.",
      "Baptist": "Consequence of leaving: if the revenger finds him outside the refuge city limits and kills him, the revenger is not guilty of blood.",
      "Catholic": "Consequence of leaving: if the avenger finds and kills the slayer outside the refuge city, the avenger is not guilty of blood.",
      "Methodist": "Result of leaving: if the avenger finds the slayer outside the refuge city and kills him, the avenger is not guilty.",
      "Lutheran": "Consequence of leaving: if the revenger finds him outside the refuge borders and kills him, the revenger is not guilty of blood."
    },
    "28": {
      "General": "Because he should have remained in his city of refuge until the death of the high priest. But after the death of the high priest, the slayer may return to the land of his own possession.",
      "Non-Denominational": "Explains the rationale (he violated the condition of refuge) and states the condition for release: the slayer may return home only after the high priest's death.",
      "Baptist": "Reason for vulnerability: he should have stayed in refuge until the high priest died. Release condition: after the high priest's death, he can return home.",
      "Catholic": "Justification: the slayer should have stayed in refuge until the high priest died. Release: after the high priest's death, the slayer may return to his property.",
      "Methodist": "Explains why the avenger isn't guilty: the slayer should have stayed until the high priest died. Release: after the high priest's death, the slayer can return home.",
      "Lutheran": "Reason: he should have stayed in refuge until the high priest's death. Release: after the high priest's death, the slayer may return to his land."
    },
    "29": {
      "General": "These rules shall be a statute of judgment for you throughout your generations in all your dwelling places.",
      "Non-Denominational": "Establishes these laws concerning bloodshed and refuge as permanent legal statutes for all future generations of Israelites wherever they live.",
      "Baptist": "Declares these regulations to be a permanent legal statute ('statute of judgment') for all generations in all their settlements.",
      "Catholic": "Institutes these rules as a perpetual ordinance for judgment throughout their generations and habitations.",
      "Methodist": "Makes these regulations a permanent statute for judgment for all future generations wherever they live.",
      "Lutheran": "Declares these rules a statute of judgment for all generations in all dwellings."
    },
    "30": {
      "General": "Whoever kills a person, the murderer shall be put to death based on the testimony (mouth) of witnesses; but a single witness is not sufficient to testify against someone for a death sentence.",
      "Non-Denominational": "Establishes the legal requirement for capital punishment: conviction requires the testimony of multiple witnesses, not just one.",
      "Baptist": "Sets the standard for capital conviction: requires multiple witnesses; one witness is insufficient for the death penalty.",
      "Catholic": "Mandates the requirement for capital punishment: based on the testimony of witnesses (plural); one witness is insufficient.",
      "Methodist": "Requires multiple witnesses for a murder conviction leading to death; one witness is not enough.",
      "Lutheran": "Rule for capital punishment: murderer put to death by testimony ('mouth') of witnesses (plural); one witness is insufficient."
    },
    "31": {
      "General": "Furthermore, you shall accept no ransom (satisfaction) for the life of a murderer who is guilty of death; he must certainly be put to death.",
      "Non-Denominational": "Prohibits accepting ransom or monetary compensation in place of the death penalty for a convicted murderer.",
      "Baptist": "Forbids taking ransom ('satisfaction') for a murderer guilty of a capital crime; execution is mandatory.",
      "Catholic": "Prohibits accepting ransom for the life of a murderer condemned to death; execution is required.",
      "Methodist": "Forbids accepting ransom for a convicted murderer; the death penalty must be carried out.",
      "Lutheran": "Prohibits taking satisfaction (ransom) for a murderer guilty of death; he must be put to death."
    },
    "32": {
      "General": "And you shall accept no ransom for someone who has fled to his city of refuge, allowing him to return to live in the land before the death of the high priest.",
      "Non-Denominational": "Prohibits accepting ransom to allow someone in a city of refuge to return home before the high priest's death.",
      "Baptist": "Forbids taking ransom ('satisfaction') for someone in refuge to allow their return before the high priest's death.",
      "Catholic": "Prohibits accepting ransom to permit someone in refuge to return to their land before the high priest's death.",
      "Methodist": "Forbids accepting ransom to allow someone in refuge to return home prematurely (before the high priest dies).",
      "Lutheran": "Prohibits taking satisfaction (ransom) for someone fled to refuge, to allow return before the priest's death."
    },
    "33": {
      "General": "So you shall not pollute the land where you are, for bloodshed defiles the land. The land cannot be cleansed (atoned for) of the blood shed in it except by the blood of the one who shed it.",
      "Non-Denominational": "Warns against polluting the land with unavenged bloodshed, stating that bloodshed defiles, and atonement/cleansing requires the execution of the murderer.",
      "Baptist": "Commands them not to pollute the land, because bloodshed defiles it, and cleansing requires the blood (execution) of the shedder.",
      "Catholic": "Forbids polluting the land, as bloodshed defiles it, and atonement for the land requires the blood of the one who shed it.",
      "Methodist": "Warns against polluting the land with bloodshed, as it defiles it; cleansing requires the blood of the murderer.",
      "Lutheran": "Command: Do not pollute the land, for blood defiles it; the land can only be cleansed by the blood of him who shed it."
    },
    "34": {
      "General": "Therefore, do not defile the land you shall inhabit, in which I Myself dwell; for I, the Lord, dwell among the children of Israel.",
      "Non-Denominational": "Concludes with a final command not to defile the land, linking the land's purity directly to God's presence dwelling among them.",
      "Baptist": "Final command against defiling the inhabited land, emphasizing the reason: the Lord Himself dwells among Israel there.",
      "Catholic": "Final injunction against defiling the land of habitation, because the Lord Himself dwells there among the Israelites.",
      "Methodist": "Final charge not to defile their inhabited land, because God dwells there among the Israelites.",
      "Lutheran": "Final command: Do not defile the land you inhabit, where God dwells, for the Lord dwells among Israel."
    }
  }
}
