{
  "Summary": {
    "General": "This final chapter of Numbers addresses a potential issue arising from the previous ruling (Chapter 27) allowing Zelophehad's daughters to inherit land. Leaders from the Gileadite clan (tribe of Manasseh) approach Moses, concerned that if these daughters marry men from other tribes, their inherited land will permanently transfer to the husband's tribe, especially after the Jubilee year, thus diminishing Manasseh's tribal inheritance. Moses confirms their concern is valid. Following God's command, Moses establishes a rule: Zelophehad's daughters (and by extension, any woman inheriting land) must marry within their own father's tribe. This ensures that tribal inheritances remain fixed and do not transfer between tribes. The chapter concludes by recording that Zelophehad's daughters obeyed, marrying within the clans of Manasseh, and reiterates that these are the final commandments given by God through Moses in the plains of Moab.",
    "Non-Denominational": "Focuses on the practical application and refinement of God's laws regarding inheritance. It highlights the importance of maintaining tribal identity and God's intended land distribution. The solution balances the daughters' right to inherit and marry with the need to preserve the integrity of tribal land allotments. It underscores the principle that inheritances should remain within the designated family/tribal lines, reflecting God's order and foresight in establishing Israelite society in the Promised Land. The daughters' obedience closes the narrative.",
    "Baptist": "Emphasizes God's wisdom in addressing potential complications arising from His laws. The concern of the Manasseh leaders is seen as legitimate foresight. God's solution, requiring marriage within the tribe for inheriting daughters, upholds both the principle of female inheritance and the integrity of tribal land boundaries established by God. It underscores the importance of adhering to God's specific commands for societal structure and land ownership. The obedience of Zelophehad's daughters serves as a final example of faithfulness to God's word in Numbers.",
    "Catholic": "Views this chapter as completing the legislation on inheritance, ensuring the stability and divine order of land distribution among the tribes. The Church might see the concern for tribal inheritance reflecting the importance of lineage and patrimony. The ruling ensures that the land, God's gift, remains within the designated tribal families, preventing social disruption and preserving the identity established by God. The daughters' obedience exemplifies submission to God's law for the common good and the preservation of divine order.",
    "Methodist": "Highlights the practical wisdom and fairness in God's laws, allowing for adjustments based on community concerns while upholding core principles. The ruling protects the rights of inheriting daughters established earlier but adds a reasonable restriction (marriage within the tribe) to prevent the unintended consequence of disrupting tribal land allotments. It emphasizes community stability, the importance of established boundaries, and the need for practical solutions that honor God's overarching plan for Israel's settlement. The chapter concludes the legal preparations for entering Canaan.",
    "Lutheran": "Focuses on the clarification and application of God's Law regarding inheritance. The concern raised by the Manassites is addressed through a specific divine command (Law) given through Moses. This command restricts the marriage options for inheriting daughters to maintain the God-ordained tribal land divisions. This upholds the Law given regarding the allotment of land by lot and prevents its alienation through marriage. The obedience of Zelophehad's daughters demonstrates submission to God's specific commands. The chapter concludes the legal corpus given before entering Canaan, emphasizing God's ordering of society through His Law."
  },
  "Verses": {
    "1": {
      "General": "The chief fathers (leaders) of the families of Gilead, son of Machir, son of Manasseh (from Joseph's lineage), approached Moses and the Israelite leaders.",
      "Non-Denominational": "Identifies the concerned party: leaders from the tribe of Manasseh (specifically the clan of Gilead), descendants of Joseph.",
      "Baptist": "Records the approach of the leaders of the Gileadite families (Manasseh tribe) to Moses and the Israelite princes.",
      "Catholic": "Describes the petitioners: the heads of the families of the clan of Gilead (from the tribe of Manasseh, descendants of Joseph) approaching Moses and the leaders.",
      "Methodist": "Notes the representatives from the tribe of Manasseh (Gilead's clan) coming forward to speak with Moses and the leaders.",
      "Lutheran": "Identifies the leaders of the Gileadite families (Manasseh tribe) approaching Moses and the Israelite princes."
    },
    "2": {
      "General": "They reminded Moses that the Lord commanded him to distribute the land by lot and specifically to give the inheritance of their relative Zelophehad to his daughters.",
      "Non-Denominational": "Restates the previous divine commands: land distribution by lot and the specific inheritance granted to Zelophehad's daughters.",
      "Baptist": "Recalls the Lord's command to Moses regarding land distribution by lot and the inheritance for Zelophehad's daughters.",
      "Catholic": "References the prior divine instructions: distribution of land by lot and the specific provision for Zelophehad's daughters' inheritance.",
      "Methodist": "Reiterates the established commands: division of land by lot and the inheritance right given to Zelophehad's daughters.",
      "Lutheran": "Recounts the Lord's commands: distribute land by lot, and give Zelophehad's inheritance to his daughters."
    },
    "3": {
      "General": "They raised the issue: If these daughters marry men from other Israelite tribes, their inheritance will be taken from Manasseh's inheritance and added to the tribe they marry into, diminishing Manasseh's allotted portion.",
      "Non-Denominational": "Presents the problem: marriage outside the tribe would transfer inherited land, reducing the original tribal allotment.",
      "Baptist": "Highlights the concern: if the daughters marry outside their tribe, their land inheritance leaves the father's tribe and goes to the husband's tribe, diminishing the original lot.",
      "Catholic": "Articulates the problem: marriage into other tribes would cause their inheritance to be subtracted from their ancestral tribe (Manasseh) and added to their husbands' tribes.",
      "Methodist": "States the concern: marriage into other tribes means their inherited land would be lost to Manasseh and gained by the husband's tribe, reducing Manasseh's share.",
      "Lutheran": "Explains the problem: If they marry into other tribes, their inheritance is removed from their fathers' tribe and added to the new tribe, diminishing Manasseh's lot."
    },
    "4": {
      "General": "They added that when the Year of Jubilee arrives (when land typically reverts), this transfer would become permanent, and their inheritance would be permanently lost to their father's tribe (Manasseh).",
      "Non-Denominational": "Explains the long-term consequence: the Jubilee year, intended to restore land, would instead solidify the transfer, permanently removing the land from the original tribe.",
      "Baptist": "Points out the permanence: even the Jubilee year would not restore the land; it would confirm its transfer to the new tribe, permanently lost to the fathers' tribe.",
      "Catholic": "Notes the finality: the Jubilee year would confirm the transfer of inheritance to the new tribe, making the loss to the ancestral tribe permanent.",
      "Methodist": "Clarifies the issue's permanence: the Jubilee wouldn't reverse this type of transfer; the land would be permanently added to the husband's tribe.",
      "Lutheran": "Highlights the Jubilee issue: in the Jubilee, the inheritance would be formally added to the new tribe, permanently removing it from their fathers' tribal inheritance."
    },
    "5": {
      "General": "Moses, following the Lord's word, commanded the Israelites, affirming that the concern raised by the tribe of Joseph (Manasseh) was valid ('hath said well').",
      "Non-Denominational": "Moses, directed by God, confirms the legitimacy of the concern raised by the descendants of Joseph (Manasseh).",
      "Baptist": "Moses, commanded by the Lord, validates the concern presented by the tribe of Joseph's sons (Manasseh).",
      "Catholic": "Moses, instructed by the Lord, acknowledges the validity of the argument presented by the tribe of Joseph (Manasseh).",
      "Methodist": "Following God's word, Moses affirms that the point made by the tribe of Joseph (Manasseh) is correct.",
      "Lutheran": "Moses commands Israel according to God's word, stating that the tribe of Joseph (Manasseh) spoke correctly."
    },
    "6": {
      "General": "This is the Lord's command concerning Zelophehad's daughters: Let them marry whomever they think best, but they must marry within a family of their father's tribe.",
      "Non-Denominational": "God's ruling: The daughters retain freedom of choice in spouse ('whom they think best'), but are restricted to marrying within their own paternal tribe (Manasseh).",
      "Baptist": "The Lord's command: Zelophehad's daughters may marry whomever they choose, provided the husband is from a family within their father's tribe.",
      "Catholic": "The divine decree: Zelophehad's daughters have freedom in choosing husbands, but must marry within the clan of their father's tribe.",
      "Methodist": "God's ruling: They can marry anyone they deem suitable, with the condition that the marriage is within their father's tribe.",
      "Lutheran": "The Lord's command regarding Zelophehad's daughters: They may marry whom they please, but only within a family of their father's tribe."
    },
    "7": {
      "General": "Therefore, the inheritance of the Israelites shall not be transferred from tribe to tribe; every Israelite shall remain attached ('keep himself to') the inheritance of their father's tribe.",
      "Non-Denominational": "The underlying principle: Tribal inheritances must remain stable and not move between tribes; Israelites should hold onto their ancestral tribal land.",
      "Baptist": "The rationale: Prevents the transfer of inheritance between tribes, ensuring each Israelite retains connection to their ancestral tribal inheritance.",
      "Catholic": "The principle established: Inheritances must not circulate between tribes; each Israelite must remain connected to their paternal tribe's inheritance.",
      "Methodist": "The reason for the rule: To prevent inheritances moving between tribes, ensuring everyone keeps the inheritance of their own tribe.",
      "Lutheran": "The purpose: Israelite inheritance shall not move between tribes; every Israelite must cleave ('keep himself') to the inheritance of his fathers' tribe."
    },
    "8": {
      "General": "Furthermore, every daughter who possesses an inheritance in any Israelite tribe must marry someone from a family within her own father's tribe, so that the Israelites may each possess their fathers' inheritance.",
      "Non-Denominational": "Generalizes the rule: Any daughter inheriting land in any tribe must marry within her paternal tribe to ensure continuity of ancestral inheritance.",
      "Baptist": "Extends the rule: Any daughter inheriting land in any tribe must marry within her father's tribal family, preserving the ancestral inheritance for each Israelite.",
      "Catholic": "General application: Every daughter inheriting property in any tribe must marry within her father's tribal clan to maintain the paternal inheritance.",
      "Methodist": "Broadens the regulation: All inheriting daughters in any tribe must marry within their father's tribe, so everyone retains their ancestral property.",
      "Lutheran": "General rule: Every daughter inheriting land in any Israelite tribe must marry within a family of her father's tribe, so Israelites possess their fathers' inheritance."
    },
    "9": {
      "General": "The inheritance shall not be transferred from one tribe to another; every Israelite tribe shall remain attached ('keep himself to') its own inheritance.",
      "Non-Denominational": "Reiterates the principle: No transfer of inheritance between tribes; each tribe maintains its own allotted land.",
      "Baptist": "Restates the prohibition: Inheritance must not move between tribes; each tribe must keep its own inheritance.",
      "Catholic": "Reaffirms the principle: Inheritance must not pass between tribes; each tribe must maintain its own inheritance.",
      "Methodist": "Reinforces the rule: Inheritances are not to move between tribes; each tribe keeps its own allocated inheritance.",
      "Lutheran": "Reiterates the command: Inheritance shall not move from tribe to tribe; each tribe must cleave ('keep himself') to its own inheritance."
    },
    "10": {
      "General": "The daughters of Zelophehad did exactly as the Lord commanded Moses.",
      "Non-Denominational": "Records the obedience of Zelophehad's daughters to this specific command.",
      "Baptist": "States the compliance of Zelophehad's daughters with the Lord's command through Moses.",
      "Catholic": "Confirms the obedience of Zelophehad's daughters to the Lord's command given via Moses.",
      "Methodist": "Notes the daughters of Zelophehad followed the command given by the Lord through Moses.",
      "Lutheran": "Records the obedience of Zelophehad's daughters to the Lord's command."
    },
    "11": {
      "General": "Mahlah, Tirzah, Hoglah, Milcah, and Noah, the daughters of Zelophehad, married their father's brothers' sons (their cousins).",
      "Non-Denominational": "Specifies the names of the daughters and states they married their paternal cousins.",
      "Baptist": "Lists the daughters by name and confirms they married their paternal cousins (father's brothers' sons).",
      "Catholic": "Names the daughters and specifies they married their cousins on their father's side.",
      "Methodist": "Names the daughters and confirms their marriage to their cousins from their father's side.",
      "Lutheran": "Lists the daughters and states they married their paternal cousins."
    },
    "12": {
      "General": "They married into the families of the sons of Manasseh, son of Joseph, and thus their inheritance remained within the tribe of their father's family.",
      "Non-Denominational": "Confirms the outcome: Their marriages were within the tribe of Manasseh, preserving their inheritance within their ancestral tribe.",
      "Baptist": "Clarifies they married within the Manasseh families, keeping their inheritance within their father's tribal family.",
      "Catholic": "Specifies they married within the clans of Manasseh (son of Joseph), ensuring their inheritance remained within their father's tribal clan.",
      "Methodist": "Shows the result: They married within Manasseh's clans, and their inheritance stayed within their father's tribe.",
      "Lutheran": "States they married within the families of Manasseh (Joseph's son), and their inheritance remained in their father's tribal family."
    },
    "13": {
      "General": "These are the final commandments and judgments the Lord commanded through Moses to the Israelites in the plains of Moab by the Jordan near Jericho.",
      "Non-Denominational": "Serves as a concluding statement for the book of Numbers, summarizing that these are the laws given in Moab before entering Canaan.",
      "Baptist": "Concludes the book, identifying these as the commandments and judgments given by the Lord through Moses in the plains of Moab.",
      "Catholic": "Forms a colophon for the book of Numbers, stating these are the commandments and ordinances given by the Lord through Moses in the plains of Moab.",
      "Methodist": "Concludes the book of Numbers, identifying these commands and regulations as those given by God via Moses in the plains of Moab.",
      "Lutheran": "Final statement of the book: These are the commandments and judgments the Lord commanded through Moses in the plains of Moab near Jericho."
    }
  }
}
