{
    "chapterSummary": {
      "General": "Numbers 4 outlines the specific duties of the Levites in relation to the Tabernacle and its transportation. It details the responsibilities of the Kohathites for the most sacred items (Ark, table, lampstand, altars), emphasizing the need for them to be covered by the priests before the Kohathites carry them. The chapter then describes the duties of the Gershonites concerning the Tabernacle's coverings and hangings, and the responsibilities of the Merarites for the structural framework. Finally, it records a census of the Levites aged thirty to fifty who were fit for service in the tent of meeting.",
      "Non-Denominational": "Emphasizes the meticulous organization and division of labor among the Levites for the care and transport of the Tabernacle, highlighting the reverence for sacred objects and the importance of each group fulfilling their specific duties for the community's spiritual life.",
      "Baptist": "Focuses on the detailed instructions for handling sacred items, underscoring the holiness of God and the need for careful obedience in all matters of worship and service within the church.",
      "Catholic": "Highlights the reverence shown for the Eucharist (symbolized by the Ark and sacred vessels) through the specific instructions for its handling and transport, and the ordered service of different groups within the Levitical ministry, mirroring the roles within the Church.",
      "Methodist": "Emphasizes the importance of every member fulfilling their designated role in the community of faith, as seen in the specific duties assigned to different Levitical groups for the smooth functioning of worship and the journey of the people.",
      "Lutheran": "Focuses on the careful preservation and handling of the means of grace (symbolized by the Ark and other sacred items), and the ordered service within the Levitical system, reflecting the importance of proper administration in the church.",
      "Presbyterian": "Stresses the covenantal order and the divinely appointed responsibilities of different groups within the Levitical service, highlighting the importance of each role in maintaining the sanctity of worship and the progress of the community.",
      "Pentecostal": "Highlights the practical and spiritual significance of each task assigned to the Levites, seeing in their careful handling of the Tabernacle and its contents a model for reverence and dedication in serving God's purposes within the church today.",
      "Anglican": "Notes the historical significance of the Levitical duties as a reflection of the ordered worship in the Old Testament, providing context for understanding the roles and responsibilities within the Christian ministry.",
      "Orthodox": "Emphasizes the profound reverence and care required for the sacred vessels and the Tabernacle itself, seeing in the Levitical duties a foreshadowing of the respect and honor due to the holy things in the Church, especially the Eucharist."
    },
    "1": {
      "General": "The Lord spoke to Moses and Aaron, saying,",
      "Non-Denominational": "Highlights the divine origin of the instructions for the Levites' duties, communicated through Moses and Aaron.",
      "Baptist": "Emphasizes God's direct involvement in the specifics of Tabernacle service.",
      "Catholic": "Focuses on the divine authority behind the instructions given to the leaders.",
      "Methodist": "Highlights the importance of divine guidance in organizing the service of the Tabernacle.",
      "Lutheran": "Emphasizes that the instructions for the Levites came directly from the Lord.",
      "Presbyterian": "Stresses the divine initiative in establishing the responsibilities of the Levites.",
      "Pentecostal": "Highlights God's continued communication and direction for His people.",
      "Anglican": "Notes the divine source of the commands regarding the Levites' duties.",
      "Orthodox": "Emphasizes the divine origin of the instructions for the service of the Tabernacle."
    },
    "2": {
      "General": "\"Take a census of the sons of Kohath from among the sons of Levi, by their clans and by their fathers' houses,",
      "Non-Denominational": "Commands Moses and Aaron to conduct a census specifically of the Kohathite branch of the Levites, based on their families and clans.",
      "Baptist": "Highlights the specific instruction to count the Kohathite families within the tribe of Levi.",
      "Catholic": "Focuses on the distinct census of the Kohathites.",
      "Methodist": "Emphasizes the separate counting of the Kohathite division.",
      "Lutheran": "Highlights the specific command to number the Kohathites according to their families and clans.",
      "Presbyterian": "Stresses the separate census of the Kohathites within the Levitical tribe.",
      "Pentecostal": "Highlights the divine instruction to count the Kohathite males based on their families.",
      "Anglican": "Notes the specific instructions for the census of the Kohathites.",
      "Orthodox": "Emphasizes the distinct census of the Kohathite branch of the Levites."
    },
    "3": {
      "General": "from thirty years old up to fifty years old, all who qualify for service in the tent of meeting.",
      "Non-Denominational": "Specifies the age range for the Kohathites to be counted: from thirty to fifty years old, indicating those eligible for active service in the Tabernacle.",
      "Baptist": "Notes the specific age range for Kohathites eligible for service in the Tabernacle.",
      "Catholic": "Highlights the age requirement for the Kohathites' service in the tent of meeting.",
      "Methodist": "Emphasizes the specific age parameters for active service among the Kohathites.",
      "Lutheran": "Highlights the age range of thirty to fifty years for Kohathites qualified for service in the Tabernacle.",
      "Presbyterian": "Stresses the specific age criteria for Kohathites eligible for service in the tent of meeting.",
      "Pentecostal": "Highlights the age range for Kohathites who were fit for service in the Tabernacle.",
      "Anglican": "Notes the specific age limits for Kohathites eligible for service.",
      "Orthodox": "Emphasizes the age range of thirty to fifty years for the Kohathites' service in the tent of meeting."
    },
    "4": {
      "General": "This is the service of the sons of Kohath in the tent of meeting, concerning the most holy things:",
      "Non-Denominational": "Introduces the specific duties of the Kohathites, which pertained to the care and transport of the most sacred items within the Tabernacle.",
      "Baptist": "Highlights the Kohathites' responsibility for the holiest objects in the Tabernacle.",
      "Catholic": "Focuses on the Kohathites' service related to the most sacred elements of the Tabernacle.",
      "Methodist": "Emphasizes the Kohathites' role in handling the holiest items.",
      "Lutheran": "Highlights the Kohathites' specific service concerning the most holy things in the Tabernacle.",
      "Presbyterian": "Stresses the Kohathites' responsibility for the most sacred articles within the tent of meeting.",
      "Pentecostal": "Highlights the Kohathites' service concerning the most holy items.",
      "Anglican": "Notes the Kohathites' duties regarding the most holy things.",
      "Orthodox": "Emphasizes the Kohathites' service in the tent of meeting, specifically concerning the most holy things."
    },
    "5": {
      "General": "when the camp is to set out, Aaron and his sons shall go in and take down the veil of the screen and cover the ark of the testimony with it.",
      "Non-Denominational": "Details the first step in the Kohathites' service: when the camp moves, Aaron and his sons (the priests) must first enter the Holy of Holies, take down the inner veil, and cover the Ark of the Covenant with it, emphasizing the sacredness of the Ark and the need for it to be handled only after being properly concealed by the priests.",
      "Baptist": "Highlights the priestly role in covering the Ark before the Kohathites could handle it, emphasizing the sanctity of the Ark.",
      "Catholic": "Focuses on the priests' responsibility to veil the Ark before the Kohathites' involvement, underscoring the sacredness of the Ark.",
      "Methodist": "Emphasizes the order of service, with the priests taking the initial steps to cover the Ark before the Kohathites' transport duties.",
      "Lutheran": "Highlights the priestly duty of covering the Ark with the veil before the Kohathites could approach it for transport, emphasizing its holiness.",
      "Presbyterian": "Stresses the prescribed order where the priests must first cover the Ark before the Kohathites could handle it, emphasizing the reverence due to the Ark.",
      "Pentecostal": "Highlights the priestly action of covering the Ark as the first step before the Kohathites' involvement in its transport, emphasizing its sacred nature.",
      "Anglican": "Notes the specific procedure requiring the priests to cover the Ark before the Kohathites could handle it for travel.",
      "Orthodox": "Emphasizes the priestly responsibility to veil the Ark before the Kohathites touch it, highlighting the immense holiness of the Ark of the Testimony."
    },
    "6": {
      "General": "Then they shall put on it a covering of goatskin and spread over that a cloth all of blue, and shall put its poles in place.",
      "Non-Denominational": "Continues the instructions for preparing the Ark for transport: after being covered with the veil, it was to be further protected with a covering of goatskin, then a blue cloth, and finally its carrying poles were to be inserted, ensuring it was fully concealed and ready for the Kohathites to carry without touching it directly.",
      "Baptist": "Highlights the layers of covering for the Ark, emphasizing its protection during travel and the placement of the poles for carrying.",
      "Catholic": "Focuses on the multiple layers of covering for the Ark, signifying its sacredness and the practical preparation for transport using its poles.",
      "Methodist": "Emphasizes the thoroughness of the preparation for transporting the Ark, with specific coverings and the placement of the poles.",
      "Lutheran": "Highlights the detailed instructions for covering the Ark with goatskin and a blue cloth, followed by the insertion of the carrying poles.",
      "Presbyterian": "Stresses the prescribed method for preparing the Ark for transport, ensuring it was properly covered and ready to be carried by its poles.",
      "Pentecostal": "Highlights the specific steps in preparing the Ark for transport: goatskin covering, blue cloth, and the insertion of the carrying poles.",
      "Anglican": "Notes the specific materials and steps involved in preparing the Ark for transport, including the goatskin, blue cloth, and poles.",
      "Orthodox": "Emphasizes the careful and layered covering of the Ark with goatskin and a blue cloth, followed by the insertion of its poles for transport, ensuring its reverence and protection."
    },
    "7": {
      "General": "And over the table of showbread they shall spread a cloth of blue and put on it the plates, the dishes for incense, the bowls, and the flagons for drink offering; the regular bread also shall be on it.",
      "Non-Denominational": "Details the preparation of the table of showbread for transport: it was to be covered with a blue cloth, and all the vessels associated with it (plates, incense dishes, bowls, flagons) were to be placed on it, along with the regular bread, ensuring all items were secured together for transport.",
      "Baptist": "Highlights the specific items to be placed on the table of showbread before it was covered for transport.",
      "Catholic": "Focuses on the orderly arrangement of the vessels and the bread on the table before it was covered with a blue cloth for transport.",
      "Methodist": "Emphasizes the careful packing of the table of showbread with its associated items for safe transport.",
      "Lutheran": "Highlights the specific instructions for covering the table of showbread with a blue cloth after placing its vessels and the regular bread on it.",
      "Presbyterian": "Stresses the prescribed method for preparing the table of showbread for transport, ensuring all its components were secured.",
      "Pentecostal": "Highlights the specific items to be placed on the table of showbread and then covered with a blue cloth for transport.",
      "Anglican": "Notes the specific items to be placed on the table of showbread before it was covered with a blue cloth for travel.",
      "Orthodox": "Emphasizes the careful placement of the plates, incense dishes, bowls, and flagons on the table of showbread, along with the regular bread, before it was covered with a blue cloth for transport."
    },
    "8": {
      "General": "Then they shall spread over them a cloth of scarlet and cover the whole with a covering of goatskin, and shall put its poles in place.",
      "Non-Denominational": "Continues the preparation of the table of showbread: after the blue cloth and the vessels were in place, a scarlet cloth was to be spread over them, followed by a goatskin covering, and then its carrying poles were to be inserted, ensuring the table and its contents were fully protected for transport.",
      "Baptist": "Highlights the additional layers of covering for the table of showbread, including the scarlet cloth and goatskin, and the placement of its poles.",
      "Catholic": "Focuses on the further protection of the table with a scarlet cloth and goatskin covering, and the insertion of its poles for transport.",
      "Methodist": "Emphasizes the thoroughness of the protection for the table of showbread during transport with these additional coverings and the poles.",
      "Lutheran": "Highlights the specific instructions for covering the table with a scarlet cloth and then goatskin, followed by the insertion of the carrying poles.",
      "Presbyterian": "Stresses the prescribed method for further securing the table of showbread for transport with these additional coverings and the placement of the poles.",
      "Pentecostal": "Highlights the specific steps of covering the table with a scarlet cloth and goatskin, and then inserting the carrying poles.",
      "Anglican": "Notes the specific materials and steps involved in further preparing the table for transport, including the scarlet cloth, goatskin, and poles.",
      "Orthodox": "Emphasizes the additional layers of protection for the table of showbread with a scarlet cloth and a goatskin covering, followed by the insertion of its poles for transport."
    },
    "9": {
      "General": "And they shall take a cloth of blue and cover the lampstand of the light, with its lamps, its tongs, its trays, and all the oil for its service.",
      "Non-Denominational": "Details the preparation of the golden lampstand for transport: it was to be covered with a blue cloth, along with its lamps, tongs, trays, and the oil used for its service, ensuring all components were kept together and protected.",
      "Baptist": "Highlights the covering of the lampstand with a blue cloth, along with all its accessories and oil.",
      "Catholic": "Focuses on the covering of the lampstand with a blue cloth, ensuring all its parts and the oil were included.",
      "Methodist": "Emphasizes the careful wrapping of the lampstand and its accessories for transport.",
      "Lutheran": "Highlights the specific instruction to cover the lampstand with a blue cloth, including its lamps, tongs, trays, and oil.",
      "Presbyterian": "Stresses the prescribed method for preparing the lampstand for transport, ensuring all its components were secured.",
      "Pentecostal": "Highlights the covering of the lampstand with a blue cloth, along with its lamps, tongs, trays, and oil for transport.",
      "Anglican": "Notes the specific items to be covered with the lampstand using a blue cloth for travel.",
      "Orthodox": "Emphasizes the covering of the lampstand of the light with a blue cloth, along with its lamps, tongs, trays, and all the oil necessary for its service."
    },
    "10": {
      "General": "And they shall put it with all its utensils in a covering of goatskin and put it on the carrying frame.",
      "Non-Denominational": "Continues the preparation of the lampstand: after being covered with the blue cloth along with its accessories, it was to be placed in a goatskin covering and then put on its carrying frame, ensuring its protection and readiness for transport.",
      "Baptist": "Highlights the further protection of the lampstand with a goatskin covering and its placement on a carrying frame.",
      "Catholic": "Focuses on the additional protection of the lampstand with a goatskin covering and its placement on a transport frame.",
      "Methodist": "Emphasizes the securement of the lampstand in a goatskin covering and on a carrying frame for transport.",
      "Lutheran": "Highlights the instruction to place the lampstand and its utensils in a goatskin covering and then on its carrying frame.",
      "Presbyterian": "Stresses the prescribed method for further securing the lampstand for transport by placing it in a goatskin covering on its carrying frame.",
      "Pentecostal": "Highlights the steps of placing the lampstand with its utensils in a goatskin covering and then on its carrying frame.",
      "Anglican": "Notes the additional steps of using a goatskin covering and a carrying frame for the lampstand's transport.",
      "Orthodox": "Emphasizes the further protection of the lampstand and all its utensils by placing them in a covering of goatskin and then putting it on the carrying frame for transport."
    },
    "11": {
      "General": "And over the golden altar they shall spread a cloth of blue and cover it with a covering of goatskin and shall put its poles in place.",
      "Non-Denominational": "Details the preparation of the golden altar (altar of incense) for transport: it was to be covered with a blue cloth, then a goatskin covering, and its carrying poles were to be inserted, ensuring its protection and readiness for the Kohathites to carry.",
      "Baptist": "Highlights the covering of the golden altar with a blue cloth and goatskin, and the placement of its poles.",
      "Catholic": "Focuses on the covering of the golden altar with a blue cloth and then a goatskin, and the insertion of its carrying poles.",
      "Methodist": "Emphasizes the thoroughness of the protection for the golden altar during transport with these coverings and the poles.",
      "Lutheran": "Highlights the specific instructions for covering the golden altar with a blue cloth and then goatskin, followed by the insertion of the carrying poles.",
      "Presbyterian": "Stresses the prescribed method for preparing the golden altar for transport, ensuring it was properly covered and ready to be carried by its poles.",
      "Pentecostal": "Highlights the steps of covering the golden altar with a blue cloth and goatskin, and then inserting the carrying poles.",
      "Anglican": "Notes the specific materials and steps involved in preparing the golden altar for transport, including the blue cloth, goatskin, and poles.",
      "Orthodox": "Emphasizes the careful covering of the golden altar with a blue cloth and then a covering of goatskin, followed by the insertion of its poles for transport, ensuring its reverence and protection."
    },
    "12": {
      "General": "And they shall take all the vessels of the service with which they minister in the sanctuary and put them in a cloth of blue and cover them with a covering of goatskin.",
      "Non-Denominational": "Details the preparation of all the vessels used in the service of the sanctuary: they were to be wrapped in a blue cloth and then covered with a goatskin covering, ensuring their protection during transport.",
      "Baptist": "Highlights the careful wrapping of all the sacred vessels in blue cloth and then a goatskin covering.",
      "Catholic": "Focuses on the protection of all the liturgical vessels by wrapping them in a blue cloth and then a goatskin.",
      "Methodist": "Emphasizes the need to securely wrap all the sacred vessels for transport.",
      "Lutheran": "Highlights the instruction to take all the vessels used in the sanctuary service, wrap them in blue cloth, and cover them with goatskin.",
      "Presbyterian": "Stresses the prescribed method for protecting all the sacred vessels during transport by wrapping them in blue cloth and covering them with goatskin.",
      "Pentecostal": "Highlights the steps of wrapping all the service vessels in a blue cloth and then a goatskin covering for transport.",
      "Anglican": "Notes the specific materials used to cover all the vessels used in the sanctuary service for travel.",
      "Orthodox": "Emphasizes the careful wrapping of all the vessels used in the ministry of the sanctuary in a blue cloth and then covering them with a covering of goatskin for protection during transport."
    },
    "13": {
      "General": "And they shall put them in a covering of goatskin and put them on the carrying frame.",
      "Non-Denominational": "Continues the preparation of the sacred vessels: after being wrapped in the blue cloth and covered with goatskin, they were to be placed on a carrying frame, ensuring their safe transport.",
      "Baptist": "Highlights the placement of the covered sacred vessels onto a carrying frame for transport.",
      "Catholic": "Focuses on the final step of placing the wrapped vessels on a transport frame.",
      "Methodist": "Emphasizes the securement of the sacred vessels on a carrying frame for transport.",
      "Lutheran": "Highlights the instruction to place the covered sacred vessels in a goatskin covering and then on the carrying frame.",
      "Presbyterian": "Stresses the prescribed method for transporting the sacred vessels by placing them on a carrying frame.",
      "Pentecostal": "Highlights the step of placing the covered vessels onto a carrying frame.",
      "Anglican": "Notes the use of a carrying frame for the transport of the covered sacred vessels.",
      "Orthodox": "Emphasizes the final step of placing the sacred vessels, already wrapped in blue cloth and covered with goatskin, onto the carrying frame for transport."
    },
    "14": {
      "General": "And they shall take away the ashes from the altar of burnt offering and spread over it a cloth of purple.",
      "Non-Denominational": "Details the preparation of the bronze altar (altar of burnt offering) for transport: first, the ashes were to be removed, and then it was to be covered with a purple cloth, signifying its importance and perhaps royalty.",
      "Baptist": "Highlights the removal of ashes and the covering of the bronze altar with a purple cloth.",
      "Catholic": "Focuses on the preparation of the altar of burnt offering by removing ashes and covering it with purple.",
      "Methodist": "Emphasizes the steps of clearing the altar and then covering it for transport.",
      "Lutheran": "Highlights the instruction to remove the ashes from the altar of burnt offering and then cover it with a purple cloth.",
      "Presbyterian": "Stresses the prescribed method for preparing the altar of burnt offering by first removing the ashes and then covering it with purple.",
      "Pentecostal": "Highlights the steps of removing the ashes and covering the altar of burnt offering with a purple cloth.",
      "Anglican": "Notes the specific steps of ash removal and covering with purple for the altar of burnt offering.",
      "Orthodox": "Emphasizes the preparation of the altar of burnt offering for transport by first removing the ashes and then spreading over it a cloth of purple, symbolizing its significance."
    },
    "15": {
      "General": "And they shall put on it all the utensils of the service with which they minister at it, the pans for the ashes, the forks, the shovels, and the basins, all the utensils of the altar, and they shall spread over it a covering of goatskin and put its poles in place.",
      "Non-Denominational": "Continues the preparation of the bronze altar: all the utensils used in its service (ash pans, forks, shovels, basins) were to be placed on it, then it was to be covered with a goatskin covering, and its carrying poles were to be inserted, ensuring all components were secured for transport.",
      "Baptist": "Highlights the placement of all altar utensils on the altar before it was covered with goatskin and its poles put in place.",
      "Catholic": "Focuses on the orderly placement of all altar vessels on the altar before it was covered with goatskin and prepared for transport.",
      "Methodist": "Emphasizes the careful packing of the altar with its associated utensils for safe transport.",
      "Lutheran": "Highlights the specific instructions for placing all the altar's utensils on it, covering it with goatskin, and inserting its poles.",
      "Presbyterian": "Stresses the prescribed method for preparing the altar of burnt offering for transport, ensuring all its components were secured under a goatskin covering with the poles in place.",
      "Pentecostal": "Highlights the steps of placing all the altar utensils on it, covering it with goatskin, and inserting the carrying poles.",
      "Anglican": "Notes the specific items to be placed on the altar of burnt offering before it was covered with goatskin and its poles were set.",
      "Orthodox": "Emphasizes the careful placement of all the utensils used in the service of the altar of burnt offering on it, followed by covering it with a covering of goatskin and inserting its poles for transport."
    },
    "16": {
      "General": "When Aaron and his sons have finished covering the holy things and all the furnishings of the sanctuary, as the camp sets out, after that the sons of Kohath shall come to carry them, but they must not touch the holy things lest they die. These are the things of the tent of meeting that the sons of Kohath are to carry.",
      "Non-Denominational": "Emphasizes the strict protocol: only after Aaron and his sons (the priests) had completely covered the holy things and all the sanctuary furnishings were the Kohathites allowed to come and carry them, with a severe warning against touching the uncovered sacred items to prevent death, highlighting the absolute holiness of these objects.",
      "Baptist": "Highlights the crucial role of the priests in covering the holy things before the Kohathites could approach, emphasizing the danger of unauthorized contact.",
      "Catholic": "Focuses on the priestly responsibility for the initial covering of the sacred items before the Kohathites' transport duties, underscoring the reverence and care required for holy objects.",
      "Methodist": "Emphasizes the importance of following the prescribed order, with the priests preparing the holy things before the Kohathites' involvement, to maintain reverence and avoid divine judgment.",
      "Lutheran": "Highlights the strict command that the Kohathites could only carry the covered holy things and were forbidden to touch them, lest they die, emphasizing the sanctity of these items.",
      "Presbyterian": "Stresses the divinely ordained procedure where the priests must first cover the holy things before the Kohathites could transport them, with a severe warning against unauthorized contact.",
      "Pentecostal": "Highlights the specific timing and condition for the Kohathites' service: only after the priests had covered the holy items, and they were not to touch them on penalty of death, emphasizing their sacredness.",
      "Anglican": "Notes the precise order of events, with the priests covering the holy things before the Kohathites' transport, and the strict prohibition against touching the uncovered items.",
      "Orthodox": "Emphasizes the absolute necessity of the priests covering the holy things completely before the Kohathites could approach to carry them, with a dire warning against touching the uncovered sacred objects, underscoring their profound holiness."
    },
    "17": {
      "General": "The Lord spoke to Moses and Aaron, saying,",
      "Non-Denominational": "Indicates another section of divine instruction to Moses and Aaron, now concerning the specific duties of Eleazar.",
      "Baptist": "Highlights God's continued guidance and instruction for His leaders.",
      "Catholic": "Focuses on the divine authority behind the instructions given to Moses and Aaron.",
      "Methodist": "Emphasizes the importance of divine guidance in organizing the service.",
      "Lutheran": "Highlights that the instructions came directly from the Lord.",
      "Presbyterian": "Stresses the divine initiative in establishing these responsibilities.",
      "Pentecostal": "Highlights God's continued communication and direction.",
      "Anglican": "Notes the divine source of the commands.",
      "Orthodox": "Emphasizes the divine origin of the instructions."
    },
    "18": {
      "General": "\"Let not the tribe of the clans of the Kohathites be destroyed from among the Levites,",
      "Non-Denominational": "Commands Moses and Aaron to ensure that the Kohathite clan is not destroyed, likely referring to the danger they faced if they touched the holy things without proper covering, emphasizing the need for strict adherence to the prescribed procedures.",
      "Baptist": "Highlights the warning to protect the Kohathites from divine judgment by ensuring they followed the proper procedures for handling sacred items.",
      "Catholic": "Focuses on the need to prevent the destruction of the Kohathites, emphasizing the importance of adhering to the prescribed rituals for handling holy objects.",
      "Methodist": "Emphasizes the seriousness of the instructions, as failure to follow them could result in the destruction of the Kohathites.",
      "Lutheran": "Highlights the divine concern for the Kohathites' well-being, urging Moses and Aaron to ensure they followed the procedures to avoid death.",
      "Presbyterian": "Stresses the importance of adhering to the divinely ordained protocols to prevent harm from coming to the Kohathite clan.",
      "Pentecostal": "Highlights the need to protect the Kohathites from divine judgment by strictly following the instructions for handling the holy things.",
      "Anglican": "Notes the warning to Moses and Aaron to ensure the Kohathites followed the procedures to avoid destruction.",
      "Orthodox": "Emphasizes the divine concern for the preservation of the Kohathite clan, urging adherence to the prescribed rituals for handling the sacred objects to prevent death."
    },
    "19": {
      "General": "but deal thus with them, that they may live and not die when they come near the most holy things: Aaron and his sons shall go in and appoint them each to his task and to his burden.",
      "Non-Denominational": "Provides the solution to prevent the Kohathites' destruction: Aaron and his sons (the priests) were to go in and specifically assign each Kohathite to their particular task and the burden they were to carry, ensuring they did not handle the uncovered holy things, thus allowing them to live.",
      "Baptist": "Highlights the priestly role in specifically assigning tasks to the Kohathites to ensure their safety when handling sacred items.",
      "Catholic": "Focuses on the priestly responsibility to direct the Kohathites in their duties, ensuring they did not come into unauthorized contact with the holy things.",
      "Methodist": "Emphasizes the importance of proper assignment and oversight by the priests to protect the Kohathites during their service.",
      "Lutheran": "Highlights the priestly duty of assigning specific tasks and burdens to the Kohathites to ensure they handled the holy things safely and did not die.",
      "Presbyterian": "Stresses the prescribed procedure where the priests were to assign specific duties to the Kohathites to protect them from harm when dealing with the most holy things.",
      "Pentecostal": "Highlights the priestly role in specifically appointing tasks and burdens to the Kohathites to ensure their safety when serving with the most holy things.",
      "Anglican": "Notes the specific role of Aaron and his sons in assigning tasks to the Kohathites to ensure their safety when handling the most holy things.",
      "Orthodox": "Emphasizes the crucial role of Aaron and his sons in specifically assigning each Kohathite to their task and burden to ensure they could approach the most holy things without dying."
    },
    "20": {
      "General": "But they shall not go in to look on the holy things even for a moment, lest they die.",
      "Non-Denominational": "Strictly forbids the Kohathites from entering to even look at the holy things before they were properly covered, emphasizing that even a momentary glance at the uncovered sacred objects would result in death due to their extreme holiness.",
      "Baptist": "Highlights the absolute prohibition against the Kohathites looking at the uncovered holy things, emphasizing the severe consequences.",
      "Catholic": "Focuses on the strict rule preventing the Kohathites from viewing the holy objects before they were covered, underscoring their sacred nature.",
      "Methodist": "Emphasizes the extreme reverence required, where even a glimpse of the uncovered holy things was forbidden to the Kohathites.",
      "Lutheran": "Highlights the severe warning against the Kohathites entering to look at the holy things, even briefly, lest they die.",
      "Presbyterian": "Stresses the absolute prohibition within the divinely ordained procedures against the Kohathites viewing the holy things before they were covered, due to their sanctity.",
      "Pentecostal": "Highlights the strict command forbidding the Kohathites from even looking at the uncovered holy things on penalty of death, emphasizing their extreme holiness.",
      "Anglican": "Notes the strict prohibition against the Kohathites looking at the uncovered holy things, with the consequence of death.",
      "Orthodox": "Emphasizes the absolute prohibition against the Kohathites entering to gaze upon the holy things, even for a moment, lest they incur death due to their profound holiness."
    },
    "21": {
      "General": "The Lord spoke to Moses, saying,",
      "Non-Denominational": "Indicates another section of divine instruction to Moses, now concerning the Gershonites.",
      "Baptist": "Highlights God's continued guidance and instruction for His people.",
      "Catholic": "Focuses on the divine authority behind the instructions given to Moses.",
      "Methodist": "Emphasizes the importance of divine guidance in organizing the service.",
      "Lutheran": "Highlights that the instructions came directly from the Lord.",
      "Presbyterian": "Stresses the divine initiative in establishing these responsibilities.",
      "Pentecostal": "Highlights God's continued communication and direction.",
      "Anglican": "Notes the divine source of the commands.",
      "Orthodox": "Emphasizes the divine origin of the instructions."
    },
    "22": {
      "General": "\"Take a census also of the sons of Gershon, by their fathers' houses and by their clans,",
      "Non-Denominational": "Commands Moses to conduct a census of the Gershonite branch of the Levites, based on their families and clans.",
      "Baptist": "Highlights the specific instruction to count the Gershonite families within the tribe of Levi.",
      "Catholic": "Focuses on the distinct census of the Gershonites.",
      "Methodist": "Emphasizes the separate counting of the Gershonite division.",
      "Lutheran": "Highlights the specific command to number the Gershonites according to their families and clans.",
      "Presbyterian": "Stresses the separate census of the Gershonites within the Levitical tribe.",
      "Pentecostal": "Highlights the divine instruction to count the Gershonite males based on their families.",
      "Anglican": "Notes the specific instructions for the census of the Gershonites.",
      "Orthodox": "Emphasizes the distinct census of the Gershonite branch of the Levites."
    },
    "23": {
      "General": "from thirty years old up to fifty years old, all who qualify for service in the tent of meeting.",
      "Non-Denominational": "Specifies the age range for the Gershonites to be counted: from thirty to fifty years old, indicating those eligible for active service in the Tabernacle.",
      "Baptist": "Notes the specific age range for Gershonites eligible for service in the Tabernacle.",
      "Catholic": "Highlights the age requirement for the Gershonites' service in the tent of meeting.",
      "Methodist": "Emphasizes the specific age parameters for active service among the Gershonites.",
      "Lutheran": "Highlights the age range of thirty to fifty years for Gershonites qualified for service in the Tabernacle.",
      "Presbyterian": "Stresses the specific age criteria for Gershonites eligible for service in the tent of meeting.",
      "Pentecostal": "Highlights the age range for Gershonites who were fit for service in the Tabernacle.",
      "Anglican": "Notes the specific age limits for Gershonites eligible for service.",
      "Orthodox": "Emphasizes the age range of thirty to fifty years for the Gershonites' service in the tent of meeting."
    },
    "24": {
      "General": "This is the service of the clans of the Gershonites, in serving and in carrying:",
      "Non-Denominational": "Introduces the specific duties of the Gershonites, which involved both direct service at the Tabernacle and the responsibility for carrying certain parts of it during travel.",
      "Baptist": "Highlights the dual role of the Gershonites in both serving and transporting parts of the Tabernacle.",
      "Catholic": "Focuses on the Gershonites' service which included both active duties and the carrying of specific items.",
      "Methodist": "Emphasizes the Gershonites' responsibilities in both the functional aspects of service and the physical task of carrying.",
      "Lutheran": "Highlights the Gershonites' specific service, which involved both ministering and transporting.",
      "Presbyterian": "Stresses the Gershonites' dual responsibilities within the covenant community's service: ministering and carrying.",
      "Pentecostal": "Highlights the Gershonites' service, which included both active duties and the transport of Tabernacle components.",
      "Anglican": "Notes the Gershonites' service, which encompassed both ministering and carrying.",
      "Orthodox": "Emphasizes the Gershonites' service, which involved both active duties and the responsibility of carrying specific parts of the Tabernacle."
    },
    "25": {
      "General": "they are to carry the curtains of the tabernacle, and the tent of meeting with its covering, and the covering of goatskin that is on top of it, and the screen for the entrance of the tent of meeting,",
      "Non-Denominational": "Details the specific items the Gershonites were responsible for carrying: the curtains of the Tabernacle, the tent of meeting itself with its inner covering, the outer covering of goatskin, and the screen for the entrance of the tent.",
      "Baptist": "Notes the specific coverings and curtains of the Tabernacle that the Gershonites were to transport.",
      "Catholic": "Highlights the Gershonites' responsibility for carrying the Tabernacle's curtains, coverings, and entrance screen.",
      "Methodist": "Emphasizes the Gershonites' role in transporting the fabric components of the Tabernacle.",
      "Lutheran": "Highlights the specific items assigned to the Gershonites for transport: the Tabernacle curtains, the tent with its coverings, and the entrance screen.",
      "Presbyterian": "Stresses the Gershonites' responsibility within the covenant community for carrying these specific fabric components of the Tabernacle.",
      "Pentecostal": "Highlights the specific items the Gershonites were to carry: the Tabernacle curtains, the tent with its coverings, and the entrance screen.",
      "Anglican": "Notes the specific curtains and coverings of the Tabernacle assigned to the Gershonites for transport.",
      "Orthodox": "Emphasizes the Gershonites' responsibility for carrying the curtains of the Tabernacle, the tent of meeting with its coverings, and the screen for the entrance."
    },
    "26": {
      "General": "the hangings of the court, and the screen for the entrance of the gate of the court that is around the tabernacle and the altar, and their cords, and all the service connected with these.",
      "Non-Denominational": "Continues the list of items the Gershonites were responsible for carrying: the hangings of the outer court, the screen for the entrance of the court surrounding the Tabernacle and the altar, their cords, and all the service related to these items.",
      "Baptist": "Further specifies the Gershonites' transport duties to include the outer court hangings, entrance screen, and cords.",
      "Catholic": "Continues to highlight the Gershonites' responsibility for the outer court hangings, screen, and cords.",
      "Methodist": "Emphasizes the Gershonites' role in transporting the fabric components of the outer court.",
      "Lutheran": "Further specifies the items assigned to the Gershonites for transport: the outer court hangings, the screen for the court entrance, and their cords, along with all related service items.",
      "Presbyterian": "Stresses the Gershonites' responsibility within the covenant community for carrying these specific fabric components of the outer court and their associated items.",
      "Pentecostal": "Further specifies the items the Gershonites were to carry: the outer court hangings, the screen for the court entrance, and their cords, along with all related service items.",
      "Anglican": "Notes the specific hangings and screens of the outer court assigned to the Gershonites for transport, along with their cords.",
      "Orthodox": "Emphasizes the Gershonites' responsibility for carrying the hangings of the court, the screen for the entrance of the gate of the court around the tabernacle and the altar, and their cords, and all the service connected with these."
    },
    "27": {
      "General": "All the service of the sons of the Gershonites shall be under the direction of Aaron and his sons, in all that they are to carry and in all that they are to do. And you shall assign to them by name the things that they are to carry.",
      "Non-Denominational": "Emphasizes that all the duties and transport responsibilities of the Gershonites were to be carried out under the direct supervision and instruction of Aaron and his sons (the priests), and Moses was commanded to assign specific tasks to individual Gershonites by name, ensuring accountability and order.",
      "Baptist": "Highlights the priestly oversight of the Gershonites' service and the specific assignment of tasks to individuals.",
      "Catholic": "Focuses on the priestly direction of the Gershonites' duties and the individual assignment of transport responsibilities.",
      "Methodist": "Emphasizes the importance of leadership and specific task assignment for the Gershonites' service.",
      "Lutheran": "Highlights that all the Gershonites' service was to be under the direction of Aaron and his sons, with specific assignments given to individuals.",
      "Presbyterian": "Stresses the importance of proper leadership and the assignment of specific responsibilities within the covenant community's service, as seen in the Gershonites' duties under the priests.",
      "Pentecostal": "Highlights the priestly direction of all Gershonite service and the specific naming of individuals responsible for carrying certain items.",
      "Anglican": "Notes the priestly supervision of the Gershonites' duties and the specific assignment of tasks by name.",
      "Orthodox": "Emphasizes that all the service of the Gershonites, both carrying and doing, was to be under the direction of Aaron and his sons, with specific items assigned to them by name."
    },
    "28": {
      "General": "This is the service of the clans of the Gershonites in the tent of meeting, and their charge shall be under the oversight of Ithamar the son of Aaron the priest.",
      "Non-Denominational": "Summarizes the duties of the Gershonite clans in the Tabernacle service and specifies that their overall charge and oversight were under the direction of Ithamar, son of Aaron the priest, indicating a level of priestly supervision for their responsibilities.",
      "Baptist": "Highlights Ithamar's role in overseeing the Gershonites' service at the Tabernacle.",
      "Catholic": "Focuses on Ithamar's responsibility for the oversight of the Gershonite clans' service in the tent of meeting.",
      "Methodist": "Emphasizes Ithamar's leadership role over the Gershonite division's service.",
      "Lutheran": "Highlights that the service of the Gershonite clans in the Tabernacle was under the oversight of Ithamar, Aaron's son.",
      "Presbyterian": "Stresses Ithamar's role in supervising the Gershonites' service within the covenant community.",
      "Pentecostal": "Highlights Ithamar's oversight of the Gershonite clans' service in the Tabernacle.",
      "Anglican": "Notes Ithamar's responsibility for the oversight of the Gershonites' service in the tent of meeting.",
      "Orthodox": "Emphasizes that the service of the Gershonite clans in the tent of meeting, including their charge, was under the oversight of Ithamar the son of Aaron the priest."
    },
    "29": {
      "General": "As for the sons of Merari, you shall number them by their clans and by their fathers' houses,",
      "Non-Denominational": "Commands Moses to conduct a census of the Merarite branch of the Levites, based on their families and clans.",
      "Baptist": "Highlights the specific instruction to count the Merarite families within the tribe of Levi.",
      "Catholic": "Focuses on the distinct census of the Merarites.",
      "Methodist": "Emphasizes the separate counting of the Merarite division.",
      "Lutheran": "Highlights the specific command to number the Merarites according to their families and clans.",
      "Presbyterian": "Stresses the separate census of the Merarites within the Levitical tribe.",
      "Pentecostal": "Highlights the divine instruction to count the Merarite males based on their families.",
      "Anglican": "Notes the specific instructions for the census of the Merarites.",
      "Orthodox": "Emphasizes the distinct census of the Merarite branch of the Levites."
    },
    "30": {
      "General": "from thirty years old up to fifty years old, all who qualify for service in the tent of meeting.",
      "Non-Denominational": "Specifies the age range for the Merarites to be counted: from thirty to fifty years old, indicating those eligible for active service in the Tabernacle.",
      "Baptist": "Notes the specific age range for Merarites eligible for service in the Tabernacle.",
      "Catholic": "Highlights the age requirement for the Merarites' service in the tent of meeting.",
      "Methodist": "Emphasizes the specific age parameters for active service among the Merarites.",
      "Lutheran": "Highlights the age range of thirty to fifty years for Merarites qualified for service in the Tabernacle.",
      "Presbyterian": "Stresses the specific age criteria for Merarites eligible for service in the tent of meeting.",
      "Pentecostal": "Highlights the age range for Merarites who were fit for service in the Tabernacle.",
      "Anglican": "Notes the specific age limits for Merarites eligible for service.",
      "Orthodox": "Emphasizes the age range of thirty to fifty years for the Merarites' service in the tent of meeting."
    },
    "31": {
      "General": "This is the charge of their burden, concerning all the service of the tent of meeting: the frames of the tabernacle, the bars, the pillars, the bases,",
      "Non-Denominational": "Introduces the specific transport responsibilities (their 'burden') of the Merarites, which involved the structural framework of the Tabernacle: the frames, bars, pillars, and bases.",
      "Baptist": "Highlights the Merarites' responsibility for transporting the heavier structural components of the Tabernacle.",
      "Catholic": "Focuses on the Merarites' duty to carry the framework of the Tabernacle.",
      "Methodist": "Emphasizes the Merarites' role in transporting the structural elements.",
      "Lutheran": "Highlights the specific items assigned to the Merarites for transport: the Tabernacle's frames, bars, pillars, and bases.",
      "Presbyterian": "Stresses the Merarites' responsibility within the covenant community for carrying the structural components of the Tabernacle.",
      "Pentecostal": "Highlights the specific structural elements of the Tabernacle that the Merarites were to carry.",
      "Anglican": "Notes the Merarites' duties regarding the transport of the Tabernacle's framework.",
      "Orthodox": "Emphasizes the Merarites' responsibility for the transport of the structural elements of the Tabernacle: its frames, bars, pillars, and bases."
    },
    "32": {
      "General": "the pillars of the court around, with their bases, their pegs, and their cords, with all their equipment for service. And you shall assign by name the objects that they are to carry.",
      "Non-Denominational": "Continues the list of the Merarites' responsibilities, including the pillars of the outer court, along with their bases, pegs, and cords, and all related equipment. Moses was also commanded to assign specific items to individual Merarites by name, ensuring accountability.",
      "Baptist": "Further specifies the Merarites' transport duties to include the outer court pillars, bases, pegs, and cords.",
      "Catholic": "Continues to highlight the Merarites' responsibility for the outer court pillars and their associated parts.",
      "Methodist": "Emphasizes the Merarites' role in transporting the structural elements of the outer court as well.",
      "Lutheran": "Further specifies the items assigned to the Merarites for transport: the pillars of the outer court with their bases, pegs, and cords, along with all related service equipment. Specific assignments were to be made by name.",
      "Presbyterian": "Stresses the Merarites' responsibility within the covenant community for carrying the structural components of the outer court and their associated items, with individual assignments made by name.",
      "Pentecostal": "Further specifies the structural elements of the outer court that the Merarites were to carry, including pillars, bases, pegs, cords, and related equipment, with individual assignments by name.",
      "Anglican": "Notes the Merarites' duties regarding the transport of the outer court pillars, bases, pegs, and cords, with specific assignments by name.",
      "Orthodox": "Emphasizes the Merarites' responsibility for the transport of the pillars of the court around the Tabernacle, with their bases, pegs, and cords, along with all their equipment for service, with specific assignments made by name."
    },
    "33": {
      "General": "This is the service of the clans of the sons of Merari, concerning all their service in the tent of meeting, under the direction of Ithamar the son of Aaron the priest.",
      "Non-Denominational": "Summarizes the duties of the Merarite clans in the Tabernacle service and specifies that all their service was under the direction of Ithamar, son of Aaron the priest, indicating priestly oversight for their responsibilities as well.",
      "Baptist": "Highlights Ithamar's role in overseeing the Merarites' service at the Tabernacle.",
      "Catholic": "Focuses on Ithamar's responsibility for the oversight of the Merarite clans' service in the tent of meeting.",
      "Methodist": "Emphasizes Ithamar's leadership role over the Merarite division's service.",
      "Lutheran": "Highlights that the service of the Merarite clans in the Tabernacle was under the direction of Ithamar, Aaron's son.",
      "Presbyterian": "Stresses Ithamar's role in supervising the Merarites' service within the covenant community.",
      "Pentecostal": "Highlights Ithamar's oversight of the Merarite clans' service in the Tabernacle.",
      "Anglican": "Notes Ithamar's responsibility for the oversight of the Merarites' service in the tent of meeting.",
      "Orthodox": "Emphasizes that the service of the clans of the sons of Merari, concerning all their service in the tent of meeting, was under the direction of Ithamar the son of Aaron the priest."
    },
    "34": {
      "General": "And Moses and Aaron and the leaders of the congregation numbered the sons of the Kohathites by their clans and their fathers' houses,",
      "Non-Denominational": "Records the execution of the census: Moses, Aaron, and the leaders of the congregation numbered the Kohathites according to their families and clans.",
      "Baptist": "Highlights the leadership's role in carrying out the census of the Kohathites.",
      "Catholic": "Focuses on the involvement of Moses, Aaron, and the leaders in the enumeration of the Kohathite clans.",
      "Methodist": "Emphasizes the collaborative effort in conducting the census of the Kohathite division.",
      "Lutheran": "Highlights the obedience of Moses, Aaron, and the leaders in numbering the Kohathites.",
      "Presbyterian": "Stresses the leadership's role in conducting the census of the Kohathites within the community.",
      "Pentecostal": "Highlights the involvement of Moses, Aaron, and the leaders in counting the Kohathites.",
      "Anglican": "Notes the historical action of Moses, Aaron, and the leaders in numbering the Kohathites.",
      "Orthodox": "Emphasizes the role of Moses, Aaron, and the leaders of the congregation in numbering the sons of the Kohathites by their clans and their fathers' houses."
    },
    "35": {
      "General": "from thirty years old up to fifty years old, all who qualified for service in the tent of meeting.",
      "Non-Denominational": "Reiterates the age range for the Kohathites included in the census: thirty to fifty years old, those eligible for service.",
      "Baptist": "Notes again the age criteria for the Kohathites included in the census.",
      "Catholic": "Highlights the age range of the Kohathites who were counted for service.",
      "Methodist": "Emphasizes the age parameters for the Kohathites counted for active service.",
      "Lutheran": "Highlights the age range of thirty to fifty years for the Kohathites numbered for service.",
      "Presbyterian": "Stresses the age criteria for the Kohathites included in the census for service.",
      "Pentecostal": "Highlights the age range of the Kohathites counted as fit for service.",
      "Anglican": "Notes the age limits for the Kohathites included in the census.",
      "Orthodox": "Emphasizes the age range of thirty to fifty years for all the Kohathites who qualified for service in the tent of meeting and were numbered."
    },
    "36": {
      "General": "And their number by their clans was two thousand seven hundred and fifty.",
      "Non-Denominational": "Records the total number of Kohathites counted within the specified age range: two thousand seven hundred and fifty.",
      "Baptist": "Notes the total count of Kohathites eligible for service.",
      "Catholic": "Highlights the numerical count of the Kohathites fit for service.",
      "Methodist": "Records the total number of Kohathites counted for service.",
      "Lutheran": "Presents the total number of Kohathites within the specified age range.",
      "Presbyterian": "Records the total number of Kohathites eligible for service.",
      "Pentecostal": "Highlights the total count of Kohathites fit for service.",
      "Anglican": "Notes the total number of Kohathites counted for service.",
      "Orthodox": "Records the total number of Kohathites aged thirty to fifty who qualified for service, counted by their clans."
    },
    "37": {
      "General": "This was the number of the Kohathites, all who served in the tent of meeting.",
      "Non-Denominational": "Summarizes that this count represented all the Kohathites within the eligible age range who were to perform service in the Tabernacle.",
      "Baptist": "Notes that this was the total number of Kohathites designated for service.",
      "Catholic": "Highlights that this number represented all the Kohathites eligible for service in the tent of meeting.",
      "Methodist": "Emphasizes that this count included all Kohathites qualified for service.",
      "Lutheran": "Highlights that this was the total number of Kohathites who were to serve in the Tabernacle.",
      "Presbyterian": "Stresses that this number represented all the Kohathites within the specified age range who were to serve.",
      "Pentecostal": "Highlights that this was the total count of Kohathites fit for service in the Tabernacle.",
      "Anglican": "Notes that this number represented all the Kohathites who served in the tent of meeting.",
      "Orthodox": "Emphasizes that this was the total number of Kohathites aged thirty to fifty who were to serve in the tent of meeting."
    },
    "38": {
      "General": "And the number of the sons of Gershon, by their clans and their fathers' houses,",
      "Non-Denominational": "Begins the record of the census of the Gershonites, counted by their families and clans.",
      "Baptist": "Notes the start of the census for the Gershonite families.",
      "Catholic": "Highlights the enumeration of the Gershonite clans.",
      "Methodist": "Records the beginning of the count for the Gershonite division.",
      "Lutheran": "Highlights the start of the numbering of the Gershonites.",
      "Presbyterian": "Stresses the beginning of the census for the Gershonite clan.",
      "Pentecostal": "Highlights the start of the count for the Gershonite families.",
      "Anglican": "Notes the beginning of the numbering of the Gershonite clans.",
      "Orthodox": "Begins the record of the census of the sons of Gershon, by their clans and their fathers' houses."
    },
    "39": {
      "General": "from thirty years old up to fifty years old, all who qualified for service in the tent of meeting,",
      "Non-Denominational": "Specifies the age range for the Gershonites included in the census: thirty to fifty years old, those eligible for service.",
      "Baptist": "Notes the age criteria for the Gershonites included in the census.",
      "Catholic": "Highlights the age range of the Gershonites who were counted for service.",
      "Methodist": "Emphasizes the age parameters for the Gershonites counted for active service.",
      "Lutheran": "Highlights the age range of thirty to fifty years for the Gershonites numbered for service.",
      "Presbyterian": "Stresses the age criteria for the Gershonites included in the census for service.",
      "Pentecostal": "Highlights the age range of the Gershonites counted as fit for service.",
      "Anglican": "Notes the age limits for the Gershonites included in the census.",
      "Orthodox": "Emphasizes the age range of thirty to fifty years for all the Gershonites who qualified for service in the tent of meeting and were numbered."
    },
    "40": {
      "General": "and their number by their clans and by their fathers' houses was two thousand six hundred and thirty.",
      "Non-Denominational": "Records the total number of Gershonites counted within the specified age range: two thousand six hundred and thirty.",
      "Baptist": "Notes the total count of Gershonites eligible for service.",
      "Catholic": "Highlights the numerical count of the Gershonites fit for service.",
      "Methodist": "Records the total number of Gershonites counted for service.",
      "Lutheran": "Presents the total number of Gershonites within the specified age range.",
      "Presbyterian": "Records the total number of Gershonites eligible for service.",
      "Pentecostal": "Highlights the total count of Gershonites fit for service.",
      "Anglican": "Notes the total number of Gershonites counted for service.",
      "Orthodox": "Records the total number of Gershonites aged thirty to fifty who qualified for service, counted by their clans and fathers' houses."
    },
    "41": {
      "General": "This was the number of the sons of Gershon, all who served in the tent of meeting.",
      "Non-Denominational": "Summarizes that this count represented all the Gershonites within the eligible age range who were to perform service in the Tabernacle.",
      "Baptist": "Notes that this was the total number of Gershonites designated for service.",
      "Catholic": "Highlights that this number represented all the Gershonites eligible for service in the tent of meeting.",
      "Methodist": "Emphasizes that this count included all Gershonites qualified for service.",
      "Lutheran": "Highlights that this was the total number of Gershonites who were to serve in the Tabernacle.",
      "Presbyterian": "Stresses that this number represented all the Gershonites within the specified age range who were to serve.",
      "Pentecostal": "Highlights that this was the total count of Gershonites fit for service in the Tabernacle.",
      "Anglican": "Notes that this number represented all the Gershonites who served in the tent of meeting.",
      "Orthodox": "Emphasizes that this was the total number of the sons of Gershon aged thirty to fifty who were to serve in the tent of meeting."
    },
    "42": {
      "General": "And the number of the clans of the sons of Merari, by their clans and their fathers' houses,",
      "Non-Denominational": "Begins the record of the census of the Merarites, counted by their families and clans.",
      "Baptist": "Notes the start of the census for the Merarite families.",
      "Catholic": "Highlights the enumeration of the Merarite clans.",
      "Methodist": "Records the beginning of the count for the Merarite division.",
      "Lutheran": "Highlights the start of the numbering of the Merarites.",
      "Presbyterian": "Stresses the beginning of the census for the Merarite clan.",
      "Pentecostal": "Highlights the start of the count for the Merarite families.",
      "Anglican": "Notes the beginning of the numbering of the Merarite clans.",
      "Orthodox": "Begins the record of the census of the clans of the sons of Merari, by their clans and their fathers' houses."
    },
    "43": {
      "General": "from thirty years old up to fifty years old, all who qualified for service in the tent of meeting,",
      "Non-Denominational": "Specifies the age range for the Merarites included in the census: thirty to fifty years old, those eligible for service.",
      "Baptist": "Notes the age criteria for the Merarites included in the census.",
      "Catholic": "Highlights the age range of the Merarites who were counted for service.",
      "Methodist": "Emphasizes the age parameters for the Merarites counted for active service.",
      "Lutheran": "Highlights the age range of thirty to fifty years for the Merarites numbered for service.",
      "Presbyterian": "Stresses the age criteria for the Merarites included in the census for service.",
      "Pentecostal": "Highlights the age range of the Merarites counted as fit for service.",
      "Anglican": "Notes the age limits for the Merarites included in the census.",
      "Orthodox": "Emphasizes the age range of thirty to fifty years for all the Merarites who qualified for service in the tent of meeting and were numbered."
    },
    "44": {
      "General": "and their number by their clans was three thousand two hundred.",
      "Non-Denominational": "Records the total number of Merarites counted within the specified age range: three thousand two hundred.",
      "Baptist": "Notes the total count of Merarites eligible for service.",
      "Catholic": "Highlights the numerical count of the Merarites fit for service.",
      "Methodist": "Records the total number of Merarites counted for service.",
      "Lutheran": "Presents the total number of Merarites within the specified age range.",
      "Presbyterian": "Records the total number of Merarites eligible for service.",
      "Pentecostal": "Highlights the total count of Merarites fit for service.",
      "Anglican": "Notes the total number of Merarites counted for service.",
      "Orthodox": "Records the total number of Merarites aged thirty to fifty who qualified for service, counted by their clans."
    },
    "45": {
      "General": "This was the number of the clans of the sons of Merari, all who served in the tent of meeting.",
      "Non-Denominational": "Summarizes that this count represented all the Merarites within the eligible age range who were to perform service in the Tabernacle.",
      "Baptist": "Notes that this was the total number of Merarites designated for service.",
      "Catholic": "Highlights that this number represented all the Merarites eligible for service in the tent of meeting.",
      "Methodist": "Emphasizes that this count included all Merarites qualified for service.",
      "Lutheran": "Highlights that this was the total number of Merarites who were to serve in the Tabernacle.",
      "Presbyterian": "Stresses that this number represented all the Merarites within the specified age range who were to serve.",
      "Pentecostal": "Highlights that this was the total count of Merarites fit for service in the Tabernacle.",
      "Anglican": "Notes that this number represented all the Merarites who served in the tent of meeting.",
      "Orthodox": "Emphasizes that this was the total number of the clans of the sons of Merari aged thirty to fifty who were to serve in the tent of meeting."
    },
    "46": {
      "General": "All those who were numbered of the Levites, whom Moses and Aaron and the leaders of Israel numbered, by their clans and by their fathers' houses,",
      "Non-Denominational": "Summarizes the overall census of the Levites, including Kohathites, Gershonites, and Merarites, who were numbered by Moses, Aaron, and the leaders of Israel according to their families and clans.",
      "Baptist": "Notes the comprehensive census of all the Levite divisions by the designated leaders.",
      "Catholic": "Highlights the total enumeration of the Levites by Moses, Aaron, and the leaders, according to their clans and families.",
      "Methodist": "Emphasizes the collective effort of the leadership in conducting the census of all the Levites.",
      "Lutheran": "Highlights the final count of all Levites who met the criteria, numbered by Moses, Aaron, and the leaders.",
      "Presbyterian": "Stresses the comprehensive census of the Levites within the community, conducted by the designated leaders.",
      "Pentecostal": "Highlights the total count of all Levites by Moses, Aaron, and the leaders, according to their families.",
      "Anglican": "Notes the comprehensive numbering of all the Levites by Moses, Aaron, and the leaders.",
      "Orthodox": "Emphasizes the final summary of the census of all the Levites, numbered by Moses, Aaron, and the leaders of Israel, by their clans and by their fathers' houses."
    },
    "47": {
      "General": "from thirty years old up to fifty years old, all who qualified for service and for the work of bearing burdens in the tent of meeting,",
      "Non-Denominational": "Reiterates the age range for the Levites included in the census: thirty to fifty years old, those eligible for both general service and the specific work of carrying the Tabernacle and its furnishings.",
      "Baptist": "Notes again the age criteria for the Levites eligible for both service and transport duties.",
      "Catholic": "Highlights the age range of the Levites counted for both general service and the work of carrying.",
      "Methodist": "Emphasizes the age parameters for the Levites counted for both active service and transport.",
      "Lutheran": "Highlights the age range of thirty to fifty years for the Levites numbered for both service and carrying responsibilities.",
      "Presbyterian": "Stresses the age criteria for the Levites included in the census for both general service and the work of bearing burdens.",
      "Pentecostal": "Highlights the age range of the Levites counted as fit for both service and the transport of the Tabernacle.",
      "Anglican": "Notes the age limits for the Levites included in the census for both service and carrying.",
      "Orthodox": "Emphasizes the age range of thirty to fifty years for all the Levites who qualified for both general service and the work of bearing burdens in the tent of meeting and were numbered."
    },
    "48": {
      "General": "and their number was eight thousand five hundred and eighty.",
      "Non-Denominational": "Records the grand total of all Levites counted within the specified age range for service and transport: eight thousand five hundred and eighty.",
      "Baptist": "Notes the total count of Levites eligible for service and transport duties.",
      "Catholic": "Highlights the numerical total of the Levites fit for both general service and carrying.",
      "Methodist": "Records the total number of Levites counted for both service and transport.",
      "Lutheran": "Presents the grand total of Levites within the specified age range.",
      "Presbyterian": "Records the total number of Levites eligible for both service and bearing burdens.",
      "Pentecostal": "Highlights the total count of Levites fit for both service and transport.",
      "Anglican": "Notes the total number of Levites counted for service and carrying.",
      "Orthodox": "Records the grand total number of Levites aged thirty to fifty who qualified for service and the work of bearing burdens in the tent of meeting."
    },
    "49": {
      "General": "According to the commandment of the Lord they were listed by Moses, each with his task of service and with his load to carry. Thus they were listed by him, as the Lord commanded Moses.",
      "Non-Denominational": "Concludes the chapter by emphasizing that the Levites were listed according to God's command through Moses, with each individual assigned their specific task of service and the load they were to carry, highlighting the meticulous organization and divine authority behind their roles.",
      "Baptist": "Highlights the complete obedience to God's commands in the listing and assignment of duties to the Levites.",
      "Catholic": "Focuses on the divine authority and the precise assignment of tasks and burdens to each Levite by Moses, according to God's word.",
      "Methodist": "Emphasizes the importance of divine direction and the orderly assignment of responsibilities within the community's service.",
      "Lutheran": "Highlights the final note of obedience to the Lord's commandment in the listing and assignment of tasks to the Levites.",
      "Presbyterian": "Stresses the adherence to divine instruction in the listing and assignment of duties within the covenant community's service.",
      "Pentecostal": "Highlights the concluding statement affirming the Levites were listed and assigned tasks according to God's specific commands through Moses.",
      "Anglican": "Notes the concluding remark on the obedience to the Lord's commands in the listing and assignment of duties to the Levites.",
      "Orthodox": "Emphasizes the final statement highlighting the complete obedience to the commandment of the Lord in the listing of the Levites by Moses, each with their assigned task of service and load to carry, as the Lord had commanded."
    }
  }