{
  "chapterSummary": {
    "General": "Numbers 4 details the duties of the Kohathites, Gershonites, and Merarites, who are responsible for the care and transportation of the tabernacle and its furnishings.",
    "Non-Denominational": "This chapter highlights the importance of organized service and the specific roles assigned to different families.",
    "Baptist": "The chapter emphasizes the importance of service and dedication to God's work.",
    "Catholic": "Numbers 4 illustrates the Church's understanding of sacred service and the role of the clergy.",
    "Methodist": "This chapter shows the importance of organized service and the role of dedicated individuals in the community.",
    "Lutheran": "The chapter demonstrates God's order and the special role of the Levites in His plan.",
    "Presbyterian": "This chapter reflects God's covenant faithfulness and the importance of dedicated service.",
    "Pentecostal": "Numbers 4 shows the importance of spiritual dedication and service in God's kingdom.",
    "Anglican": "The chapter demonstrates the importance of sacred service and the role of the clergy.",
    "Orthodox": "This chapter reveals the sacred nature of service and the unique role of the Levites."
  },
  "1": {
    "General": "The Lord said to Moses and Aaron:",
    "Non-Denominational": "God's communication with Moses and Aaron highlights the importance of leadership and guidance.",
    "Baptist": "The verse emphasizes the importance of divine guidance in leadership.",
    "Catholic": "God's communication reflects the importance of divine guidance in the Church.",
    "Methodist": "This verse shows the importance of divine guidance in the community.",
    "Lutheran": "God's communication with Moses and Aaron highlights the importance of guidance.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of guidance.",
    "Pentecostal": "God's communication emphasizes the importance of divine guidance.",
    "Anglican": "The account highlights the importance of divine guidance in God's plan.",
    "Orthodox": "This verse reveals the importance of divine guidance in God's plan."
  },
  "2": {
    "General": "Take a census of the Kohathite branch of the Levites by their clans and families.",
    "Non-Denominational": "The census of the Kohathites highlights the importance of organization and service.",
    "Baptist": "The verse emphasizes the importance of organization and service in God's work.",
    "Catholic": "The census reflects the importance of organization and service in the Church.",
    "Methodist": "This verse shows the importance of organization and service in the community.",
    "Lutheran": "The census of the Kohathites highlights the importance of organization.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of organization.",
    "Pentecostal": "The census emphasizes the importance of organization and service.",
    "Anglican": "The account highlights the importance of organization and service in God's plan.",
    "Orthodox": "This verse reveals the importance of organization and service in God's plan."
  },
  "3": {
    "General": "Count all the men from thirty to fifty years of age who come to serve in the work at the Tent of Meeting.",
    "Non-Denominational": "The age requirement highlights the importance of maturity and capability in service.",
    "Baptist": "The verse emphasizes the importance of maturity and capability in God's work.",
    "Catholic": "The age requirement reflects the importance of maturity and capability in the Church.",
    "Methodist": "This verse shows the importance of maturity and capability in the community.",
    "Lutheran": "The age requirement highlights the importance of maturity.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of maturity.",
    "Pentecostal": "The age requirement emphasizes the importance of maturity and capability.",
    "Anglican": "The account highlights the importance of maturity and capability in God's plan.",
    "Orthodox": "This verse reveals the importance of maturity and capability in God's plan."
  },
  "4": {
    "General": "This is the work of the Kohathites at the Tent of Meeting: the care of the most holy things.",
    "Non-Denominational": "The work of the Kohathites highlights the importance of sacred service.",
    "Baptist": "The verse emphasizes the importance of sacred service in God's work.",
    "Catholic": "The work reflects the importance of sacred service in the Church.",
    "Methodist": "This verse shows the importance of sacred service in the community.",
    "Lutheran": "The work of the Kohathites highlights the importance of sacred service.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of sacred service.",
    "Pentecostal": "The work emphasizes the importance of sacred service.",
    "Anglican": "The account highlights the importance of sacred service in God's plan.",
    "Orthodox": "This verse reveals the importance of sacred service in God's plan."
  },
  "5": {
    "General": "When the camp is to move, Aaron and his sons are to go in and take down the shielding curtain and cover the ark of the Testimony with it.",
    "Non-Denominational": "The movement of the camp highlights the importance of careful handling of sacred items.",
    "Baptist": "The verse emphasizes the importance of careful handling of sacred items in God's work.",
    "Catholic": "The movement reflects the importance of careful handling of sacred items in the Church.",
    "Methodist": "This verse shows the importance of careful handling of sacred items in the community.",
    "Lutheran": "The movement of the camp highlights the importance of careful handling.",
    "Presbyterian": "The verse reflects God's covenant with His servants and the importance of careful handling.",
    "Pentecostal": "The movement emphasizes the importance of careful handling of sacred items.",
    "Anglican": "The account highlights the importance of careful handling of sacred items in God's plan.",
    "Orthodox": "This verse reveals the importance of careful handling of sacred items in God's plan."
  }
} 