{
  "_comment": "Interpretations for Numbers Chapter 5",
  "book": "Numbers",
  "chapter": "5",
  "chapterSummary": {
    "General": "Chapter 5 details laws concerning ritual purity within the Israelite camp, restitution for wrongs committed, and the unique 'law of jealousy' involving a ritual for a wife suspected of adultery by her husband.",
    "Non-Denominational": "Focuses on the need for holiness and purity within God's community, addressing physical defilement, relational integrity through restitution, and marital faithfulness through the jealousy ordeal. Emphasizes God's concern for justice and the sanctity of relationships within the covenant community.",
    "Baptist": "Highlights God's requirement for separation from uncleanness (spiritual and physical) within the camp where His presence dwells. Stresses personal responsibility for sin, the necessity of confession and restitution for wrongs, and views the jealousy ordeal as a specific (though difficult) provision under the Law to address suspicion and maintain covenant order.",
    "Catholic": "Interprets the laws as reflecting God's holiness and the need for the community to mirror that holiness. Restitution underscores justice and repairing harm. Views the jealousy ordeal (ordeal of bitter water) as a unique Old Testament legal procedure, superseded by Christ's teachings, intended to resolve serious marital accusations and protect the sacredness of marriage within that specific context.",
    "Methodist": "Emphasizes the importance of maintaining a holy community where God dwells. Addresses ritual purity, social justice through restitution (making things right), and the seriousness of marital fidelity. The jealousy ordeal is seen as a means within the Old Law to address deep relational breakdown and suspicion, reflecting God's concern for truth and order.",
    "Lutheran": "Focuses on God's command for purity in the camp because He dwells there. Views the restitution laws as demonstrating the Law's function in revealing sin and requiring amends. Interprets the jealousy ordeal as a specific legal ceremony under the Mosaic Law to address accusations and bring hidden sin to light or vindicate the innocent, highlighting God's desire for truth within marriage.",
    "Presbyterian": "Sees the laws reflecting the covenant requirements for maintaining purity and justice in God's presence. Restitution emphasizes repairing breaches in the community. The jealousy ordeal is understood within its Old Covenant context as a legal means to adjudicate accusations of adultery, upholding the sanctity of marriage and community order, ultimately pointing to the need for Christ's perfect righteousness.",
    "Pentecostal": "Emphasizes the importance of maintaining a sanctified environment for the presence of the Holy Spirit. Focuses on cleansing from defilement, the need for genuine repentance involving confession and restitution, and the seriousness with which God views marital vows. The jealousy ordeal highlights God's power to reveal truth and hidden sin.",
    "Anglican": "Views the chapter as addressing different aspects of holiness required for the community dwelling with God: ritual purity, ethical conduct (restitution), and relational integrity (jealousy ordeal). Understands the ordeal within its historical and covenantal context as a way to resolve intractable suspicion, while affirming the New Testament's emphasis on grace and forgiveness.",
    "Orthodox": "Interprets the purity laws typologically, pointing towards spiritual purity needed to approach God. Restitution emphasizes restoring broken relationships. Views the jealousy ordeal as a specific, severe measure within the Old Law to deal with marital suspicion, reflecting the seriousness of sin within the covenant community, while stressing the transformation of such laws in Christ."
  },
  "verses": {
    "1": {
      "General": "The Lord commands Moses regarding the purity of the Israelite camp.",
      "Non-Denominational": "God instructs Moses on maintaining community purity.",
      "Baptist": "Yahweh gives specific instructions to Moses concerning camp cleanliness.",
      "Catholic": "The Lord speaks to Moses about maintaining sanctity within the encampment.",
      "Methodist": "God directs Moses on the requirements for keeping the camp holy.",
      "Lutheran": "The Lord gives Moses instructions for the purity of the camp.",
      "Presbyterian": "Yahweh commands Moses concerning the maintenance of ritual purity in the camp.",
      "Pentecostal": "God speaks to Moses about ensuring the camp remains undefiled.",
      "Anglican": "The Lord commands Moses regarding the maintenance of purity among the Israelites.",
      "Orthodox": "The Lord instructs Moses on preserving the holiness of the community's dwelling place."
    },
    "2": {
      "General": "Command to remove from the camp anyone with a defiling skin disease, a discharge, or who is unclean from contact with a dead body.",
      "Non-Denominational": "Instruction to separate those with specific types of ritual uncleanness to preserve the community's holiness.",
      "Baptist": "Specific command to exclude individuals with leprosy, bodily discharges, or corpse contamination from the main camp.",
      "Catholic": "Requirement to send outside the camp those ritually impure due to leprosy, discharges, or contact with the dead.",
      "Methodist": "Directive to remove those with defiling conditions (skin diseases, discharges, corpse uncleanness) from the camp.",
      "Lutheran": "Commandment to put out of the camp everyone with leprosy, discharges, or uncleanness from the dead.",
      "Presbyterian": "Instruction to exclude from the camp those affected by ritual defilement specified by the Law.",
      "Pentecostal": "Order to separate individuals with defiling conditions to maintain the camp's sanctity.",
      "Anglican": "Command to put out of the camp all who are ritually unclean through specific conditions.",
      "Orthodox": "Instruction to remove from the community those considered ritually impure according to the Law."
    },
    "3": {
      "General": "This command applies to both males and females; they must be sent outside the camp so they do not defile it, as God dwells among them.",
      "Non-Denominational": "Emphasizes the universality of the command (male and female) and the reason: to prevent defilement of the camp where God resides.",
      "Baptist": "Specifies the command applies equally to men and women, reinforcing the reason: God's presence requires camp purity.",
      "Catholic": "Stresses the inclusion of both sexes in this law and links the exclusion to the necessity of maintaining the sanctity of the camp due to God's dwelling presence.",
      "Methodist": "Clarifies the command applies to both genders and underlines the theological basis: God's presence necessitates camp holiness.",
      "Lutheran": "Applies the command to both men and women, grounding the requirement in the fact that God dwells in their midst.",
      "Presbyterian": "Extends the requirement to both males and females, emphasizing the theological rationale: preventing defilement because Yahweh dwells there.",
      "Pentecostal": "Highlights that both men and women must be excluded if unclean, because God's presence demands holiness.",
      "Anglican": "Specifies the command includes both males and females, linking the exclusion to the need to keep the camp undefiled where God dwells.",
      "Orthodox": "Indicates the law applies universally within the community, connecting the requirement for exclusion to the sanctity needed due to God's immanence."
    },
    "4": {
      "General": "The Israelites obeyed this command and removed the unclean individuals from the camp as the Lord had instructed Moses.",
      "Non-Denominational": "Records the Israelites' obedience in implementing God's instructions regarding community purity.",
      "Baptist": "Documents the faithfulness of the Israelites in carrying out God's command concerning the unclean.",
      "Catholic": "Notes the compliance of the Israelites with the divine command given through Moses regarding ritual purity.",
      "Methodist": "Shows the Israelites' adherence to God's instructions for maintaining camp holiness.",
      "Lutheran": "Records the obedience of the people in putting the unclean out of the camp according to God's Word.",
      "Presbyterian": "Documents the Israelites' compliance with the command to maintain ritual purity in the camp.",
      "Pentecostal": "Shows the community's obedience in separating the unclean as God commanded.",
      "Anglican": "Records the Israelites' obedience in putting the unclean outside the camp as instructed.",
      "Orthodox": "Notes the fulfillment of the Lord's command by the Israelites in maintaining ritual purity."
    },
    "5": {
      "General": "The Lord speaks to Moses concerning restitution for wrongs.",
      "Non-Denominational": "God addresses the issue of making amends for sins committed against others.",
      "Baptist": "Yahweh gives instructions regarding compensation for wrongdoing.",
      "Catholic": "The Lord instructs Moses on the necessity of making restitution for sins.",
      "Methodist": "God provides guidance on how to make things right when someone wrongs another.",
      "Lutheran": "The Lord speaks to Moses concerning recompense for sin.",
      "Presbyterian": "Yahweh commands Moses regarding the laws of restitution for sins against a neighbor.",
      "Pentecostal": "God instructs Moses on the process of restitution for confessed sins.",
      "Anglican": "The Lord commands Moses concerning the making of restitution for wrongdoings.",
      "Orthodox": "The Lord instructs Moses regarding the means of atonement and restoration for wrongdoing."
    },
    "6": {
      "General": "Instructs that when a man or woman commits any sin against another person, thus breaking faith with the Lord, that person is guilty.",
      "Non-Denominational": "Establishes that wronging another person is also an act of unfaithfulness towards God, incurring guilt.",
      "Baptist": "Links sins committed against fellow humans directly to a breach of faith with Yahweh, resulting in guilt.",
      "Catholic": "Teaches that sins against one's neighbor are simultaneously offenses against God, establishing the person's guilt.",
      "Methodist": "Connects interpersonal sin with unfaithfulness to God, affirming the sinner's guilt.",
      "Lutheran": "Declares that sinning against a neighbor constitutes unfaithfulness to the Lord and makes the person guilty.",
      "Presbyterian": "Establishes that transgressions against others are a violation of the covenant relationship with God, resulting in guilt.",
      "Pentecostal": "Shows that harming others is also breaking faith with God and brings guilt upon the individual.",
      "Anglican": "States that committing a sin against another person is an act of unfaithfulness to the Lord, making the perpetrator guilty.",
      "Orthodox": "Teaches that sins against fellow humans are also breaches of faith towards God, establishing culpability."
    },
    "7": {
      "General": "The guilty person must confess the sin they have committed. They must make full restitution for the wrong, add a fifth (20%) to it, and give it to the person they have wronged.",
      "Non-Denominational": "Requires confession of the specific sin and mandates full restitution plus a 20% penalty, paid directly to the injured party.",
      "Baptist": "Commands confession of the sin, full repayment of the principal amount of the loss, plus an added one-fifth penalty, given to the victim.",
      "Catholic": "Stipulates the necessity of confessing the sin and making full reparation, including an additional fifth part, to the one who was wronged.",
      "Methodist": "Requires the guilty party to confess their sin, make full restitution for the harm caused, and add a 20% surcharge payable to the victim.",
      "Lutheran": "Commands confession of sin and full restitution for the principal loss, with an added fifth, given to the person wronged.",
      "Presbyterian": "Requires confession of the sin and full restitution (principal plus one-fifth) to the injured party, restoring justice.",
      "Pentecostal": "Mandates confession, full repayment for the wrong, plus an additional 20% penalty paid to the victim.",
      "Anglican": "Requires the guilty person to confess their sin and make full restitution, adding a fifth part, to the person wronged.",
      "Orthodox": "Commands confession of the transgression and full material restoration to the victim, including an additional one-fifth penalty."
    },
    "8": {
      "General": "If the wronged person has died and has no near kinsman to receive the restitution, the restitution belongs to the Lord and must be given to the priest, along with the ram of atonement that makes atonement for the guilty person.",
      "Non-Denominational": "Provides instruction for cases where the victim is deceased and has no heir: the restitution payment goes to the Lord (via the priest), alongside the required atonement sacrifice.",
      "Baptist": "Specifies that if the victim is dead and has no kinsman-redeemer, the restitution payment (plus penalty) is dedicated to Yahweh and given to the priest, in addition to the ram offering for atonement.",
      "Catholic": "Addresses the situation where the wronged party is deceased without a kinsman; the restitution is then made to the Lord through the priest, accompanying the sacrifice for atonement.",
      "Methodist": "Stipulates that if the victim has died without a close relative to receive payment, the restitution is given to the Lord (represented by the priest), along with the ram sacrifice for atonement.",
      "Lutheran": "Directs that if the wronged person has died without a kinsman, the restitution payment is owed to the Lord and given to the priest, together with the ram of atonement.",
      "Presbyterian": "Provides that if the wronged party has no kinsman to receive restitution, it is to be paid to Yahweh via the priest, along with the prescribed atonement offering.",
      "Pentecostal": "Instructs that if the victim has died and has no heir, the restitution money goes to the priest for the Lord, separate from the atonement sacrifice.",
      "Anglican": "Specifies that if the wronged person has no kinsman to receive restitution, it shall be paid to the Lord for the priest, along with the ram of atonement.",
      "Orthodox": "Provides that in the absence of a kinsman of the deceased victim, the restitution belongs to the Lord and is given to the priest, alongside the required sacrifice."
    },
    "9": {
      "General": "All sacred contributions the Israelites bring to the priest will belong to him.",
      "Non-Denominational": "Establishes the principle that designated holy contributions brought by the people become the property of the serving priest.",
      "Baptist": "States that all holy offerings ('terumah') presented by the Israelites are assigned to the priest.",
      "Catholic": "Declares that sacred offerings presented by the Israelites belong to the priest officiating.",
      "Methodist": "Assigns ownership of the sacred contributions brought by the people to the priest.",
      "Lutheran": "Specifies that every contribution lifted up (holy offering) belongs to the priest.",
      "Presbyterian": "Establishes the priest's right to the holy contributions offered by the people.",
      "Pentecostal": "Affirms that the holy gifts brought by the people are the portion of the priest.",
      "Anglican": "States that all contributions that the Israelites dedicate shall be the priest's.",
      "Orthodox": "Assigns the sacred gifts and offerings brought by the people to the priest who receives them."
    },
    "10": {
      "General": "Each person's sacred contributions remain their own [until presented], but what they give to the priest belongs to the priest.",
      "Non-Denominational": "Clarifies that while individuals own their potential offerings, once given to the priest as a sacred contribution, they belong to the priest.",
      "Baptist": "Distinguishes ownership: sacred things belong to the individual until dedicated, after which they become the priest's property.",
      "Catholic": "Specifies that while holy things belong to the individual, whatever is given to the priest becomes the priest's possession.",
      "Methodist": "Differentiates between potential offerings (owned by the individual) and actual offerings given (which belong to the priest).",
      "Lutheran": "Clarifies that each person's holy things are theirs, but what is given to the priest belongs to the priest.",
      "Presbyterian": "Affirms individual ownership of potential holy gifts, but confirms the priest's ownership once the gift is presented.",
      "Pentecostal": "States that while holy things belong to the offerer initially, they become the priest's portion upon presentation.",
      "Anglican": "Clarifies that each person's holy donations are their own, but what is given to the priest belongs to the priest.",
      "Orthodox": "Distinguishes between the potential offering (belonging to the individual) and the actual offering given to the priest (which becomes his)."
    },
    "11": {
      "General": "The Lord speaks to Moses concerning the law of jealousy.",
      "Non-Denominational": "God introduces the specific procedure for dealing with a husband's suspicion of his wife's adultery.",
      "Baptist": "Yahweh gives Moses instructions for the 'law of jealousies' ritual.",
      "Catholic": "The Lord instructs Moses regarding the specific ordinance ('law of jealousy') for cases of suspected marital infidelity.",
      "Methodist": "God outlines the process to be followed when a husband is jealous and suspects his wife of adultery.",
      "Lutheran": "The Lord speaks to Moses concerning the law to be applied in cases of jealousy.",
      "Presbyterian": "Yahweh commands Moses regarding the specific statute for dealing with a husband's jealousy and suspicion of adultery.",
      "Pentecostal": "God gives instructions for the ritual to address a husband's spirit of jealousy.",
      "Anglican": "The Lord commands Moses concerning the law to be enacted when a spirit of jealousy comes upon a husband.",
      "Orthodox": "The Lord instructs Moses on the procedure ('law of jealousy') for addressing a husband's suspicion of his wife's faithfulness."
    },
    "12": {
      "General": "Speak to the Israelites: If a man's wife goes astray and is unfaithful to him,",
      "Non-Denominational": "Addresses the specific scenario: a wife is suspected by her husband of committing adultery.",
      "Baptist": "The law applies when a wife deviates from faithfulness ('goes astray') and acts treacherously against her husband.",
      "Catholic": "Introduces the case: a wife turns aside ('goes astray') and breaches faith with her husband.",
      "Methodist": "Specifies the situation: a wife is suspected of being unfaithful to her husband.",
      "Lutheran": "Applies to the case where a man's wife goes astray and breaks faith with him.",
      "Presbyterian": "Describes the scenario activating the law: a wife is unfaithful ('goes astray') and commits a trespass against her husband.",
      "Pentecostal": "Concerns the situation where a wife becomes unfaithful and sins against her husband.",
      "Anglican": "Instructs Moses to speak to the people regarding a wife who goes astray and is unfaithful to her husband.",
      "Orthodox": "Addresses the case where a wife deviates from marital fidelity and acts unfaithfully towards her husband."
    },
    "13": {
      "General": "and another man has sexual relations with her, but it is hidden from her husband and her impurity is undetected (since there is no witness against her, and she was not caught in the act),",
      "Non-Denominational": "Details the grounds for suspicion: adultery occurred, but secretly, without witnesses or direct evidence.",
      "Baptist": "Describes the hidden nature of the suspected sin: intercourse occurred, but it remains concealed from the husband, lacking witnesses or apprehension.",
      "Catholic": "Specifies the conditions: sexual infidelity occurred, but it is concealed from the husband, and the defilement is hidden due to lack of witnesses or being caught.",
      "Methodist": "Explains the situation: adultery happened secretly, hidden from the husband, with no witnesses or evidence.",
      "Lutheran": "Describes the suspected act as hidden from the husband's eyes, with no witness and the wife not being seized.",
      "Presbyterian": "Details the circumstance: a man lies with her carnally, but it is hidden from the husband, and she is undetected, lacking witnesses or being caught.",
      "Pentecostal": "Specifies the nature of the suspicion: adultery occurred secretly, without the husband's knowledge or any witnesses.",
      "Anglican": "Details the scenario: intercourse occurred secretly, hidden from the husband, with no witness and without her being caught.",
      "Orthodox": "Describes the situation: the act of infidelity is hidden from the husband, remaining undetected due to the absence of witnesses or apprehension."
    },
    "14": {
      "General": "and if feelings of jealousy come over her husband and he suspects his wife, whether she has defiled herself or not,",
      "Non-Denominational": "Focuses on the husband's internal state: a 'spirit of jealousy' arises, causing suspicion, regardless of the wife's actual guilt or innocence.",
      "Baptist": "Describes the husband being overcome by a 'spirit of jealousy,' leading him to suspect his wife, irrespective of her actual guilt.",
      "Catholic": "Highlights the husband's motivation: a 'spirit of jealousy' prompts suspicion, whether the wife is truly defiled or innocent.",
      "Methodist": "Points to the husband's emotional state ('spirit of jealousy') as the trigger for suspicion, which may or may not be founded.",
      "Lutheran": "Describes the 'spirit of jealousy' coming upon the husband, causing suspicion, whether justified or not.",
      "Presbyterian": "Focuses on the husband's 'spirit of jealousy' which provokes suspicion concerning his wife's fidelity, whether she is defiled or not.",
      "Pentecostal": "Indicates the husband is motivated by a 'spirit of jealousy,' leading to suspicion, regardless of the wife's actual actions.",
      "Anglican": "Describes the husband being overcome by a spirit of jealousy, leading to suspicion, whether the wife is actually defiled or not.",
      "Orthodox": "Emphasizes the internal state of the husband ('spirit of jealousy') which leads to suspicion, irrespective of the wife's factual guilt or innocence."
    },
    "15": {
      "General": "then the husband must bring his wife to the priest. He must also bring an offering for her: a tenth of an ephah of barley flour. He must not pour olive oil on it or put incense on it, because it is a grain offering for jealousy, a reminder offering exposing wrongdoing.",
      "Non-Denominational": "Prescribes the husband's action: bring the wife to the priest with a specific offering (barley flour, without oil or incense) designated as an offering of jealousy to bring the matter to light.",
      "Baptist": "Commands the husband to present his wife to the priest, along with a jealousy offering (barley meal, no oil or frankincense) intended as a 'memorial offering' to recall potential iniquity.",
      "Catholic": "Instructs the husband to bring his wife to the priest, accompanied by a specific grain offering (barley, without oil or incense) identified as an 'offering of jealousy' meant to bring remembrance of potential sin.",
      "Methodist": "Directs the husband to take his wife to the priest with a required offering (barley flour, plain) symbolizing jealousy and serving as a reminder of potential sin.",
      "Lutheran": "Commands the husband to bring his wife to the priest with her offering (barley meal, no oil or frankincense), described as a grain offering of jealousy, bringing iniquity to remembrance.",
      "Presbyterian": "Instructs the husband to bring his wife and the prescribed offering (barley meal, without oil or incense) to the priest; it is an offering related to jealousy, intended to recall potential sin.",
      "Pentecostal": "Requires the husband to bring his wife to the priest with a special offering (plain barley flour) representing jealousy and designed to expose potential sin.",
      "Anglican": "Directs the husband to bring his wife to the priest with the prescribed offering (barley flour, without oil or incense), designated as a grain offering of jealousy, a reminder offering bringing iniquity to remembrance.",
      "Orthodox": "Commands the husband to present his wife to the priest with a specific offering (barley meal, without oil or incense), identified as an offering of jealousy intended to recall potential transgression."
    },
    "16": {
      "General": "The priest shall bring the woman forward and have her stand before the Lord.",
      "Non-Denominational": "The priest initiates the formal ritual by placing the woman in God's presence.",
      "Baptist": "The priest brings the woman near and presents her before Yahweh.",
      "Catholic": "The priest is to bring the woman near and set her before the presence of the Lord.",
      "Methodist": "The priest brings the woman forward to stand formally before the Lord.",
      "Lutheran": "The priest shall bring her near and set her before the Lord.",
      "Presbyterian": "The priest presents the woman, causing her to stand before Yahweh.",
      "Pentecostal": "The priest brings the woman into the Lord's presence for the ordeal.",
      "Anglican": "The priest is to bring the woman near and make her stand before the Lord.",
      "Orthodox": "The priest brings the woman forward and positions her before the face of the Lord."
    },
    "17": {
      "General": "Then the priest shall take holy water in an earthen vessel and put some dust from the tabernacle floor into the water.",
      "Non-Denominational": "The priest prepares the mixture for the ordeal using holy water and dust from the sacred space.",
      "Baptist": "The priest takes holy water (likely from the laver) in a clay pot and adds dust from the tabernacle floor.",
      "Catholic": "The priest prepares the 'water of bitterness' by taking holy water in a clay jar and mixing in dust from the tabernacle floor.",
      "Methodist": "The priest mixes holy water with dust from the tabernacle floor in an earthenware jar.",
      "Lutheran": "The priest takes holy water in an earthenware vessel and mixes in dust from the floor of the tabernacle.",
      "Presbyterian": "The priest takes holy water in an earthen vessel and adds dust from the tabernacle floor.",
      "Pentecostal": "The priest prepares the ritual water by combining holy water and tabernacle dust in a clay pot.",
      "Anglican": "The priest takes holy water in an earthenware vessel and mixes it with dust from the tabernacle floor.",
      "Orthodox": "The priest takes holy water in an earthen vessel and adds dust taken from the floor of the tabernacle."
    },
    "18": {
      "General": "After the priest has the woman stand before the Lord, he shall loosen her hair and place in her hands the reminder offering, the grain offering for jealousy, while he himself holds the bitter water that brings a curse.",
      "Non-Denominational": "The priest unbinds the woman's hair (symbolic gesture), gives her the jealousy offering, and holds the curse-inducing water.",
      "Baptist": "The priest presents the woman before Yahweh, uncovers her head, places the jealousy offering in her hands, and holds the 'bitter water that causes the curse'.",
      "Catholic": "The priest sets the woman before the Lord, unbinds her hair, places the offering of remembrance (jealousy offering) in her hands, while holding the 'water of bitterness that brings the curse'.",
      "Methodist": "The priest positions the woman before the Lord, loosens her hair, places the jealousy offering in her hands, and holds the bitter, curse-bringing water.",
      "Lutheran": "The priest sets the woman before the Lord, uncovers her head, puts the grain offering of jealousy (reminder offering) in her hands, while holding the water of bitterness that brings the curse.",
      "Presbyterian": "The priest makes the woman stand before Yahweh, uncovers her head, places the jealousy offering in her hands, and holds the bitter, curse-bearing water.",
      "Pentecostal": "The priest has the woman stand before God, loosens her hair, gives her the jealousy offering, and holds the bitter water that invokes a curse.",
      "Anglican": "The priest makes the woman stand before the Lord, unbinds her hair, places the grain offering of jealousy (reminder offering) in her hands, and holds the water of bitterness that brings the curse.",
      "Orthodox": "The priest positions the woman before the Lord, uncovers her head, places the offering of remembrance (jealousy offering) in her hands, while holding the water of bitterness that induces a curse."
    },
    "19": {
      "General": "Then the priest shall put the woman under oath and say to her, 'If no other man has had sexual relations with you and you have not gone astray and become defiled while married to your husband, may this bitter water that brings a curse not harm you.",
      "Non-Denominational": "The priest administers an oath, stating the condition for innocence: if she is faithful, the water will be harmless.",
      "Baptist": "The priest adjures the woman with an oath, declaring that if she is innocent of adultery, she will be immune to the curse of the bitter water.",
      "Catholic": "The priest administers an oath, stating that if she has remained faithful and not defiled herself, she will be unharmed by the 'water of bitterness that brings the curse'.",
      "Methodist": "The priest puts the woman under oath, assuring her that if she is innocent of adultery, the curse-bearing water will not affect her.",
      "Lutheran": "The priest makes her take an oath, stating that if she is innocent and undefiled, she will be free from the effects of the bitter, curse-bringing water.",
      "Presbyterian": "The priest adjures the woman, declaring that if she has not committed adultery, she will be immune from the harmful effects of the bitter, curse-bearing water.",
      "Pentecostal": "The priest puts the woman under oath: if innocent, the bitter water will not harm her.",
      "Anglican": "The priest makes the woman take an oath: if she has not been unfaithful or defiled, she will be immune from the bitter, curse-bringing water.",
      "Orthodox": "The priest administers an oath, stating that if she has maintained fidelity and is undefiled, the water of bitterness that brings a curse will not harm her."
    },
    "20": {
      "General": "But if you have gone astray while married to your husband and have defiled yourself by having sexual relations with a man other than your husband'—",
      "Non-Denominational": "The oath continues, stating the condition for guilt: if she has been unfaithful.",
      "Baptist": "The oath presents the alternative: if she has indeed gone astray, defiled herself, and committed adultery.",
      "Catholic": "The oath states the condition of guilt: if she has turned aside, become defiled, and had relations with another man.",
      "Methodist": "The oath outlines the consequence of guilt: if she has been unfaithful and committed adultery.",
      "Lutheran": "The oath describes the condition of guilt: if she has gone astray, defiled herself, and another man has lain with her.",
      "Presbyterian": "The oath specifies the condition of guilt: if she has gone astray from her husband and become defiled through adultery.",
      "Pentecostal": "The oath states the condition for the curse: if she has been unfaithful and committed adultery.",
      "Anglican": "The oath continues, outlining the condition of guilt: if she has gone astray, become defiled, and had relations with another man.",
      "Orthodox": "The oath presents the condition for culpability: if she has deviated from fidelity and defiled herself through adultery."
    },
    "21": {
      "General": "here the priest is to put the woman under this curse—'may the Lord cause you to become a curse and an object of precise cursing among your people when he makes your thigh rot and your abdomen swell.",
      "Non-Denominational": "The priest invokes the specific curses associated with guilt: infertility/miscarriage ('thigh rot') and bodily affliction ('abdomen swell'), making her an example.",
      "Baptist": "The priest administers the oath of the curse: Yahweh will make her a curse and an oath among her people, causing her thigh to fall away (miscarry/be barren) and her belly to swell.",
      "Catholic": "The priest administers the oath with its curse: the Lord will make her an execration and an oath among her people by causing her womb to discharge ('thigh fall away') and her belly to swell.",
      "Methodist": "The priest invokes the curse for guilt: the Lord will inflict a curse causing infertility ('thigh fall away') and abdominal swelling, making her a public example.",
      "Lutheran": "The priest administers the oath of the curse: the Lord make her a curse and an oath among her people by making her thigh fall away and her body swell.",
      "Presbyterian": "The priest administers the oath of the curse: Yahweh make her a curse and oath among her people by causing her thigh to waste away and her belly to swell.",
      "Pentecostal": "The priest invokes the curse: God will cause infertility ('thigh rot') and sickness ('abdomen swell'), making her a cursed example.",
      "Anglican": "The priest administers the oath of the curse: the Lord make her a curse and an oath among her people by making her thigh fall away and her belly swell.",
      "Orthodox": "The priest pronounces the oath's curse: the Lord will make her a curse and subject of oaths among her people by causing her thigh to fall away and her belly to swell."
    },
    "22": {
      "General": "May this water that brings a curse enter your body so that your abdomen swells and your thigh rots.' Then the woman is to say, 'Amen, Amen.'",
      "Non-Denominational": "The curse invocation concludes, stating the water will enter her body to produce the effects if guilty. The woman formally accepts the terms of the oath by saying 'Amen, Amen'.",
      "Baptist": "The curse specifies the water will enter her body to cause the swelling and thigh falling. The woman must affirm the oath with a double 'Amen'.",
      "Catholic": "The curse is invoked upon the water entering her body. The woman must consent to the conditions of the oath by responding, 'Amen, Amen.'",
      "Methodist": "The curse links the water entering her body to the physical consequences. The woman confirms her acceptance of the oath's conditions with 'Amen, Amen'.",
      "Lutheran": "The curse states the water will enter her body to cause swelling and thigh falling away. The woman responds 'Amen, Amen,' affirming the oath.",
      "Presbyterian": "The curse links the ingested water to the physical consequences. The woman assents to the oath and its potential consequences by saying, 'Amen, Amen.'",
      "Pentecostal": "The curse specifies the water will cause the afflictions. The woman agrees to the oath by saying 'Amen, Amen'.",
      "Anglican": "The curse concludes, stating the water will enter her to cause the swelling and falling away. The woman responds, 'Amen. Amen.'",
      "Orthodox": "The curse links the ingested water to the physical effects. The woman must formally assent to the oath by declaring, 'Amen, Amen.'"
    },
    "23": {
      "General": "The priest is to write these curses on a scroll and then wash them off into the bitter water.",
      "Non-Denominational": "The priest records the curses and then dissolves the ink into the prepared water, symbolically transferring the curses' power into the liquid.",
      "Baptist": "The priest writes the curses on a document and washes the ink into the bitter water, infusing the water with the curse.",
      "Catholic": "The priest writes the curses down and washes the writing into the water of bitterness, symbolically imbuing the water with the power of the curse.",
      "Methodist": "The priest writes the curses and washes them into the bitter water, signifying the water now carries the potential curse.",
      "Lutheran": "The priest writes these curses in a book and washes them off into the water of bitterness.",
      "Presbyterian": "The priest inscribes the curses and washes the inscription into the bitter water, charging it with the potential curse.",
      "Pentecostal": "The priest writes the curses and dissolves the writing into the bitter water, activating its power.",
      "Anglican": "The priest writes the curses on a scroll and washes them off into the water of bitterness.",
      "Orthodox": "The priest inscribes these curses in a document and washes the writing into the water of bitterness, symbolically charging the water."
    },
    "24": {
      "General": "He shall make the woman drink the bitter water that brings a curse, and this water will enter her and cause bitter suffering [if she is guilty].",
      "Non-Denominational": "The priest administers the water to the woman; it will cause suffering only if she is guilty.",
      "Baptist": "The priest gives the woman the bitter, curse-bearing water to drink, which will enter her and become bitter (cause affliction) if she is guilty.",
      "Catholic": "The priest makes the woman drink the water of bitterness that brings the curse; it will enter her and become bitter if she is culpable.",
      "Methodist": "The priest has the woman drink the curse-bearing water, which will cause bitterness (suffering) within her if guilty.",
      "Lutheran": "He makes the woman drink the water of bitterness that brings the curse; the water enters her and becomes bitter if she is guilty.",
      "Presbyterian": "He makes the woman drink the bitter, curse-bearing water, which will enter her and cause bitterness if she is guilty.",
      "Pentecostal": "The priest gives the woman the bitter, curse-infused water to drink, which will bring suffering if she is guilty.",
      "Anglican": "He makes the woman drink the water of bitterness that brings the curse; the water shall enter her and cause bitter pain if guilty.",
      "Orthodox": "He makes the woman drink the water of bitterness that brings the curse; this water enters her to cause bitterness if she is guilty."
    },
    "25": {
      "General": "The priest is then to take the grain offering for jealousy from her hands, wave it before the Lord, and bring it to the altar.",
      "Non-Denominational": "The priest takes the jealousy offering, performs a wave offering ceremony before God, and presents it at the altar.",
      "Baptist": "The priest takes the jealousy offering from the woman, waves it as a wave offering before Yahweh, and brings it near the altar.",
      "Catholic": "The priest takes the grain offering of jealousy from the woman's hand, waves it before the Lord, and presents it upon the altar.",
      "Methodist": "The priest takes the jealousy offering, waves it before the Lord in a ritual motion, and brings it to the altar.",
      "Lutheran": "The priest takes the grain offering of jealousy from the woman's hand, waves it before the Lord, and brings it to the altar.",
      "Presbyterian": "The priest takes the jealousy offering from the woman, waves it before Yahweh, and offers it upon the altar.",
      "Pentecostal": "The priest takes the jealousy offering, waves it before God, and presents it on the altar.",
      "Anglican": "The priest takes the grain offering of jealousy from the woman's hand, waves it before the Lord, and brings it to the altar.",
      "Orthodox": "The priest takes the offering of jealousy from the woman's hands, elevates it before the Lord, and brings it to the altar."
    },
    "26": {
      "General": "The priest shall take a handful of the grain offering as a memorial portion and burn it on the altar; afterward, he shall make the woman drink the water.",
      "Non-Denominational": "The priest burns a symbolic portion ('memorial portion') of the offering on the altar before administering the water.",
      "Baptist": "The priest takes a memorial portion of the grain offering, burns it on the altar, and then makes the woman drink the water.",
      "Catholic": "The priest takes a handful as a memorial portion of the offering, burns it on the altar, and subsequently gives the woman the water to drink.",
      "Methodist": "The priest burns a representative handful ('memorial portion') on the altar, then gives the woman the water.",
      "Lutheran": "The priest takes a handful of the grain offering as its memorial portion, burns it on the altar, and afterward makes the woman drink the water.",
      "Presbyterian": "The priest takes a memorial portion from the offering, burns it on the altar, and then administers the water to the woman.",
      "Pentecostal": "The priest burns a symbolic portion of the offering on the altar, then gives the woman the water to drink.",
      "Anglican": "The priest takes a handful of the grain offering as its memorial portion, burns it on the altar, and afterward makes the woman drink the water.",
      "Orthodox": "The priest takes a handful of the offering as a memorial, burns it on the altar, and subsequently makes the woman drink the water."
    },
    "27": {
      "General": "If she has defiled herself and been unfaithful to her husband, the curse-bearing water will enter her and cause bitter suffering; her abdomen will swell and her thigh will rot, and she will become a curse among her people.",
      "Non-Denominational": "Describes the consequences if the woman is guilty: the water induces the curse, causing the physical afflictions and making her a public example of disgrace.",
      "Baptist": "Specifies the result of guilt: the curse-bearing water enters, becomes bitter, causing her belly to swell and thigh to fall away, making her a curse among her people.",
      "Catholic": "Details the outcome if she is guilty: the water enters causing bitterness, her belly swells, her womb discharges ('thigh falls away'), and she becomes an execration among her people.",
      "Methodist": "Outlines the effects if guilty: the water causes bitter suffering, abdominal swelling, infertility ('thigh falls away'), and she becomes a public curse.",
      "Lutheran": "States the result if she is defiled and unfaithful: the curse-bearing water enters, becomes bitter, her body swells, her thigh falls away, and she becomes a curse among her people.",
      "Presbyterian": "Describes the consequences of guilt: the curse-bearing water enters, becomes bitter, her belly swells, her thigh wastes away, and she becomes a curse among her people.",
      "Pentecostal": "Details the outcome for the guilty: the water brings the curse, causing sickness, infertility, and public disgrace.",
      "Anglican": "Specifies the outcome if she is defiled and unfaithful: the curse-bearing water enters, causes bitter pain, her belly swells, her thigh falls away, and she becomes a curse among her people.",
      "Orthodox": "Details the consequences if guilty: the water enters causing bitterness, her belly swells, her thigh falls away, and she becomes a curse among her people."
    },
    "28": {
      "General": "If, however, the woman has not defiled herself and is pure, she will be unaffected and able to conceive children.",
      "Non-Denominational": "Describes the consequences if the woman is innocent: she remains unharmed by the water and retains her fertility.",
      "Baptist": "Specifies the result of innocence: she is clean, unharmed by the water, and will be able to bear children.",
      "Catholic": "Details the outcome if she is innocent: she is clean, unharmed, and will retain her ability to conceive.",
      "Methodist": "Outlines the effects if innocent: she is unharmed by the water and remains fertile.",
      "Lutheran": "States the result if she is undefiled and clean: she will be free from harm and able to conceive children.",
      "Presbyterian": "Describes the consequences of innocence: she is clean, suffers no harm, and retains her fertility.",
      "Pentecostal": "Details the outcome for the innocent: she is unharmed and remains fertile.",
      "Anglican": "Specifies the outcome if she is undefiled and pure: she shall be unharmed and able to conceive children.",
      "Orthodox": "Details the consequences if innocent: she is clean, unharmed by the ordeal, and retains her ability to conceive."
    },
    "29": {
      "General": "This is the law regarding jealousy, when a wife goes astray and defiles herself while married to her husband,",
      "Non-Denominational": "Summarizes the purpose of the law: addressing situations of suspected adultery where the wife has become defiled.",
      "Baptist": "Restates the subject: this is the law concerning jealousy when a wife under her husband's authority goes astray and is defiled.",
      "Catholic": "Summarizes the regulation: this is the law for jealousy, applicable when a wife under her husband's authority turns aside and defiles herself.",
      "Methodist": "Concisely states the purpose: this law applies to jealousy when a wife becomes unfaithful.",
      "Lutheran": "Summarizes the law of jealousy for when a wife goes astray and becomes defiled.",
      "Presbyterian": "Restates the purpose: this is the statute concerning jealousy, for when a wife under her husband goes astray and is defiled.",
      "Pentecostal": "Summarizes the law's application: for cases of jealousy involving a wife's infidelity.",
      "Anglican": "Summarizes the law of jealousy: applicable when a wife goes astray and defiles herself.",
      "Orthodox": "Restates the purpose of the law: addressing jealousy when a wife deviates into defilement."
    },
    "30": {
      "General": "or when feelings of jealousy come over a husband and he suspects his wife. The priest is to have her stand before the Lord and is to apply this entire law to her.",
      "Non-Denominational": "Also applies the law when the husband is merely suspicious due to jealousy, requiring the priest to perform the full ritual.",
      "Baptist": "Also applies when a spirit of jealousy comes upon the husband causing suspicion; the priest must perform the entire ritual.",
      "Catholic": "Also covers cases where only a spirit of jealousy motivates the husband's suspicion; the priest must still administer the whole law.",
      "Methodist": "Includes cases driven solely by the husband's jealous suspicion; the priest must follow the entire prescribed procedure.",
      "Lutheran": "Also applies when a spirit of jealousy comes upon a man causing suspicion; the priest shall set the woman before the Lord and apply the whole law.",
      "Presbyterian": "Also applies when the husband acts out of a spirit of jealousy and suspicion; the priest must execute the entire statute.",
      "Pentecostal": "Covers cases where the husband is motivated by jealousy alone; the priest must perform the full ritual.",
      "Anglican": "Also applies when a spirit of jealousy comes over a husband causing suspicion; the priest shall make her stand before the Lord and apply the entire law.",
      "Orthodox": "Also encompasses situations where a spirit of jealousy overcomes the husband leading to suspicion; the priest must perform the complete ritual."
    },
    "31": {
      "General": "The husband will be innocent of any wrongdoing [in bringing the charge], but the wife will bear the consequences of her sin [if found guilty].",
      "Non-Denominational": "Absolves the husband of guilt for initiating the process, placing the consequence solely on the wife if she is proven guilty by the ordeal.",
      "Baptist": "Declares the husband free from iniquity (for invoking the ritual), while the wife bears her iniquity if guilty.",
      "Catholic": "States the husband is free from guilt in invoking the law, but the wife shall bear her iniquity if found guilty.",
      "Methodist": "Frees the husband from blame for using the process, while the wife bears the penalty for her sin if guilty.",
      "Lutheran": "Declares the husband free from guilt, but the wife shall bear her iniquity if culpable.",
      "Presbyterian": "Absolves the husband from guilt related to the process, but assigns the bearing of iniquity to the wife if she is guilty.",
      "Pentecostal": "States the husband is not guilty for bringing the suspicion, but the wife faces the consequences if guilty.",
      "Anglican": "Declares the husband free from guilt, but the wife shall bear her iniquity if found culpable.",
      "Orthodox": "Absolves the husband of guilt for initiating the ordeal, while the wife must bear the consequence of her sin if proven guilty."
    }
  }
}
