{
  "_comment": "Interpretations for Numbers Chapter 6",
  "book": "Numbers",
  "chapter": "6",
  "chapterSummary": {
    "General": "Chapter 6 outlines the laws concerning the Nazirite vow, a special vow of separation and dedication to the Lord involving abstinence from grape products, letting hair grow long, and avoiding contact with the dead. It concludes with the Aaronic Blessing, the priestly blessing God instructed Aaron and his sons to pronounce over the Israelites.",
    "Non-Denominational": "Focuses on the voluntary nature of the Nazirite vow as an act of personal devotion and separation unto God. Highlights the specific requirements as symbols of consecration (abstinence from worldly pleasures, uncut hair signifying dedication, avoidance of death signifying commitment to life in God). Sees the Aaronic blessing as God's desire to bless, keep, and grant peace to His people through His mediators.",
    "Baptist": "Views the Nazirite vow as a temporary period of extraordinary dedication beyond ordinary requirements, emphasizing personal holiness and separation. Interprets the specific restrictions literally. Sees the Aaronic blessing as a powerful declaration of God's favor, protection, and grace bestowed upon His covenant people, invoked by the priesthood.",
    "Catholic": "Interprets the Nazirite vow as a form of special consecration, a way for laypeople to dedicate themselves to God in a manner akin to priests for a time. The restrictions symbolize deeper spiritual realities (detachment, life). The Aaronic blessing is seen as a sacramental invocation of God's grace, protection, and peace, conferred through the ordained priesthood, ultimately fulfilled in Christ's blessing.",
    "Methodist": "Focuses on the Nazirite vow as an expression of heightened spiritual commitment and discipline, demonstrating a desire for deeper holiness. The restrictions signify setting oneself apart for God. The Aaronic blessing emphasizes God's loving desire to bless His people with His presence, protection, favor, and peace, mediated through the priesthood.",
    "Lutheran": "Views the Nazirite vow as a specific Old Testament practice allowing for special devotion, fulfilled and surpassed by devotion to Christ. The restrictions highlight the seriousness of the vow. Interprets the Aaronic blessing as God commissioning the priests to pronounce His name and blessing upon the people, signifying His gracious promise of protection, favor, and peace.",
    "Presbyterian": "Understands the Nazirite vow within the covenant framework as a means of special, temporary consecration. The outward signs point to inward dedication. Sees the Aaronic blessing as a divinely instituted priestly benediction, pronouncing God's covenant blessings of preservation, grace, favor, and peace upon His people, contingent on His sovereign will.",
    "Pentecostal": "Emphasizes the Nazirite vow as a powerful act of consecration, potentially accompanied by special anointing or gifting, demonstrating radical commitment. Focuses on the separation from worldly influences. Sees the Aaronic blessing as a potent declaration invoking God's tangible presence, supernatural protection, divine favor, and shalom peace upon the believers.",
    "Anglican": "Views the Nazirite vow as a recognized way within the Old Covenant for individuals to express exceptional devotion. The specific rules underscore the totality of the dedication. Interprets the Aaronic blessing as a formal liturgical blessing, conveying God's grace, safeguarding presence, benevolent regard, and holistic peace (shalom) upon the congregation through priestly ministry.",
    "Orthodox": "Sees the Nazirite vow typologically, prefiguring monastic vows and total dedication to God. The physical separations point to spiritual detachment and consecration. Views the Aaronic blessing as a liturgical invocation where the priest acts in persona Christi, extending God's blessing, enlightenment (God's face shining), and profound peace upon the faithful."
  },
  "verses": {
    "1": {
      "General": "The Lord speaks to Moses regarding the Nazirite vow.",
      "Non-Denominational": "God initiates the instruction concerning the special vow of a Nazirite.",
      "Baptist": "Yahweh gives Moses instructions about the specific regulations for the Nazirite vow.",
      "Catholic": "The Lord instructs Moses concerning the law applicable to those taking the Nazirite vow of consecration.",
      "Methodist": "God directs Moses regarding the rules for individuals making a special vow of separation (Nazirite vow).",
      "Lutheran": "The Lord speaks to Moses concerning the vow of a Nazirite.",
      "Presbyterian": "Yahweh commands Moses regarding the statute for the Nazirite vow, a vow of separation.",
      "Pentecostal": "God instructs Moses on the requirements for the Nazirite vow of dedication.",
      "Anglican": "The Lord commands Moses concerning the regulations for the Nazirite vow.",
      "Orthodox": "The Lord instructs Moses regarding the law of the Nazirite, one consecrated to God."
    },
    "2": {
      "General": "Speak to the Israelites: When a man or woman makes a special vow, the vow of a Nazirite, to separate themselves to the Lord,",
      "Non-Denominational": "Specifies the vow is voluntary ('makes a special vow') for both men and women, involving separation and dedication to God.",
      "Baptist": "Applies to both men and women who make a distinct vow ('special vow') to separate themselves specifically unto Yahweh.",
      "Catholic": "Addresses both men and women who make the particular vow of a Nazirite, consecrating themselves to the Lord through separation.",
      "Methodist": "Clarifies the vow is applicable to both genders and involves a deliberate act of separation ('to separate themselves') for dedication to God.",
      "Lutheran": "States that either a man or a woman may make the special vow of a Nazirite, dedicating themselves to the Lord.",
      "Presbyterian": "Applies to any man or woman who makes a special vow (the Nazirite vow) to consecrate themselves ('separate themselves') unto Yahweh.",
      "Pentecostal": "Highlights the voluntary nature for men or women making a special vow of separation and dedication to God.",
      "Anglican": "Instructs Moses to tell the Israelites about a man or woman making a special vow (Nazirite vow) to separate themselves to the Lord.",
      "Orthodox": "Addresses both men and women who choose to undertake the special vow of a Nazirite, setting themselves apart for the Lord."
    },
    "3": {
      "General": "they must abstain from wine and other fermented drink and must not drink vinegar made from wine or other fermented drink. They must not drink grape juice or eat grapes, fresh or dried.",
      "Non-Denominational": "First restriction: complete abstinence from all grape products (wine, fermented drinks, vinegar, juice, fresh/dried grapes) symbolizing separation from worldly indulgence.",
      "Baptist": "Requires total abstinence from wine, strong drink, wine vinegar, strong drink vinegar, grape juice, and both fresh and dried grapes.",
      "Catholic": "Mandates separation from wine and strong drink, including their derivatives (vinegar), grape juice, and grapes in any form.",
      "Methodist": "Specifies complete avoidance of all products of the grapevine, including wine, strong drink, vinegar, juice, and grapes (fresh or dried).",
      "Lutheran": "Commands separation from wine, strong drink, vinegar of wine or strong drink, grape juice, and eating fresh or dried grapes.",
      "Presbyterian": "Requires abstinence from wine, strong drink, and all forms of grape products (vinegar, juice, fresh/dried grapes).",
      "Pentecostal": "Demands total separation from wine, fermented drinks, and any product derived from grapes, symbolizing dedication.",
      "Anglican": "Requires abstinence from wine, strong drink, vinegar from wine/strong drink, grape juice, and fresh or dried grapes.",
      "Orthodox": "Commands complete abstention from wine, strong drink, and all products derived from the grapevine, including juice and fruit."
    },
    "4": {
      "General": "As long as they remain under their Nazirite vow, they must not eat anything that comes from the grapevine, not even the seeds or skins.",
      "Non-Denominational": "Reinforces the totality of the grape abstinence: absolutely nothing from the grapevine, from seeds to skin, is permitted during the vow period.",
      "Baptist": "Emphasizes the comprehensive nature of the restriction: throughout the vow period, nothing from the grapevine, not even seeds or skin, may be consumed.",
      "Catholic": "Stresses the duration and completeness of the abstinence: for the entire period of the vow, nothing derived from the grapevine is permissible.",
      "Methodist": "Underlines the thoroughness: during the vow, all parts of the grapevine product, even insignificant ones like seeds and skins, are forbidden.",
      "Lutheran": "Specifies that during the entire period of separation, nothing from the grapevine, from seeds to skin, may be eaten.",
      "Presbyterian": "Reinforces the scope: throughout the vow, consumption of any part of the grapevine product is prohibited.",
      "Pentecostal": "Emphasizes complete separation: for the duration of the vow, absolutely no product of the grapevine is allowed.",
      "Anglican": "Clarifies the extent of the abstinence: during the entire vow, nothing from the grapevine, not even seeds or skins, may be eaten.",
      "Orthodox": "Highlights the comprehensiveness: throughout the vow, the Nazirite must avoid everything derived from the grapevine, down to the smallest part."
    },
    "5": {
      "General": "During the entire period of their Nazirite vow, no razor may be used on their head. They must be holy until the period of their separation to the Lord is over; they must let the hair of their head grow long.",
      "Non-Denominational": "Second restriction: uncut hair. A razor must not touch their head throughout the vow, symbolizing their holiness and dedication to God. Long hair becomes the visible sign of the vow.",
      "Baptist": "Commands that no razor shall touch the Nazirite's head for the duration of the vow; long hair serves as a visible sign of their holiness and separation unto Yahweh.",
      "Catholic": "Requires that for the entire duration of the vow, the Nazirite's hair must remain uncut, symbolizing their consecration and holiness until the vow is completed.",
      "Methodist": "Specifies the second rule: hair must not be cut during the vow period. Letting the hair grow long is a sign of their holiness and dedication to God.",
      "Lutheran": "Commands that during the vow period, no razor shall come upon the head; the hair must grow long, signifying holiness and separation to the Lord.",
      "Presbyterian": "Requires uncut hair throughout the vow's duration as a mark of holiness and consecration to Yahweh.",
      "Pentecostal": "Mandates that hair remain uncut for the entire vow period as an outward sign of inward holiness and dedication to the Lord.",
      "Anglican": "Requires that during the entire period of the vow, no razor shall touch the head; the hair must be allowed to grow long as a mark of holiness and separation.",
      "Orthodox": "Commands that throughout the vow, the Nazirite's hair must not be cut but allowed to grow freely, symbolizing their consecration and holiness dedicated to the Lord."
    },
    "6": {
      "General": "Throughout the period of their separation to the Lord, they must not go near a dead body.",
      "Non-Denominational": "Third restriction: avoidance of corpses. The Nazirite must not come into contact with the dead, maintaining ritual purity and separation from death.",
      "Baptist": "Commands avoidance of proximity to any dead person during the entire period of separation unto Yahweh.",
      "Catholic": "Requires the Nazirite to avoid all contact with the dead throughout the period of consecration to the Lord.",
      "Methodist": "Specifies the third rule: avoidance of dead bodies to maintain ritual purity during the period of separation.",
      "Lutheran": "Commands that during the period of separation to the Lord, the Nazirite shall not go near a dead person.",
      "Presbyterian": "Requires the Nazirite to avoid corpse contamination throughout the period of separation unto Yahweh.",
      "Pentecostal": "Mandates avoidance of dead bodies throughout the vow period, symbolizing separation unto life in God.",
      "Anglican": "Requires that during the entire period of separation to the Lord, the Nazirite must not go near a dead body.",
      "Orthodox": "Commands the Nazirite to refrain from approaching any dead person throughout the duration of their consecration to the Lord."
    },
    "7": {
      "General": "Even if their own father or mother or brother or sister dies, they must not make themselves ceremonially unclean on account of them, because the symbol of their dedication to God is on their head.",
      "Non-Denominational": "Emphasizes the stringency of corpse avoidance: it applies even to the closest family members (father, mother, brother, sister) because the Nazirite's dedication to God (symbolized by the hair) takes precedence.",
      "Baptist": "Specifies that the prohibition against corpse defilement overrides even the duty to mourn immediate family members, because the sign of consecration (uncut hair) signifies their primary commitment to God.",
      "Catholic": "Highlights the radical nature of the vow: the Nazirite cannot become unclean even for deceased parents or siblings, because the consecration to God, signified by their hair, demands absolute purity.",
      "Methodist": "Underlines the vow's priority: the Nazirite must not become unclean even for their closest relatives, as their dedication to God (symbolized by their hair) requires this separation.",
      "Lutheran": "States that even for immediate family, the Nazirite must not become unclean, because their consecration to God is visibly upon their head.",
      "Presbyterian": "Emphasizes the supremacy of the vow: the Nazirite must not incur corpse uncleanness even for parents or siblings, as the sign of their consecration to God takes priority.",
      "Pentecostal": "Shows the radical commitment required: avoiding defilement even by deceased close family, because their dedication to God (symbolized by hair) is paramount.",
      "Anglican": "Specifies that the Nazirite must not become unclean even for their closest relatives (father, mother, brother, sister) because the sign of their dedication to God is upon their head.",
      "Orthodox": "Highlights the vow's strictness: avoidance of defilement extends even to parents and siblings, because the sign of their consecration to God upon their head demands purity."
    },
    "8": {
      "General": "Throughout the period of their separation, they are holy to the Lord.",
      "Non-Denominational": "Reiterates the Nazirite's status during the vow: they are set apart and considered holy, dedicated entirely to God.",
      "Baptist": "Affirms the Nazirite's state during the vow: holy unto Yahweh for the entire duration of their separation.",
      "Catholic": "Declares the consecrated status of the Nazirite throughout the vow: they are holy to the Lord.",
      "Methodist": "Confirms the Nazirite's dedicated state: they are holy to the Lord throughout their period of separation.",
      "Lutheran": "States their status during the vow: holy to the Lord all the days of their separation.",
      "Presbyterian": "Affirms the Nazirite's status throughout the vow: holy unto Yahweh.",
      "Pentecostal": "Reaffirms their standing while under the vow: set apart as holy to the Lord.",
      "Anglican": "Declares that throughout the period of separation, the Nazirite is holy to the Lord.",
      "Orthodox": "Confirms the Nazirite's state of consecration: they remain holy to the Lord for the entire duration of their vow."
    },
    "9": {
      "General": "If someone dies suddenly in their presence, thus defiling the hair that symbolizes their dedication, they must shave their head on the seventh day, the day of their cleansing.",
      "Non-Denominational": "Addresses accidental defilement by a corpse: if someone dies nearby unexpectedly, defiling the consecrated hair, the Nazirite must shave their head on the seventh day (completion of purification).",
      "Baptist": "Provides instruction for accidental corpse contamination: if someone dies suddenly nearby, defiling the consecrated head, the hair must be shaved on the day of cleansing (the seventh day).",
      "Catholic": "Specifies the procedure for accidental defilement: if someone dies suddenly nearby, contaminating the consecrated head, the hair must be shaved on the seventh day, the day of purification.",
      "Methodist": "Outlines the process if the vow is broken by accidental proximity to death: the consecrated hair (now defiled) must be shaved on the seventh day (the day of purification ritual).",
      "Lutheran": "Instructs that if the consecrated head is defiled by a sudden death nearby, the Nazirite must shave their head on the day of cleansing, the seventh day.",
      "Presbyterian": "Provides the remedy for accidental corpse defilement: if the consecrated head is contaminated by a sudden death, the hair must be shaved on the seventh day (the day of purification).",
      "Pentecostal": "Addresses unintentional defilement: if proximity to a sudden death defiles the consecrated hair, it must be shaved on the seventh day, the day signifying cleansing.",
      "Anglican": "Specifies what happens if the consecrated head is accidentally defiled by a sudden death: the Nazirite must shave their head on the day of their cleansing, the seventh day.",
      "Orthodox": "Instructs on accidental defilement: if someone dies suddenly near the Nazirite, defiling the consecrated head, the hair must be shaved on the seventh day, the day designated for purification."
    },
    "10": {
      "General": "Then on the eighth day, they must bring two doves or two young pigeons to the priest at the entrance to the tent of meeting.",
      "Non-Denominational": "Requires specific offerings on the eighth day following accidental defilement: two doves or pigeons brought to the priest at the Tabernacle entrance.",
      "Baptist": "Commands offerings on the eighth day after defilement: two turtledoves or two pigeons presented to the priest at the Tabernacle entrance.",
      "Catholic": "Mandates offerings on the eighth day post-defilement: two turtledoves or two pigeons brought to the priest at the entrance of the Tent of Meeting.",
      "Methodist": "Specifies sacrifices for the eighth day: two doves or pigeons are required, brought to the priest at the sanctuary entrance.",
      "Lutheran": "Commands bringing two turtledoves or two pigeons to the priest at the entrance of the tent of meeting on the eighth day.",
      "Presbyterian": "Requires bringing two turtledoves or two pigeons to the priest at the Tabernacle entrance on the eighth day after defilement.",
      "Pentecostal": "Instructs bringing two doves or pigeons to the priest at the Tabernacle on the eighth day to address the defilement.",
      "Anglican": "Requires bringing two turtledoves or two young pigeons to the priest at the entrance of the tent of meeting on the eighth day.",
      "Orthodox": "Commands the offering of two turtledoves or two young pigeons to the priest at the entrance of the Tent of Meeting on the eighth day."
    },
    "11": {
      "General": "The priest is to offer one as a sin offering and the other as a burnt offering to make atonement for the Nazirite because they sinned by being in the presence of the dead body. That same day they must reconsecrate their head.",
      "Non-Denominational": "Details the purpose of the offerings: one bird for a sin offering (purification from the defilement), the other for a burnt offering (rededication), making atonement for the sin of contact with death. The head (hair) must be reconsecrated that day.",
      "Baptist": "Specifies the priest's action: offer one bird as a sin offering and the other as a burnt offering to make atonement for the Nazirite's sin involving the dead body. The head must be reconsecrated the same day.",
      "Catholic": "Instructs the priest to offer one bird as a purification offering and the other as a holocaust (burnt offering) to make atonement for the sin incurred through contact with the dead. The Nazirite must then reconsecrate their head on that day.",
      "Methodist": "Explains the offerings' roles: one for purification (sin offering), one for dedication (burnt offering), atoning for the defilement. The Nazirite must then reconsecrate their head.",
      "Lutheran": "Directs the priest to offer one bird for a sin offering and the other for a burnt offering, making atonement for the sin regarding the dead body. The head must be consecrated anew that day.",
      "Presbyterian": "Specifies the use of the offerings: one for a sin offering, one for a burnt offering, providing atonement for the sin of corpse contamination. The head must be reconsecrated the same day.",
      "Pentecostal": "Details the offerings: a sin offering for purification, a burnt offering for atonement related to the defilement. The head (hair) must be reconsecrated immediately.",
      "Anglican": "Instructs the priest to offer one bird for a sin offering and the other for a burnt offering, making atonement because of the sin involving the dead body. The head must be reconsecrated that same day.",
      "Orthodox": "Specifies the priestly action: one bird offered for sin, the other as a whole burnt offering, making atonement for the sin of proximity to death. The head must be reconsecrated that day."
    },
    "12": {
      "General": "They must rededicate themselves to the Lord for the same period of separation and must bring a year-old male lamb as a guilt offering. The previous days do not count, because their period of separation was defiled.",
      "Non-Denominational": "Requires restarting the vow period: the Nazirite must dedicate themselves again for the full original duration and bring a guilt offering (year-old lamb). The time served before defilement is nullified.",
      "Baptist": "Commands the Nazirite to restart the vow period for the original length and offer a male lamb in its first year as a guilt offering. The prior days are forfeited due to the defilement.",
      "Catholic": "Mandates restarting the vow: the Nazirite must consecrate themselves anew for the full duration and offer a yearling lamb as a reparation offering. The time already spent is invalidated by the defilement.",
      "Methodist": "Requires the Nazirite to begin the vow period again from scratch for the original duration, bringing a year-old male lamb as a guilt offering. The previous time is lost.",
      "Lutheran": "Commands rededication to the Lord for the full vow period and bringing a male lamb a year old for a guilt offering. The former days are void because the separation was defiled.",
      "Presbyterian": "Requires the Nazirite to rededicate the full period of separation and bring a yearling male lamb as a guilt offering. The previous time under the vow is nullified due to defilement.",
      "Pentecostal": "Mandates restarting the entire vow period and offering a year-old male lamb as a guilt offering. The time before defilement doesn't count.",
      "Anglican": "Requires the Nazirite to rededicate the period of separation to the Lord and bring a year-old male lamb for a guilt offering. The previous days are void because the separation was defiled.",
      "Orthodox": "Commands the Nazirite to reconsecrate themselves for the full duration of the vow and bring a yearling male lamb as a guilt offering. The time prior to defilement does not count."
    },
    "13": {
      "General": "Now this is the law for the Nazirite when the period of their separation is over. They are to be brought to the entrance to the tent of meeting,",
      "Non-Denominational": "Introduces the procedures for successfully completing the Nazirite vow period, beginning with presentation at the Tabernacle entrance.",
      "Baptist": "Outlines the ritual for the completion of the vow term: the Nazirite is brought to the entrance of the Tabernacle.",
      "Catholic": "Details the regulations for concluding the Nazirite vow: the person is brought to the entrance of the Tent of Meeting upon completion.",
      "Methodist": "Describes the process at the end of the vow period: the Nazirite comes to the sanctuary entrance.",
      "Lutheran": "States the law for when the days of separation are completed: the Nazirite shall be brought to the entrance of the tent of meeting.",
      "Presbyterian": "Outlines the statute for completing the vow: presentation at the Tabernacle entrance.",
      "Pentecostal": "Introduces the ceremony for finishing the vow: the Nazirite is brought to the Tabernacle entrance.",
      "Anglican": "Details the law for when the period of separation is complete: the Nazirite shall be brought to the entrance of the tent of meeting.",
      "Orthodox": "Describes the regulations for the completion of the vow: the Nazirite is brought to the entrance of the Tent of Meeting."
    },
    "14": {
      "General": "and they are to present their offerings to the Lord: a year-old male lamb without defect for a burnt offering, a year-old ewe lamb without defect for a sin offering, a ram without defect for a fellowship offering,",
      "Non-Denominational": "Specifies the required offerings at vow completion: a male lamb (burnt offering for dedication), a ewe lamb (sin offering for any unknown/unintentional sins during the vow), and a ram (fellowship offering for communion/peace with God). All must be unblemished.",
      "Baptist": "Lists the prescribed offerings for completing the vow: unblemished yearling male lamb (burnt offering), unblemished yearling ewe lamb (sin offering), and unblemished ram (peace offering).",
      "Catholic": "Mandates specific offerings upon vow completion: a perfect yearling male lamb (burnt offering), a perfect yearling ewe lamb (purification offering), and a perfect ram (communion sacrifice).",
      "Methodist": "Details the required sacrifices: a flawless year-old male lamb (burnt offering), a flawless year-old ewe lamb (sin offering), and a flawless ram (fellowship offering).",
      "Lutheran": "Requires specific offerings: a year-old male lamb without blemish (burnt offering), a year-old ewe lamb without blemish (sin offering), and a ram without blemish (peace offering).",
      "Presbyterian": "Specifies the offerings: unblemished yearling male lamb (burnt offering), unblemished yearling ewe lamb (sin offering), unblemished ram (peace offering).",
      "Pentecostal": "Lists the necessary sacrifices: perfect male lamb (burnt offering), perfect ewe lamb (sin offering), perfect ram (fellowship offering).",
      "Anglican": "Specifies the offerings presented to the Lord: a year-old male lamb without blemish (burnt offering), a year-old ewe lamb without blemish (sin offering), a ram without blemish (peace offering).",
      "Orthodox": "Details the offerings required: a perfect yearling male lamb (whole burnt offering), a perfect yearling ewe lamb (sin offering), and a perfect ram (peace offering)."
    },
    "15": {
      "General": "together with their grain offerings and drink offerings, and a basket of bread made without yeast—thick loaves made with finely ground flour mixed with olive oil, and thin loaves coated with olive oil.",
      "Non-Denominational": "Adds accompanying offerings: grain and drink offerings corresponding to the animal sacrifices, plus a basket of unleavened bread items (loaves mixed with oil, wafers spread with oil).",
      "Baptist": "Includes associated offerings: corresponding grain and drink offerings, plus a basket of unleavened bread (cakes mixed with oil and wafers anointed with oil).",
      "Catholic": "Adds accompanying elements: their prescribed grain offerings and libations, plus a basket of unleavened cakes (fine flour mixed with oil) and unleavened wafers (spread with oil).",
      "Methodist": "Specifies additional offerings: related grain and drink offerings, and a basket containing two types of unleavened bread made with oil.",
      "Lutheran": "Includes their grain offerings, drink offerings, and a basket of unleavened bread (cakes mixed with oil, wafers spread with oil).",
      "Presbyterian": "Requires accompanying grain and drink offerings, and a basket of unleavened bread (cakes mixed with oil, wafers anointed with oil).",
      "Pentecostal": "Adds the necessary grain/drink offerings and a basket of specific unleavened breads prepared with oil.",
      "Anglican": "Includes their grain offerings and drink offerings, and a basket of unleavened bread (cakes mixed with oil, wafers smeared with oil).",
      "Orthodox": "Requires the associated grain offerings and libations, plus a basket of unleavened bread (loaves mixed with oil, wafers anointed with oil)."
    },
    "16": {
      "General": "The priest is to present these before the Lord and make the sin offering and the burnt offering.",
      "Non-Denominational": "The priest presents all the offerings before God and performs the sacrifices for the sin offering and burnt offering.",
      "Baptist": "The priest presents these items before Yahweh and offers the Nazirite's sin offering and burnt offering.",
      "Catholic": "The priest presents these before the Lord, offering the purification offering and the holocaust.",
      "Methodist": "The priest brings these offerings before the Lord and performs the sin and burnt sacrifices.",
      "Lutheran": "The priest presents these before the Lord, offering the sin offering and burnt offering.",
      "Presbyterian": "The priest presents these before Yahweh and offers the sin and burnt offerings.",
      "Pentecostal": "The priest presents these offerings to God and performs the sin and burnt sacrifices.",
      "Anglican": "The priest presents these before the Lord and offers the sin offering and the burnt offering.",
      "Orthodox": "The priest presents these offerings before the Lord and performs the sin offering and the whole burnt offering."
    },
    "17": {
      "General": "He is also to sacrifice the ram for a fellowship offering to the Lord, together with the basket of unleavened bread; the priest is to make the grain offering and drink offering as well.",
      "Non-Denominational": "The priest sacrifices the ram (fellowship offering) along with the unleavened bread, and also offers the accompanying grain and drink offerings.",
      "Baptist": "The priest offers the ram as a peace offering to Yahweh, along with the basket of unleavened bread, and also presents its grain and drink offerings.",
      "Catholic": "The priest sacrifices the ram as a communion sacrifice to the Lord, together with the basket of unleavened bread, and also offers its grain offering and libation.",
      "Methodist": "The priest sacrifices the ram as a fellowship offering, along with the unleavened bread, and performs the related grain and drink offerings.",
      "Lutheran": "The priest offers the ram as a peace offering to the Lord, with the basket of unleavened bread, and also offers its grain and drink offerings.",
      "Presbyterian": "The priest offers the ram as a peace offering to Yahweh with the basket of unleavened bread, and also offers its grain and drink offerings.",
      "Pentecostal": "The priest sacrifices the ram (fellowship offering) with the unleavened bread, and performs the grain and drink offerings.",
      "Anglican": "The priest sacrifices the ram as a peace offering to the Lord, with the basket of unleavened bread, and also offers its grain offering and drink offering.",
      "Orthodox": "The priest offers the ram as a peace offering to the Lord, along with the basket of unleavened bread, and also performs its grain offering and libation."
    },
    "18": {
      "General": "Then, at the entrance to the tent of meeting, the Nazirite must shave off the hair that symbolizes their dedication. They are to take the hair and put it in the fire that is under the sacrifice of the fellowship offering.",
      "Non-Denominational": "The concluding symbolic act: the Nazirite shaves the consecrated hair at the Tabernacle entrance and burns it in the fire under the fellowship offering sacrifice, signifying the completion and offering of the vow to God.",
      "Baptist": "The Nazirite shaves the consecrated head (hair) at the Tabernacle entrance, takes the shaved hair, and places it on the fire beneath the peace offering sacrifice.",
      "Catholic": "The Nazirite shaves their consecrated head at the entrance of the Tent of Meeting, takes the hair, and places it on the fire burning under the communion sacrifice.",
      "Methodist": "The Nazirite shaves off the dedicated hair at the sanctuary entrance and burns this hair in the fire associated with the fellowship offering sacrifice.",
      "Lutheran": "The Nazirite shaves the consecrated head at the entrance of the tent of meeting, takes the hair, and puts it on the fire under the peace offering sacrifice.",
      "Presbyterian": "The Nazirite shaves the consecrated head at the Tabernacle entrance and puts the hair into the fire under the peace offering sacrifice.",
      "Pentecostal": "The Nazirite shaves the dedicated hair at the Tabernacle entrance and burns it in the fire under the fellowship offering, signifying the vow's completion.",
      "Anglican": "The Nazirite shaves the consecrated head at the entrance of the tent of meeting, takes the hair, and puts it on the fire under the peace offering sacrifice.",
      "Orthodox": "The Nazirite shaves their consecrated head at the entrance of the Tent of Meeting, takes the hair, and places it in the fire beneath the peace offering sacrifice."
    },
    "19": {
      "General": "After the Nazirite has shaved off the hair of their dedication, the priest is to place in their hands the boiled shoulder of the ram, and one thick loaf and one thin loaf from the basket, both made without yeast.",
      "Non-Denominational": "The priest gives portions of the completed offerings back to the Nazirite: the boiled shoulder of the ram (priest/offerer share) and specific unleavened bread items.",
      "Baptist": "After shaving, the priest takes the boiled shoulder of the ram, one unleavened cake, and one unleavened wafer from the basket and places them in the Nazirite's hands.",
      "Catholic": "After shaving, the priest takes the cooked shoulder of the ram, one unleavened cake, and one unleavened wafer from the basket and puts them into the Nazirite's hands.",
      "Methodist": "Following the shaving, the priest gives the Nazirite specific portions: the cooked ram shoulder and one of each type of unleavened bread cake/wafer.",
      "Lutheran": "The priest takes the boiled shoulder of the ram, one unleavened cake, and one unleavened wafer from the basket and puts them into the hands of the Nazirite after the consecrated head is shaved.",
      "Presbyterian": "After shaving, the priest places the boiled shoulder of the ram, one unleavened cake, and one unleavened wafer from the basket into the Nazirite's hands.",
      "Pentecostal": "The priest gives the Nazirite parts of the offering after shaving: the ram's boiled shoulder and specific unleavened breads.",
      "Anglican": "The priest takes the boiled shoulder of the ram, one unleavened cake, and one unleavened wafer from the basket, and puts them into the hands of the Nazirite after the consecrated hair is shaved.",
      "Orthodox": "After shaving, the priest takes the cooked shoulder of the ram, one unleavened loaf, and one unleavened wafer from the basket and places them in the Nazirite's hands."
    },
    "20": {
      "General": "The priest shall then wave these before the Lord as a wave offering; they are holy and belong to the priest, together with the breast that was waved and the thigh that was presented. After that, the Nazirite may drink wine.",
      "Non-Denominational": "The priest performs a wave offering with the items given to the Nazirite, dedicating them to God. These portions, along with the standard wave breast and heave thigh from peace offerings, belong to the priest. The vow is now complete, and the Nazirite is released from restrictions (can drink wine again).",
      "Baptist": "The priest waves these items as a wave offering before Yahweh; they are holy portions belonging to the priest, in addition to the wave breast and heave thigh. Following this, the Nazirite is permitted to drink wine.",
      "Catholic": "The priest waves these items as a gesture offering before the Lord; they become a holy portion for the priest, along with the waved breast and the presented thigh. Afterwards, the Nazirite may drink wine.",
      "Methodist": "The priest waves these items before the Lord. They become holy portions for the priest (along with the usual breast and thigh portions). The Nazirite is then free from the vow's restrictions, including wine abstinence.",
      "Lutheran": "The priest waves them for a wave offering before the Lord; they are holy portions for the priest, along with the breast of the wave offering and the thigh of the contribution. After this, the Nazirite may drink wine.",
      "Presbyterian": "The priest waves these items as a wave offering before Yahweh; they are holy and belong to the priest, along with the wave breast and contribution thigh. After this ceremony, the Nazirite is permitted to drink wine.",
      "Pentecostal": "The priest waves these items before God. They become the priest's holy portion. The Nazirite is now released from the vow and can drink wine.",
      "Anglican": "The priest waves them as a wave offering before the Lord; they are a holy portion for the priest, together with the waved breast and offered thigh. After that, the Nazirite may drink wine.",
      "Orthodox": "The priest elevates these items as an offering before the Lord; they are holy portions belonging to the priest, along with the breast of the elevation offering and the thigh of the separation offering. Following this, the Nazirite is permitted to drink wine."
    },
    "21": {
      "General": "This is the law of the Nazirite who vows offerings to the Lord in accordance with their separation, in addition to anything else they can afford. They must fulfill the vow they have made, according to the law of their separation.",
      "Non-Denominational": "Summarizes the Nazirite law: specifies the required offerings associated with the vow, allows for additional voluntary offerings if affordable, and mandates fulfillment of the vow according to these regulations.",
      "Baptist": "Concludes the Nazirite regulations: this is the law for the Nazirite who makes a vow, outlining their required offering to Yahweh for their separation, besides any voluntary additions. The vow must be fulfilled according to the established law.",
      "Catholic": "Summarizes the Nazirite ordinance: this is the law concerning the Nazirite's vow and the obligatory offering to the Lord, apart from any additional voluntary offerings. The vow must be completed according to the specific law of consecration.",
      "Methodist": "Restates the law: outlines the required offerings for the Nazirite vow, allows for extra voluntary offerings, and stresses the importance of fulfilling the vow according to these rules.",
      "Lutheran": "Summarizes the law for the Nazirite vow, detailing the required offering based on the separation, besides what else they can afford. The vow made must be fulfilled according to the law of separation.",
      "Presbyterian": "Concludes the statute: this is the law for the Nazirite vow, specifying the required offering for the separation (besides voluntary additions), emphasizing the need to fulfill the vow according to its specific regulations.",
      "Pentecostal": "Summarizes the Nazirite law: covers the required offerings, acknowledges potential voluntary additions, and mandates completion of the vow according to these instructions.",
      "Anglican": "Summarizes the law for the Nazirite vow: prescribes the offering to the Lord according to the separation, besides any additional voluntary offerings. The vow must be performed according to the law of separation.",
      "Orthodox": "Concludes the Nazirite regulations: this is the law for the Nazirite vow, stipulating the offering due to the Lord for their consecration (beyond voluntary gifts), requiring fulfillment according to the specific vow law."
    },
    "22": {
      "General": "The Lord instructs Moses on the priestly blessing.",
      "Non-Denominational": "God directs Moses to establish the specific words for the Aaronic blessing.",
      "Baptist": "Yahweh speaks to Moses, commanding the formula for the priestly blessing.",
      "Catholic": "The Lord instructs Moses on the manner in which Aaron and his sons are to bless the Israelites.",
      "Methodist": "God gives Moses the specific words Aaron and his sons should use to bless the people.",
      "Lutheran": "The Lord speaks to Moses concerning the blessing Aaron and his sons are to pronounce.",
      "Presbyterian": "Yahweh commands Moses, providing the specific formula for the Aaronic blessing.",
      "Pentecostal": "God instructs Moses on how the priests should pronounce His blessing upon the people.",
      "Anglican": "The Lord commands Moses regarding the way Aaron and his sons are to bless the Israelites.",
      "Orthodox": "The Lord instructs Moses concerning the form of the priestly blessing for the children of Israel."
    },
    "23": {
      "General": "Tell Aaron and his sons, 'This is how you are to bless the Israelites. Say to them:",
      "Non-Denominational": "God explicitly commands Aaron and his sons (the priests) to use these specific words when blessing the people.",
      "Baptist": "Moses is to instruct Aaron and his sons to use this precise formula when blessing the Israelites.",
      "Catholic": "Instructs Aaron and his sons to use this specific formulation when invoking God's blessing upon the Israelites.",
      "Methodist": "Directs Aaron and his sons to pronounce the blessing using the exact wording provided.",
      "Lutheran": "Commands Aaron and his sons to bless the Israelites using the following words.",
      "Presbyterian": "Instructs Aaron and his sons to bless the Israelites with this specific benediction.",
      "Pentecostal": "God commands the priests (Aaron and sons) the exact words to use for blessing Israel.",
      "Anglican": "Instructs Aaron and his sons on the specific words to use when blessing the Israelites.",
      "Orthodox": "Commands Aaron and his sons to bless the Israelites using this particular formula."
    },
    "24": {
      "General": "The Lord bless you and keep you;",
      "Non-Denominational": "First part of the blessing: Invokes God's blessing (provision, favor) and His protection/preservation.",
      "Baptist": "Invokes Yahweh's blessing and His protective keeping over the people.",
      "Catholic": "Invokes the Lord's blessing and His safeguarding protection upon the person.",
      "Methodist": "Asks for God's blessing (favor, well-being) and His protective care.",
      "Lutheran": "Invokes the Lord's blessing and His preservation.",
      "Presbyterian": "Pronounces Yahweh's blessing and His covenantal keeping (protection).",
      "Pentecostal": "Calls for God's supernatural blessing and divine protection.",
      "Anglican": "Invokes the Lord's blessing and safe-keeping upon the individual.",
      "Orthodox": "Invokes the blessing and protective vigilance of the Lord."
    },
    "25": {
      "General": "the Lord make his face shine on you and be gracious to you;",
      "Non-Denominational": "Second part: Asks for God's favor and presence ('face shine') and His undeserved kindness/grace.",
      "Baptist": "Invokes Yahweh's favorable presence ('make his face shine') and His graciousness towards the people.",
      "Catholic": "Asks the Lord to reveal His benevolent presence ('make his face shine') and bestow His grace.",
      "Methodist": "Requests God's radiant favor ('face shine') and His gracious kindness.",
      "Lutheran": "Invokes the Lord's favorable countenance and His grace.",
      "Presbyterian": "Pronounces Yahweh's favorable presence ('face shine') and His gracious disposition.",
      "Pentecostal": "Calls for God's radiant presence, favor, and abundant grace.",
      "Anglican": "Asks the Lord to make His face shine upon the individual and be gracious to them.",
      "Orthodox": "Invokes the illumination of the Lord's countenance and His merciful grace."
    },
    "26": {
      "General": "the Lord turn his face toward you and give you peace.",
      "Non-Denominational": "Third part: Asks for God's favorable attention ('turn his face toward you') and His holistic well-being/peace.",
      "Baptist": "Invokes Yahweh's favorable regard ('lift up his countenance') and His gift of peace.",
      "Catholic": "Asks the Lord to look upon the person with favor ('turn his face toward you') and grant them peace.",
      "Methodist": "Requests God's favorable attention and His gift of comprehensive peace.",
      "Lutheran": "Invokes the Lord's favorable regard ('lift up his countenance') and His peace.",
      "Presbyterian": "Pronounces Yahweh's favorable regard ('lift up his countenance') and His bestowal of peace.",
      "Pentecostal": "Calls for God's favorable attention and His impartation of complete peace.",
      "Anglican": "Asks the Lord to turn His face toward the individual and give them peace.",
      "Orthodox": "Invokes the Lord's favorable attention ('lift up his countenance') and His granting of peace."
    },
    "27": {
      "General": "So they will put my name on the Israelites, and I will bless them.",
      "Non-Denominational": "Conclusion: By pronouncing this blessing, the priests place God's name (His character, authority, presence) upon the people, and God Himself promises to enact the blessing.",
      "Baptist": "Explains the effect: the priests invoking the blessing places Yahweh's name (representing His authority and presence) upon the Israelites, and Yahweh Himself confirms He will bless them.",
      "Catholic": "States that by using this formula, the priests invoke God's name upon the Israelites, and God Himself promises to bestow His blessing.",
      "Methodist": "Clarifies that pronouncing this blessing puts God's name (His active presence and authority) on the people, and God personally confirms His intention to bless them.",
      "Lutheran": "Declares that in this way, the priests place God's name upon the Israelites, and God Himself promises to bless them.",
      "Presbyterian": "Explains that through this benediction, the priests place Yahweh's name upon the Israelites, signifying His ownership and presence, and Yahweh promises to ratify the blessing.",
      "Pentecostal": "Reveals that the blessing puts God's name (His power and presence) upon the people, and God Himself activates the blessing.",
      "Anglican": "States that by blessing in this way, the priests will put God's name upon the Israelites, and God Himself will bless them.",
      "Orthodox": "Explains that thus the priests invoke God's name upon the Israelites, signifying their belonging to Him, and God Himself promises to confer the blessing."
    }
  }
}
